[{"title":"JOURNEY TO THE LAST HEAVEN","fiction_id":"87598","link":"https:\/\/www.royalroad.com\/fiction\/87598\/journey-to-the-last-heaven","tags":["Xianxia","Action","Fantasy","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":23,"chapters_count":1,"last_update":1717256225,"description":"Living only to avenge his mother who was killed by the demonic sect when he was still a child, and his father, who was murdered years later accused of being one of the founders of the revival of this same sect, Huo-Lei was one of the young prodigies of the demonic academy. thousand petals, number one in the Silver Sky Sect. He was mistreated and despised with his half sister Jia-Li, where they just endured everything by living to clear their parents' names, until one day Huo-Lei receives an important mission that only he and six other warriors would be able to do.","description_hash":-7590011190260523030},{"title":"Adrift on a Verdurous Planet","fiction_id":"87596","link":"https:\/\/www.royalroad.com\/fiction\/87596\/adrift-on-a-verdurous-planet","tags":["Portal Fantasy \/ Isekai","Progression","Male Lead","Slice of Life","Strong Lead","Adventure","Drama","Fantasy","Romance","Magic","Low Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":3,"view_count":43,"chapters_count":1,"last_update":1717256190,"description":"A genetically enhanced super-soldier is unexpectedly pulled through a wormhole during a mission. He finds himself on the shores of a new world, inhabited by a society resembling 19th century Earth, but where the locals practice basic forms of magic - magic that can be wondrous but also dangerous.\nWith his militaristic purpose now stripped away, he has no choice but to embrace a more civilian role and adapt and learn about the workings of this world's societal, political and magical forces. Through eye-opening experiences and personal growth, the former weapon of war transitions from a battle-hardened soldier into someone who understands and appreciates the bonds formed by friendship and family.","description_hash":4258271051523922233},{"title":"The Heir","fiction_id":"87595","link":"https:\/\/www.royalroad.com\/fiction\/87595\/the-heir","tags":["Progression","Comedy","Male Lead","Adventure","Fantasy","Romance","Grimdark","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":16,"chapters_count":1,"last_update":1717256181,"description":"Cenric Demetrius, Son of Alvira and Faust Demetrius, Is the heir to House Demetrius and must learn to face the challenges of princehood as he tries to find his place in the midst of everyone's mind games.","description_hash":-1605304201904152214},{"title":"I'm Actually A Fake Immortal Expert","fiction_id":"87594","link":"https:\/\/www.royalroad.com\/fiction\/87594\/im-actually-a-fake-immortal-expert","tags":["LitRPG","Portal Fantasy \/ Isekai","Xianxia","Comedy","Male Lead","Adventure","Fantasy","Harem","Supernatural","Strong Lead","High Fantasy"],"lable":"Original","following_count":6,"rating":4.0,"page_count":54,"view_count":785,"chapters_count":7,"last_update":1718538669,"description":"Summoned by a bizarre system into the fantasy world of immortal cultivators, the mortal named Chico uses the 'Mortal System' to pretend to be the powerful immortal God who can raze mountains and dry oceans with just a wave of a hand.\nFollow the exploits of Chico as he bluffs his way to the top and conquers the immortals in the new fantasy world.","description_hash":-2877691283258843442},{"title":"Becoming Sect Master: My Rules Are a Bit Wild","fiction_id":"87593","link":"https:\/\/www.royalroad.com\/fiction\/87593\/becoming-sect-master-my-rules-are-a-bit-wild","tags":["Progression","Strategy","Xianxia","Multiple Lead Characters","Strong Lead","Action","Adventure","Drama","Fantasy","Martial Arts","Male Lead","High Fantasy","Mythos","Attractive Lead"],"lable":"Original","following_count":96,"rating":4.69,"page_count":120,"view_count":9479,"chapters_count":24,"last_update":1718200291,"description":"Lin Fan looked at the declining sect and set down the rules:\n1. Priority admission for those with the surnames Xiao, Ye, Shi, or Lin.2. Priority admission for those who enjoy talking to rings or other objects.3. Priority admission for those who have survived three near-death experiences and have a mysterious fiancée.4. Priority admission for those who have been divorced or have parents who mysteriously disappeared.5. Priority admission for those who face targeted harassment as soon as they reach the sect gate.6. Immediate appointment as a personal disciple for those who have a mysterious smile and enemies who laugh with a \"ji ji ji\" sound.7. Immediate appointment as a personal disciple for those who have had their bones removed and are in dire straits....8. Bla bla...\nOne day, the Fifth Elder came to report: \"Sect Master, great news! A young man has come who has been divorced, has a mysterious smile, and enjoys talking to his ring! His parents are also missing!\"\n\"What? Quickly bring him in, I want to take him as a… Wait, what's his name?\"\n\"It seems his surname is Tang.\"\n\"Tang? Hold on, don't bring him here. I will personally take action to block the heavenly secrets and write a letter of recommendation. You will introduce him to a rival sect... Make sure to be tactful, and remember! From today onwards, I am entering seclusion. Do not disturb me unless it's absolutely necessary! And make sure all the sect's secret manuals are well-guarded, so they don’t get stolen!\"\nFifth Elder: \"Huh?!\"","description_hash":-5823520193579829436},{"title":"Felix, or the art of the smallest gap","fiction_id":"87592","link":"https:\/\/www.royalroad.com\/fiction\/87592\/felix-or-the-art-of-the-smallest-gap","tags":["LitRPG","Urban Fantasy","Progression","Space Opera","Psychological","Adventure","Fantasy","Sci-fi","Slice of Life","School Life","Male Lead","Magic","Low Fantasy","First Contact"],"lable":"Original","following_count":3,"rating":0.0,"page_count":26,"view_count":190,"chapters_count":5,"last_update":1717603637,"description":"The story is about - Wholesome guy named Aelius trying to navigate a not so wholesome universe. On top of trying not to die during Humanity’s Cosmos Frontier Rush. HCFR for the intimates. System, magic power, old humans trying to improve humanity a little and themselves a lot, even older aliens not really trying to improve humanity. \nYou can expect - Humans, acronyms, non humans, slice of life, humans being humans, lightheartedness, non humans being too humans, drama, more acronyms, politics, more slice of life, world building in an early space faring age (the trans-neptunian agricultural community are to die for, literally) and character focus.\n\n\n\nAelius was a very generic young boy living in a very generic residential suburb on Earth. As generic as possible when your father is a retired member of the Solar Federation’s special force. And your mother used to be a core member of the system equivalent of a political secret society. \nOne evening, his very generic life exploded around him and he was called for much greater responsibility than he ever wished for. And the power that comes with them. But that’s okay. Aelius is a big boy now. He just turned five.\n\n\n\nDisclaimer : I basically put every content warning tag I could about adult content because I'm an adult writing adult themed stuff to other adults and I will throw at you whatever life throws at us in general. You however have my solemn pledge that I will always do it in a way serving the story and the evolution of the characters, and I'll do it in the most sensible way possible. Feel free to call me out on it if needed. You can see here how I intend to play around each tag.\nProfanity - Some characters don't swear at all. Some characters swear in dialogue. Some characters swear in thoughts. And I'm pretty sure that you'll find along the way some characters that swear in action. 99% of the time it will be more about their way to express stress and state of mind rather than to express the literal meaning of their swear. 1% of the time, characters will be assholes.\nSexual content - For now it’s not planned to appear before much further down the line. There will be some eroticism, implied relationships AND adult scenes. It will never be free and it will never be gross. Always serving the story. Not a central theme of the story.\nGraphic Violence - It’s a violent world out there part’ner. There will be violence, expect it. There will be injustice. There will be monstrous beings. And there will even be human ones.\nSensitive content - There will be humans being humans. Making bad call. Making wrong decisions. Obstinate about it. Teeth will gnash and bones will break.","description_hash":-7561898061258202505},{"title":"Oh, who is she?","fiction_id":"87591","link":"https:\/\/www.royalroad.com\/fiction\/87591\/oh-who-is-she","tags":["Short Story","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":2,"view_count":58,"chapters_count":1,"last_update":1717240781,"description":"Her cinder lipstick was the first thing that captured his attention, followed by her sickly pale skin","description_hash":1687823941137981965},{"title":"The Five Celestial Star","fiction_id":"87590","link":"https:\/\/www.royalroad.com\/fiction\/87590\/the-five-celestial-star","tags":["Comedy","Male Lead","Action","Adventure","Fantasy","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":2.5,"page_count":53,"view_count":486,"chapters_count":13,"last_update":1717290472,"description":"About a boy who was summoned another world and has to save it! But He doesn't want to so he goes on a adventure of his own!","description_hash":-7343412776513127386},{"title":"Omega Battle Streamers","fiction_id":"87589","link":"https:\/\/www.royalroad.com\/fiction\/87589\/omega-battle-streamers","tags":["Contemporary","Action"],"lable":"Original","following_count":0,"rating":0.0,"page_count":86,"view_count":188,"chapters_count":9,"last_update":1718554503,"description":"Suddenly, people are capable of using physic powers within certain zones. 3 years later, superpower-fueled battles have become a common form of content over the internet.\n\nI wrote this novel for J-Novel Club's Original Light Novel Contest, but it didn't make past the second round. Description\/synopsis still needs some work (pending).","description_hash":-7072960003913945325},{"title":"ETERNAL SOVEREIGNTY:MONARCH ASCENSION ","fiction_id":"87588","link":"https:\/\/www.royalroad.com\/fiction\/87588\/eternal-sovereigntymonarch-ascension","tags":["Reincarnation","Progression","Post Apocalyptic","War and Military","Martial Arts","Adventure","Comedy","Fantasy","Mystery","Supernatural","Secret Identity","Magic","Strategy","Low Fantasy","High Fantasy","Mythos"],"lable":"Original","following_count":2,"rating":0.0,"page_count":20,"view_count":130,"chapters_count":3,"last_update":1717704444,"description":"The rise of the new empire shall start as the battle for the world begins with the appearance of new Worldwalkers. Who will reach the top? Who will become the strongest? Survival is a must as the new war has begun, and power and dominance over the world and realm will be the key to survival. The gaze of a single being shall always lurk everywhere, for he is him.\nWaking up in the struggle for power, Julian Campbell, who has lost his memory, embarks on a journey of self-discovery. Finding himself in a world full of war, how can he survive? As the evolution continues, he sees an endless world filled with warships, empires, dragons, relics, chained nightmares and fallen beings. In the path of no return, nightmare shall roar with anger, sadness, and suffering. Where is that path? \nThe sun will soon reach its peak, shining its light on the endless world, but memories shall be forever buried in blood as the future becomes a conquest of worlds. As dangers become an apocalypse, monsters shall rise along with the empire, and nightmares shall be broken free once again. Can Julian truly grow his empire? How can he survive in an apocalyptic world full of dangers? What story awaits Julian? What challenges must he overcome? For a single being shall always ask him... Can you truly save this world? For I am always watching...This is the Monarch's Ascension, the Tale of the Void.","description_hash":1544105160618957772},{"title":"The Villainess Wants Her Prince to Live!","fiction_id":"87587","link":"https:\/\/www.royalroad.com\/fiction\/87587\/the-villainess-wants-her-prince-to-live","tags":["GameLit","Time Travel","Villainous Lead","Ruling Class","Female Lead","Adventure","Historical","Romance","Mystery","Supernatural","Magic","Strategy","Low Fantasy"],"lable":"Original","following_count":2,"rating":5.0,"page_count":76,"view_count":576,"chapters_count":6,"last_update":1718387281,"description":"Lady Regina Sheridan can see the future. Unfortunately, the future says that she will be executed as a villainess unless she can keep her new fiancé, Prince Artem Alpin, alive. The future also tells her someone is hunting Artem… and that he has the survival instincts of a goldfish. Please universe, The Villainess Wants Her Prince to Live!","description_hash":1837529614800456283},{"title":"Min アパート","fiction_id":"87586","link":"https:\/\/www.royalroad.com\/fiction\/87586\/min","tags":["Psychological","Horror","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":27,"chapters_count":1,"last_update":1717239674,"description":"Multiple people went missing and the only thing left behind was a journal.","description_hash":-1629447014889914428},{"title":"THE HERMITS HAVEN ","fiction_id":"87585","link":"https:\/\/www.royalroad.com\/fiction\/87585\/the-hermits-haven","tags":["Anti-Hero Lead","Psychological","Strong Lead","Tragedy","Action","Horror"],"lable":"Fan Fiction","following_count":2,"rating":4.0,"page_count":31,"view_count":217,"chapters_count":4,"last_update":1718120280,"description":"Search for a Peaceful Existence in a World of StrifeSOME SECRETS NEVER SLEEP \nMeet John, a young man with a passion for learning and a desire to survive in a world that seems determined to destroy him. After his parents' death, John is left alone to fend for himself, but he refuses to give up. With his quick wit and resourcefulness, he sets out to create a new life for himself, determined to thrive in a world gone mad.\nAs John navigates the treacherous landscape, he discovers a voice in his head, a constant companion that whispers dark thoughts and fuels his paranoia. Despite this, John presses on, driven by a singular focus: to survive at any cost.\nJohn's journey takes him from the mountains to the city, where he encounters a group of children struggling to survive. With a calculating mind and a charismatic charm, John manipulates the children into following him, promising them a safe haven and a better life.\nAs John's power grows, so does his ambition. He creates a community, a walled city where he is the ultimate authority. But at what cost? The children are trapped, bound to John by their loyalty and trust. And John's true intentions are shrouded in darkness, his actions driven by a desire for control and power.\nAs the years pass, John's city flourishes, but the cost of his success is high. He has created a world of manipulation and deception, where loyalty is bought and sold. And John, once a man with a dream, has become a monster, consumed by his own ambition.\nThemes:\nThe struggle for survival in a post-apocalyptic worldThe corrupting influence of power and ambitionThe danger of manipulation and deceptionThe importance of loyalty and trust in a world gone mad\nGenre:\nPost-apocalyptic fictionPsychological thrillerDystopian fiction","description_hash":-7289338832921317157},{"title":"Sour Pebbles","fiction_id":"87584","link":"https:\/\/www.royalroad.com\/fiction\/87584\/sour-pebbles","tags":["Grimdark","Male Lead","Tragedy","Drama","Horror","Short Story","Hard Sci-fi"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":7,"view_count":29,"chapters_count":1,"last_update":1717239643,"description":"Lemongrab tries dark soda for the first time, resulting in solids forming in his urine. The Earl would rather die than request help with this medical issue.","description_hash":58258536904749893},{"title":"The Tardigrade Man ","fiction_id":"87583","link":"https:\/\/www.royalroad.com\/fiction\/87583\/the-tardigrade-man","tags":["Progression","Anti-Hero Lead","Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":114,"chapters_count":2,"last_update":1717257608,"description":"Exactly 10 years ago everything changed, thousands of gates opened up in our world, letting in thousands of monsters. And powers called ray suddenly started appearing.\n\nThose who have that power and awakened it are called the hunters. Who hunted down the monsters for money and fame.","description_hash":-8027213075207229579},{"title":"Vigilance","fiction_id":"87582","link":"https:\/\/www.royalroad.com\/fiction\/87582\/vigilance","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Comedy","Non-Human Lead","Action","Adventure","Fantasy","Short Story","Reincarnation","Supernatural","Female Lead","Strong Lead","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":9,"rating":5.0,"page_count":44,"view_count":346,"chapters_count":4,"last_update":1717456706,"description":"(This is the first book in the Fallen Lands series. Because this has been moved to Kindle Unlimited, only a sample is currently available here on Royal Road. If you like what you see here, I'd love for you to grab the rest from KU and let me know what you think! Future installments will be posted on Royal Road before moving to Kindle after completion and editing.)\nMoving to Monterey Bay for college was supposed to be my big adventure, you know, fresh start, new dreams, that sort of thing. But instead of worrying about my first day jitters, I found myself in a real-life nightmare – trapped in a chilling ritual chamber, surrounded by the echoes of cries and the stench of blood and old earth. It was like stepping into the worst horror game, except the iron collar around my neck and the creepy messages flooding my vision were all too real.Thrown into this bizarre, terrifying world, I had to pinch myself to believe it. Monsters, magic, chaos – it felt like a messed-up dream. But hey, a girl's got to do what a girl's got to do, right? My will to survive kicked in big time. I wasn't going to let the darkness, or the monsters, swallow me up.It was like being lost in a twisted version of a history book – ruined cities, ancient secrets, and here I was, running from demons and dodging danger at every turn. I didn’t even recognize myself anymore, thrust into this strange role, armed with just a smidge of newfound magic. But I learned something out there – when life throws you into the deep end, you either sink or learn to swim real fast.\nAnd trust is a funny thing in a world where everyone's a stranger. I had to rely on others, not knowing if they were friend or foe. But amidst all the fear and uncertainty, I found little sparks of hope and friendship. I knew I had to find out why this happened to me, to chase even the faintest chance of getting back home – a home that was starting to feel like a distant dream.So, with a deep breath (and maybe a little pep talk), I stepped forward on this wild, scary, but kind of exhilarating path. I was determined to unravel the mystery of my abduction and hold onto the hope of returning to a life that, once upon a time, was just about college applications and what movie to watch on Friday nights.","description_hash":3205553072771694356},{"title":"The Dead Cat Problem","fiction_id":"87581","link":"https:\/\/www.royalroad.com\/fiction\/87581\/the-dead-cat-problem","tags":["Comedy","Male Lead","Mystery","Short Story"],"lable":"Original","following_count":0,"rating":3.5,"page_count":8,"view_count":133,"chapters_count":2,"last_update":1717239867,"description":"A quirky mystery and slice-of-life short story.\nLiving on your own as a new adult is a series of challenges. Every week presents something you need to learn to do on your own.\nWhat would you do if one of those challenges was waking up in your apartment to find a dead cat on the coffee table? How did it get there? How do you dispose of it? What new lessons in Adulting are you sure to learn in the process?","description_hash":-707589346809760137},{"title":"On the Oragin of Dragons","fiction_id":"87580","link":"https:\/\/www.royalroad.com\/fiction\/87580\/on-the-oragin-of-dragons","tags":["Post Apocalyptic","Fantasy","Short Story","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":50,"chapters_count":1,"last_update":1717239081,"description":"This is a short book written as a primer on dragons. It is used in a class taught on fauna in the university of the city Superbiae. Not everyone recognizes dragons as people. The author is unknown and they dont know everything about dragons. Not everything in this book is accurate to the land of Farth.","description_hash":-5029346138300044600},{"title":"Tales from a Town called Blackwater [A litRPG]","fiction_id":"87579","link":"https:\/\/www.royalroad.com\/fiction\/87579\/tales-from-a-town-called-blackwater-a-litrpg","tags":["LitRPG","Progression","Multiple Lead Characters","Action","Adventure","Fantasy","Supernatural","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":33,"view_count":433,"chapters_count":6,"last_update":1718406019,"description":"The town of Blackwater is your typical wild west town. Saloons, shoot-outs, cowboys, cryptids, madams, and magic. The discovery of magical crystal deposits has caused an upset to the usual goings-on of the sleepy town with an influx of new people and the trouble that comes with them. These are some of the stories of those troubles.","description_hash":-5535846939065154485},{"title":"Reincarnated as Naruto with Sukuna's Powers","fiction_id":"87578","link":"https:\/\/www.royalroad.com\/fiction\/87578\/reincarnated-as-naruto-with-sukunas-powers","tags":["Anti-Hero Lead","Strong Lead","Adventure","Fantasy"],"lable":"Fan Fiction","following_count":13,"rating":3.0,"page_count":58,"view_count":1117,"chapters_count":9,"last_update":1718384861,"description":"Alexander, a skilled assassin and heir to the world's most powerful mafia dynasty, walks away from his dangerous life when he falls in love. Embracing a new passion for anime and starting a family, he cherishes his newfound peace. But when his past catches up with him, tragedy strikes as his wife and daughter are brutally taken from him. He seeks revenge, but ultimately chooses to end his life. Surprisingly, he finds himself reincarnated as Naruto with two special abilities.","description_hash":-4662067672801589229},{"title":"Not As It Seems","fiction_id":"87577","link":"https:\/\/www.royalroad.com\/fiction\/87577\/not-as-it-seems","tags":["Comedy","Multiple Lead Characters","Slice of Life","Adventure","Fantasy","Short Story","Male Lead","Female Lead","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":29,"chapters_count":1,"last_update":1717238942,"description":"A very short story I wrote based on my fictional elf tribe, the Lowvanicc Tribe. (Full thing is one chapter. I’m pretty sure there’s a video of me reading it on YouTube, as well.)","description_hash":968675046437093209},{"title":"Summoner's Edge","fiction_id":"87576","link":"https:\/\/www.royalroad.com\/fiction\/87576\/summoners-edge","tags":["Female Lead","Drama","Action","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":2,"view_count":30,"chapters_count":1,"last_update":1717238935,"description":"\"This up-and-coming Summoner has a novel approach: summoning other summoners. Let's see how she fares in the arena!\"","description_hash":-3542451655161563667},{"title":"Enchanting Dreams (The Wandering Inn)","fiction_id":"87574","link":"https:\/\/www.royalroad.com\/fiction\/87574\/enchanting-dreams-the-wandering-inn","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Adventure","Fantasy","Magic"],"lable":"Fan Fiction","following_count":1,"rating":5.0,"page_count":41,"view_count":190,"chapters_count":3,"last_update":1718473834,"description":"The Wandering Inn Fanfic. Follows three boys from the first spirited away generation. dropped in minutes after Erin, same continent, different location. Title should clue you in where its going.","description_hash":-4538395676063136611},{"title":"Premonition","fiction_id":"87573","link":"https:\/\/www.royalroad.com\/fiction\/87573\/premonition","tags":["Reincarnation","Martial Arts","Multiple Lead Characters","Sci-fi","Action","Fantasy","Short Story","Magic","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":206,"view_count":569,"chapters_count":16,"last_update":1717279670,"description":"For hundreds of years, the Spargarians have been in servitude to King Melon and his people. As a constructor, Zazarel's life has been nothing but crafting sculptures since he was a boy. His girlfriend, Vodkis, a seamstress, sews clothing from sun up, to sundown to an unrelenting needy kingdom. To survive was to obey every command, but he had reached his limit. Lucky for him, so is the big guy.","description_hash":4153296884150335268},{"title":"THAT INCOMPLETE LOVE STORY ","fiction_id":"87571","link":"https:\/\/www.royalroad.com\/fiction\/87571\/that-incomplete-love-story","tags":["Comedy","Female Lead","Action","Historical","Romance","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":62,"chapters_count":2,"last_update":1717239663,"description":"Long time ago, Alina, the Crown Princess of a kingdom named Embiran had a forbidden love relationship with a beautiful royal servant of their palace named Jasmine. They loved each other intensely, but as their fate had it, they were tragically torn apart by death being unable of completing their incomplete love story.\nReborn in modern time into the same families, they met again but having no memories about the past love that they shared for each other.\nWill they rediscover their love for each other? Will they fall in love with each other again? Will they'd be able to complete their incomplete love story? Find out by reading this strange love story!","description_hash":1795453499760619472},{"title":"Amaranthéa","fiction_id":"87570","link":"https:\/\/www.royalroad.com\/fiction\/87570\/amaranthea","tags":["Multiple Lead Characters","Strong Lead","Fantasy","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":4,"rating":4.5,"page_count":97,"view_count":399,"chapters_count":5,"last_update":1718352005,"description":"The world is broken.\nMountains lie strewn across the sky and seas fall away into the abyss.\nAsphales, a simple fisherman with a heart for the heroic, is the only one who believes the stories – a mad king in league with an ancient devourer of light brought destruction and decay.\nFor Adélia, an accomplished warrior on the other side of the world, that ancient force is all too present. Her heart has been tainted by a thread of that foul magic since childhood.\nTogether, they discover this old enemy is not only real, but returning. As secretive factions seek to take advantage of desperate times, they must decide if their convictions can withstand what is demanded of them.\nWhen the Shadow threatens to awaken...\nWho will stand to sing the Eldersong?","description_hash":-6411375958021964209},{"title":"Celestial Model [A Progression Fantasy]","fiction_id":"87569","link":"https:\/\/www.royalroad.com\/fiction\/87569\/celestial-model-a-progression-fantasy","tags":["Progression","Action","Adventure","Fantasy","Horror","Supernatural","Magic"],"lable":"Original","following_count":14,"rating":4.42,"page_count":72,"view_count":867,"chapters_count":13,"last_update":1718609671,"description":"The Celestial Model, a powerful woman who once commanded the world's fate, lies dead, leaving only her corpse and its immense power behind.\nNow, the powerful and those ignorant of it vie for control of the sacred relic as the world grapples with the aftermath of her passing, wondering what to do with what remains.\nKist, however, is too caught up in his own mind to pay the world much attention, too busy chasing his own ambitions: finding a way to be a player in the game he's loved for so long.\nUnfortunately, this game just so happens to challenge the very stars that the Celestial Model locked away.\nTo become a serious Player on the board, he knows what he has to do: change the rules of the game.\nBut, when labeled as a failure by even his family, what was he to do? For Kist, the answer becomes simple when he is met with Nue, another ambition-drunk youth with a plan flawed by design. One sure to draw attention, in fact, much more attention than either of them could have expected.\n\nWhat To Expect:\n[+] Weak to strong\n[+] Unique Astrology\/Comic Based Magics\n[+] Fast pact action & pacing\n[+]Detailed High Quality Fights \n[+] Fun and interesting Mc(s), Side Characters, and Villians\n\nRelease schedule: 5 chapters per week until the 1st of July. Released at 3:34 AM GMT-4 time. 11:34 PM EST.","description_hash":43491515330269819},{"title":"The Arcana: Shadow Wars, Codex I ","fiction_id":"87568","link":"https:\/\/www.royalroad.com\/fiction\/87568\/the-arcana-shadow-wars-codex-i","tags":["Multiple Lead Characters","Adventure","Fantasy","Mystery","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":201,"view_count":492,"chapters_count":14,"last_update":1718625606,"description":"When giants attack her vineyard, a playwright wonders: are they a sorcerer's conjurings, or invaders from an undiscovered country? Joining forces with a long-lost friend and a mysterious seer, she learns they must either stop a prophecy … or die trying.\nThe Shadow Wars trilogy is inspired by Greek mythology, a love ignited with Ray Harryhausen's Clash of the Titans, and Robert Graves' Greek Gods and Heroes. Beginning with The Arcana, the trilogy takes you from an idyllic vineyard to lairs guarded by fantastic beasts, with thrilling quests via magic portals, all the way to the very gates of the cosmos itself. The Arcana, has 39 chapters in addition to the prologue, and I will be posting it here in its entirety. Posting Schedule: Every Monday, Wednesday, Friday at 8 a.m. Detroit time (EST).","description_hash":3497007042705937517},{"title":"Dan the Man - turned - Eldritch God - turned - Dungeon Core","fiction_id":"87567","link":"https:\/\/www.royalroad.com\/fiction\/87567\/dan-the-man-turned-eldritch-god-turned-dungeon","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Comedy","Male Lead","Action","Fantasy","Magic","GameLit","High Fantasy","Progression"],"lable":"Original","following_count":394,"rating":3.78,"page_count":107,"view_count":14819,"chapters_count":15,"last_update":1718290820,"description":"With Earth facing imminent consumption via Eldritch God, Dan finds himself running for his life while an octopus-looking aberration relentlessly chases him for fun.\nSadly, after getting the world's worst case of heartburn, Dan loses consciousness and wakes up in a dark void with a sentient world god thing telling him he is actually a fallen Eldritch God!? And that he now needs to become a dungeon to save the world from himself!?\nWhat the hell does that even mean!?\nHow do you go from Human to Eldritch God to Dungeon? \n\n\n\nWhat to expect -\nDungeon and Monster Creation Litrpg. \nDungeon expansion and progression along with its monsters.\nDungeon conquering new lands and epic fights.\nDungeon exploration by adventurers Pov.\nDungeon maps.\n\n\n\nNew chapters will be released on Tuesdays and Thursdays. Chapters will usually be around 2000 words.\nAlso, check out my other fantasy book with light Litrpg Aspects. They are both set in the same Universe. \nAdventure in the Shattered Fang Continent\nIt is about a guy who escapes Earth as it is being eaten by an Eldritch God. He then arrives on a different world and will go on lots of adventures while hoping his new powers don't turn him or his allies into goats.","description_hash":-316438514851596384},{"title":"Sword's Chosen - [LitRPG] [Cultivation]","fiction_id":"87566","link":"https:\/\/www.royalroad.com\/fiction\/87566\/swords-chosen-litrpg-cultivation","tags":["LitRPG","Dungeon","Post Apocalyptic","Strategy","Xianxia","Action","Adventure","Fantasy","Martial Arts","Male Lead","Strong Lead","Magic","Progression"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"This is my attempt at fusing the genres of litrpg and cultivation, I hope you like it.\nAll going well, the first chapter should be released June 19th this year.\n-\n For Aodh, every day is a bad day. Get up, go to class, avoid talking to other people, go home, fall asleep and repeat.\nHowever, on a seemingly normal day, Aodh is somehow transported to a strange forest, with only one goal given to him: survive. With quick thinking, and mysterious skill with a sword, Aodh has to do just that, until he can figure out what's going on, and what the strange words floating in the air mean.","description_hash":-3717300043049964220},{"title":"8. EMPYREAL [TALES FROM THE CROSSROADS vol. 1]","fiction_id":"87565","link":"https:\/\/www.royalroad.com\/fiction\/87565\/8-empyreal-tales-from-the-crossroads-vol-1","tags":["Non-Human Lead","Strong Lead","Action","Historical","Horror","Short Story","Supernatural","Male Lead","Magic","Low Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":49,"chapters_count":1,"last_update":1717194568,"description":"Tales from the Crossroads is a series of 17 micro-fiction horror stories set in the Primordial Crossroads Universe.\nEMPYREAL is about the tale of an Incan warrior of light venturing to the heavens of the beyond to combat evil.","description_hash":6293348981013866661},{"title":"RISE OF THE DEATHSMITH [Army Building] and [Clan Building] ","fiction_id":"87564","link":"https:\/\/www.royalroad.com\/fiction\/87564\/rise-of-the-deathsmith-army-building-and-clan","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Ruling Class","Male Lead","Action","Drama","Fantasy","Slice of Life","Strategy","GameLit","High Fantasy"],"lable":"Original","following_count":134,"rating":4.06,"page_count":55,"view_count":3389,"chapters_count":5,"last_update":1717453116,"description":"Nico awoke in another world—a world of steam and energy called [Force] Industrialization. He now inhabited the body of a fat debauchee from a declining clan. His unique class, [Death Forger], a necromancer and soulmancer, was reset to level F. All his stats were reduced to the lowest his new body could handle. Worse, there was no way to return home for revenge.\nNow known as Raven Gu-Nesterfield, Nico is determined to surpass all his previous achievements. He refuses to accept anything less than raising his declining clan to its zenith. Using his past experiences and knowledge, he will forge his path to power and glory.","description_hash":3783214727808874566},{"title":"Doctor Lord","fiction_id":"87563","link":"https:\/\/www.royalroad.com\/fiction\/87563\/doctor-lord","tags":["Progression","Xianxia","Female Lead","Action","Adventure","Male Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":34,"view_count":423,"chapters_count":10,"last_update":1718595901,"description":"The Vibrant Region is the epicenter of a ferocious new disease. The disease’s progression is such that the medical community, suppressed by Global as they are, is struggling to keep a balance.\nYoung Lord and Azazel attend the greatest academy in the region, Vibrant Academy, to study their respective fields of medicine and adventure. The bonds they create and decisions they make impact them for the rest of their lives.\nA loosely-ranked xianxia-based unique magical system that reduces the traditional emphasis on battles. The non-cultivators have as much of an impact on their world as the cultivators do through the power of intellect and industry.","description_hash":-8517751485521088289},{"title":"Echoes of rebirth","fiction_id":"87562","link":"https:\/\/www.royalroad.com\/fiction\/87562\/echoes-of-rebirth","tags":["LitRPG","Reincarnation","Dungeon","Anti-Hero Lead","Ruling Class","Action","Adventure","Comedy","Fantasy","Male Lead","Multiple Lead Characters","Non-Human Lead","Magic","GameLit","Genetically Engineered ","Artificial Intelligence"],"lable":"Original","following_count":4,"rating":0.0,"page_count":13,"view_count":235,"chapters_count":3,"last_update":1717532977,"description":"A man from another world reincarnates in this medieval fantasy like world filled with magic monsters and a whole variety of races both human and inhuman in nature. \nOnly 1 teeny tiny little probleme is a dungeon, the thing that every adventure, every Kingdom, and every guild wants to loot and conquer for their own benefit.\nHow will he survive the new world that he was put in without his permission. \nYou're going to have to read all that to figure that out bud.\n_________________________________________________\nMy sorry attempts at trying to be a good Royal road author.\nWhat to expect: \nProgression: (lifelong progression stories) \nWeak too strong: (we're not having overpowered characters here only relatable ones 🗿)\nUnique monsters (not monsters just made to be killed but monsters with an actual lore behind them) \nUnique magic system: (not Mana equals Fireball but more flushed out and diverged) \nWhat not to expect: \nOverpowered: (no good story can have an all-powerful character) \nRomance\/harem: (the story will be relatable but don't expect too much or out of nowhere romance don't expect romance at all or harem) \nWorld without reasoning: (don't expect a world that is just a world because the protagonist exists the world already existed before he did and there is lower behind every character that is introduced)\nDumb villains: (don't expect them villains with weak motivations expect good villains who actually have real motivation for why they do what they do 🗿)\n\n[ AI art book cover ]","description_hash":-9132217132889360448},{"title":"Polymath's Advancement ","fiction_id":"87561","link":"https:\/\/www.royalroad.com\/fiction\/87561\/polymaths-advancement","tags":["LitRPG","Portal Fantasy \/ Isekai","Urban Fantasy","Progression","Comedy","Action","Adventure","Fantasy","Male Lead","Strong Lead","GameLit","Mythos"],"lable":"Original","following_count":32,"rating":3.8,"page_count":271,"view_count":6879,"chapters_count":26,"last_update":1718571662,"description":"Owen is a simple programmer for a low end shipping company, who feels like the background character to his own life. After one of his coworkers pushes him past his limits, Owen get's fired with his coworker getting promoted to Owen's old job. Feeling like everything is falling apart, the system appears and Owen dares to consider that this is his chance to maybe become a main character.","description_hash":-5176971677539039754},{"title":"Hedging the Dungeon","fiction_id":"87560","link":"https:\/\/www.royalroad.com\/fiction\/87560\/hedging-the-dungeon","tags":["LitRPG","Dungeon","Comedy","Male Lead","Harem","Action","Adventure","Fantasy","Magic","High Fantasy","Progression"],"lable":"Original","following_count":2,"rating":0.0,"page_count":11,"view_count":160,"chapters_count":2,"last_update":1717183947,"description":"Marvin is a down on his luck villager, who upon turning 15 unlocked the class Hedge mage instead of anything actually useful. Not deterred by this setback, Marvin travels to the Dungeon city of Ell. In the great dungeon, he will find great magical treasures, horrifying monstrosities, devious traps and loyal companions. Will his slow and easily distracted mind manage to pull him through the danger, or will he hit the danger with a stick until its no longer a problem. Come and find out in this light hearted litrpg comedy about a man who really shouldn't be a mage of any kind.\n____________________________________________________\nI'm writing this for fun as a hobby and writing practice, and I've liked to read books on royal road for a while now, so I thought I'd give back to the community by dropping my nonsensical ramblings on here for your enjoyment.\nAs I'm the laziest creature known to man and have other duties to attend to during my brief bursts of activity I cannot in good conscience promise any sort of release schedule that I'm most likely guaranteed to fail. \nNevertheless I hope you give this story a chance. I accept all criticism and will be confused by any possible praise.\nSincerely yours, The Kingfisher.","description_hash":7018061007987359796},{"title":"Battle Through the Nine Realms [Isekai \/ LitRPG]","fiction_id":"87559","link":"https:\/\/www.royalroad.com\/fiction\/87559\/battle-through-the-nine-realms-isekai-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Strategy","Male Lead","Drama","Action","Adventure","Fantasy","Reincarnation","Low Fantasy","Mythos"],"lable":"Original","following_count":2329,"rating":4.7,"page_count":289,"view_count":216988,"chapters_count":32,"last_update":1718629251,"description":"Ragnarok is near, and the Vikings of Midgard have failed to uphold their duty to prevent it.  With time running out, the All-Father Odin himself searches all the worlds for one last warrior who might hold back the destruction threatening Nine Realms and every world created.\nMagnus’s death caught the All-Father’s one good eye.\nAs an Army Ranger, he knew he was placing himself in the line of fire every day and knew a day could come that cost him his life. He didn't want the rest of his team to be wiped out with him, the worst disaster the Rangers had experienced in decades.\nSummoned before the All-Father, Magnus is given the grave news and outcome for every realm, including his own.\nA deal was struck, a bargain made - Be reborn in Midgard, empower himself through mystical runes, and battle Odin's foes in exchange for his team getting a second lease on life if Magnus succeeds.\nWaking up in a small farming village in Midgard, Magnus must now train and battle mundane foes and creatures out of myths and legends in Midgard and the rest of the Nine Realms.\n-----\nBook 1 Finished Completely\n10 Books Planned\n5+ Chapters a week \nLITRPG\nDifferent Magic Systems for each Realm","description_hash":-7109448252483927763},{"title":"Till the End of Time: Asura Blood Saga","fiction_id":"87558","link":"https:\/\/www.royalroad.com\/fiction\/87558\/till-the-end-of-time-asura-blood-saga","tags":["Anti-Hero Lead","Xianxia","Male Lead","Strong Lead","Tragedy","Action","Adventure","Fantasy","Martial Arts","Supernatural","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":53,"view_count":149,"chapters_count":5,"last_update":1718197250,"description":"The boundless universe contains myriads of different worlds. The unfathomable Heavenly Dao stands above everything. In these worlds of demons, gods, immortals, mythical creatures and powerful humans with ancient bloodlines all thrive to one day reach the apex of the world. Unaware of the past, Yasha is living a simple life in a remote clan. Without anyone but himself he trains everyday to find the missing pieces of his memory, but because he is unable to cultivate, he is cursed to live a mediocre, but peaceful life, never able to roam the world to uncover his past. Until the fateful day arrives and turns his live upside down. At deaths door, an ancient, forbidden bloodline awakens in Yasha. A bloodline so strong that it was obliterated and left to the annals of time, eternally banished. However, the bigger the power, the bigger the price one has to pay. Will Yasha be able to overcome all obstacles fate put in his way and pave his own path? Or will he succumb to the shackles on him?","description_hash":-1305259761666597864},{"title":"Immortal Mercenary that's Certified Insane ","fiction_id":"87557","link":"https:\/\/www.royalroad.com\/fiction\/87557\/immortal-mercenary-thats-certified-insane","tags":["Martial Arts","Comedy","Action","Fantasy","Mystery","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":29,"chapters_count":1,"last_update":1717175038,"description":"A Mad Immortal with an hole in the brain, drifting through a surreal fantasy world, seeks to discover if life still holds any joy. His mind fractured, he wanders through strange, dream-like landscapes, encountering odd and elusive creatures. In this hazy quest for meaning, he questions if any joy remains. It's a wild and disorienting journey, where the lines between madness and fantasy blur into one.\n\nSummary : Bluds wonky","description_hash":-4574313431152624459},{"title":"Valoria Saga","fiction_id":"87556","link":"https:\/\/www.royalroad.com\/fiction\/87556\/valoria-saga","tags":["Virtual Reality","Portal Fantasy \/ Isekai","Progression","Strategy","Psychological","Action","Adventure","Fantasy","LitRPG","Male Lead","Magic","GameLit","Soft Sci-fi"],"lable":"Original","following_count":10,"rating":5.0,"page_count":82,"view_count":732,"chapters_count":5,"last_update":1718377220,"description":"\"Join the Valorian Saga, the most immersive RPG experience that has ever existed.\"\nY'know, I might be a tad biased here, but the devs sure weren't lying. I mean, I kinda wish they were, but yeah, feelin' pretty immersed seeing as we can't actually leave the game...\nLuke just joined the brand new VRMMO Valorian Saga with his friends, only to find out that they are trapped with no way out. With no way out, and no respawning, can the group survive, in the game and in real life? And what will be left of the people they were if they do?\nValoria Saga is meant as form of trying to write a better LitRPG\/GameLit genre novel","description_hash":-4826178658177244854},{"title":"The Last Curse of Sword Coast - pt2","fiction_id":"87512","link":"https:\/\/www.royalroad.com\/fiction\/87512\/the-last-curse-of-sword-coast-pt2","tags":["Anti-Hero Lead","Action","Adventure"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":1,"view_count":27,"chapters_count":1,"last_update":1717124953,"description":"A continuation of the first part of the story.","description_hash":-5860363287820776949},{"title":"The Last Curse of Sword Coast - pt1","fiction_id":"87511","link":"https:\/\/www.royalroad.com\/fiction\/87511\/the-last-curse-of-sword-coast-pt1","tags":["Anti-Hero Lead","Action","Adventure","Fantasy","Supernatural"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":2,"view_count":26,"chapters_count":1,"last_update":1717124949,"description":"Inspired by the tales form the DND campaign \"The Lost mines of Phandalin\", I bring you a self written second act for the campaign. In the 1st Act the party are tasked with the overall task of finding and killing a Young White Dragon. After successfully slaying the dragon, the party is confronted by a mysterious figure with a new task for them.","description_hash":2640562735861690084},{"title":"Catalyst: Interesting Times. A Reincarnation Litrpg","fiction_id":"87510","link":"https:\/\/www.royalroad.com\/fiction\/87510\/catalyst-interesting-times-a-reincarnation-litrpg","tags":["LitRPG","Reincarnation","Dungeon","Multiple Lead Characters","Adventure","Fantasy","Female Lead","Magic","Progression"],"lable":"Original","following_count":27,"rating":0.0,"page_count":201,"view_count":2554,"chapters_count":14,"last_update":1718378835,"description":"A soul lost in the weave between worlds for so long that it has forgotten almost all of the life they lived before, is found by a goddess of lost and broken things, on their way to break and remake the world of Axis. An offer is made - reincarnation, for being a foot in the door, a crack, a Catalyst for change.\nJoin Arcadia as she is born again into an ancient world of magic and history, dungeons, deserts, and ruins, and learns exactly what it means to be born in Interesting Times.\n-----------------------------------------------------------------------------------------------\nWhat to expect:\n- A world with deep lore and long history, with plenty of mysteries to speculate on.\n- A Monster Progression system based on hunting creatures to increase abilities\n- A non overpowered MC. She will have advantages, yes, but there will always be someone stronger\n- Absolutely no Harem, most likely no adult content past violence against monsters, and no plan for a romance subplot at this time\n- If there is disturbing content in a chapter, I will try to find include a TW in the pre chapter box.\nthis is an experiment and my first time writing something like this. hope you enjoy.\nAiming for a chapter a week.\nChapters will be at least 3000 words in length (hopefully)","description_hash":2845277720888060635},{"title":"Pionier: Forger of Lands ","fiction_id":"87509","link":"https:\/\/www.royalroad.com\/fiction\/87509\/pionier-forger-of-lands","tags":["Virtual Reality","Reincarnation","Time Travel","Progression","War and Military","Action","Fantasy","LitRPG","Male Lead","Ruling Class"],"lable":"Original","following_count":1,"rating":0.0,"page_count":1,"view_count":38,"chapters_count":1,"last_update":1717124921,"description":"Eric died from playing a game for less than half a year. He was a good explorer, a rare class with good information gathering. Using said class he gathered alot of secrets and gave them for a price. competition was fierce and fierce was the way he went down. he found something too great for a small person and paid for it with his life. going back to half a year before the said game launch, he laid out a plan to gather said treasures and gain advantages.","description_hash":7373733509691945264},{"title":"Beasts: Reborn","fiction_id":"87508","link":"https:\/\/www.royalroad.com\/fiction\/87508\/beasts-reborn","tags":["LitRPG","Urban Fantasy","Dungeon","Post Apocalyptic","Super Heroes","Action","Adventure","Fantasy","Mystery","Martial Arts","Multiple Lead Characters","Non-Human Lead","Magic","Grimdark","GameLit","High Fantasy","War and Military","Dystopia","Progression"],"lable":"Original","following_count":4,"rating":5.0,"page_count":79,"view_count":839,"chapters_count":9,"last_update":1718051725,"description":"In a world where your shot at fame and fortune depends on the awakening of your latent magical abilities, numbers are everything. Your Class? System? Chosen god? They’re all pieces of a puzzle conveying images of blood and death a thousand ways. But that’s life, ironically enough. And that blood, death, and experience is what comes from the modern heroes sacred duty. \nExplore Tangents. Kill monsters. Stop them from terraforming the Earth and everything else they’re attracted to— no matter how bizarre. \nClaude knows bizarre well. Living in the forests of New Gloria with his father gives him an upbringing unique from his classmates. In many ways he’s disconnected from the world of heroes. His near photographic memory of famous heroic events and tales of grandeur can’t change that fact. And no matter how many stories he reads, he can’t prepare himself for the truth of the heroes he’s confided in since boyhood and the monsters he’s feared since before then.\nAs if he needed a more explicit showing, a strange and beautiful age old power is born again within him, twisting his very life into a tumultuous battle-heavy hunt of legend….\nFear twins. \nEmbrace change. \nPrepare for war.","description_hash":-4760544419509506984},{"title":"Emotional Damage","fiction_id":"87507","link":"https:\/\/www.royalroad.com\/fiction\/87507\/emotional-damage","tags":["Villainous Lead","Female Lead","Contemporary","Slice of Life","Strong Lead","Horror"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":39,"chapters_count":1,"last_update":1717121297,"description":"Your children were wonderful, you had done a good job. Even as a single mother you had strived to create the perfect environment for them to live and grow up in. Maintaining the web in order to keep them safe, secure and happy was extraordinarily tricky.It is unfortunate that you missed him, and he yanked the careful construct down so hard.Fixing this is going to hurt.Someone.","description_hash":5989001244607731528},{"title":"Rise of the Runelord - The Guild Saga","fiction_id":"87506","link":"https:\/\/www.royalroad.com\/fiction\/87506\/rise-of-the-runelord-the-guild-saga","tags":["LitRPG","Dungeon","Fantasy","Magic","GameLit"],"lable":"Original","following_count":4,"rating":0.0,"page_count":52,"view_count":328,"chapters_count":5,"last_update":1718380806,"description":"The first fully sentient A.I. has been created and the first task it's given is to develop a cutting edge MMO RPG. Erik is one of the first wave of players brought into the game, due to his professional expertise as a blacksmith. After losing his arm in an accident a couple years prior, all but ending his blacksmithing career, he joins the game to get away from his situation and enjoy himself. After being given an incredible boon during character creation, he finds his blacksmithing days might not be behind him anymore.\nAfter making waves with his unique blacksmithing style, he's stumbles upon the secret code of the game in the form of runes and catapults himself even further ahead. Fame comes with many benefits, but also sinister machinations. Follow Erik as he navigates a complex game system while finding his passion in blacksmithing again.","description_hash":-3904391122695824350},{"title":"Elizabeth and the Order of the Realms","fiction_id":"87505","link":"https:\/\/www.royalroad.com\/fiction\/87505\/elizabeth-and-the-order-of-the-realms","tags":["Multiple Lead Characters","Strong Lead","Adventure","Fantasy","Female Lead","Magic"],"lable":"Original","following_count":3,"rating":5.0,"page_count":48,"view_count":289,"chapters_count":5,"last_update":1718424079,"description":"Elizabeth is the newest member  in the Order of the Realms tasked to protect the realm holding the place she hates the most, Earth. When her commander is put out of commission, and an old foe returns, threatening the safety of the Realms, Elizabeth must go to the place she loathes in order to save the realms.\nUpdates every Saturday","description_hash":-3824669812368604449},{"title":"I Transmigrated As A Demon King Player","fiction_id":"87504","link":"https:\/\/www.royalroad.com\/fiction\/87504\/i-transmigrated-as-a-demon-king-player","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Ruling Class","Martial Arts","Action","Adventure","Comedy","Fantasy","Reincarnation","Slice of Life","Magic","Strategy","GameLit","High Fantasy","Mythos","Progression"],"lable":"Original","following_count":55,"rating":2.25,"page_count":117,"view_count":2255,"chapters_count":11,"last_update":1718406154,"description":"I never imagined becoming a Demon King inside a novel. Worse yet, I didn't inherit the Demon King's power, leaving me incredibly weak. On top of that, I must face the protagonist in the future, knowing he is determined to kill me because of his hatred for demons. Now, I'm left with two choices: either I grow stronger and take down the protagonist to survive, or attempt to befriend him against all odds.\nHowever, that's not the point because my real goal is to live a peaceful life without any conflict, but as a Demon King, that seems impossible to avoid. Ah, dammit! Just thinking about it already stresses me out! Whatever! My life comes first, so I'm going to do whatever it takes to stay alive!\nAuthor Note: If you're interested in reading 10 chapters ahead, the Patreon page is now available.\nAlso post on Scribblehub.","description_hash":3973851090088883064},{"title":"Ascendant Online","fiction_id":"87503","link":"https:\/\/www.royalroad.com\/fiction\/87503\/ascendant-online","tags":["Virtual Reality","Progression","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":11,"rating":2.75,"page_count":61,"view_count":1168,"chapters_count":9,"last_update":1718155030,"description":"Eddie was pissed. His PhD advisor just told him that he needed another 12 months of experiments. After he had needed “only another month or so” which was after he needed “just two more weeks,” so he didn’t think that he would ever graduate. But a new VR game was coming out, Ascendant Online, and a trillionaire had staked his fortune as the prize for the winner. Eddie never played VR games before, but this was a new world for him, one without his hated advisor. So, he booted up the game and became a looting, pillaging, plundering goblin. Eddie finds himself growing until he becomes the most feared pirate to sail the seas, notadoctor.\nSchedule: one chapter per weekday for the first two weeks plus one bonus so (10+Prologue) then down to twice a week (maybe three if I have time).\nWhat to expect: disillusioned student who becomes an aquatic goblin; classes focused on looting and piracy; mostly solo play \/ leveling; use of illusions, explosives, and trickery to succeed as a pirate, even without a crew; both land and sea classes \/ races. \nWhat not to expect: the world merging into the game or vice versa (for at least a few hundred chapters); MC who is trusting \/ naive \/ stupid; harem.","description_hash":6578951545749768812},{"title":"The Eclipsed dawn","fiction_id":"87502","link":"https:\/\/www.royalroad.com\/fiction\/87502\/the-eclipsed-dawn","tags":["Psychological","Action","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":11,"view_count":32,"chapters_count":1,"last_update":1717113591,"description":"In the small town of Riverside, four inseparable friends—Ethan, Jamie, Sam, and Alex—find themselves plunged into a nightmare after an end-of-year party. Clara Kepler, the most popular girl in school, mysteriously disappears during a forest outing. The boys, bound by a dark secret, swear to keep silent.\nAs a thorough investigation led by Inspector Grace Mitchell begins, flashbacks reveal the deep connections and intimate secrets shared with Clara. Tension rises, the truth becomes unbearable, and chaotic memories blur reality.\n\"The Eclipsed Dawn\" is a captivating story of mysteries, broken loyalties, and devastating secrets. Discover how one night can change lives forever.","description_hash":-8226502654906307675},{"title":"The adventure never ends","fiction_id":"87501","link":"https:\/\/www.royalroad.com\/fiction\/87501\/the-adventure-never-ends","tags":["Comedy","Adventure","Fantasy","Short Story"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":1,"view_count":22,"chapters_count":1,"last_update":1717113585,"description":"My idea for fanfiction that no one ever posts about.I'll post once in awhile if I come up with a new idea if any of the short stories take off I'll actually write it I hope you like my ideas if you get inspiration from them good for you go for it have a blast","description_hash":4329060789163444892},{"title":"Valor & Fire","fiction_id":"87500","link":"https:\/\/www.royalroad.com\/fiction\/87500\/valor-fire","tags":["Male Lead","Action","Adventure","Fantasy","Mystery","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":36,"view_count":105,"chapters_count":3,"last_update":1717827930,"description":"Last Hero of Mankind, our last hope .\nHear our prayers . Please save our kingdom.\n------------------------------------------------------------\na western style fantasy .\nMy first writing , feel free to comment your opinion","description_hash":4636452533339500152},{"title":"Guardians of the Vedas","fiction_id":"87499","link":"https:\/\/www.royalroad.com\/fiction\/87499\/guardians-of-the-vedas","tags":["Urban Fantasy","Male Lead","Action","Adventure","Fantasy","Historical","Magic","Low Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":5,"view_count":18,"chapters_count":1,"last_update":1717113562,"description":"When 17-year-old Arjun stumbles upon a glowing manuscript in an ancient temple, he unlocks elemental powers and a destiny as the Guardian of the Vedas. Guided by the wise Guruji and supported by his best friend Priya, Arjun must master his abilities to combat the malevolent Asura, an ancient dark force threatening to plunge the world into chaos. Journeying through India's sacred sites, Arjun discovers the true power of his heritage and the epic battle between light and dark.","description_hash":-6242336909234588304},{"title":"The Artifcer ","fiction_id":"87498","link":"https:\/\/www.royalroad.com\/fiction\/87498\/the-artifcer","tags":["Male Lead","Slice of Life","Strong Lead","Fantasy","High Fantasy","Mythos"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":2,"view_count":18,"chapters_count":1,"last_update":1717113558,"description":"After the burning of Yawgmoths from within the lands of Dominaria and the valiant sacrifice of our heroes. The legacy weapon had in doing so fried a hole within the blind eternities. Where ones spark could fall forever through into fading. My embers pushed by the release of so much black and white mana into the dimensional warp. I had left behind the planes connected to our planetry spheres. I, Master Mazra, Chief Artifcer and Headmaster of Tristerns Academy, found myself lost in the realms of another plane of existance. Where the towers of the heavens stood.","description_hash":-554986943233551401},{"title":"The 2nd Descendant of That Hell","fiction_id":"87497","link":"https:\/\/www.royalroad.com\/fiction\/87497\/the-2nd-descendant-of-that-hell","tags":["Portal Fantasy \/ Isekai","Time Loop","Dungeon","Villainous Lead","Super Heroes","Action","Adventure","Historical","Mystery","Reincarnation","Martial Arts","Sports","Reader Interactive","School Life","Supernatural","Male Lead","Strong Lead","Secret Identity","Magic","High Fantasy","Space Opera","Time Travel","Hard Sci-fi","Attractive Lead"],"lable":"Original","following_count":2,"rating":4.0,"page_count":8,"view_count":95,"chapters_count":3,"last_update":1718329505,"description":"In 'The 2nd Descendant of That Hell,' protagonist Shivam Sinha navigates a world where magic and technology intertwine seamlessly. Born with an unusually high level of Prana-Shakti (PS), Shivam struggles to control his immense power. When he joins the Legacy Cultivators club at his college, he discovers a hidden society dedicated to awakening unique abilities within individuals. Led by enigmatic senior Niharika, the club explores the mysteries of manifestation—a process that enhances specific body parts to unlock extraordinary abilities.\nAs Shivam delves deeper into the club's teachings, he uncovers dark secrets about his own heritage and the true nature of the Dream Hell—a parallel dimension inhabited by dangerous entities. With the help of his loyal friend Veer and newfound allies in the Legacy Cultivators, Shivam embarks on a journey to master his powers and confront the looming threat of the Dream Hell's resurgence.\n'The 2nd Descendant of That Hell' is a thrilling adventure that blends elements of fantasy, mystery, and coming-of-age drama. Through Shivam's eyes, readers will explore themes of identity, destiny, and the power of perseverance in the face of adversity.","description_hash":6698246566475642042},{"title":"Looping Jack","fiction_id":"87495","link":"https:\/\/www.royalroad.com\/fiction\/87495\/looping-jack","tags":["GameLit","Portal Fantasy \/ Isekai","Time Loop","Dungeon","Anti-Hero Lead","Action","Adventure","Fantasy","Reincarnation","Strong Lead","Secret Identity","Magic","Wuxia","High Fantasy","Ruling Class","Time Travel","First Contact","Progression","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":29,"view_count":113,"chapters_count":3,"last_update":1717688210,"description":"A bounty hunter named Jack roams the world while completing missions issued by the Guild. However, he has a secret. He can time loop. Where this power came from? Jack has no idea.\n\nNew to the whole author thing, so please don't hate me if my work has plotholes or grammar mistakes :)","description_hash":-255312859828759616},{"title":"Secret of the Raganrog","fiction_id":"87494","link":"https:\/\/www.royalroad.com\/fiction\/87494\/secret-of-the-raganrog","tags":["Portal Fantasy \/ Isekai","Post Apocalyptic","Male Lead","Sci-fi","Action","Adventure","Reincarnation","Technologically Engineered"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":37,"chapters_count":1,"last_update":1717112728,"description":"What if what we knew of the Norse Mythology was just stories about the remnants of their society and world? The destroyer was a life devouring beast the Raganrog whos name was changed over time to become Ragnarok. But what happened to that world? The Vitan Central Command tasked to restoring the planets devastated by the Raganrog sends their Environmental Repair Cyborg to the Planet Midgard where they lose contact. Vitan Central Command sends another Environmental Repair Cyborg who not only assumes the missing cyborg's mission but also find out what happened to the previous cyborg. What happened to him and what other mysteries await Environmental Repair Cyborg Mark 90?","description_hash":-7560651380151003921},{"title":"The Wanderer of the West Winds ","fiction_id":"87493","link":"https:\/\/www.royalroad.com\/fiction\/87493\/the-wanderer-of-the-west-winds","tags":["Progression","Wuxia","Action","Adventure","Fantasy","Martial Arts","Low Fantasy","First Contact"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"After a war of unprecedented scale, the Murim alliance emerged, like a sovereign commanding the entire central plain. But a simple breeze from the west could be enough to change Murim forever.","description_hash":-3715979463968722681},{"title":"YOU AGAIN?","fiction_id":"87492","link":"https:\/\/www.royalroad.com\/fiction\/87492\/you-again","tags":["Super Heroes","Female Lead","Secret Identity","Strong Lead","Drama","Adventure","Fantasy","Romance","Supernatural","Male Lead","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":8,"view_count":54,"chapters_count":2,"last_update":1717191519,"description":"Diana stumbled upon her ex after coming to terms with his absence from her life. He cheated on her. He betrayed her. He left her.For more than a year, she dreamed of him, and for over a year, she did her best to forget what he had done to her. Now he is back. But Diana doesn't need him anymore. And he better stay away from her.","description_hash":-7021924893665096189},{"title":"Gravitas","fiction_id":"87553","link":"https:\/\/www.royalroad.com\/fiction\/87553\/gravitas","tags":["Psychological","Male Lead","Low Fantasy","Soft Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":14,"view_count":36,"chapters_count":1,"last_update":1717168321,"description":"Did you ever hear the one about God and the saltshaker?","description_hash":-203791515949971916},{"title":"The Silent Moon","fiction_id":"87552","link":"https:\/\/www.royalroad.com\/fiction\/87552\/the-silent-moon","tags":["Virtual Reality","Post Apocalyptic","Multiple Lead Characters","Sci-fi","Action","Adventure","Mystery","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":11,"view_count":47,"chapters_count":1,"last_update":1717168314,"description":"Welcome to GameBox Studios newest game, \"The Silent Moon.\" Set in a game world, players are virtualized onto an ever changing planet called Abos. Ryn is an elite Dropper, part of the Assault Force to rid Abos of creatures called Wastes, and find the source of the Corruption.","description_hash":5295509071856655800},{"title":"Apostate of the Reaper","fiction_id":"87551","link":"https:\/\/www.royalroad.com\/fiction\/87551\/apostate-of-the-reaper","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Anti-Hero Lead","Xianxia","Action","Adventure","Fantasy","Sci-fi","Reincarnation","Martial Arts","Supernatural","Male Lead","Strong Lead","Magic","Wuxia","GameLit","High Fantasy","Progression"],"lable":"Original","following_count":4,"rating":0.0,"page_count":20,"view_count":158,"chapters_count":2,"last_update":1717383097,"description":"Kaelan Blackwater, an purposeless and disillusioned customer service agent, escapes his soul-sucking job through audiobooks and online games. One night after falling asleep listening to his favourite authors latest fantasy audiobook, he wakes up in a magical world straight out of his favorite stories.\nThrown into a land filled with danger and adventure, Kaelan quickly realizes he's not just dealing with mundane tasks anymore. Armed with his gamer instincts and a sharp, anti-hero attitude, he navigates unfamiliar landscapes and faces challenging quests. Joined by a group of diverse companions, he discovers that being a hero is actually a lot easier than he imagined!\nAs Kaelan adapts to his new reality, he embraces the chaos and complexity of this magical world. Deep friendships and dangerous challenges test his courage and resolve, making him realize he has no desire to return to his ordinary, mundane life. This is where he belongs, where every decision matters, and where he can truly be himself.\nGenre: Fantasy\/LitRPG\/Cultivation","description_hash":6073675021923400012},{"title":"Paradise Reindeer Corporation","fiction_id":"87550","link":"https:\/\/www.royalroad.com\/fiction\/87550\/paradise-reindeer-corporation","tags":["Progression","Anti-Hero Lead","Strategy","Psychological","Multiple Lead Characters","Action","Adventure","Fantasy","Female Lead","Strong Lead","Secret Identity","High Fantasy","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":39,"view_count":78,"chapters_count":2,"last_update":1717172430,"description":"Asun lived peacefully at her poor village, on one of the islands of a Nation surrounded by the sea. The night of her birthday, all she wanted was to have fun and talk with her friends ; but alas, fate is not one that cares about feelings. As it decided, Asun has now to work for a mysterious Corporation named \"Paradise Reindeer\", and she becomes a new member of the latest team, \"4-Comet\".As she will work with them so she can survive and gets her revenge, she will soon understand that, as much as her, the nine other members of the team have all lives... that deserves a story of their own.[For the trailer of this story: https:\/\/www.youtube.com\/watch?v=OsJEFtdA-qM !!](Note: This story is first written in french, then translated by DeepL, and then checked by me (and re-doing the chapter format). There will be errors, I won't hide it ; but I can guarantee that it's readable. \/\/ This story is one of the 4 story\/Web Novel I'm writing at this moment. Until I'm up to date to the french chapters, translations will depend on my mood!)","description_hash":1896727693803719807},{"title":"VIP System","fiction_id":"87549","link":"https:\/\/www.royalroad.com\/fiction\/87549\/vip-system","tags":["LitRPG","Reincarnation","Male Lead","Adventure","Fantasy","Magic"],"lable":"Original","following_count":6,"rating":0.5,"page_count":139,"view_count":2551,"chapters_count":28,"last_update":1718595632,"description":"Eman, an average Filipino man, lived a life marked by family tragedy and relentless determination. After losing his parents to illness and his sister to violence, he resolved to secure a stable future before starting his own family. Working tirelessly as a software tester, Eman saved diligently, but a tragic motorcycle accident cut his life short. To his astonishment, he awakens in a new world, reincarnated as a baby named Leo.In this new world, Leo is taken in by Amanda, a beautiful and resilient woman with a tragic past of her own. Amanda had once been a powerful adventurer, her skills honed through countless battles. Now, she dedicates herself to raising Leo, honoring a vow made to his dying parents. The two of them carve out a life on a small farm, surrounded by fields of green and the quiet hum of nature.This world, however, is anything but ordinary. It is a land of magic and monsters, where adventurers known as System Users wield extraordinary powers granted by mysterious systems. These adventurers, often revered as heroes, possess abilities that can reshape the fate of kingdoms. The systems they harness offer advanced and unique upgrades, transforming them into formidable warriors with unprecedented power.On his eighth birthday, Leo discovers his own link to this powerful heritage when he activates the “VIP System.” This unique system grants him incredible abilities and opportunities, from daily rewards and exclusive quests to immense boosts in strength and defense. Among the system's features is “Share the Pain,” a daunting perk that allows Leo to sync with another’s experiences, gaining their skills and knowledge, but at great personal risk.As Leo navigates the challenges and perils of his new world, he must balance his growing power with his commitment to protect Amanda. Each level of the VIP System unlocks greater potential but also brings increased danger. Through his journey, Leo learns the true extent of his abilities and the responsibilities that come with them.“VIP System” is a gripping tale of reincarnation, resilience, and the relentless pursuit of power and protection. Set in a world where heroes wield systems of immense power.","description_hash":2376241405441561045},{"title":"Atlantis","fiction_id":"87548","link":"https:\/\/www.royalroad.com\/fiction\/87548\/atlantis","tags":["Grimdark","Tragedy","Action","Adventure","Fantasy","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":47,"chapters_count":1,"last_update":1717168276,"description":"A visual novel about the collapse of the fabled civilization of Atlantis","description_hash":-1895142036774836590},{"title":"Perspective","fiction_id":"87547","link":"https:\/\/www.royalroad.com\/fiction\/87547\/perspective","tags":["Female Lead","Tragedy","Horror","Short Story","Male Lead","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":38,"view_count":22,"chapters_count":1,"last_update":1717168082,"description":"\"What to do while I wait for people\"\n\"Why wait at all? Maybe you should just close the store down and give up on this place\"\n\"Or a nicer thing to do is count how many books or maybe see how many pages you can read in ten minutes\"","description_hash":-2526086963278062870},{"title":"Branching Reality","fiction_id":"87546","link":"https:\/\/www.royalroad.com\/fiction\/87546\/branching-reality","tags":["Portal Fantasy \/ Isekai","Progression","Strategy","Xianxia","Sci-fi","Action","Adventure","Fantasy","Reincarnation","Martial Arts","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":1,"rating":0.0,"page_count":30,"view_count":204,"chapters_count":5,"last_update":1717198127,"description":"A man dies and finds himself in a river of souls, confronted by a man of Valhalla with a service contract.  \nSigning up for community service in exchange for the right to reincarnate with memories partially intact, he finds himself in a primitive world where humans move in nomadic tribes and are hunted by Origin Beasts.\nHe also finds that he happens to be blind now.  So, as a blind man he’ll need to develop cultivation from scratch while preparing for an impending inter-dimensional war in an infantile reality, as an infant.\n\nWhat could go wrong?","description_hash":371353935478060540},{"title":"Saliton's Legacy","fiction_id":"87545","link":"https:\/\/www.royalroad.com\/fiction\/87545\/salitons-legacy","tags":["Grimdark","Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":42,"view_count":305,"chapters_count":7,"last_update":1718404231,"description":"In the grim expanse of the Bronze Kingdom, Alatar Saliton dubbed the Demon Eater, emerges from the ashes of a village ravaged by demons and witches. His existence is a fusion of vengeance and an ill-fated ritual that bound his essence with that of Vorgrimm, the First Ancient Demon King. Driven by a thirst for retribution, Alatar embarks on a relentless quest to eradicate every demon and those allied with them. Amidst this darkness, fate intertwines his journey with Mira, the youngest Princess of the Diamond Kingdom, betrayed and sold into demonic enslavement by her kin. Rescued by Alatar, she, too seeks vengeance, embracing the shadows that envelop his mission. As Alatar navigates the treacherous paths of this dark fantasy realm, the line between his humanity and the voracious demon within blurs. Will his pursuit of vengeance consume his soul, or will he triumph against the forces that seek to claim him, risking both his life and essence in the relentless pursuit of justice?","description_hash":83554746971678181},{"title":"Propagate: A survival litrpg","fiction_id":"87544","link":"https:\/\/www.royalroad.com\/fiction\/87544\/propagate-a-survival-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Action","Fantasy"],"lable":"Original","following_count":5,"rating":0.0,"page_count":36,"view_count":410,"chapters_count":5,"last_update":1718521217,"description":"A somewhat more realistic depiction of what would happen if you threw a highschooler into another world. On a planet of magic, monsters, and gods, humanity is in a constant war for survival, and they are losing, badly. In a last ditch effort to save them, their pantheon of gods took inspiration from Earth, and crafted a complex system capable of bolstering humanity's growth. Now, they just need a few humans to test it for balancing. \n\n“Earth has plenty of humans, and they're the ones who came up with the concept of systems in the first place! I'm sure they won't mind if we take a few…”","description_hash":-2764640974169567261},{"title":"Lunar Castle","fiction_id":"87542","link":"https:\/\/www.royalroad.com\/fiction\/87542\/lunar-castle","tags":["Female Lead","Action","Adventure","Fantasy","Short Story","High Fantasy"],"lable":"Original","following_count":1,"rating":4.5,"page_count":15,"view_count":44,"chapters_count":1,"last_update":1717159354,"description":"The Lunar King and Queen are  people from legends who live in a castle. Most believe that this is just a myth, that the King and Queen do not exist. Victoria Green is not one of these people. She believes that she saw the castle as a child and is determined to find it. She crosses many planes and her last obstacle is a cave that seems to contain an ancient power that does not want to be disturbed.","description_hash":3678401453051572943},{"title":"Adventure Bound","fiction_id":"87541","link":"https:\/\/www.royalroad.com\/fiction\/87541\/adventure-bound","tags":["Multiple Lead Characters","Strong Lead","Action","Adventure","Fantasy","Romance","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":5.0,"page_count":185,"view_count":1136,"chapters_count":26,"last_update":1717513221,"description":"a system in the realm of Grass Mark that allows people to register as adventurers who takes up on quest, raids, dungeons. Each adventurer have their own distinguish ranks from adventurer rank one to one hundred. depending on your rank, you are only able to do certain amount of quests until your next rank unlocks.","description_hash":-4554680515414613118},{"title":"Welcome to Your World","fiction_id":"87540","link":"https:\/\/www.royalroad.com\/fiction\/87540\/welcome-to-your-world","tags":["Virtual Reality","Portal Fantasy \/ Isekai","Time Travel","Post Apocalyptic","Sci-fi","Adventure","Hard Sci-fi"],"lable":"Original","following_count":2,"rating":0.0,"page_count":37,"view_count":208,"chapters_count":6,"last_update":1718481369,"description":"\"Welcome to Your World\", is a contiuation of the Ethan Strong series found on Royal Road. This time AI has created a world Ethan doesn't recognize. A world he's never seen before, yet pieces of his life can be found everywhere he looks. What is this? Unfinished business?","description_hash":4837788164835199517},{"title":"Good People","fiction_id":"87539","link":"https:\/\/www.royalroad.com\/fiction\/87539\/good-people","tags":["Urban Fantasy","Non-Human Lead","Sci-fi","Drama","Action","Fantasy","Cyberpunk","Female Lead","Low Fantasy","Technologically Engineered","Soft Sci-fi","Dystopia","Artificial Intelligence"],"lable":"Fan Fiction","following_count":8,"rating":5.0,"page_count":128,"view_count":650,"chapters_count":9,"last_update":1718475527,"description":"The year is 2070. It is seven decades since magic returned to the world, bringing with it creatures once believed to be myths and legends. The power of nation-states has declined, eclipsed by megacorporations who fight an invisible war for market share with deniable mercenaries known as Shadowrunners.\nBug is no Shadowrunner, just a reclusive hacker who spends her days doing petty Matrix jobs for petty pay. When a crew of mercenaries in need of a tech expert reaches out to her with an offer too profitable to refuse, Bug discovers that for someone with her gifts, there are much better - and riskier - ways to live.\nDrawn into a spider's web of competing interests, Bug will have to adapt quickly to survive a city where the lines between gangs, corporations and politicians are so blurred as to be almost non-existent, all while the uncovering the hidden depths of her own Technomantic abilities.\n\n\nThis story is a fusion of the Parahumans universe, created by John C. McCrae, with the fantasy-cyberpunk universe of Shadowrun, developed and published by Catalyst Games. No prior knowledge of either setting is required to read and enjoy Good People.","description_hash":-5247282641716823537},{"title":"Ink and Shadow","fiction_id":"87538","link":"https:\/\/www.royalroad.com\/fiction\/87538\/ink-and-shadow","tags":["Psychological","Female Lead","Romance","Mystery","School Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":28,"chapters_count":1,"last_update":1717157632,"description":"In a seemingly peaceful town that hides dark secrets, aspiring writer Maxine finds herself entangled in a dangerous game of seduction and obsession with Thomas, her professor and renowned author. Thomas, a brilliant and enigmatic man, harbors a terrifying secret that could destroy their careers and relationship.","description_hash":5386878307600893959},{"title":"Panic","fiction_id":"87537","link":"https:\/\/www.royalroad.com\/fiction\/87537\/panic","tags":["Psychological","Non-Human Lead","Tragedy","Horror","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"A tiny creature finds itself trapped in a massive, maze-like world that feels hostile and oppressive at every turn. Separated from its family during a terrifying incident, the protagonist is now desperately crawling through shadowy crevices and nooks, panic driving its movements. Memories of loved ones spur it onwards, but the labyrinth seems infinite and inescapable. Behemoth forces loom all around, their rumblings and illuminations sending the protagonist scattering for cover. Though frightened and exhausted, the driving need to locate its kin and ensure their safety pushes the creature to brave each new horror the maze presents. Internal fears and worries plague the protagonist as it flees from one dire situation to the next. Can it survive this ordeal and find its way back to the comfort of family?  (Synopsis reworded by Claude AI)","description_hash":9070054711521578945},{"title":"S. T. E. V. E. ","fiction_id":"87536","link":"https:\/\/www.royalroad.com\/fiction\/87536\/s-t-e-v-e","tags":["LitRPG","Progression","Comedy","Non-Human Lead","Sci-fi","Adventure","Mystery","Magic","GameLit"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":29,"chapters_count":1,"last_update":1717157597,"description":"Steve Murphy, a gamer from Alabama, moves to rainy Seattle to pursue his dream job at Dungeon Dynamics Inc. Living out of his truck, he joins a brain-scanning program led by gaming legend John Carmack. As Steve waits for his turn, he reflects on his journey and passion for gaming, excited to be a part of a groundbreaking project, hinting at a transformative adventure ahead.","description_hash":4640811916503982977},{"title":"Where is The Meaning in All of This","fiction_id":"87535","link":"https:\/\/www.royalroad.com\/fiction\/87535\/where-is-the-meaning-in-all-of-this","tags":["Dungeon","Female Lead","Sci-fi","Action","Adventure","Fantasy","Supernatural","Male Lead","Magic","High Fantasy","Progression"],"lable":"Original","following_count":0,"rating":0.0,"page_count":71,"view_count":20,"chapters_count":1,"last_update":1717157574,"description":"-Co-Written BookSamuel Granderson and Cristina SeguraFantasy World\nCristina Character:Description:     Teenage girl: name - Mara    Age - 15    ~ She wears white clothing with lace falling from her elbows and ankles.    Eye color - Golden yellow    Hair color - white with gold streaks    Height - 5’6”Race - light elf    ~ She has a creature with glowing white fur and antlers like branches that grew the most beautiful of pink blossoms.    Ko - a male deerKo was the name of the creature.    ~ Mara came from a wealthy high standing family, but she had two other siblings. Her other siblings were treated like royalty while she was treated like a person without worth. So her parents sent her away on a journey to gain worth, honor, and respect. With this, Mara could make a name for herself, return home, and bring honor to her family name. \n\nSamuel Character:Description:    Kent is a young boy, 14 years of age, wrapped in dark clothing that fell to the floor. They were obviously too large for him. He bunched up his sleeves to keep them out of his way. Only his boots were a proper fit for him. His dark hair fell in the way of his pale gray irises. His glare looked life in the eyes, unblinking. At his side was a thin knife, a crude and common weapon left behind by his father. He grew up in the suburbs of his dying town, a rough cold neighborhood of which he did not belong. He could hold his own in a fight despite his size and thieving was necessary to survive.    Kent’s mother had died of an illness and his father had been a guard for the city gate before he was killed by an intruder three years ago. His father had been of the Wolfman race, as exemplified by Kent’s two dark ears and his strong sense of smell.","description_hash":-6562471579753408048},{"title":"Devil's Seraph - Short Story 1","fiction_id":"87534","link":"https:\/\/www.royalroad.com\/fiction\/87534\/devils-seraph-short-story-1","tags":["Horror","Mystery","First Contact","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":25,"chapters_count":1,"last_update":1717157522,"description":"A short story about a little girl facing her first demon.","description_hash":4836659240976757537},{"title":"Veil of Shadows","fiction_id":"87533","link":"https:\/\/www.royalroad.com\/fiction\/87533\/veil-of-shadows","tags":["Female Lead","Secret Identity","Historical","Horror","Mystery","Supernatural","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":19,"view_count":45,"chapters_count":2,"last_update":1718491879,"description":"Eliyah Morewood the resident physician, teams up with a newbie detective to investigate the gruesome murder of a young girl once under her care. Upon joining the investigation, she discovers a sinister conspiracy brewing beneath the streets of Ardes, threatening to spill into the everyday lives of its citizens and challenge the very fabric of reality.\nJoin my characters as they step foot in a hidden supernatural world hidden behind murders, sex cults, and human sacrifice. Everyone has their own selfish objective, and in this situation, Eliyah is in over her head, death knocks on her door multiple times, and one of these days he will catch her. \nI'm taking inspiration from the father of great webnovels, Ai Qianshui de Wuzei . My work is nowhere as good but I am trying my best to give my characters justice.","description_hash":-6991801262553776164},{"title":"I Did Not Kill the King!","fiction_id":"87532","link":"https:\/\/www.royalroad.com\/fiction\/87532\/i-did-not-kill-the-king","tags":["Action","Adventure","Fantasy","Mystery"],"lable":"Original","following_count":1,"rating":0.0,"page_count":17,"view_count":216,"chapters_count":6,"last_update":1718374824,"description":"Sallivan Hatcher wants you to know that he did not kill the king. He was framed, but who would believe the son of a horse thief? Now, he is on the run from the Shadow Guard, an elite group led by an incredibly impressive elven warrior lady who has sworn allegiance to the crown. He must find a way to the castle and tell the princess who really killed her father.  Will he stay alive long enough to reveal the truth?","description_hash":8124502348159260907},{"title":"Caligo","fiction_id":"87531","link":"https:\/\/www.royalroad.com\/fiction\/87531\/caligo","tags":["Grimdark","Male Lead","Action","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":20,"chapters_count":1,"last_update":1717157451,"description":"The Feylands.\nWhile the name might sound pleasant, they are anything but. Cruelty and hardships are as common as breathing, but that doesn't stop common folk from trying to live honest lives.\nPetyr is a knight in the employ of a small fiefdom in the Southern Feylands. He spends his days full of self-loathing and drinking until a ruinous event leads to the destruction of the land he watches over. Seeking answers for the havoc wrought before him, he sets off on a tragic, dark journey.","description_hash":845624265423114715},{"title":"Spring in the Land of Farth","fiction_id":"87530","link":"https:\/\/www.royalroad.com\/fiction\/87530\/spring-in-the-land-of-farth","tags":["Adventure","Fantasy","Romance","Supernatural","Magic","Low Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":105,"chapters_count":3,"last_update":1717254894,"description":"The Balance off. Simone is tipping the Scale. All attempts at divination have been blocked. I am leaving for the Source and will see what I can make out from their. If the Balance fails and the World falls then we will fall with it and this time the world ends none of us may survive.\nThe Ring of Stone\nArc Mage Thorn","description_hash":-5758556349623637431},{"title":"The Brave One","fiction_id":"87529","link":"https:\/\/www.royalroad.com\/fiction\/87529\/the-brave-one","tags":["Anti-Hero Lead","Female Lead","Strong Lead","Action","Adventure","Historical","Short Story","Supernatural","Male Lead","Magic","Low Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":28,"view_count":448,"chapters_count":10,"last_update":1717945230,"description":"A retelling of Irish mythology following Eachtach, a young hunter who was born to parents fleeing from a ghost of their past, needs to learn to challenge the heroes from her childhood. \nEachtach's parents were once a great hunter and a princess. By the time Eachtach is born they are fleeing from a powerful man who was once engaged to Eachtach's mother. Eachtach spent her entire life in the wilderness, fleeing from that man. One day while out hunting for her family she spots a strange raven, following it leads her on an adventure that will allow her to get revenge. \nMany years before Eachtach's time, a young hero by the name of Fionn Mac Cumhail is coming into his own as the leader of the Fianna, a band of hunters who protect the land from invasions and magical threats. He grows to become one of the greatest heroes in the land, however the loss of his first wife changes his path and leads him to meeting a young and beautiful princess.","description_hash":-2297931166081054228},{"title":"Silver dragon[OneShot]","fiction_id":"87528","link":"https:\/\/www.royalroad.com\/fiction\/87528\/silver-dragononeshot","tags":["Comedy","Non-Human Lead","Slice of Life","Fantasy","Romance","Short Story","Male Lead","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":2,"rating":4.83,"page_count":11,"view_count":118,"chapters_count":1,"last_update":1717157389,"description":"Andryrth is a dragon in search of a good fight, so he kidnaps the princess of a human kingdom and awaits for a worthy opponent to challenge him ,but they keep sending him people that cant even beat a goblin.","description_hash":-9156077040384937813},{"title":"Tales of the independent space mage","fiction_id":"87527","link":"https:\/\/www.royalroad.com\/fiction\/87527\/tales-of-the-independent-space-mage","tags":["Urban Fantasy","Progression","Male Lead","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":2,"rating":4.5,"page_count":8,"view_count":45,"chapters_count":1,"last_update":1717157382,"description":"In a world where those with magic are revered as they are the only ones capable enough to take on the monsters that come from the rifts, aided in their fight by the elemental affinity that awakens alongside their latent mana. Arlo, in the midst of a rift outbreak, awakens the latent mana within himself and discovers he possesses the most coveted affinity of them all: spatial magic.\nNot wanting to be beholden to any organisation that would inevitably try to covet his power, seeing him as a valuable asset to be controlled and exploited. He embarks on a journey to a place where he can learn to use his powers without fear of discovery, in order to face dangers brought about by monsters and people alike to protect not only his freedom but those he cares about. Armed with his newfound power will he be able to carve out a path for himself or will those that can’t use him succeed in stopping at nothing to prevent his rise outside of their control?\nThis will be a progression fantasy where the MC goes from weak to strong as he learns to control and use his powers in new ways and for him to build up a network over time which he comes to utilise in his future endeavours. As well as looking at some of the finer details of what it would actually be like to develop as a mage.","description_hash":1378839963348003559},{"title":"On the Hills of Eden","fiction_id":"87526","link":"https:\/\/www.royalroad.com\/fiction\/87526\/on-the-hills-of-eden","tags":["Grimdark","Multiple Lead Characters","Action","Fantasy","Female Lead","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":4.73,"page_count":252,"view_count":1315,"chapters_count":24,"last_update":1718572565,"description":"Where sin does not retreat at the heat of the flame, nor erode against the rushing of the rapids, there is often no other choice than to beat it back with bleeding fists and broken fingers; for some plights cannot be purged but with the spilling of blood.\nAs the recepient of the 3rd Minervan Blessing and the bearer of the title of Soteira, Defender of Minerva, Pallas has a lot riding on her shoulders. The safety of her people and the balance of the Phian Continent lie in her hands as she finds herself caught in a struggle for survival amidst all sorts of enemies, human or otherwise. And while her fellows worry about whether or not she can stay alive, she finds herself confronted with a different conundrum.\nThat is, whether she can live a life worthy of her title at all.","description_hash":2281223742542325134},{"title":"I Reincarnate on Tuesdays [Wuxia]","fiction_id":"87525","link":"https:\/\/www.royalroad.com\/fiction\/87525\/i-reincarnate-on-tuesdays-wuxia","tags":["Portal Fantasy \/ Isekai","Time Travel","Progression","War and Military","Wuxia","Action","Drama","Fantasy","Historical","Reincarnation","Martial Arts","Slice of Life","Female Lead","Magic","Ruling Class"],"lable":"Original","following_count":32,"rating":5.0,"page_count":103,"view_count":3676,"chapters_count":22,"last_update":1718614805,"description":"Edina, a thirteen-year-old girl living in the Blazing Dawn Sect, is tormented by her Aunt Li Mei after the tragic death of her parents. Her life takes an unexpected turn when she begins receiving messages from her future self, Senior Edina, who has mysteriously reincarnated back to her past self's body every Tuesday. Senior Edina uses her knowledge and experiences to guide Junior Edina in reclaiming her life and breaking free from Aunt Li Mei’s control.","description_hash":-2408459488959683749},{"title":"Emergence: The Awakening of other half","fiction_id":"87524","link":"https:\/\/www.royalroad.com\/fiction\/87524\/emergence-the-awakening-of-other-half","tags":["Time Loop","Urban Fantasy","Anti-Hero Lead","War and Military","Grimdark","Action","Adventure","Fantasy","Sci-fi","Multiple Lead Characters","Non-Human Lead","Magic","High Fantasy","Ruling Class","Time Travel","Genetically Engineered ","Technologically Engineered","First Contact","Soft Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":8,"view_count":162,"chapters_count":3,"last_update":1717291376,"description":"\"Zha'thikros, wake up,\" whispered the voice.\nFrom within the darkness emerged the other half .\nAnd so began the story.\n________________________________________\nWarning: My first time writing.\nEnglish is not my first language.\nConstructive criticism is welcomed .\nDo not expect a harem, there may be multiple love interests. (Not decided yet) \nI hope you enjoy the story.","description_hash":8488928519012789608},{"title":"La-La Love Hunter","fiction_id":"87523","link":"https:\/\/www.royalroad.com\/fiction\/87523\/la-la-love-hunter","tags":["Virtual Reality","Time Loop","Strategy","Multiple Lead Characters","Secret Identity","Fantasy","Supernatural","Male Lead","Female Lead","Strong Lead","Time Travel","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":31,"view_count":197,"chapters_count":4,"last_update":1717917929,"description":"They say that love is always in the air, and there are angels who guide people to their destined ones. As they play a part in keeping lovers together, they are called miracles, known as Cupid.However, prior knowledge suggests that there is no such thing as an angel of love, a.k.a. Cupid. It's just a fairy tale story created to make people believe that angels exist and guide us to the good, under the premise that love is also good. This, however, is not true","description_hash":-72502728625267666},{"title":"Origin Saga - The Last Sovereign","fiction_id":"87522","link":"https:\/\/www.royalroad.com\/fiction\/87522\/origin-saga-the-last-sovereign","tags":["Non-Human Lead","Adventure","Fantasy","Mystery"],"lable":"Original","following_count":4,"rating":0.0,"page_count":17,"view_count":174,"chapters_count":3,"last_update":1718150403,"description":"Siegyrd and his brother Aerendir are on a quest, hunting dragons with their wizard friend Mareth, new to the band. The pay is alright, but the young world doesn't know how to deal with these powerful creatures. Something is terribly wrong among the dragons - a sickness of unknown source driving them to madness and bestial rage. What will Siegyrd and Aerendir find in their wanderings? What frightful fall may threaten the younger races if they cannot discover the source?","description_hash":8222351530722562144},{"title":"A New Beginning","fiction_id":"87521","link":"https:\/\/www.royalroad.com\/fiction\/87521\/a-new-beginning","tags":["Non-Human Lead","Short Story","Male Lead","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":13,"view_count":41,"chapters_count":1,"last_update":1717130575,"description":"Having lost everything in his life, Rusty finds an odd advertisement while watching TV. Without much else to consider, he went out and started anew. [Commissioned Work]","description_hash":-7454177520566009948},{"title":"Awakened In The Deep","fiction_id":"87520","link":"https:\/\/www.royalroad.com\/fiction\/87520\/awakened-in-the-deep","tags":["LitRPG","Dungeon","Male Lead","Slice of Life","Strong Lead","Action","Adventure","Fantasy","Magic","High Fantasy","Progression"],"lable":"Original","following_count":2,"rating":0.0,"page_count":28,"view_count":118,"chapters_count":3,"last_update":1718384406,"description":"The world is old and vast. Much of its abundant magic slumbers deep in the Labyrinth, an artifact built to continue a war long forgotten by the mortals of the surface. Join Greg on his unexpected journey into the dangers below.","description_hash":-46796633563352205},{"title":"Vampire's Around The Corner ","fiction_id":"87519","link":"https:\/\/www.royalroad.com\/fiction\/87519\/vampires-around-the-corner","tags":["Anti-Hero Lead","Comedy","Non-Human Lead","Slice of Life","Drama","Romance","Mystery","Supernatural","Male Lead","Female Lead","Magic","Low Fantasy","Attractive Lead"],"lable":"Original","following_count":3,"rating":0.0,"page_count":22,"view_count":205,"chapters_count":5,"last_update":1718333803,"description":"In the city of Salem, Massachusetts, the observant residents and tourists are able to see that the Unusual is all around them. What creatures and magic lie hiding beneath the surface? Find out in this comedy\/drama slice of life in which we discover the horrors and mysteries between this unique cast of characters!","description_hash":2821452747756054567},{"title":"The Rise And Fall Of Nira Cole (Book One)","fiction_id":"87518","link":"https:\/\/www.royalroad.com\/fiction\/87518\/the-rise-and-fall-of-nira-cole-book-one","tags":["Post Apocalyptic","Space Opera","Non-Human Lead","Sci-fi","Drama","Action","Adventure","Female Lead","Genetically Engineered ","Technologically Engineered","Soft Sci-fi","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":26,"chapters_count":1,"last_update":1717125017,"description":"Nira Cole was destined to live a life of hard work and servitude under the tyrannical government of her people. A chance meeting changed all that, sending her into the stars to fight injustice and save lives. She became a freedom fighter with her closest friends, Alfons, Min, and Poe. Together they hope to dismantle the Drit'ud Empire brick by hellish brick. But things don't always go as planned.","description_hash":-732148724912497720},{"title":"War for God","fiction_id":"87517","link":"https:\/\/www.royalroad.com\/fiction\/87517\/war-for-god","tags":["Anti-Hero Lead","Male Lead","Tragedy","Drama","Action","Historical"],"lable":"Original","following_count":0,"rating":5.0,"page_count":23,"view_count":144,"chapters_count":3,"last_update":1717127692,"description":"It was the year 1016, and Canute, the son of King Sweyn, had invaded England. However, Canute’s forces were defeated by the Kingdom of England, though not without inflicting significant casualties on the English forces. Nevertheless, this setback would not deter Canute from his goal of conquering England. After the death of Edmund Ironside, Canute eventually succeeded in taking control of the entire kingdom. 14 years later, in the year 1030, King Canute met his demise at the hands of a man named Kane. Leading a massive army of soldiers and Vikings, Kane's sole purpose was the conquest of England.","description_hash":-699463190445923110},{"title":"Glacier Shark","fiction_id":"87516","link":"https:\/\/www.royalroad.com\/fiction\/87516\/glacier-shark","tags":["Dungeon","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":8,"rating":4.5,"page_count":51,"view_count":1078,"chapters_count":17,"last_update":1718439373,"description":"Glacier Shark, a leviathan that was forgotten because it was too weak and unable to adapt. destiny began to change, she accidentally activated a machine that changed her body shape into a humanoid. With her new body she begins her adventure to uncover the mystery that exists.","description_hash":-1825563384026537590},{"title":"Aeternitatem Genesis","fiction_id":"87515","link":"https:\/\/www.royalroad.com\/fiction\/87515\/aeternitatem-genesis","tags":["LitRPG","Strong Lead","Action","Adventure","Fantasy","Satire","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":16,"rating":3.75,"page_count":121,"view_count":2553,"chapters_count":21,"last_update":1718560805,"description":"Humanity has entered an almost entirely digital age. After the turn of the 22nd century, games and entertainment have become something ordinary people may live on.The year is 2143, and a new VR game has entered the market. Not one that stands out in every conceivable way. Not one that breaks and reinvents the wheel of modern VRMMORPGS.What makes Aeternitatem Genesis unique is its gameplay. Most modern fantasy games circle around classes.But what makes a player stand out is their choices. The decisions and outcomes of a quest. This is what's in store for Aeternitatem Genesis.The achievements they garner in their time. A class and the grade it carries hold little weight, not the end all, and be all of a player's existence.Reputation with the inhabitants of Aeternitatem Genesis is integral to the progress and standing in one's time.It allows ordinary players. Ordinary people. Not the rich with unlimited resources and time. To become someone special in Aeternitatem Genesis.The story of such a person begins on the day of it's release.","description_hash":7984504980685743368},{"title":"What's your emergency?","fiction_id":"87514","link":"https:\/\/www.royalroad.com\/fiction\/87514\/whats-your-emergency","tags":["Tragedy","Drama","Horror","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":21,"view_count":500,"chapters_count":17,"last_update":1717204147,"description":"This is a original short story about Andy Swartz and his wife Maria moving into a new house, in a new town to pursue Andys long dream of becoming a actor as well as a fresh start for the two to raise their soon to be born child.","description_hash":-5128040586561150945},{"title":"The Last Curse of Sword Coast - pt3","fiction_id":"87513","link":"https:\/\/www.royalroad.com\/fiction\/87513\/the-last-curse-of-sword-coast-pt3","tags":["Anti-Hero Lead","Action","Adventure"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":3,"view_count":32,"chapters_count":1,"last_update":1717124963,"description":"The third part to this thrilling adventure.  Perspective 3 is the final part for this backstory of two of the party members.","description_hash":-6129409403537697178},{"title":"The Respawn Ground","fiction_id":"87491","link":"https:\/\/www.royalroad.com\/fiction\/87491\/the-respawn-ground","tags":["Virtual Reality","Reincarnation","Time Travel","Strategy","Male Lead","Action","Adventure","Romance","Satire","School Life","Secret Identity","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":25,"chapters_count":1,"last_update":1717112637,"description":"Massimo, a weary game developer with a failing career, stumbles upon a mysterious game called The King. Drawn in by its dark allure, he inadvertently triggers a series of events that blur the lines between reality and the digital world. After a grueling eight-hour gaming session filled with unexpected challenges and visceral enemies, Massimo collapses, only to awaken in the body of a newborn baby within the game's universe.\nTrapped in this grim new reality, he discovers that he must navigate a perilous world filled with assassins, mythical creatures, and dark conspiracies. Guided by a sinister system that offers him a chance to reclaim his former life, Massimo must use his gaming skills to survive and unravel the mysteries of his new existence. With only five chances to succeed, failure means permanent death.\nAs he adapts to his new identity and faces relentless threats, Massimo learns that true courage and resilience are needed not just in games, but in life itself. \"The Respawn Ground\" is a gripping tale of survival, redemption, and the quest for meaning in a world where every choice could be his last.","description_hash":5487338868406451225},{"title":"Hidden Avenue","fiction_id":"87490","link":"https:\/\/www.royalroad.com\/fiction\/87490\/hidden-avenue","tags":["War and Military","Strong Lead","Tragedy","Action","Fantasy","Historical","Dystopia"],"lable":"Original","following_count":5,"rating":2.5,"page_count":97,"view_count":1575,"chapters_count":16,"last_update":1718397802,"description":"Enma Yoshida, a Japanese salaryman whose existence revolves around the mundane routine of corporate life. But when he stumbles upon a mysterious world hidden within his wardrobe, Enma's life takes a drastic and dark turn.","description_hash":8239012266004630260},{"title":"ATLA: A Tale of Fire and Steel","fiction_id":"87489","link":"https:\/\/www.royalroad.com\/fiction\/87489\/atla-a-tale-of-fire-and-steel","tags":["Anti-Hero Lead","Ruling Class","Martial Arts","Psychological","Multiple Lead Characters","Adventure","Drama","Tragedy","Male Lead","Female Lead"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":74,"view_count":304,"chapters_count":7,"last_update":1717530502,"description":"The year was 100AG, and the Hundred Year War had finally come to an end. Half the world stood in ruins, but a new era was looming on the horizon. This is a tale of a defeated and broken princess, of a farseeing yet conflicted Fire Lord, and an Avatar struggling with the death of his people and the birth of a new world. This is a tale of life and death, loyalty and betrayal, war and peace; but most importantly, it is a tale of a brother and sister.\nThis is a multiple POV fic that tries to follow canon and piece together multiple events between the end of the show and the comics of Avatar the Last Airbender.","description_hash":-8642326899961546712},{"title":"Millennium Game","fiction_id":"87488","link":"https:\/\/www.royalroad.com\/fiction\/87488\/millennium-game","tags":["Virtual Reality","Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":24,"chapters_count":1,"last_update":1717112581,"description":"Cameron is the last of his family alive.\nAt 18 years old, he has only 1 year left to live.\nThe Millennium Game is his final hope…\n\nOr it will leave him dead in an abandoned Disney World from hell.\n\nWhen a forbidden secret is released, Cameron discovers his father, a gambling addict, dead from an overdose on the day of his high school graduation. Weeks later, his mom and sister are gone too.\n\nTo save the world from climate change, governments create a global currency based on carbon. \n\nWhen you hit your limit, you die.\n\nWith all his carbon stolen from him, Cameron enters a secret military experiment. The Millennium Game awards one winner an unlimited amount of carbon. \n\nEveryone else is killed. \n\nNow, Cameron must compete against 100 people in a massive scavenger hunt across the flooded wasteland of Walt Disney World. \n\nEvery step of the way blackmailers, criminals, and worse riddle his path. But the most dangerous force of all for Cameron is love.\n\nThere is only one winner. And winning may just mean murdering the love of his life.","description_hash":4996581854407797557},{"title":"Arsenal","fiction_id":"87487","link":"https:\/\/www.royalroad.com\/fiction\/87487\/arsenal","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Comedy","Female Lead","Action","Adventure","Strong Lead","Magic","Progression"],"lable":"Original","following_count":18,"rating":4.0,"page_count":9,"view_count":709,"chapters_count":4,"last_update":1718553606,"description":"Skylar Newsome didn't ask to be summoned. She didn't ask to be cast out because she couldn't use magic in a distinctly magical world. And she definitely didn't ask to be dropped into a S-ranked forest to cover up the fact that she wasn't what the Kingdom wanted. But Skylar was nothing if not an optimist. And with a unique class, a fairly strong penchant for violence, and a style all her own, Skylar figured she could make the world of Zephryia a little bit...stabbier than it had been previously. Only for those who deserve it of course. Inspired by Azarinth Healer and by Practical Guide to Evil, Arsenal is a isekai litrpg that I've contemplated writing for a while now. I'm not close to a professional writer - any feedback would be great. I've used AI for both the cover and editing - if you don't like it, please donate to me so I can pay someone to do it. Chapters will be shorter, 500-1k words mostly. Posting once a week on Sun.","description_hash":1319344373150892182},{"title":"The Road To Ruin","fiction_id":"87486","link":"https:\/\/www.royalroad.com\/fiction\/87486\/the-road-to-ruin","tags":["Space Opera","War and Military","Male Lead","Sci-fi","Strong Lead","Action","Adventure","Romance","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":2,"rating":0.0,"page_count":36,"view_count":355,"chapters_count":4,"last_update":1718292317,"description":"In a galaxy recovering from a devastating war against the expansionist Vexari, humanity clings to its fragile empire. When the resurgent Vexari splinter forces invade a remote colony, Rhys Redfield must assemble a team of extraordinary individuals to face the growing threat of war. Traveling from planet to planet, Rhys and the crew of the Kestrel must race to uncover the enemy war plans and get to the bottom of rumors of an ancient super weapon that could hold the key to victory or defeat.\nA Space Opera that’s a horrible mishmash of things I like to read\/watch in the media that I consume. It’s this, or I go insane at work.\nNew chapters every Thursday OR when the ADHD allows.","description_hash":-4973818767760338645},{"title":"9. PALINGENESIS [TALES FROM THE CROSSROADS vol. 1]","fiction_id":"87485","link":"https:\/\/www.royalroad.com\/fiction\/87485\/9-palingenesis-tales-from-the-crossroads-vol-1","tags":["Time Loop","Post Apocalyptic","Male Lead","Sci-fi","Tragedy","Horror","Short Story","Supernatural","Low Fantasy","Mythos","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":43,"chapters_count":1,"last_update":1717111107,"description":"Tales from the Crossroads is a series of 17 micro-fiction horror stories set in the Primordial Crossroads Universe.\nPALINGENESIS delves into a far future tribe and their attempts to escape the cycle of reincarnation.","description_hash":6510808066244682715},{"title":"Accursed Revenant","fiction_id":"87484","link":"https:\/\/www.royalroad.com\/fiction\/87484\/accursed-revenant","tags":["LitRPG","Dungeon","Anti-Hero Lead","Grimdark","Female Lead","Action","Fantasy","Horror","Tragedy","Supernatural","Strong Lead","GameLit"],"lable":"Original","following_count":6,"rating":0.0,"page_count":27,"view_count":222,"chapters_count":4,"last_update":1717858817,"description":"Something is wrong.\nBroken. Missing, or possibly stolen. I can feel it in my bones–it is the one thing I woke up truly knowing. I didn't even remember my own name, but I knew something had been taken from me.\nAnd I knew that I would do anything to get it back.\nMy name is Astraea Kaion, and this is the story of my death.\n\n\nWhat to expect:\n- undead female MC that is incapable of interacting with the System as normal\n- dark tones and violent circumstances\n- and a type of magic that has never been seen in this world before\n\nCurrent release schedule is 1 Chapter every three days.\nI created a Patreon! Check it out!","description_hash":-8212415590458264262},{"title":"Introspection Of Unwritten letters: A Cure To A Lamb's Madness Is Observation","fiction_id":"87483","link":"https:\/\/www.royalroad.com\/fiction\/87483\/introspection-of-unwritten-letters-a-cure-to-a","tags":["Multiple Lead Characters","Adventure","Fantasy","Male Lead","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":243,"view_count":1387,"chapters_count":50,"last_update":1718556592,"description":"A character who is born into a world without a purpose to fulfill, and so through the influence of others and the shades of other people, Thales gains a purpose that he strives to seek, whether it’s for spirituality, for strength, Thales seeks out this purpose that is engraved through a concept in the story called The Mystery. In a world where gods roam freely, organizations hold power with mighty beings, where diverse races all have different origins...a universe so vast that purpose has yet to be found. This is a journey of seeking, through adventures in all sorts of unique environments never seen before- Hidden societies that seek justice and righteousness- A Shadow Land plagued by lost souls and magical beasts! Each character has philosophical dilemmas or moral ones, and they all search on an answer to their confusion and curiosity.\n \n \n\"I-am alone.\nThat was obvious though. I’d not a clue what nightmare I have awakened from, maybe it was that I’d rather forget? Did the world hug me too coldly or did I run from the world?\" Will Thales attain the knowledge he so desperately seeks for unknown reasons. This is the journey of knowing, I hope you join us.","description_hash":-3049995632963023658},{"title":"A Greater Power","fiction_id":"87482","link":"https:\/\/www.royalroad.com\/fiction\/87482\/a-greater-power","tags":["Progression","Anti-Hero Lead","War and Military","Female Lead","Fantasy","Romance","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":4,"view_count":26,"chapters_count":1,"last_update":1717099815,"description":"Endora, a witch, vows to avenge her sister's death in a never-ending war. During an undercover mission, she meets Admus and uncovers a shocking truth that forces her to make a life-altering decision. Endora's next moves will shape her destiny in ways she never imagined.","description_hash":-4320809844777135090},{"title":"Shadow of the First Sin","fiction_id":"87481","link":"https:\/\/www.royalroad.com\/fiction\/87481\/shadow-of-the-first-sin","tags":["Anti-Hero Lead","Non-Human Lead","Strong Lead","Action","Adventure","Fantasy","Supernatural","Male Lead","Magic","High Fantasy","Mythos","Attractive Lead"],"lable":"Original","following_count":8,"rating":5.0,"page_count":36,"view_count":378,"chapters_count":9,"last_update":1718476239,"description":"Valerian, an outcast in his own home of Elyria, a celestial realm where immortal avians live, is anything but ordinary. Born from the forbidden union of a mortal man and an avian woman, Valerian is a half-breed, bearing the wings of an avian and the soul of a human. For this, he has been shunned his entire life.\nIn Elyria, avians live eternally, their wings symbolize their divine nature. Valerian's mother, upon his birth, was banished to the mortal plane of Eldoria—a land teeming with diverse races and cultures. This punishment was not just for their union but because of a prophecy foretelling that a child born from such a forbidden bond would bring the end of times. Stripped of her celestial essence, Valerian’s mother was forced to live among mortals.\nValerian grew up in isolation, his childhood marked by loneliness and fear. Seen as an omen, he was kept locked away, his every action scrutinized. Viewing Elyria as a prison, Valerian rebelled, hoping to be cast out and find freedom. Yet, no matter his actions, the avians refused to banish him, ignoring his desperate attempts to escape.\nDetermined to break free, Valerian takes a drastic gamble that finally grants him his desired freedom, but at a steep price.\nNow that Valerian has become mortal, he faces a whole new set of challenges. Struggling with an identity crisis, he must discover who he truly is: a human, an avian, or something entirely different. The story delves into the rich and varied world of Eldoria, introducing a host of mortal residents such as elves, the fey, beastfolk, wizards and witches, dragons, and many more.\nChapters update every two days!","description_hash":-8295847476941244564},{"title":"My Name is Lyra","fiction_id":"87480","link":"https:\/\/www.royalroad.com\/fiction\/87480\/my-name-is-lyra","tags":["War and Military","Multiple Lead Characters","Sci-fi","Tragedy","Action","Romance","Female Lead","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":104,"chapters_count":2,"last_update":1717250295,"description":"Lyra - brown pixie cut, hazel eyes, 5’6”\nPaxton - brown fluffy hair, dark blue eyes, 6’2”\nOlive - long sandy blonde hair, olive green eyes 5’8”\nCallum - dark blonde hair, green with bits of brown eyes, 6’\n\nThe magic - Magic stones (seeds) that sprout into magic flowers that grant abilities to anyone in range when it blooms. White\/Iridescent Gold Petals. \n\nUnderstanding of past and current events - The magic flowers were the impetus for a civil war when dissatisfied citizens rebelled against the existing system, bringing down society so they could reign over the ruins of civilization. The former governments warned people to stay away from the magic, as it was considered quite dangerous, so “criminals” were the first superhumans to appear, which left the old governments at a serious disadvantage.\nThose who took down society took control, propping up their own military (which is significantly weaker). After ten years of this newly formed militia, some cities have been rebuilt, numbers expanded. The continent has been split into 5 territories controlled by 5 different military head monarchs known to be the most powerful and deadly of them all. But little do we know there are a few good places left.","description_hash":8789623236114978552},{"title":"I'm an Inmortal Shiba Inu in Other World","fiction_id":"87479","link":"https:\/\/www.royalroad.com\/fiction\/87479\/im-an-inmortal-shiba-inu-in-other-world","tags":["Portal Fantasy \/ Isekai","Strategy","Comedy","Slice of Life","Action","Adventure","Fantasy","Reincarnation","High Fantasy"],"lable":"Original","following_count":7,"rating":0.0,"page_count":26,"view_count":1334,"chapters_count":12,"last_update":1718194213,"description":"The life of Tenma, a boy in the throes of adolescence, comes to an end after a midnight murder. However, he is reincarnated as a Shiba Inu dog who is soon adopted by the leader of a guild. Thus presenting him with a new chance at life in a fantasy world.","description_hash":2880823024115541031},{"title":"Children of the dragon. Book one. Squires.","fiction_id":"87478","link":"https:\/\/www.royalroad.com\/fiction\/87478\/children-of-the-dragon-book-one-squires","tags":["LitRPG","Urban Fantasy","Villainous Lead","Multiple Lead Characters","Adventure","Fantasy","Romance","Mystery","Reader Interactive","Male Lead","Magic","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":16,"view_count":40,"chapters_count":1,"last_update":1717081264,"description":"\"Criminal always returns to the scene of the crime. That's why Arian yearns to revisit the land where friendships and enmities intertwine. Leading six childhood friends by his side, Arian seeks to strengthen bonds and find his missing younger brother. While opening the portal to a magic-infused realm, they step into a world where every fantasy can become reality. Their mission: locate the portal key, rescue Arian's brother, and execute a mysterious plan \"A\" devised by the elder Nix and Arian himself.\nEach friend discovers latent magical abilities and opportunities for enrichment, but they must also navigate dangers posed by bandits and predatory creatures. Arian is suspected of the murder of an old prince, compelling him to participate in a tournament to prove his innocence and unravel the mysteries of this world.","description_hash":-5819438936957682449},{"title":"Lost Genesis: The Book of Providence","fiction_id":"87477","link":"https:\/\/www.royalroad.com\/fiction\/87477\/lost-genesis-the-book-of-providence","tags":["Progression","Non-Human Lead","Sci-fi","Strong Lead","Action","Adventure","Fantasy","Male Lead","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":81,"chapters_count":1,"last_update":1717074190,"description":"Set, a young mage who would come to be feared as \"The Mad King\" , is on a journey to find the peak of power. After learning his masters signature magic at a young age, he ventured out to various worlds as a part of his people's 'coming-of-age' tradition. Honing his magic and gaining more knowledge as he traveled from place to place, he would encounter the truth about the worlds and of the threats that loom just out of reach. With renewed resolve, he aims to create a power beyond heights he could ever hope to reach to have even the slightest chance at protecting what he values.","description_hash":-6232973669944604186},{"title":"Path Of Arcane Ascendancy [Progression Fantasy, Isekai]","fiction_id":"87476","link":"https:\/\/www.royalroad.com\/fiction\/87476\/path-of-arcane-ascendancy-progression-fantasy","tags":["Portal Fantasy \/ Isekai","Dungeon","War and Military","Martial Arts","Grimdark","Action","Adventure","Fantasy","Sci-fi","Reincarnation","School Life","Supernatural","Male Lead","Strong Lead","Magic","Strategy","High Fantasy","Genetically Engineered ","Technologically Engineered","Hard Sci-fi","Soft Sci-fi","Progression","Artificial Intelligence"],"lable":"Original","following_count":336,"rating":4.44,"page_count":199,"view_count":16010,"chapters_count":20,"last_update":1718287501,"description":"The relentless pursuit of perfection always comes at a price, and for Arthur, that price was death. As the first man to implant the revolutionary Neurochip into his brain, he lay lifeless on the hospital gurney, a victim of his own unbridled ambition.\nBut upon opening his eyes, he is in a completely new world, no longer the technological environment he was accustomed to, but rather a pre-industrial, medieval and primitive setting. With the Neurochip AI as his only link to his past reality, Arthur is reborn in this world and delves into the depths of the unknown, unraveling the secrets of this new essence that governs his existence - MAGIC.\nGenres: Dark Fantasy, Progression Fantasy, Isekai, Medieval Fantasy\nWhat to Expect:\n-A unique magic system\n-Rewarding progression with extensive world-building\n-Struggle for survival in a grim and brutal world\n-Applying a scientific approach","description_hash":3032471312765276567},{"title":"Humanity, After the Dark Lord","fiction_id":"87475","link":"https:\/\/www.royalroad.com\/fiction\/87475\/humanity-after-the-dark-lord","tags":["War and Military","Multiple Lead Characters","Fantasy","Non-Human Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"The Dark Lord appeared towards the end of the 4th Era deep inside human lands. The other races of our world decided to close borders and isolate. The Humans won after 300 years of war. Humans adapted, improved, meanwhile those at peace in their isolation did not, but no victory over a great evil is truly complete when they still have. The Dark Lord's forces have now infiltrated these other lands and they know how to deal with the common adventurer.","description_hash":-1817663531393399400},{"title":"The Spirit Beyond","fiction_id":"87474","link":"https:\/\/www.royalroad.com\/fiction\/87474\/the-spirit-beyond","tags":["Reincarnation","Time Loop","Urban Fantasy","Female Lead","Strong Lead","Fantasy","Romance","Mystery","Tragedy","Supernatural","Magic","Low Fantasy","Mythos","Time Travel"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":41,"chapters_count":1,"last_update":1717071621,"description":"Lexi’s lonely journey has just begun, and Leo cannot stop the dreams that plague him. Even in death, forces seek to keep them apart, threatening to extinguish the flame of their love once again.\nAs Lexi face’s the horror of each death, she must confront the past once concealed by shadows. As Lexi faces the adversary alone, will she find the strength to break free from the shackles that bind them?\nIs no hope for this lifetime? Will they meet in another life?\nJoin us in a world where magic and love combine. The finale has come.","description_hash":-6841582668429067500},{"title":"Are Second Chances Deserved?","fiction_id":"87473","link":"https:\/\/www.royalroad.com\/fiction\/87473\/are-second-chances-deserved","tags":["Portal Fantasy \/ Isekai","Progression","Female Lead","Strong Lead","Tragedy","Action","Adventure","Fantasy","Reincarnation","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":37,"chapters_count":1,"last_update":1717071038,"description":"A young woman gets a second chance at life.","description_hash":-1098034147119112318},{"title":"Undersea Reincarnation - [Octopus Monster Evolution LitRPG]","fiction_id":"87472","link":"https:\/\/www.royalroad.com\/fiction\/87472\/undersea-reincarnation-octopus-monster-evolution","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Comedy","Male Lead","Action","Adventure","Fantasy","Reincarnation","High Fantasy"],"lable":"Original","following_count":1728,"rating":4.75,"page_count":150,"view_count":81811,"chapters_count":23,"last_update":1718620472,"description":"Subnautica meets monster reincarnation classics.\nHenry was a freshly graduated marine biologist about to make the discovery of a lifetime when he was struck by lightning. Thankfully, that wasn't the end for him. He woke up alive and healthy. And he had... tentacles.\n...\nWhat? \nFollow Henry, a small Trickster Octopus trying to survive in a vast and unfamiliar ocean. He must navigate dangerous and mysterious waters, contend with magic-enhanced marine life, and find civilization—all while armed only with his wits, the ability to temporarily copy skills, and the tools of a bored and forgotten System.\n\n~ Start reading - Chapter 1 ~\n\nWhat to expect:\nLight-hearted and sometimes terrifying Weak to Strong adventure with some underwater fighting, especially in the beginning. 1.5~2k words per chapter.\nCurrent schedule: One chapter every two days for a few weeks.\nRegular schedule: Wed-Thur-Fri chapters.\nPublishing on RoyalRoad and Scribblehub only.\nEditing by @madsadie","description_hash":324197565936190820},{"title":"Monster Hunter for a Shady Organization","fiction_id":"87471","link":"https:\/\/www.royalroad.com\/fiction\/87471\/monster-hunter-for-a-shady-organization","tags":["Urban Fantasy","War and Military","Grimdark","Sci-fi","Contemporary","Action","Horror","Supernatural","Secret Identity","Soft Sci-fi"],"lable":"Original","following_count":2,"rating":0.0,"page_count":131,"view_count":844,"chapters_count":13,"last_update":1718481678,"description":"Dylan, or rather Exterminator 7D11087, is down on his luck. He’s got a drinking problem, is chronically depressed, but worst of all, he’s working for a shadowy organization and tasked with taking down interdimensional monsters. When the frequency of incidents in his city begins to rise drastically, he knows things are about to get worse, a lot worse.\nMonster Hunter for a Shady Organization is an action-packed horror series, full of gripping action, snarky dialogue and Lovecraftian horrors.","description_hash":8659010705046071299},{"title":"Rise of the Blood Sorcerer","fiction_id":"87470","link":"https:\/\/www.royalroad.com\/fiction\/87470\/rise-of-the-blood-sorcerer","tags":["LitRPG","Villainous Lead","Strong Lead","Fantasy"],"lable":"Original","following_count":10,"rating":5.0,"page_count":55,"view_count":874,"chapters_count":7,"last_update":1717377140,"description":"Knowing the end of the world is to come Arthur, a billionaire, performs a bloody ritual as to become a god. Instead he is brought to a new magical world as an unborn infant, doing what he must to become powerful he finds a way to develop his magic even before he is born. And once he is he is nothing but a menace to others on his path to becoming a god.","description_hash":-529360802176811789},{"title":"Two Bad Cops","fiction_id":"87469","link":"https:\/\/www.royalroad.com\/fiction\/87469\/two-bad-cops","tags":["Comedy","Non-Human Lead","Contemporary","Drama","Short Story","Male Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":12,"view_count":45,"chapters_count":1,"last_update":1717054819,"description":"Noah and Caleb are tasked with interrogating a criminal oblivious to their tactics, and his own crime.","description_hash":-4119590263631330414},{"title":"Endless","fiction_id":"87468","link":"https:\/\/www.royalroad.com\/fiction\/87468\/endless","tags":["Reincarnation","Progression","Female Lead","Strong Lead","Adventure","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":44,"chapters_count":1,"last_update":1717054085,"description":"Alira has been around for a long long year.\nStuck with a quest, that denies her true death until completed, she tries to make the best of it.\nLet's get on with it, then.\nFor the spire!\nFor eternal rest!\nFor a little fun along the way!\n----\nA little profanity goes a long way. So does a little bit of graphical violence and other sensitive content.\nIf you are not okay with this, that's fine. I wish you a pleasant time with other stories then. May they float your boat, all good like.","description_hash":-8308930095168947264},{"title":"Enter the System: Live Free Or Die","fiction_id":"87467","link":"https:\/\/www.royalroad.com\/fiction\/87467\/enter-the-system-live-free-or-die","tags":["LitRPG","Post Apocalyptic","Male Lead","Sci-fi","Action","Adventure","Fantasy","GameLit","Soft Sci-fi"],"lable":"Fan Fiction","following_count":4,"rating":5.0,"page_count":237,"view_count":1503,"chapters_count":17,"last_update":1718561028,"description":"This fan fiction novel is set in the universe of the Natural Laws Apocalypse by Tom Larcombe\nIt follows the adventures of a 68 year old retired professor living in New Hampshire, as he (along with everyone else on Earth) attempts to cope with the arrival of the System. Karl Hausman struggles to find people and gather resources with the goal of forming a Safe Zone, a base from which to explore the strange new world Earth has become.","description_hash":1511648999814001380},{"title":"The Doors of the Shadow","fiction_id":"87466","link":"https:\/\/www.royalroad.com\/fiction\/87466\/the-doors-of-the-shadow","tags":["Portal Fantasy \/ Isekai","Action","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":23,"view_count":350,"chapters_count":7,"last_update":1717844404,"description":"In a world where mysterious portals appear and disappear without warning, leading to strange and dangerous dimensions populated by fantastic creatures and ancient secrets, a new generation of portal hunters was born. Ethan Delacroix, an ordinary but curious young man, finds himself embarked on an epic adventure after discovering a portal that calls him. This unexpected journey pushes him to discover hidden powers in him and face challenges he would never have imagined.\n\nNew chapters every Saturday.\n\nWhat to expect\n- Long chapters. 600 - 1200 words on average ( the imagination is complicated sometimes :)) \n- Somewhat slow paced and long story.\n- A cultivation inspired system\n- A mix of magic and combat. \n- A determined main character who's willing to do what it takes\nWhat not to expect\n- Any kind of harem\n- Some writing error, because although I face several revisions I still an amateur!\n\nI am open for any constructive criticism!","description_hash":-2393767527302487845},{"title":"Kitty Sparklestone and the Glittering Seas of Serendipity","fiction_id":"87465","link":"https:\/\/www.royalroad.com\/fiction\/87465\/kitty-sparklestone-and-the-glittering-seas-of","tags":["Comedy","Female Lead","Sci-fi","Romance","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":39,"view_count":55,"chapters_count":3,"last_update":1718633271,"description":"It's been six months since Scratch accidentally stole one of the most famous paintings in the galaxy. It's been four months and eighteen days since she offloaded it for far less than it was worth.\n\nFor now, she's laying low. That means taking a job as a private chef to a billionaire, the closest thing to an honest job she's ever had. Glamorous parties, illicit affairs, and hor d'oeuvres at all hours, soon she realises that the great Galastar Heist is not as forgotten as she had hoped.\n\nWill she manage to find a way to wipe her record clean, and, more importantly, what the hell is she going to do with all of these pineapples?","description_hash":-1157842440639264739},{"title":"The Dark Genaration","fiction_id":"87464","link":"https:\/\/www.royalroad.com\/fiction\/87464\/the-dark-genaration","tags":["Martial Arts","Psychological","Action","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":133,"chapters_count":5,"last_update":1717341226,"description":"What would you do if your life was shattered by a ruthless crime syndicate? Park Taejoon is a young MMA fighter with a promising future. But everything changes when he witnesses the murder of his father and the coma of his mother by the Rising Suns, the most feared gang in Ansan. Swearing vengeance, he embarks on a dangerous journey to take down the syndicate and unify the country under his rule. Along the way, he will face fierce enemies, unexpected allies, and shocking revelations. Will he achieve his dream of peace, or will he fall prey to the darkness of the gangs? Find out in this thrilling action myesteri webnovel","description_hash":-2018832742280048384},{"title":"The Space Between","fiction_id":"87463","link":"https:\/\/www.royalroad.com\/fiction\/87463\/the-space-between","tags":["Reincarnation","Multiple Lead Characters","Sci-fi","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":36,"view_count":181,"chapters_count":4,"last_update":1717347603,"description":"When Katiannah, a seasoned astral traveler, finds herself trapped in an alternate reality, she seeks answers at a secluded temple, guided by the enigmatic shaman, Sylas, and his sister, Naloria, a starseed alchemist. Through their intertwined journeys, the novel delves into the depths of astral projection, shamanic practices, and the profound interconnectedness of all things. As Katia unravels the secrets of her true purpose and confronts the looming threat to the multiverse, the boundaries between realities blur, and the power of love and sacrifice is tested. Told from the perspective of four unique characters, this captivating fantasy novel invites readers to explore the depths of their own consciousness and embrace the boundless possibilities that lie within the space between. Written by Rachel Stevens Shamanic Practitioner","description_hash":6163431734733094679},{"title":"Runic Water","fiction_id":"87462","link":"https:\/\/www.royalroad.com\/fiction\/87462\/runic-water","tags":["Grimdark","Multiple Lead Characters","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":44,"view_count":110,"chapters_count":2,"last_update":1718391882,"description":"Raised as a maid, Alyce takes great pride in the peaceful barony she calls home. Neburh is renowned for fertile land, great orchards, and the clearest of waters. But when a ghastly misfortune happens upon a neighboring town, two mages are sent from the Blue Sanctus, a council of noble magicians, to survey the humble county. As Alyce knows the lay of the land like the back of her hand, she is asked to accompany the esteemed Hollis and her much guarded apprentice, Kytes, and show the best of hospitality to them both. But the longer they stay, the more Alyce learns about the deteriorating world outside her haven home and how she might have been the reason for ensuring safety for its people.","description_hash":807840805893067177},{"title":"I'm Energy In DC","fiction_id":"87461","link":"https:\/\/www.royalroad.com\/fiction\/87461\/im-energy-in-dc","tags":["Super Heroes","Male Lead","Strong Lead","Action","Adventure","Fantasy","Romance","Magic"],"lable":"Fan Fiction","following_count":33,"rating":3.6,"page_count":791,"view_count":19335,"chapters_count":82,"last_update":1718466126,"description":"You have read Fanfics on how one lucky or unlucky guy would get picked by some random omnipotent being to relive his life in another world.\nWell what if you were that R.O.B only less omnipotent [For now] and more immortal.\nWhat happens when a man is reborn as Energy in the world of DC\nCapable of using said energy to do anything imaginable.","description_hash":-6885077321376787026},{"title":"Total Blackout","fiction_id":"87460","link":"https:\/\/www.royalroad.com\/fiction\/87460\/total-blackout","tags":["Progression","Post Apocalyptic","Multiple Lead Characters","Contemporary","Slice of Life","Adventure","Drama","Tragedy","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":249,"view_count":1423,"chapters_count":37,"last_update":1718457452,"description":"In a world where civilization has plunged into chaos, every day is a battle for survival. Through the destinies of several characters, immerse yourself in a captivating narrative that explores the depths of the human soul in the face of adversity. In a devastated Paris where the law of the jungle reigns supreme, every choice can mean the difference between life and death. Amidst violence, betrayal, and hope, dive into this epic tale where the bonds of humanity are tested, and each page reveals a new facet of this post-apocalyptic world. Prepare to be transported to a universe where the only rule that remains is that of survival.","description_hash":-6801724032412919300},{"title":"The Great War - A VRMMORPG Adventure","fiction_id":"87459","link":"https:\/\/www.royalroad.com\/fiction\/87459\/the-great-war-a-vrmmorpg-adventure","tags":["Virtual Reality","Reincarnation","Progression","War and Military","Grimdark","Adventure","Drama","Fantasy","Mystery","LitRPG","Gender Bender","Harem","Slice of Life","Supernatural","Male Lead","Strong Lead","Multiple Lead Characters","Magic","GameLit","High Fantasy","Mythos","Soft Sci-fi"],"lable":"Original","following_count":7,"rating":5.0,"page_count":10,"view_count":204,"chapters_count":1,"last_update":1717047412,"description":"Sixteen-year-old Jon Maverick's life is cut short in a tragic accident. His journey doesn't end there; he finds himself in the afterlife, facing an enigmatic and powerful Unknown Goddess. She offers Jon a second chance at life, with a single condition: he must aid her in a brewing cosmic conflict. Jon learns about the Great War—a colossal struggle involving gods, goddesses, and supernatural beings divided into factions. This war threatens the very fabric of existence.\nIn this war-torn universe, the Primordials, ancient beings who created the cosmos, step in to mediate. They devise a novel solution: a virtual reality MMORPG (VRMMORPG) that serves as a battleground for divine conflicts and a recruiting ground for exceptional human warriors. This game, released on Earth, blurs the lines between reality and virtuality.\nResurrected and returned to the mortal world, Jon is tasked with mastering this game. Guided by the Unknown Goddess, he must navigate the intricacies of divine politics, form alliances, and prepare for battles that transcend the virtual and impact the real world. As Jon immerses himself in this new existence, he grapples with an identity crisis, balancing his old life with his new purpose.\nThe novel delves into the themes of resurrection, identity, and the nature of war. Jon's journey is intertwined with romantic entanglements and the evolving dynamics of a harem, each relationship adding layers to his character and mission. His mother, Isabella Maverick, also plays a crucial role, anchoring him to his past while he forges a future amidst gods and mortals.\nSubplots enrich the narrative, exploring the arcs of secondary characters, each with their own quests and connections to Jon. The virtual war reveals deeper psychological battles, testing loyalties and beliefs. \nAs the Great War reaches its climax, Jon's actions lead to a resolution that transforms the world. He achieves a feat deemed impossible, altering the course of history and redefining the boundaries between the mortal and the divine.\n\"The Great War\" is a high-stakes epic blending fantasy and reality, where the fate of universes hinges on the bravery and choices of a young resurrected warrior.\n---\nThe Great War\n**Genre**: Original, Fantasy, Virtual Reality, LitRPG, War, Harem, High Fantasy, Drama, Psychological, Mythos, Adventure, Cultivation Progression\n**Main Characters**: Jon Maverick, The Unknown Goddess, Isabella Maverick (Jon's mother), (Maybe more in the future with their own POV'S)\n**Setting**: Present day, spanning both the real world and a vast, immersive virtual reality environment.\n---","description_hash":-8905333038957399232},{"title":"Industrial Mage: Modernizing a Magical World [Kingdom Building LitRPG]","fiction_id":"87458","link":"https:\/\/www.royalroad.com\/fiction\/87458\/industrial-mage-modernizing-a-magical-world-kingdom","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Ruling Class","Male Lead","Action","Adventure","Fantasy","Reincarnation","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":4535,"rating":4.38,"page_count":142,"view_count":186099,"chapters_count":16,"last_update":1718295673,"description":"An engineer from Earth blends science and magic to achieve greatness in another world where skills and levels reign supreme.\nEthan was just a plain old engineer, but everything changed when he was reborn into a world of skills, levels, and magic. With his advanced knowledge far ahead of the time period he finds himself in, this new reincarnated life will be much different than his last, especially because he can construct, deconstruct, and reconstruct runes—something no one else can do.\nBut with royal politics, looming tax collectors, a mountain of debt, dungeon incursions, cults, and hostile fantasy races mixing together into a cocktail of bullshit that threatens to bury his dreams; Ethan must bridge the gap between steel and sorcery to grow stronger.\n\nThis novel is fast-paced in areas to maximize entertainment value. Please suspend disbelief, as this is what the novel's meant to be.\nWhat to Expect:\n- Weak to very strong progression with a Sword & Magic MC that kicks a whole lotta ass.- Fast pacing. A balance of action galore, politics, kingdom building, and slow-burn runecrafting.- Fun, satisfying moments. An extra shot of happiness when reading. Hardcore wish fulfillment. Hyper competent MC.- MC will trigger an industrial revolution, abolish slavery, revolutionize magic, modernize agriculture, communication, commerce, textile production, education, transportation, sanitation, weapons manufacturing, leisure & entertainment, and medicine.- Dark truths of a medieval-esque society going under change.\n\nOne chapter every 2 days—so that I can maintain quality as well as my sanity and avoid burnout.\nRead up to 10 advance chapters on Patreon!\nPatreon - https:\/\/www.patreon.com\/ItsNectar\nDiscord Server - https:\/\/discord.gg\/d57v5upvcx","description_hash":8705488479919981400},{"title":"TRASH - Act 1: The Spinner","fiction_id":"87457","link":"https:\/\/www.royalroad.com\/fiction\/87457\/trash-act-1-the-spinner","tags":["Anti-Hero Lead","Comedy","Multiple Lead Characters","Adventure","Fantasy","Romance","Male Lead","Female Lead","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":3,"rating":5.0,"page_count":70,"view_count":519,"chapters_count":8,"last_update":1718567156,"description":"Act 1 - After accidentally stabbing a hero too hard, Sariel finds herself in the company of an unorthodox mercenary, and is eager to get back to her wiccaphobic village. But when there's a strange thread of fate running the show, and an arsenal of heroes out for her head, she'll have to scrounge up a ton of plot armour to best the production - and stay on the crossbow wielding anti-romanticist's 'good side'.\nUpdates every Friday!","description_hash":-8774546572613526891},{"title":"Aelerotech Avarice","fiction_id":"87456","link":"https:\/\/www.royalroad.com\/fiction\/87456\/aelerotech-avarice","tags":["LitRPG","Portal Fantasy \/ Isekai","Time Travel","Progression","Male Lead","Action","Fantasy","Horror","Sci-fi","Supernatural","GameLit","Dystopia"],"lable":"Original","following_count":2,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"In the grim darkness of humanity's future, there is only the corporate bottom line. Our main character; an unfortunate but fairly well-off technician by the name of Otto Weber, has made a deal with a corporate devil to save his family; and is going to be making a one-way trip to a beautiful, amazing new world, as Test Subject #3.\n\nWhat follows will be a series of harrowing adventures involving time travel, transformation, 'leveling up', 'Elves', 'Dragons', and an evil corporate CEO with delusions of grandeur and no morality whatsoever.","description_hash":8131684276128082791},{"title":"In January","fiction_id":"87455","link":"https:\/\/www.royalroad.com\/fiction\/87455\/in-january","tags":["Progression","Comedy","Multiple Lead Characters","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":28,"view_count":136,"chapters_count":5,"last_update":1717764235,"description":"“That's what I thought until I found myself hung upside down a ditch watching my grave be dug.” This tale is about a group of young youths that progressively age together and find themselves in brand new situations constantly until one goes mad and has to be put down. The story begins with my main character and his best friend being hung upside down about to be buried alive.","description_hash":-1078540405327537843},{"title":"The Starlit Soul: An Elven Progression Fantasy","fiction_id":"87454","link":"https:\/\/www.royalroad.com\/fiction\/87454\/the-starlit-soul-an-elven-progression-fantasy","tags":["Progression","War and Military","Martial Arts","Non-Human Lead","Slice of Life","Action","Adventure","Drama","Fantasy","Male Lead","Strong Lead","Magic","Strategy","High Fantasy","Mythos","Ruling Class","First Contact"],"lable":"Original","following_count":33,"rating":5.0,"page_count":98,"view_count":1282,"chapters_count":7,"last_update":1718401775,"description":"What to expect: Action, adventure, a bit of slice of life, a bit of romance, a bit of Epic Fantasy, progression from fighting with sticks and stones on, kingdom building, war tactics. Basic Plot: Lysander is an elf, and fights to support, protect, and understand the world and other races as he and they grow from tribal societies into sprawling empires. \n\nIt is said that evil was brought into the world. That it was born from the hearts of the mortal races, that the world before their arrival, when the elves roamed freely after the dragons and giants shaped the mountains and seas, was a land of peace and paradise. \nLysander knows better. He knows better, because he was there. Born into the world while the fires of creation were still cooling, he was there when the first of the mortal races poked their heads out of the holes they were hiding in, to expand and grow and discover. He was there when true evil first saw its chance to take control of the budding world, and was among the first to take up arms in defiance. He is one of the immortal elves, and he knows the truth. \nThe world before just had less people in it, and improvement comes with time. And evil? Evil came from the same place as great goodness - it came from the greatest, and worst, gift the gods gave their children. Freewill. Something evil wishes to remove from the world. \nHis name is Lysander, first of his name, among the first of his kind, and he had a warrior's soul before his kind had a word for war. This is his story. \n\nGuaranteed chapters on Tuesday and Friday. While the story is still getting started, there will likely be some erratic chapters published throughout the week as well.","description_hash":5176474434621086548},{"title":"Born To Chase (A Storm Chasing LITRPG)","fiction_id":"87453","link":"https:\/\/www.royalroad.com\/fiction\/87453\/born-to-chase-a-storm-chasing-litrpg","tags":["LitRPG","Progression","Female Lead","Slice of Life","Drama","Action","Adventure","Fantasy","Supernatural","Male Lead","Magic","Soft Sci-fi"],"lable":"Original","following_count":4,"rating":5.0,"page_count":59,"view_count":198,"chapters_count":4,"last_update":1717416358,"description":"Engin is an orphan boy, raised on an estate by a once prolific artist, and Moxella is an aspiring young forecaster, daughter to a powerful noble family. Never would they have imagined that one fateful day could change the course of their entire lives, binding them onto paths destined to chase storms.\nIt's as they say among the chasing guilds, \"...some folks tuck their tails and hide from the tempest, BUT WE ... are born to chase it!\"\nNotes:\nSlice of Life; Fantasy; Science Fiction\nLITRPG: No stats or LITRPG elements in the early chapters. There is a system engrained into the world, you will see it as the story progresses. Storm Chasing and forecasting are part of the system, but they are not the only domain that exists. \nWhy did I write this?: I've always been fascinated by severe weather, and tornadoes. I think tornadoes have the closest resemblance to eldritch monsters in our real world. The culture and science that surrounds meteorology and storm chasing in general is so rich, and absolutely fits the fantasy genre. I wanted to take those raw moments of adventure and awe that one gets from storm chasing and infuse the fantasy oomph into it. Originally, I was going to write this purely as a fantasy novel, but after experimenting a ton with the world building and magic system, I realized that I would have the most fun if I attempted at creating a LITRPG system, but also have it feel more grounded into the lore of the world rather than it feel too much like a video game. This is the end result, and I can't wait to flesh it out even more as I go. \n\n'There is no greed like Monarch greed'\nFour Hundred Years Ago, the Monarch Kings conquered the lands beyond the gates, paying no heed to the warnings of their ancestors. Their greed and their plunder awakened long dormant malevolent forces, bringing their short reigns to a very abrupt end. One by one, each of the monarch kingdoms began to fall, until the few that remained retreated back to the sovereign lands, vowing never to cross back over the gates again. \nBut the damage had already been done. An irreversible course of events had been set into motion, leading to the demise of the last Primalord, Moraftus the Muted.\nThe lord's demise had broken a seal, one that unleashed powerful tempests that tore through the Primalands, opening gateways for elder beings to seep through. \nFrom the darkness of this era, a new breed of adventurers took to the roads. Each with their own ambitions; whether it was seeking thrill, or seeking glory, they rode up and down the lands, chasing tempests; forecasting them, documenting them and observing them to further their own understanding.\nThey were given the moniker of 'storm chasers', and thus, a new age of conquest had begun.","description_hash":7002601753792481101},{"title":"A Soul Bound, A Bargain Struck","fiction_id":"87452","link":"https:\/\/www.royalroad.com\/fiction\/87452\/a-soul-bound-a-bargain-struck","tags":["Progression","Anti-Hero Lead","Female Lead","Adventure","Fantasy","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":23,"view_count":162,"chapters_count":2,"last_update":1717051555,"description":"Whoever said hell was hot is a gods-damned liar.\nSure there were probably other regions of hell, lower circles that burned just as hot as the stories said, but the domain that she awoke in was not one. Instead she was stark naked in a freezing tundra that lacked even ice and snow, simply freezing stone as far as the eye could see. Well freezing stone and a single looming castle that looked formed from darkness itself. Its sheer stone walls rose like mountains on the horizon and seemed to drink in the ambient light that surrounded her as if sinking into a bottomless void. The few scattered shrubs that dotted the flat expanse that surrounded the castle, all made sure to keep their distance from the horrifying structure.\nA thought occurred to her as she took measure of her surroundings. If she was already dead, and in hell, could she freeze to death? It certainly felt like she could as her form began to shake and shiver. The cold seemed to invade her senses as she took in her bearings clawing down to her very bones. Her teeth were already chattering in the icy wind after just a minute to gather herself. Still many questions flew through her mind, but the single most shocking one was what plagued her mind with every step she took towards the looming structure, who was she?\nShe knew this was hell. She knew she was dead. But she didn't know her name? A name came to her mind but it felt wrong. \"Lilian Theridore\". No! That wasn't her name. But it was so familiar to her... Some instinctual part of her brain seemed to almost argue with her, that was not her name. Not anymore. Right. Names held power, especially with demons.\nFor a demon a name was a leash, to call upon a demon by name was to tug at their leash, something they rarely took kindly to. Giving out her name would be akin to handing another being her leash. Yet... if her name wasn't Lilian what was her name now, shouldn’t a demon know its own name. Or at least, if she was in hell that made her a demon now didn’t it?\nContent Warnings: This story will contain Profanity, Sexual Content, Graphic Violence, and Sensitive content. Chapters which contain these will have individual content warnings at the start of the chapter and elaborate on the types of content. As a pre-empt this will likely include sensitive themes such as: slavery, various BDSM dynamics involving the MC as both a dominant and a submissive, non-consensual sexual encounters, dubious consent, and sexual violence. This is not all present in the first chapter, however it will likely be present as the story progresses, hence the warning.\nAI Usage Notice: The Cover art is AI generated.","description_hash":8300111012632911405},{"title":"Breaking Ground: Rebuilding a Deadworld [LIT-RPG, Fantasy, Adventure]","fiction_id":"87430","link":"https:\/\/www.royalroad.com\/fiction\/87430\/breaking-ground-rebuilding-a-deadworld-lit-rpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","War and Military","Martial Arts","Action","Adventure","Fantasy","School Life","Male Lead","Magic","Strategy","Grimdark","GameLit","High Fantasy","Progression"],"lable":"Original","following_count":1,"rating":0.0,"page_count":10,"view_count":45,"chapters_count":2,"last_update":1717437407,"description":"Cole Forger is ready to escape his current life, and signs up to join what he mistakenly thinks is a position for a construction worker in a black hat organization. Lost in his dreams of being an underground operative , it takes him far too long to realize that he's no longer on earth, and there's no way back home. Transported to a world where civilization hasn’t been seen in eons, Cole and his team fight ancient terrors and hordes of monsters while they build the foundations of a new civilization. All is not lost though, for this is a world of magic, and Cole's trusty hammer and dependable Earth Magic will carve out a new home.\nThis story features a robust magic and leveling system and follows the life of a capable but not overpowered construction worker and his team.  The first arc covers his training for his new job, and then the real adventures will start.","description_hash":-1918493301933194347},{"title":"The Hunter Killer | Book 1: S.T.E.L.L.A. [A LitRPG Saga]","fiction_id":"87429","link":"https:\/\/www.royalroad.com\/fiction\/87429\/the-hunter-killer-book-1-stella-a-litrpg-saga","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Sci-fi","Strong Lead","Action","Adventure","Fantasy","Magic","High Fantasy","Progression","Artificial Intelligence"],"lable":"Original","following_count":22,"rating":4.75,"page_count":651,"view_count":7000,"chapters_count":41,"last_update":1718569860,"description":"Of the thousands of faster-than-light capable civilizations that tune in daily to watch the Universal Games, no one could have expected when one unknown, non-player character would shake the System to its core.\nMillions of people follow live as Hunters roam an entirely open MMORPG world, uncovering lost arcane knowledge and unlocking powerful abilities. Free to do as they please, most Hunters are feared across the realms.\nXaz, whose memory of Earth has been forcibly supplanted, believes he is nothing more than a young man from a backwater merchant family. His true memories hidden, he has no idea the universe dismisses him as a lowly non-player character.\nAs fate would have it, and a chance encounter with the Game’s most advanced artificial intelligence named Stella, his world is about to be thrown into chaos.\nSoon learning that every other non-Hunter in the game was abducted to create realistic non-player characters, Xaz is about to become…\nThe Hunter Killer.\n\nWhat to expect:\n- LitRPG with a weak-to-strong progression\n- Starts slow then ramps up quickly\n- Skill and spell progression\n- Class system based on skills and spells\n- Interesting characters\n- 3k-5k word chapters\n- 70+ chapters for book 1","description_hash":-8874704796819917659},{"title":"The Island","fiction_id":"87428","link":"https:\/\/www.royalroad.com\/fiction\/87428\/the-island","tags":["Strategy","Martial Arts","Action","Adventure","Fantasy","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":102,"chapters_count":2,"last_update":1716995353,"description":"Rule number 1 : The island can only be accessed once a year, when the deathly blizzard that surrounds it retracts itself to form a gate.\nRule number 2 : The island only lets in one hundred people every year. Once this number is reached, the gate will close. \nRule number 3 : To enter the island, you have to be trained by Heavens Corp. To be trained by Heavens Corp, you have to pass the selection.","description_hash":6059687754387792372},{"title":"The Ambassador - Book 1","fiction_id":"87427","link":"https:\/\/www.royalroad.com\/fiction\/87427\/the-ambassador-book-1","tags":["Multiple Lead Characters","Sci-fi","Adventure","Fantasy","Romance","Male Lead","Female Lead","First Contact"],"lable":"Original","following_count":9,"rating":5.0,"page_count":12,"view_count":345,"chapters_count":3,"last_update":1718204419,"description":"Special-Ambassador James Wallace Of Earth, Galactic Council Head Representative, helps the Tolian people to join the council; all whilst trying not to fall in love.","description_hash":-8040200581986573361},{"title":"Starlit Odyssey: A Futuristic LitRPG Adventure","fiction_id":"87426","link":"https:\/\/www.royalroad.com\/fiction\/87426\/starlit-odyssey-a-futuristic-litrpg-adventure","tags":["GameLit","Progression","Male Lead","Sci-fi","Adventure","Cyberpunk","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":5,"rating":0.0,"page_count":14,"view_count":539,"chapters_count":7,"last_update":1717945446,"description":"In the year 2070, space travel is as routine as a cross-country flight, with commercial companies offering trips to the moon and back. For Max, the chief scientist at a leading space tourism company, the dream of venturing further into the cosmos is almost within reach.\nWhen his company's ambitious deep space project is on the brink of failure, Max takes a bold step. After many years of research and billions of dollars invested, he and his team finally got the new space drive to work. Desperate, he launches himself into the unknown, determined to break the record for the farthest-traveled human.\nEquipped with everything he needs for survival—food, breathable air, and an AI companion—Max's journey beyond the familiar planets is a daring leap into the void. Years into his voyage, when he's well outside the solar system, disaster strikes. Navigation systems fail, leaving him stranded in space's vast, uncharted depths. With power dwindling and hope fading, Max must confront the ultimate test of his ingenuity and will to survive.\nWhat happens next is a mystery that will captivate and intrigue. \"Starlit Odyssey\" is a thrilling adventure of resilience and discovery, set against the boundless backdrop of the cosmos. Join Max on a journey that will leave you pondering the true limits of human exploration.","description_hash":5367191771182929199},{"title":"Dread-Head","fiction_id":"87425","link":"https:\/\/www.royalroad.com\/fiction\/87425\/dread-head","tags":["War and Military","Martial Arts","Comedy","Action","Adventure","Romance","High Fantasy","Dystopia"],"lable":"Original","following_count":0,"rating":5.0,"page_count":14,"view_count":165,"chapters_count":5,"last_update":1718622004,"description":"There's young boy named Ray all he wanted was some food and knowledge to live a happy life but when he makes an unexpected encounter with a weapon of legend what will happen next.(Royal Road staff please let my submission go through I was previously rejected)","description_hash":1216227318923432914},{"title":"Biothronica","fiction_id":"87424","link":"https:\/\/www.royalroad.com\/fiction\/87424\/biothronica","tags":["Virtual Reality","Progression","Anti-Hero Lead","Strategy","Psychological","Action","Adventure","Sci-fi","Cyberpunk","Male Lead","Genetically Engineered ","Technologically Engineered","Soft Sci-fi","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":2,"rating":0.0,"page_count":4,"view_count":70,"chapters_count":1,"last_update":1716978990,"description":"Aldernan Sirius is a second-rate smuggler living as he can in the neon paradise of Nihila, the city most cursed by technological evolution and falling living standards.\nHis old goals, long forgotten, resurface when some collaborative research between megacorporations reaches his ears. Now, he will assemble a team, hardly the best possible, but the one available, to tear his way to the heart of this scheme.\nGangs, businessmen, assassins and madmen will stand in his way, but he can't stop, because he made a promise.","description_hash":789068637516999627},{"title":"Strange Journey","fiction_id":"87423","link":"https:\/\/www.royalroad.com\/fiction\/87423\/strange-journey","tags":["GameLit","Strategy","Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":45,"chapters_count":1,"last_update":1716978981,"description":"Vioral, the land of progress, the land of knowledge, the land that was once ruled by the great mistress of magic... in this prospering land a man in his early twenties has made his mind to move up and change his life, from the dull and slow progressing village life, he aims for the big apple, the city of trades, the capital of Vioral!\nbut... it wont be interesting and worth it if it was such an easy journey would it?","description_hash":-1996880616775506889},{"title":"From City Forge To Country Hearth","fiction_id":"87422","link":"https:\/\/www.royalroad.com\/fiction\/87422\/from-city-forge-to-country-hearth","tags":["Male Lead","Slice of Life","Drama","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":1,"view_count":68,"chapters_count":1,"last_update":1716978978,"description":"\"In the midst of bustling city life, Erik, a seasoned blacksmith with a preference for metal over cloth, prepares to embark on a new chapter in the serene town of Trona. Alongside his friend Gideon, Erik anticipates a fresh start away from the chaos of city streets. However, upon arrival, Erik encounters unexpected challenges, including a peculiar encounter with a determined elven mage seeking his craftsmanship. As Erik navigates the unfamiliar territory, he finds himself drawn into the intrigue of his new surroundings, setting the stage for an adventure filled with unexpected twists and turns.\"","description_hash":4352087065584244250},{"title":"InterCons Information Book","fiction_id":"87421","link":"https:\/\/www.royalroad.com\/fiction\/87421\/intercons-information-book","tags":["Fantasy"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":1,"view_count":109,"chapters_count":3,"last_update":1717002513,"description":"This book contains information about InterCons and may receive updates when I make minor changes.","description_hash":-8270427414418424453},{"title":"A Survivor's Guide to Planetary Apotheosis","fiction_id":"87420","link":"https:\/\/www.royalroad.com\/fiction\/87420\/a-survivors-guide-to-planetary-apotheosis","tags":["Post Apocalyptic","Grimdark","Psychological","Action","Low Fantasy"],"lable":"Original","following_count":7,"rating":5.0,"page_count":103,"view_count":290,"chapters_count":4,"last_update":1718117271,"description":"Alexander Gerifalte is at the top of his game, literally, in the seat of a plane when the planet awakens and magic envelopes the world.  In the wake of the Pulse, all that was electronic is gone, and Alexander is left to fend for himself in a world newly ascended to godhood.  Those who survive must contend against the regions where magic bridges worlds, and monsters cross between.  Gaia itself conjures beasts where they have been extinct for a century and which flourish under the ever present wash of mana that enriches the environment. \nWhat to expect:\nA young man's journey full of struggle, pain, determination, and discovery in a land familiar but twisted. \nHeavy survival and post apocalyptic themes, with a heavy dose of dark fantasy.  I don't hesitate to use the word gritty.\nThere are new, improved, blue boxes!  There are literpg elements which are not abused, but have a role in the story.  Now hear this, there will NOT be numbers go burr!!  There are dungeons and classes, and I hope they're done in an interesting manner.\nThere is magic, but not wizardry, so to speak, and magitech is present, but not prevalent, especially at the beginning.\nIf you've read my other story then you have some idea what you're in for, if you haven't then I tell you now, you will be sitting on the MC's shoulder, right next to the devil in his ear that whispers paranoia.  I like to write a story with real people in them, and real people think real thoughts, not all of which are useful, intelligent, or even very nice.  This is the first book of a series and, in this one, the only person left to navigate the new world is our MC, alone.  It's man vs wild out here, so don't go looking for help, it isn't coming for a while.  I learned from my mistakes last time, this release will be full length chapters, as written, no mucking about with webserial chunking, however long the chapter is, is how it gets posted, typically about 8-10k words.\nIf all that sounds like a good time then welcome aboard, I hope you have fun. \nPosting Schedule: Due to time constraints from work, editing Varda Walk, walking my dog, and occasional bouts of neurotic obsession with reinstalling skyrim for the 18th time or some such, as well as time to read, I'm only going to publish once a month while I work on Book 2.  More than that and you folks wouldn't get the quality you deserve and I want to expect from myself.\nI'll post the first two chapters today to give you enough to decide whether this story is for you, although I think it really picks up steam by around chapter 4.\nDisclaimer: I work full time and write for fun and to let the spiders out of my brain.  That brain likes words, weird ones, and isn't afraid of a thesaurus and neither should you be.  Not having fun? No problem, I encourage you to go somewhere else and have fun, life is short, I wish you the best.  See my relentless grammatical and structural mistakes?  Point them out, I'm pretty on the ball with fixing things, and I desperately would like to edit my work into a highly palatable state.  Want to tell me how you would write my story?  Write your own instead, we'll both be happier that way.","description_hash":-7573428818006545150},{"title":"InterCons Story Book I","fiction_id":"87419","link":"https:\/\/www.royalroad.com\/fiction\/87419\/intercons-story-book-i","tags":["Portal Fantasy \/ Isekai","Psychological","Multiple Lead Characters","Fantasy","Supernatural"],"lable":"Fan Fiction","following_count":1,"rating":4.0,"page_count":11,"view_count":121,"chapters_count":3,"last_update":1718391356,"description":"I don't actually know if there will be a book II, I'm just calling this number one in case there is. Also, be aware that this may contain strong language.\nInterCons was an unusual company on Earth. It's even more unusual in a world inhabited by dragons, especially if you are one of those dragons. InterCons management, however, would like to make it more normal in their new world--at least once they know where that is--but they won't do so by changing InterCons.\n(There is an information book for InterCons in my profile. Thank you to @SusanneSaM (Wattpad) for making the cover image.)","description_hash":349923100635937931},{"title":"Grow Anything","fiction_id":"87418","link":"https:\/\/www.royalroad.com\/fiction\/87418\/grow-anything","tags":["LitRPG","Male Lead","Slice of Life","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":9,"rating":4.62,"page_count":15,"view_count":261,"chapters_count":2,"last_update":1717992358,"description":"Trog is a goblin who joined the military at the age of 17. To fight for the Joined Kingdom and show that goblins could hold their own with all the other races seemed like a great use of his life. He hoped to one day become an officer and lead warriors into combat.\n\nNow ten years later he is sent back home. Injury forced his discharge. However, chance smiles upon him as he finds a legendary awakening stone. The only problem is that the stone didn't awaken fire magic or void magic both would have been a ticket straight back into the military. No, it was farming magic. Now forced into a life he never wanted he must master his newly awakened magic. Trog will soon learn this isn’t the common farming magic that can do little more than help crops grow. What would you grow if you could Grow Anything?","description_hash":10984288363679975},{"title":"Improbable love","fiction_id":"87417","link":"https:\/\/www.royalroad.com\/fiction\/87417\/improbable-love","tags":["Anti-Hero Lead","Comedy","Female Lead","Contemporary","Romance","School Life","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"When Claire Jones, Lotus academies most popular,(and most homophobic), girl is caught being unfaithful with her boyfriend, a shy student decides it is time Claire learned a lesson.","description_hash":734040897250417067},{"title":"Cultivating Chai","fiction_id":"87416","link":"https:\/\/www.royalroad.com\/fiction\/87416\/cultivating-chai","tags":["Xianxia","Male Lead","Slice of Life","Action","Fantasy","Martial Arts"],"lable":"Original","following_count":2887,"rating":4.68,"page_count":151,"view_count":213713,"chapters_count":32,"last_update":1718634027,"description":"Transmigrated into the ruthless world of cultivation from Earth, Xiao Feng ditches the way of violence for a craft he always wanted to pursue back on his old world but never got the opportunity to- brewing tea. \nTrading battles for blends, he discovers that strength comes in many forms.","description_hash":8821569004003479734},{"title":"I was Reincarnated as a vampire in a wicked world.","fiction_id":"87415","link":"https:\/\/www.royalroad.com\/fiction\/87415\/i-was-reincarnated-as-a-vampire-in-a-wicked-world","tags":["Portal Fantasy \/ Isekai","Time Travel","Progression","Post Apocalyptic","Anti-Hero Lead","Action","Adventure","Fantasy","Tragedy","Reincarnation","Gender Bender","School Life","Supernatural","Female Lead","Non-Human Lead","Magic","Grimdark","High Fantasy","Villainous Lead"],"lable":"Original","following_count":3,"rating":0.0,"page_count":84,"view_count":1528,"chapters_count":10,"last_update":1718597492,"description":"5 Million years ago a self-proclaimed God made another world similar to the human world.\nAfter just a few thousand years, the God left the world to do as it pleases, causing absolute chaos all around.\nThe protagonist gets reincarnated as a vampire. As most of the creatures in this world are extremely powerful, vampires are one of the weaker ones despite their strength, does he still have what it takes to survive in this world?","description_hash":-708302339518174595},{"title":"Descent","fiction_id":"87414","link":"https:\/\/www.royalroad.com\/fiction\/87414\/descent","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Non-Human Lead","Action","Adventure","Fantasy","Reincarnation","Male Lead","Magic","GameLit","Progression"],"lable":"Original","following_count":18,"rating":4.67,"page_count":46,"view_count":1297,"chapters_count":6,"last_update":1718353804,"description":"Notification:\n-This is my first ever novel that I wrote as a hobby. I'm really just trying to have fun writing a fantasy story, and for the most part, trying to see where the story takes me.\n-Naturally, as a newcomer, there might be some small issues, but I will try to fix them before posting chapters.\n-Posting schedule: Wednesday, Saturday, and Monday. This will range from 2–3 weeks (if I am insanely busy) or 3–5 days (if I have some breathing room to write chapters).\n-Some chapters may be shorter than others; however, all the chapters will have a word count of about 1800 to 2000.\n\nSynopsis:\nReynold dies and finds himself reborn in another world, not as a hero or even human, but as a six-legged, venomous lizard monster. Struggling to survive in a harsh, unforgiving environment teeming with fantasy-like creatures.\nEquipped with a mysterious game-like status system, Reynold must navigate this perilous new reality, discovering his unique abilities and understanding the rules of this strange world. Each day is a battle for survival as he faces deadly monsters, treacherous landscapes, and the constant threat of death.\nAs Reynold learns to harness the power of the system to level up, and evolve, he begins to uncover secrets about the world he now inhabits. What is the true purpose of the status system? Who or what brought him to this realm?  And will he survive the constant life or death situations that he is placed in?","description_hash":5072518027125252363},{"title":"The Patchwork Alchemist ","fiction_id":"87413","link":"https:\/\/www.royalroad.com\/fiction\/87413\/the-patchwork-alchemist","tags":["Male Lead","Action","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":21,"view_count":211,"chapters_count":6,"last_update":1718457746,"description":"A cultivation story. The tales of self cultivation. A Journey into discovering the unorthodox. An adventure exploring the unknown. A story of love, a story of loyalties, a story of discipleship and a story of conquerers. Discovering the world, walking among the elite, discovering another side to life that never existed. Discovering Immortality.","description_hash":5031480974416718486},{"title":"The fifth life ","fiction_id":"87412","link":"https:\/\/www.royalroad.com\/fiction\/87412\/the-fifth-life","tags":["Non-Human Lead","Fantasy","Short Story","Female Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":44,"chapters_count":1,"last_update":1716962516,"description":"Ranni is part of a noble half elf clan but they have a curse. Each member has five lives and with each new generation their lifespan become shorter. Ranni has a second curse she dies before the age of eighteen in each life. Now on her last live she is determined to break her curse and live a full human lifespan. Will she be able to break the curse with the help of her twin brother Rykard or is she destined to die once more...","description_hash":3992992982959779953},{"title":"My baby daughter is a dragon","fiction_id":"87411","link":"https:\/\/www.royalroad.com\/fiction\/87411\/my-baby-daughter-is-a-dragon","tags":["Comedy","Multiple Lead Characters","Fantasy","Romance","Short Story","Magic"],"lable":"Original","following_count":13,"rating":5.0,"page_count":88,"view_count":1577,"chapters_count":16,"last_update":1718494383,"description":"In the mystical land of Artemia, Freydelhart, the renowned general and dragonslayer, is hailed as “the hero” by its people. His valorous deeds have become the stuff of legends, and his name echoes through the kingdom. But destiny has a peculiar way of unfolding, and Frey’s path takes an unexpected turn.\nThe war against the foul dragon beasts has raged for years, and Frey believes that within the grand castle of Meyrin lies the key to ending the conflict. The throne room, he thinks, holds the secret to victory—a confrontation with the elusive dragon king. Armed with courage and determination, Frey strides into the heart of the castle, ready to face his destiny.\nHowever, what awaits him is not a fearsome dragon but a cute, innocent five-year-old girl. She stands before him, her eyes wide and curious, and Frey’s world shifts on its axis. The truth dawns upon him: this child is no ordinary girl. She is a baby dragon, transformed into a demi-human form. Her existence defies the boundaries of war and peace, threatening the delicate balance among the kingdoms.\nFrey’s heart softens. Pity replaces his battle-hardened resolve. He cannot bring himself to harm this innocent creature. Instead, he carries her back to safety, shielding her from the chaos that surrounds them. Little does he know that this act of compassion will alter the course of his life forever.\nAs Frey navigates the complexities of fatherhood, he faces a new kind of battle—one that transcends swords and shields. He must protect his newfound daughter, even if it means defying his own people. The war still rages, but now Frey fights not only against dragonkind but also for their coexistence. His loyalty to Runasthera, the half-elf princess of Artemia and the love of his life, is unwavering. Together, they strive to bridge the gap between races, forging a fragile peace in a world torn by conflict.\nIn this tale of unexpected bonds and sacrifice, Freydelhart discovers that heroism takes many forms. Sometimes, it’s not about slaying dragons but nurturing hope—even in the most unlikely of places.","description_hash":-815681085585152565},{"title":"Bankinahn [FRENCH]","fiction_id":"87410","link":"https:\/\/www.royalroad.com\/fiction\/87410\/bankinahn-french","tags":["Ruling Class","Multiple Lead Characters","Adventure","Fantasy","Male Lead","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":70,"chapters_count":2,"last_update":1717010502,"description":"Une tour immense perdue dans le désert sans fin, si grande que son sommet se perd dans les nuages. A son sommet, les plus riches. Au plus bas, les plus pauvres. Les castes ne se mélangent jamais, sciemment séparées par un système qui fonctionne depuis des millénaires. Pourtant, parmi les habitants, la révolte gronde. Karon, l'un des leaders d'un des groupes les plus extrémistes, va bientôt se voir entraîné dans bien plus de complots et de secrets qu'il n'aurait pu s'en douter, propulsé dans des lieux encore jamais exploré par les gens \"comme lui\".","description_hash":7619127881420250060},{"title":"POKÉMON : The Mystery Of Lavender Town","fiction_id":"87409","link":"https:\/\/www.royalroad.com\/fiction\/87409\/pokemon-the-mystery-of-lavender-town","tags":["Action","Adventure","Mystery","Short Story"],"lable":"Fan Fiction","following_count":0,"rating":5.0,"page_count":8,"view_count":288,"chapters_count":3,"last_update":1718232595,"description":"A young boy from the small town of Pallet, Red is a powerful Pokemon trainer who is passionate about challenges and constantly seeks to improve his skills as a trainer. He is dedicated to hard training, spending long hours exploring the Pokémon world, his determination to become the best is evident in his journey, he faces gyms, the Pokémon League, the biggest competition in the Pokemon world and even the Elite Four (four Pokémon trainers who are considered the hardest trainers to defeat in a battle). His main goal is to become a Pokémon Master, the highest level of trainer. He aims to complete the Pokédex by finding all the Pokemons in existence.\nAfter defeating the leader of the Vermilion City gym, Lt. Surge, red continues his journey to the mysterious and melancholy town of Lavender Town.\n       A small town, shrouded in mist and hills with a cold and foggy climate... Lavender Town's main feature is the imposing structure that stands in the center of town, a tower that serves as a shrine to deceased Pokémon, where trainers go to pay homage to their dead companions. Known for its heavy atmosphere and full of mysteries, Lavender Town attracts Pokémon trainers and curious visitors looking to explore the unique nature of the Pokémon Tower and perhaps even find ghost Pokémon. The mystery and sense of dread that permeate the town make it an intriguing and captivating place for those seeking adventure.","description_hash":-5630012067753656529},{"title":"Where the Night-Sun Sings","fiction_id":"87407","link":"https:\/\/www.royalroad.com\/fiction\/87407\/where-the-night-sun-sings","tags":["Multiple Lead Characters","Drama","Action","Fantasy","Mystery","Supernatural","Non-Human Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":33,"chapters_count":1,"last_update":1716961030,"description":"Following the story of a deer and a wolf as they become friends, and the many complex ways they view the world. This story explores the different challenges they face and the diverse culture of the deer and the wolf.","description_hash":6504575333949697157},{"title":"Messiah Destiny","fiction_id":"87406","link":"https:\/\/www.royalroad.com\/fiction\/87406\/messiah-destiny","tags":["Portal Fantasy \/ Isekai","Time Travel","Dungeon","Male Lead","Action","Adventure","Fantasy","Romance","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":4,"rating":0.0,"page_count":13,"view_count":346,"chapters_count":7,"last_update":1717016485,"description":"Enter the world of Messiah Destiny, an epic adventure that will immerse you into a mysterious and perilous realm full of secrets and destiny.Follow Luke, a young hero whose fate is intertwined with danger, and who must confront his own emotions and decisions that shape his destiny.In Messiah Destiny, you'll encounter powerful gods, dark forces, and various races that unite or clash in a battle for the world's fate. Throughout his journey, Luke discovers his own strengths, finds allies and foes, and uncovers deep secrets of his family and the world around him.Prepare for an adventure full of suspense, where every decision can change the fate of the world.Messiah Destiny is a tale of power, hope, and destiny that will engulf you and won't let go until the very end.","description_hash":-8134677958895076601},{"title":"Space Crusader","fiction_id":"87405","link":"https:\/\/www.royalroad.com\/fiction\/87405\/space-crusader","tags":["Space Opera","Comedy","Male Lead","Sci-fi","Action","Adventure","Grimdark","First Contact","Hard Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":98,"view_count":265,"chapters_count":9,"last_update":1716995694,"description":"William Fallis, an unknown knight from the medieval European era, has a fated encounter with, what he believes to be angels, despite in actuallity being xenos that resemble these religious icons of his belief. Due to his zealous nature he goes on to aid them against a small force of attacking xenos that resemble devils. This whole ordeal ends up with our knight having his heart blown to smitherens and in an effort to save him, and the life of her comrades, one xeno woman gives the human knight access to the life support of an older model combat suit at their disposal, which binds itself to the dying human. A new opportunity arises for William to live, but it also has him bound for the stars, as he can't be left on Earth with the suit that is bound to his body. Wonder in what situations the religious knight might get into?","description_hash":-7570228030381190274},{"title":"I become a Dark Knight in a world full of dungeons (Urban Fantasy litRPG) ","fiction_id":"87404","link":"https:\/\/www.royalroad.com\/fiction\/87404\/i-become-a-dark-knight-in-a-world-full-of-dungeons","tags":["LitRPG","Urban Fantasy","Dungeon","Martial Arts","Comedy","Action","Adventure","Fantasy","Harem","Slice of Life","Supernatural","Male Lead","Strong Lead","Secret Identity","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":12,"rating":4.5,"page_count":168,"view_count":2356,"chapters_count":11,"last_update":1718556256,"description":"Ren Sarain was a weak adventurer who couldn't level up in the dungeon, however, he had a secret class that was locked, unable to find the way to open his class, he's faced with hopelessness, until one day he managed to open it with sheer determination and hard work. From now on, his life will change!","description_hash":6904952676573922221},{"title":"A Heartfelt Dream","fiction_id":"87403","link":"https:\/\/www.royalroad.com\/fiction\/87403\/a-heartfelt-dream","tags":["Slice of Life","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":21,"view_count":85,"chapters_count":3,"last_update":1718611434,"description":"A fun romance and slice of life. Jacob works in Melbourne. His life is nothing but ordinary - but things change when he meets Pip.","description_hash":-4864164484504646888},{"title":"Excidium Elysiae (2nd Draft)","fiction_id":"87402","link":"https:\/\/www.royalroad.com\/fiction\/87402\/excidium-elysiae-2nd-draft","tags":["Portal Fantasy \/ Isekai","Progression","Post Apocalyptic","Anti-Hero Lead","Strategy","Adventure","Horror","Psychological","Mystery","Slice of Life","Multiple Lead Characters","Secret Identity","Magic","Grimdark","High Fantasy","First Contact"],"lable":"Original","following_count":0,"rating":0.0,"page_count":28,"view_count":140,"chapters_count":4,"last_update":1718508601,"description":"“We felt empty inside. Dumbstruck. We didn’t know what to think or feel. It was as if this new world was too great, too vast. And the problems and issues I had… or We had, were miniscule to the sublimity of this new world. As if they were too little to compare; for my mind to even fathom that they mattered anymore. It felt like nothing but this world mattered now, and it was an omen of great struggles to come.”\nHomo Sapiens have been summoned. Spawning with no knowledge of why they are where they are, who or what brought them to that place, or even what world they are in.","description_hash":5940306533763456992},{"title":"I am not on the job right now!","fiction_id":"87401","link":"https:\/\/www.royalroad.com\/fiction\/87401\/i-am-not-on-the-job-right-now","tags":["Reincarnation","Anti-Hero Lead","Xianxia","Comedy","Female Lead","Fantasy","Historical","Romance","Martial Arts","Slice of Life","Strong Lead"],"lable":"Original","following_count":5,"rating":5.0,"page_count":21,"view_count":150,"chapters_count":3,"last_update":1717618614,"description":"Zhi Yan wakes up in a dead girl's body with no recollection of how she got there and a wish to fulfill. Plan: 1. Complete the wish and get out alive. 2. Live a peaceful life with a small garden. Her mortal days would lived out with content. At least that was the plan.\n\"Birdie~ I heard the mayor's wife just died. Let's go, have a look around.\"\"No.\"\"Just a look around, nothing else.\"\"No.\"\"Come, we could sell some of your medicine while we're at it.\"\"...Fine.\"","description_hash":-533288342368316591},{"title":"The Lord Of Dreams (A HP Fanfiction Novel)","fiction_id":"87400","link":"https:\/\/www.royalroad.com\/fiction\/87400\/the-lord-of-dreams-a-hp-fanfiction-novel","tags":["Villainous Lead","Comedy","Multiple Lead Characters","Harem","Strong Lead","Action","Fantasy","Romance","Magic"],"lable":"Fan Fiction","following_count":7,"rating":0.0,"page_count":21,"view_count":521,"chapters_count":8,"last_update":1718311631,"description":"He is the Lord of Dreams, called simply The Lord, or as the love of his life knew him, Dante King. Robbed of his love by treachery, he slaughtered an entire world. Upon completion of his vengeance, he once again comes face to face with the love of his life, Freya Valmore, the goddess of Darkness and Life. Now, after feeding on the life force of a trillion dead souls, Freya has completed her ascension to complete godhood.\nNow, after countless battles, what does the ultimate villainous couple do? They retire and tour the multiverse, starting with the Wizarding World of Harry Potter. Join them in their tour of death and delight as they reshape the myriad realms of fantasy and fiction.","description_hash":4362791231439840448},{"title":"Shadow and Light","fiction_id":"87399","link":"https:\/\/www.royalroad.com\/fiction\/87399\/shadow-and-light","tags":["Villainous Lead","Super Heroes","Comedy","Female Lead","Slice of Life","Action","Romance","Male Lead","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":10,"view_count":108,"chapters_count":2,"last_update":1717007467,"description":"Stygian and Aurora are an apparently ordinary couple living a quiet and routine life. Stygian is a devoted husband and househusband, always taking care of breakfast and household chores while Aurora rushes off to work every morning. But each of them hides an extraordinary secret: Stygian is actually a cunning supervillain with plans to dominate the world, while Aurora is a fearless superhero, Radiant Star, constantly saving the city from dangers.","description_hash":-6561774243514701496},{"title":"Timeless Enigma","fiction_id":"87398","link":"https:\/\/www.royalroad.com\/fiction\/87398\/timeless-enigma","tags":["Reincarnation","Strategy","Comedy","Psychological","Multiple Lead Characters","Mystery","Contemporary","Slice of Life","School Life","Supernatural","Male Lead","Female Lead","Strong Lead","Secret Identity","Magic","Attractive Lead"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":9,"view_count":114,"chapters_count":3,"last_update":1717417191,"description":"In this introspective tale, we meet Shu, a 16-year-old girl caught between dreams and reality, cultural expectations, and her own restless mind. Living in Italy with her Tunisian family, Shu grapples with a profound sense of displacement and the weight of life's seemingly arbitrary routines. Narrated by Aki, a mysterious figure with memories of past lives shared with Shu, the story delves into themes of reincarnation, the quest for meaning, and the elusive nature of identity. As Shu navigates her world, we are invited to ponder the deep questions she raises about existence, memory, and the value of life itself.","description_hash":-4633674473218106918},{"title":"Point-Blank Ranger","fiction_id":"87397","link":"https:\/\/www.royalroad.com\/fiction\/87397\/point-blank-ranger","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Martial Arts","Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":10,"rating":2.17,"page_count":34,"view_count":456,"chapters_count":4,"last_update":1718265774,"description":"On the eve of the world tournament, the top student of a prestigious martial arts academy meets an untimely death. Miraculously, he is given a second chance at life in a fantastical new world. However, he finds himself assigned the unexpected class of a ranger. As he embarks on this challenging journey, he must learn to blend his hand-to-hand combat skills with the versatile, yet unfamiliar, abilities of a ranger. Can he adapt and thrive in this new world?","description_hash":-6125095111692456566},{"title":"Silver","fiction_id":"87396","link":"https:\/\/www.royalroad.com\/fiction\/87396\/silver","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Comedy","Male Lead","Action","Adventure","Fantasy","Reincarnation","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":24,"view_count":257,"chapters_count":5,"last_update":1716979078,"description":"Being dead wasn't something I wanted to be. Unfortunately, it seems in life you can't always have what you want. Wait, can I even use that saying anymore?","description_hash":4079711760486326473},{"title":"Little girl-short story","fiction_id":"87395","link":"https:\/\/www.royalroad.com\/fiction\/87395\/little-girl-short-story","tags":["Tragedy","Adventure","Horror","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":47,"chapters_count":1,"last_update":1716960540,"description":"Its my first writen short story so if you have time give it a read","description_hash":2958670921061646279},{"title":"Undead Siege","fiction_id":"87394","link":"https:\/\/www.royalroad.com\/fiction\/87394\/undead-siege","tags":["Steampunk","Multiple Lead Characters","Fantasy","High Fantasy","Technologically Engineered"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":27,"chapters_count":1,"last_update":1716959991,"description":"Mankind's end is near. The great fortress city of Verdinani is under siege by an army of the machined dead. Metal grafted to corpses reanimating them into abominations. They ravage the lands with a raging hunger as they seek to feed their war machine. Captain Titus and three Siege Breakers are on a mission that could change man's fate. The city harbors a devastating secret, an artifact of legend capable of great power. Their mission is to recover the artifact before the dead can take the city. But time is running out and the city can only hold for so long. Bare witness to the Siege of the Undead.","description_hash":-8696556512399542773},{"title":"The Creator's Games","fiction_id":"87393","link":"https:\/\/www.royalroad.com\/fiction\/87393\/the-creators-games","tags":["Strong Lead","Fantasy","Mythos"],"lable":"Original","following_count":1,"rating":3.5,"page_count":59,"view_count":1323,"chapters_count":24,"last_update":1718025081,"description":"This novel delves into the epic tale of heaven and hell as they begin to realize that they are merely pieces in a grand game orchestrated by the Creator. The story opens with a dramatic and fierce battle between angels and demons, highlighting the age-old conflict between these two realms. As the war rages on, both sides start to uncover cryptic clues and hidden truths that hint at a larger, more intricate mystery at play.\nThroughout the narrative, characters from both heaven and hell find themselves questioning their roles and the true nature of their existence. Powerful and enigmatic figures from each side come into focus, their motivations and secrets slowly unraveling. Alliances are tested, and unexpected friendships form as angels and demons alike grapple with the revelations that challenge their fundamental beliefs.\nAs the mystery deepens, the characters embark on a journey across various realms, encountering ancient beings and uncovering long-forgotten lore. Each discovery brings them closer to understanding the Creator's true intentions and the purpose of their endless struggle.","description_hash":-6097494302726244244},{"title":"Come Together","fiction_id":"87392","link":"https:\/\/www.royalroad.com\/fiction\/87392\/come-together","tags":["Comedy","Non-Human Lead","Adventure","Fantasy","Short Story","Magic","High Fantasy"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":5,"view_count":31,"chapters_count":1,"last_update":1716959764,"description":"Faxel is a charismatic elven bard. At least, he is in his own head. \nWhen his melodica is broken and he needs help repairing it, he stumbles on a group of adventurers coming together to set out on a mission. This is the story of their coming together.\n(The original DnD intro to a pre-made campaign, set in Neverwinter.)","description_hash":-4564677606395722989},{"title":"Valendar","fiction_id":"87391","link":"https:\/\/www.royalroad.com\/fiction\/87391\/valendar","tags":["Villainous Lead","Male Lead","Adventure","Fantasy","Short Story","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":40,"chapters_count":1,"last_update":1716959756,"description":"The Fall of a paladin.\n(The backstory of a villain for a campaign of DnD.)","description_hash":-1922866497931175959},{"title":"Edan ","fiction_id":"87390","link":"https:\/\/www.royalroad.com\/fiction\/87390\/edan","tags":["Non-Human Lead","Adventure","Fantasy","Short Story","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":43,"chapters_count":1,"last_update":1716959748,"description":"The brief history of a misfit paladin.(The backstory I wrote for an original Dungeons and Dragons character.)","description_hash":-7597087365678702039},{"title":"Some People Get A Dog [Community Contest Submission]","fiction_id":"87915","link":"https:\/\/www.royalroad.com\/fiction\/87915\/some-people-get-a-dog-community-contest-submission","tags":["Female Lead","Slice of Life","Fantasy","Short Story","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":72,"chapters_count":2,"last_update":1718628126,"description":"Living alone since her husband's passing, June potters around, waiting for either her children to show up or to join him. To her shock, these goblins have shown up in her cellar and she might not want them to leave. Who would've thought the hole her husband left in her heart can be filled with something small and green. \n\nTemporary Cover Photo: Photo by Shortsands on FreeImages","description_hash":-4240621945272034282},{"title":"Realm of Redemption: The Hidden World","fiction_id":"87914","link":"https:\/\/www.royalroad.com\/fiction\/87914\/realm-of-redemption-the-hidden-world","tags":["Male Lead","Action","Adventure","Fantasy","Mystery","Magic"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":39,"view_count":654,"chapters_count":17,"last_update":1718537546,"description":"\"Today, it was announced that our world has only one year left before it will be destroyed due to an internal explosion that will split the planet in half, leading to the annihilation of everyone. Except for me, Sarutobi, although my friends call me Saru. I have kept a secret since childhood that I never wanted to share with anyone, but now I am in a position where I am forced to share it with everyone. I have only one year to make this crucial decision and see its future consequences. I see sadness on everyone's faces, and this news has only added to their horror. Suicide attempts began as soon as the news was heard, and theft and panic engulfed everyone. Fewer people come to school now. My day ends, and I return home to find my mother crying after my father fled. This was after rumors spread that those living in the North Pole would survive this explosion. I entered my room after trying to calm my mother down, continuing to talk to her until she fell asleep. I took her to her bed and went up to my room after this long day. My room is my only sanctuary, holding the biggest secret I've carried since childhood. #Warning This is my first fanfic and English also not my first language . The Idea of this fic juste come in me don't expect some mind blowing and Amazing plot .but i'll try to improve along the way. 2_3 chapters a day Lastly ,Be sure to enjoy!","description_hash":-4110153927901461692},{"title":"Eros","fiction_id":"87913","link":"https:\/\/www.royalroad.com\/fiction\/87913\/eros","tags":["Strategy","Comedy","Psychological","Female Lead","Slice of Life","Fantasy","Secret Identity","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":135,"view_count":464,"chapters_count":12,"last_update":1718611340,"description":"What a dumb story.\nOnce upon a time, in a fantasy land full of magic and dragons and unicorns and happiness, there was a girl. Everyone in the kingdom loved the girl unconditionally. Not only was she the most beautiful person in the world, but she was also the kindest soul one could ever have met. Born a princess with all the power, wealth, and happiness she could ever want, she lived her life beautifully. Handsome men from all over the country would come just to be her husband, and everyone would wish to serve her should they have the chance.\nThat wasn't me. That was the main character, Aphrodite, in an erotica I'd read. I was her annoying and hardly mentioned sister, Persephone, and this world was heading toward an apocalypse. And if I couldn't get out of this place before I was found to not be her, I would be executed. Great. Cool. I could do this!\n... On the bright side, I was surrounded by hot guys, and one of my absolute favorite characters was willing to help me! Yes!\n\nThis is a story written out of pure rage. I had a lot of fun writing it. This began as a rage-written story, but it has 148k already written, and it's pretty much complete. Regardless, feel free to comment on how bad it is. I only wrote it to spite the manwha I'd been reading at the time.\nI don't know what to call it or what genres it falls under, because it wasn't written satirically (though it should have been). It's a nothing-burger given form and plot. Just like the dumb manwha I'd been reading. But better. Because there's... Trauma?\n\nTrigger warnings:\nThe chapters will never have good stopping points, I wrote this without chapters in mind.\nCharacter isn't depressed! Yay! :D Unlike all my other stories lmao.\nMC has deep trauma\nBody dysmorphia\nr*pe (not detailed)\nsex (also not detailed)\n\n(Lifeless is not over. I wanted to avoid time-skips, but I'm not great at writing combat lmao. New chapter there within the year, promise)","description_hash":-5421124110762729257},{"title":"Journey Beyond Infinity ","fiction_id":"87912","link":"https:\/\/www.royalroad.com\/fiction\/87912\/journey-beyond-infinity","tags":["Anti-Hero Lead","Wuxia","Male Lead","Action","Fantasy","Martial Arts"],"lable":"Original","following_count":1,"rating":0.0,"page_count":29,"view_count":117,"chapters_count":4,"last_update":1718388317,"description":"Transported to a brutal world overrun by demon beasts, Max awakens in the body of Tian Feng, a young hunter with a fierce responsibility – his little sister. Now, in a desperate fight for survival, Max must adapt to this savage reality and carve a path forward. Can he overcome a world gone mad and protect his newfound family?","description_hash":610948882413744302},{"title":"The Shadows Within","fiction_id":"87911","link":"https:\/\/www.royalroad.com\/fiction\/87911\/the-shadows-within","tags":["Portal Fantasy \/ Isekai","Anti-Hero Lead","Grimdark","Female Lead","Slice of Life","Action","Drama","Fantasy","Romance","Magic","High Fantasy","Villainous Lead"],"lable":"Original","following_count":5,"rating":5.0,"page_count":46,"view_count":381,"chapters_count":6,"last_update":1718553885,"description":"After being whisked away into another world, from one cruel existence to another, Sylvia finds herself in front of a demon lord. He only has one command for her.\n\"Be my bride.\"\n\nI'll be updating this every Sunday and Thursday!","description_hash":-3727066331585563389},{"title":"Extraordinary Mistakes II - Blood Ties","fiction_id":"87910","link":"https:\/\/www.royalroad.com\/fiction\/87910\/extraordinary-mistakes-ii-blood-ties","tags":["Progression","Super Heroes","Multiple Lead Characters","Sci-fi","Strong Lead","Action","Drama","Tragedy","Female Lead","Low Fantasy","Genetically Engineered ","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":29,"view_count":177,"chapters_count":5,"last_update":1718447734,"description":"How much are they willing to sacrifice to protect the truth?\n\nFollowing Emily Roberts' abduction, the Council sees it as the perfect opportunity to ensure a solid result in the elections and turn the tide against the deviants with the help of the new number one, Jade Harris. Tensions grow high when the Parkers demand results from the President of the United States and act on their own to have Abigail return safely. An elaborate plan to end the terrorist movement, with Aminu Ikubor right in the center of it, succeeds, forcing Megan to face her past and Rachel to make her toughest decision yet.","description_hash":3625701603569845660},{"title":"Greed of the deep","fiction_id":"87909","link":"https:\/\/www.royalroad.com\/fiction\/87909\/greed-of-the-deep","tags":["LitRPG","Reincarnation","Female Lead","Strong Lead","Action","Adventure","Fantasy","Horror","Magic","High Fantasy"],"lable":"Original","following_count":7,"rating":5.0,"page_count":35,"view_count":533,"chapters_count":5,"last_update":1718292084,"description":"Marina lost her life walking through the street, finding herself in a world where gods populate the world and extend blessings to the worthy, all life governed by the \"system\" Marina wants to try settling down but that quickly flies out the window as the lost god of vermin and rot extends his blessing to her making her his scion on the surface while he waits in the deep\n-traditional litrpg\n-mc gets corrupted slowly\n-i write as it comes to my mind so it goes how i decide in the moment how it goes\n-hope to include readers in decisions\n-chapters released extremely randomly\nhope yall enjoy :3","description_hash":1859378697605222096},{"title":"Worlds End Online","fiction_id":"87908","link":"https:\/\/www.royalroad.com\/fiction\/87908\/worlds-end-online","tags":["Virtual Reality","Dungeon","Female Lead","Action","Adventure","Fantasy","GameLit","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"A Homeless Girl by the name Lana gets her hands on a thrown away headset for an all New Virtual reality game called Worlds End Online, Luckily for Lana the headset works and she is able to experience playing her first ever video game. Follow Lana as she gets to explore a entire new Fantasy World, and experience so many new things in this world that she previously couldn’t due to her homelessness.","description_hash":-4913477546037694204},{"title":"A Human's Journey","fiction_id":"87906","link":"https:\/\/www.royalroad.com\/fiction\/87906\/a-humans-journey","tags":["Super Heroes","Psychological","Male Lead","Tragedy","Action","Fantasy","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":43,"chapters_count":1,"last_update":1717614124,"description":"What if? What if heroes were not made but born. What if the mythological legends were real and it has been kept a secret from the majority of the world. And the legend of a great hero and his unexpected journey in uncovering the corrupt actions keeping this secret unknown.","description_hash":-3746802686198789253},{"title":"Hopeless Dream","fiction_id":"87905","link":"https:\/\/www.royalroad.com\/fiction\/87905\/hopeless-dream","tags":["Comedy","Male Lead","Tragedy","Action","Romance","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":44,"chapters_count":1,"last_update":1717614092,"description":"\"Michael Rose, who just turned 18 as the new year began, finds himself among millions of others summoned with a stark message: 'You shall all partake in a training for the sake of your world.' With these words, the dawn of a new world is set into motion.\"","description_hash":5904989872707282935},{"title":" Shadows of Aliriel","fiction_id":"87904","link":"https:\/\/www.royalroad.com\/fiction\/87904\/shadows-of-aliriel","tags":["Steampunk","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":45,"view_count":140,"chapters_count":4,"last_update":1717614349,"description":"In the mystical realm of Aliriel, Eamon Duskwood, a seventeen-year-old born into a lineage of revered clerics, finds himself embroiled in a harrowing battle against an insidious adversary: the Arcane Blight. Rather than embodying hope as expected, Eamon grapples with the terrifying specter of the Blight lurking within him, pushing him toward the brink of madness.\nHaunted by his fears and the ominous presence of the Blight, Eamon sets out on a perilous journey, venturing beyond the safety of Athia's confines. Across the expansive landscapes of Aliriel, he seeks ancient wisdom and confronts formidable adversaries, all in a desperate quest for a cure.\nAs Eamon delves deeper into forgotten secrets and clashes with powerful forces intent on his failure, he will meet friends and foe alike. The fate of the world and his own sanity hang precariously in the balance. With courage and determination, Eamon must navigate treacherous paths and face the darkness threatening to engulf him.","description_hash":3600598805594390959},{"title":"Silverlight","fiction_id":"87903","link":"https:\/\/www.royalroad.com\/fiction\/87903\/silverlight","tags":["Psychological","Action","Adventure","Fantasy","Magic","High Fantasy","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":54,"view_count":487,"chapters_count":10,"last_update":1717901647,"description":"A person living a dreary life wishes upon a ring they inherited for a life of magic.\nThey wake up in Celestia and begin to explore their magical new life.","description_hash":-1685127342193810165},{"title":"The Mad Gods and the Uncertain Afterlife","fiction_id":"87902","link":"https:\/\/www.royalroad.com\/fiction\/87902\/the-mad-gods-and-the-uncertain-afterlife","tags":["Comedy","Action","Adventure","Short Story","Low Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":4.0,"page_count":8,"view_count":40,"chapters_count":1,"last_update":1717612371,"description":"What happens when your premium version of the afterlife isn't all it's cracked up to be? \n\nThis is just a quick comedy I wrote a long time ago. Figured I'd post it here instead of sitting on it forever.","description_hash":-4831619143001080250},{"title":"Scars","fiction_id":"87901","link":"https:\/\/www.royalroad.com\/fiction\/87901\/scars","tags":["Post Apocalyptic","Steampunk","Male Lead","Action","Fantasy","Historical","Mystery","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":49,"chapters_count":2,"last_update":1717609847,"description":"It all happened in a flash, if you ask the elders even now what exactly had set off the chain reaction of doom; they would all reply the same way, no one knows.\nBut what they could remember were the feeling stars, the bleeding moon and the sudden drop in temperature.\nIt was soon followed by the stranger visitors, unwanted guests that the elder claimed tainted our lands. Some blamed them, saying it was their attempt to come here that led the gods to be angry. Some don't believe the gods caused this, some think it's a curse by an evil entity.\nBut there was another speculation, one so terrifying and blasphemous it dare not be spoken out loud. The gods were dead.\nThat would explain the corrupted waters, the crimson moon and the erratic climate. That would also explain the abominations that were the strange humans who came with even strange weapons and pride almost as large as the gods.\nThey destroyed our order and carved out theirs. They brought machineries and industrialization and steam, all which seemed to kill the earth even more.\nWe finally fought back, after a long while but it was no use. After we attained victory, finally managing to win the war, it turned out to be effortless. They couldn't return. When the gods had died, they took with them the bridge to cross the oceans.\nNow we are stuck with the enemy, trying to find a way to make our own bridge because this land is dying, and if something is not done, it will take us all with it.","description_hash":-4612575007345153116},{"title":"Petitions, Jam and - monsters?","fiction_id":"87900","link":"https:\/\/www.royalroad.com\/fiction\/87900\/petitions-jam-and-monsters","tags":["Comedy","Female Lead","Slice of Life","Action","Fantasy","Short Story","Supernatural","Low Fantasy"],"lable":"Original","following_count":6,"rating":0.0,"page_count":11,"view_count":124,"chapters_count":2,"last_update":1718040721,"description":"In a world where the magic of your childhood was real but only the old-timers can actually see it, who do you call about the monsters?","description_hash":2792599463496732839},{"title":"The Night Rift Manager","fiction_id":"87899","link":"https:\/\/www.royalroad.com\/fiction\/87899\/the-night-rift-manager","tags":["Urban Fantasy","Comedy","Non-Human Lead","Fantasy","Short Story","Female Lead"],"lable":"Original","following_count":8,"rating":5.0,"page_count":25,"view_count":391,"chapters_count":5,"last_update":1718410273,"description":"Participant in the June 2024 Community Magazine\nGnal has a cushy job cleaning up other people’s messes. Anytime an eldritch summoning goes wrong, she’s called in to seal the resulting rift between dimensions. While the life of a night rift manager isn’t anything glamorous, it’s predictable – and comes with perks, like novelty pens!\nThat is until a goblin on Gnal’s cleaning crew smuggles home the most abominable creature imaginable – a human baby. For the first time in her life, Gnal finds herself scrambling to clean up a mess of her own making.","description_hash":-878492704935289884},{"title":"Reincarnated as a Villainess ","fiction_id":"87898","link":"https:\/\/www.royalroad.com\/fiction\/87898\/reincarnated-as-a-villainess","tags":["Reincarnation","Time Travel","Villainous Lead","Wuxia","Female Lead","Drama","Fantasy","Historical","Romance","Secret Identity"],"lable":"Original","following_count":2,"rating":2.25,"page_count":33,"view_count":686,"chapters_count":11,"last_update":1717612416,"description":"Xi Lanyon a 21st Century Chinese doctor transmigrated into the novel as a villianess who was overshadowed by her second sister and was murdered in front of the whole kingdom since she tried to kill the empress aka her second sister since she stole her fiance.... Thinking about the story Xi Lanyon who transmigrated wanted a peaceful life where there was no schedules and no politicss... \"Why is the crown prince following me\" Go and talk to my beautiful sister who is going to be your empress, should I make them meet so that he will bless me since I made them meet","description_hash":-4118941027123009950},{"title":"Zardok!","fiction_id":"87897","link":"https:\/\/www.royalroad.com\/fiction\/87897\/zardok","tags":["Comedy","Non-Human Lead","Sci-fi","Secret Identity","Short Story","Satire","Low Fantasy","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":5.0,"page_count":7,"view_count":156,"chapters_count":1,"last_update":1717604109,"description":"It was just a typical day in the office, until Zardok got called for a Meeting Without Coffee...","description_hash":-4270166854197835367},{"title":"Whisper of the Demon","fiction_id":"87896","link":"https:\/\/www.royalroad.com\/fiction\/87896\/whisper-of-the-demon","tags":["Anti-Hero Lead","War and Military","Grimdark","Multiple Lead Characters","Action","Adventure","Fantasy","Satire","Male Lead","Magic","High Fantasy","Mythos","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":91,"view_count":440,"chapters_count":11,"last_update":1717676824,"description":"Sleep until waking up naturally, count money until the hands cramp, this is Roger's happy life.\nThe undead mage desecrated the temple... \nThe heretic desecrated the orthodoxy... \nMoney desecrated justice...\nDesire desecrated human nature...\nNote: This novel has a large number of dark elements. Well, the protagonist is a complete jerk. What I want to say is that this will be a quite wonderful story, but it needs time to unfold. People with a strong sense of justice, please leave. This is not for you. People with strong inclusiveness, please come in. Here will reveal all the evils of human nature for you.","description_hash":6427378796182199932},{"title":"Red Moon, Shaking Earth","fiction_id":"87895","link":"https:\/\/www.royalroad.com\/fiction\/87895\/red-moon-shaking-earth","tags":["Anti-Hero Lead","Multiple Lead Characters","Action","Adventure","Fantasy","Short Story","Male Lead","Female Lead","Non-Human Lead","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":15,"view_count":95,"chapters_count":2,"last_update":1717859674,"description":"It has been almost two decades since the last red moon. Our people have known peace for so long that there are those who forget that peace always ends.\nI am no such fool.\nThe red moon always rises.\nThe goblins always come.\nI will be ready.\n\nBeen eight cycles since the last earth shaking. Eight cycles since we went up top. \nIt's been long. It's been far too long. \nNot so easy these days. These days the Talls are always there. These day they wait for us, with their metal and their fire. These days the Hunt-blood flows. \nThe earth will shake again though.\nI will be ready.","description_hash":979286712239731995},{"title":"Why Can't I Stop This Dungeon From Growing?","fiction_id":"87366","link":"https:\/\/www.royalroad.com\/fiction\/87366\/why-cant-i-stop-this-dungeon-from-growing","tags":["LitRPG","Reincarnation","Dungeon","Comedy","Non-Human Lead","Adventure","Fantasy","Short Story","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":5.0,"page_count":6,"view_count":200,"chapters_count":1,"last_update":1716936962,"description":"A poor soul finds himself as a dungeon core. But, he has no idea how he landed where he is, where \"here\" even is, and has an issue with his dungeon continuing to grow even when he wants to stop.","description_hash":-4810822315794102622},{"title":"The Arrow of Ardenwood","fiction_id":"87365","link":"https:\/\/www.royalroad.com\/fiction\/87365\/the-arrow-of-ardenwood","tags":["War and Military","Action","Adventure","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":26,"chapters_count":1,"last_update":1716936948,"description":"There is a saying that is often stuck through the annals of time. Even if you've given up on your life, The Ardenwood will make you cherish it. This story follows the life of a boy born and raised in a magical forest using a bow and arrow trying to fit in in a world full of magic and swordsmen.","description_hash":1944613182963486852},{"title":"Fable of Fantasy: \"Whispers of the Enchanted Forest\"","fiction_id":"87364","link":"https:\/\/www.royalroad.com\/fiction\/87364\/fable-of-fantasy-whispers-of-the-enchanted-forest","tags":["Anti-Hero Lead","Female Lead","Action","Adventure","Fantasy","Mystery","Supernatural","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":30,"chapters_count":1,"last_update":1716936939,"description":"In a world where fairy tales are more than just stories, four unexpected heroes must unite to save the magical realm. Red, a cunning thief; Alice, a sorceress princess; Thomas, a blacksmith with a heart of steel; and Pinocchio, a wooden archer with the gift of discerning the truth. Bound by destiny and guided by the mysterious wizard Merlin, they must face the Korudi, dark fungi threatening to corrupt their reality.","description_hash":5639452853964546908},{"title":"The Convalescent","fiction_id":"87362","link":"https:\/\/www.royalroad.com\/fiction\/87362\/the-convalescent","tags":["Urban Fantasy","Psychological","Male Lead","Action","Fantasy","Mystery","Supernatural","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":40,"chapters_count":1,"last_update":1716934072,"description":"Elias is a typical young man in school whose hobbies include perusing the weird and strange, and he never thought it would get him into trouble, but when one curious book in the library seemingly curses him, he finds himself in a much different world than he was used to.","description_hash":5700582297472547181},{"title":"Destiny Unchosen: A LITRPG\/Progression Fantasy","fiction_id":"87361","link":"https:\/\/www.royalroad.com\/fiction\/87361\/destiny-unchosen-a-litrpgprogression-fantasy","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Female Lead","Action","Fantasy","GameLit"],"lable":"Original","following_count":18,"rating":5.0,"page_count":44,"view_count":1141,"chapters_count":7,"last_update":1717626735,"description":"Clio's plans to study history were shattered when she awakened as a hunter. While she didn't awaken at the very bottom of the totem pole, her stats might as well put her there. She is too weak for Malie and her ability to use mana is locked, so being a magic user is out of the question. Despite these setbacks, she is determined to make the most of it and keep up with her sister. However, her determination is tested once again when she is betrayed by those around she is left in an unknown place struggling yet again on a path she did not choose.","description_hash":-8353708585646659343},{"title":"The Book of Apotato","fiction_id":"87360","link":"https:\/\/www.royalroad.com\/fiction\/87360\/the-book-of-apotato","tags":["Post Apocalyptic","Female Lead","Horror","Romance","Mystery","Supernatural","Magic","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":63,"chapters_count":2,"last_update":1717021951,"description":"A young scientist accidentally invokes a talking potato and unveils buried family secrets as a result.\n Emily's break from academic research sees her investigating her dead grandmother's belongings. She finds her well-hidden journal and starts reading it, including a few strange incantations. That is the catalyst for the appearance of Apotato, a talking vegetable that will torment Emily by teasing her, threatening to fill her house with mashed potato in twenty-four hours in case she doesn't teach it to speak Swahili. Emily does not have the willpower needed to teach the critter, but she needs to do it - it is the only way of unwrapping the shocking truth about her grandmother's past - and her own.","description_hash":2937703942665219671},{"title":"After the Asteroid [Post-Apoc LitRPG]","fiction_id":"87359","link":"https:\/\/www.royalroad.com\/fiction\/87359\/after-the-asteroid-post-apoc-litrpg","tags":["Progression","Post Apocalyptic","Grimdark","Sci-fi","Action"],"lable":"Original","following_count":2,"rating":0.0,"page_count":59,"view_count":357,"chapters_count":7,"last_update":1717103882,"description":"Six months after an asteroid decimated Earth, Pilot woke up completely naked, shivering in the forest.\nThe plane he crashed is a wreck; the passengers condemned to a gruesome demise. His only solace is that a voice calling itself the Scavenger System has implanted a Gem inside his chest, granting him a strange Power: Animal Authority.\nAdrift in the ruined world and searching for answers, Pilot finds purpose when his strange dreams compel him to track down a girl of unfathomable power.\nWhilst Pilot navigates the dangers of New Earth, a crazed drug addict competes for political domination against a radicalised high-school bully. A lonely New Zealander makes a terrible discovery that threatens the sanctity of their new world.\n\n\n\nWhat to expect:\n- Intelligent, daring MC- Conniving antagonists and compelling supporting cast- Post-Apocalypse story set on Earth. Primarily Spain, Gibraltar, and New Zealand.- Low on the number-crunching, fresh take on Systems and LitRPG\nPosting four times a week, 7am AEST.","description_hash":-8205219937751656092},{"title":"Dreamer's Game ","fiction_id":"87358","link":"https:\/\/www.royalroad.com\/fiction\/87358\/dreamers-game","tags":["Portal Fantasy \/ Isekai","War and Military","Martial Arts","Multiple Lead Characters","Sci-fi","Action","Fantasy","Romance","Cyberpunk","Male Lead","Secret Identity","Magic","Strategy","Low Fantasy","High Fantasy","Mythos","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":0,"rating":5.0,"page_count":34,"view_count":348,"chapters_count":9,"last_update":1717526149,"description":"Earth is undergoing a Second Invasion by fantastical alien conquerors. This time, they're not leaving until they win. Ria and her group of resistors are doing their best to survive in the occupied city of Philadelphia. However, they are hindered by a narcissistic Scathan commander named Scole, who wields shadow and smoke against his enemies. In the midst of their clash a third party disrupts the paradigm of war: The Dreamer. A human with the ability to shift between realms, invoke their dreams into reality, and dive into the dreams of others. The Dreamer is the key to this grand war but he has been absent from the conflict. Despite the best efforts of the alien conquerors, the Dreamer has yet to be found. Unfortunately for everyone involved, the Dreamer is an enemy spy, a monster, a myth, and most importantly... a twelve year old boy named Leo who is quite out of his depth. Can Leo change the course of this war? Or is he doomed to fail? \n[Author's Note]: Hello dear readers. I am actively looking for cover artists and have currently uploaded an AI generated cover as a temporary fix. But, I really do value actual human art far more than LLM generated art, so I would be grateful for any referrals or offers. I'm willing to pay a good amount upon commission. \nEnjoy the story!","description_hash":8928455886788236943},{"title":"The Priestess' Vessel","fiction_id":"87357","link":"https:\/\/www.royalroad.com\/fiction\/87357\/the-priestess-vessel","tags":["Female Lead","Secret Identity","Action","Fantasy","Romance","Magic","High Fantasy","First Contact"],"lable":"Original","following_count":3,"rating":0.0,"page_count":48,"view_count":839,"chapters_count":9,"last_update":1718577980,"description":"Would you be willing to give up your whole existence for the sake of humanity? For those who are good, evil, and complete strangers? Would you be willing to give up your life for those who don’t deserve it? Agatha has always known she is the vessel of the well-known White Lotus Priestess. She has always known that people only respect and protect her because of her position as \"the vessel.\" She has come to terms with this fact, but still can't help but wonder if that is all there is to her. She knows she will one day have to give up herself so that the priestess can return, but will she be able to do it? A turn of events makes her meet new people and the outside world. Will this motivate her to go against her destiny, even if it means that humanity will have to end if she decides to do so?","description_hash":1684273734591768736},{"title":"Earth awakened","fiction_id":"87356","link":"https:\/\/www.royalroad.com\/fiction\/87356\/earth-awakened","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Anti-Hero Lead","Martial Arts","Action","Adventure","Fantasy","Mystery","Male Lead","Strong Lead","Grimdark","High Fantasy","Progression","Attractive Lead"],"lable":"Original","following_count":3,"rating":0.0,"page_count":20,"view_count":200,"chapters_count":3,"last_update":1717128972,"description":"A professor of a college, Devan was content with life. Despite his amputee status he was content with living out his adult life, teaching and solitude, everything was fine.. \n\nUntil it wasn't.\n\n Transported to what some system called the tutorial, killing each threat left and right, will Devan survive? Or even worse, will he find a thrill out of it?","description_hash":-403456227833427610},{"title":"Short Stories","fiction_id":"87355","link":"https:\/\/www.royalroad.com\/fiction\/87355\/short-stories","tags":["Psychological","Female Lead","Drama","Mystery","Short Story","School Life","Male Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":33,"chapters_count":1,"last_update":1716919218,"description":"This is an entire “mini-series” of short stories that are no where near relevant towards the story I am currently writing. They aren’t connected as they are just random short stories I have written in my journal. As I don’t have many written so far, trigger warnings include: stalking, mention of murdering, small hints of physical abuse, and possible curse words. These short stories will start off dark so far but these are to help entertain while I am in progress for my actual story.","description_hash":8097418859468463231},{"title":"COOKED POETRY","fiction_id":"87354","link":"https:\/\/www.royalroad.com\/fiction\/87354\/cooked-poetry","tags":["Anti-Hero Lead","Comedy","Male Lead","Contemporary","Drama","Satire"],"lable":"Original","following_count":0,"rating":0.0,"page_count":66,"view_count":538,"chapters_count":14,"last_update":1717823824,"description":"A chronic alcoholic and his down on his luck brother try to track down their lost job contract in hopes that their lives will change in the process.","description_hash":-1449067779563673682},{"title":"The vanguard ","fiction_id":"87353","link":"https:\/\/www.royalroad.com\/fiction\/87353\/the-vanguard","tags":["Grimdark","Male Lead","Tragedy","Action","Fantasy","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":20,"view_count":57,"chapters_count":1,"last_update":1716918532,"description":"Caelen of Skillvara A Vanguard a wandering warrior who seeks to vanquish evil will find himself on a journey that will test his resolve and spirit. He will face tyrants,a Elven prince,eldritch magic and cursed gods from the sea. this is first edition of the Vanguard saga.","description_hash":4746766970816648748},{"title":"Double Legacy","fiction_id":"87352","link":"https:\/\/www.royalroad.com\/fiction\/87352\/double-legacy","tags":["LitRPG","Progression","Super Heroes","Male Lead","Slice of Life","Action","Adventure","Fantasy","School Life","Magic","Low Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":16,"view_count":100,"chapters_count":2,"last_update":1717094535,"description":"After an unexpected genetic mutation, the world transformed beyond recognition. A new gene granting unique superpowers turned ordinary people into heroes adored by the masses. There was only one condition: each bearer of this gene could access the memories of one of their past lives.\nAiden, a seventeen-year-old teenager, found himself among the chosen. With ambitions of becoming a top superhero, he enrolled in the prestigious Hero Academy. All would be well, except for one thing—unlike everyone else, he could see two past lives. In one, he was a noble knight defending the weak; in the other, he was a harbinger of pain and destruction...\nNow, Aiden faces a daunting choice: to unravel his dual memories and choose one of his fates. Will he become a hero who saves the world, or will his path be darkened by the shadows of his past?\n\nIn this novel, you can find: character development from the beginning, exploration of secondary characters, Slice of life, a bit of gloominess, detailed descriptions of the world, classes, ranks, mutations and stats.It will be an exciting journey into an unique world of superheroes and villains, filled with new creatures, monsters, and unexpected alliances.\n\n*This is not a short story. The plot involves a long narrative.**I work on the chapters in between my studies and main job, so please I ask for your understanding regarding possible delays in chapters or minor mistakes.","description_hash":4761388463479708209},{"title":"Iring 0: The New World","fiction_id":"87351","link":"https:\/\/www.royalroad.com\/fiction\/87351\/iring-0-the-new-world","tags":["Portal Fantasy \/ Isekai","Psychological","Male Lead","Adventure","Fantasy","Horror","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":42,"chapters_count":1,"last_update":1716918494,"description":"The loss of his wife cast a deeper gloom over Adam's daily life as a gravekeeper until the arrival of a Charity Organization, which awakened him to his immense spiritual power and the existence of another dimensional layer. The Charity Organization's true nature was gradually revealed as they exploited Adam for their own sinister Cosmic goals, which were somehow linked to the Human Dimension and his wife's departure. Ultimately, Adam encountered a wandering Dragon from another Dimension, bearing a misson that requred him to save the Human Dimension","description_hash":4961840539670368385},{"title":"From Nowhere to Sender Vol 1 (Revised Edition)","fiction_id":"87350","link":"https:\/\/www.royalroad.com\/fiction\/87350\/from-nowhere-to-sender-vol-1-revised-edition","tags":["Progression","Strategy","Multiple Lead Characters","Action","Adventure"],"lable":"Original","following_count":1,"rating":0.0,"page_count":29,"view_count":155,"chapters_count":3,"last_update":1718088186,"description":"There are three things one must ask themselves before disembarking a Crusader for the first time and last times. Is this destination a place you want to be, a place you need to be, or simply a place TO be? Your first step will be differentiating the three, making your second the first step into a new destination. Those incapable of making this distinction having been discarded during the journey.\nLux couldn't recall where those words trickled down from, but she'd disembarked from enough Crusaders over the past year of field service to get a general idea of their meaning. And she was certain that the girl from a year ago had long since vanished as a result. Though where exactly she'd been left behind who could say.\nBut there was no place for that girl on a Crusader, and no set destination for it to take her too. With nowhere to send her, Lux would have no choice but to grow into her next destination. Wherever that might be...","description_hash":4697568213943286442},{"title":"Evarus Falls","fiction_id":"87349","link":"https:\/\/www.royalroad.com\/fiction\/87349\/evarus-falls","tags":["Virtual Reality","Portal Fantasy \/ Isekai","Female Lead","Sci-fi","Adventure","Fantasy","GameLit","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":27,"view_count":140,"chapters_count":3,"last_update":1718061482,"description":"A YA science fantasy \/ video-game-world Isekai\nSadie aspires to become a pro gamer in the world’s only fully immersive VR MMORPG. Only the world is more real than she knows and elite players physically travel to cyberspace to play instead of using VR gear. When her mother is kidnapped within the game, Sadie is sucked into cyberspace with no way to log out and an ultimatum from the kidnapper, and creator of the game—return an in-game item her parents stole or see virtual reality collapse, with the people inside it.\nNew chapters Mondays","description_hash":1969473801973584976},{"title":"Stars and Flares","fiction_id":"87348","link":"https:\/\/www.royalroad.com\/fiction\/87348\/stars-and-flares","tags":["Male Lead","Action","Adventure","Romance"],"lable":"Original","following_count":1,"rating":0.0,"page_count":10,"view_count":213,"chapters_count":5,"last_update":1717024015,"description":"Will the sudden chaos be able to prevent Alan and Elliot from coming together? They thought everything was going well until zombies appeared out of nowhere, causing them to become separated. However, it appears that neither of them wants to talk about how they split up. Even though it appears that fate has brought them back together. Maybe fate has something else in store for the two of them.","description_hash":3967557417718048364},{"title":"My Boss's Baby","fiction_id":"87347","link":"https:\/\/www.royalroad.com\/fiction\/87347\/my-bosss-baby","tags":["Urban Fantasy","Multiple Lead Characters","Drama","Horror","Romance","Mystery","Non-Human Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":56,"view_count":398,"chapters_count":9,"last_update":1718484661,"description":"Madelynn Fisher thought she had it all figured out. She had her own apartment, and was had her dream job all lined up. Which was a lot in Dark City, especially for a pixie. However, at least half of her reality when down hill when her boss called to tell her the promotion had gone to an outside hire. Devastated, she went to a bar to drown her sorrows and see if she could find anything to distract her. This distraction came in the form of Damien Sullivan, a tall, handsome elf who was even willing to leave with her! \nAfter a passionate weekend together, Madelynn feels ready to face the man who took her job. But to her complete horror, the outside hire is none-other-than Damien himself! From that moment on, it is a downhill power of dominance between the two. To top it off, Madelynn finds out she's pregnant a few weeks later - and only Damien can be the father!\nWhile she struggles with the implications of sleeping with her superior, even if she didn't know it, she meets Raymond Leaf-Trasher, a mountain troll detective working for the Fae Bureau of Magical Investigation. Raymond is hunting a serial killer who is only targeting Pixie women, so after a chance meeting, he keeps an eye on her. \nNow she has Damien and Raymond both vying for her heart, let alone just her attention. As well as the danger that lurks around every corner in the form of the unhinged serial killer roaming the streets. All while Pregnant with a capital P.","description_hash":-11045642520452980},{"title":"The Book of Creation ","fiction_id":"87346","link":"https:\/\/www.royalroad.com\/fiction\/87346\/the-book-of-creation","tags":["Portal Fantasy \/ Isekai","Time Loop","Urban Fantasy","Super Heroes","Strategy","Action","Adventure","Fantasy","Sci-fi","Cyberpunk","Supernatural","Male Lead","Strong Lead","Secret Identity","Magic","High Fantasy","Steampunk","Time Travel","Hard Sci-fi","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":1,"rating":0.0,"page_count":64,"view_count":645,"chapters_count":12,"last_update":1718537402,"description":"A book That Creates reality or a whole Universe! \n\nA College student Named \"Jay\"\n       His hands got on that book and now \nHe can do what ever he wants! What ever means WHATEVER 🌚. \n\nAnd also he becomes The god of all the universes that he made! \n\n{See the story to see more~😏 and also stick with us to recieve the letest update first 😉}","description_hash":-5283076124071203456},{"title":"Misfit Monsters (Pack of Outcasts #1)","fiction_id":"87345","link":"https:\/\/www.royalroad.com\/fiction\/87345\/misfit-monsters-pack-of-outcasts-1","tags":["Urban Fantasy","Comedy","Multiple Lead Characters","Harem","Adventure","Fantasy","Romance","School Life","Supernatural","Female Lead","Non-Human Lead","Magic","Low Fantasy"],"lable":"Original","following_count":4,"rating":0.0,"page_count":50,"view_count":341,"chapters_count":6,"last_update":1718139650,"description":"One last chance to prove they're more than monsters...\nI spent most of my life under a sorcerer’s thumb, wielded as a weapon. Now that I’m free, all I want is to spread enough joy to make up for the pain I've caused.\nSo it'd be nice if my emotion-absorbing powers would stop going haywire.\nNo one’s quite sure what I am or how to get my outbursts under control. When I start blitzing my fellow monsters as well as mortals, the authorities of the supernatural world give me a final opportunity to avoid banishment and starvation.\nIf I want to make amends, I’ve got to join three other misfit monsters on a dangerous mission no one wants to take. Strange creatures are attacking innocent humans, and we have to stop their rampage.\nIt’s up to me, a frigid winter fae, a brutal basilisk shifter, and a chaotic kitsune to figure out what’s gone wrong—and fix it. Which would be a lot easier if my teammates didn’t see me as a ditzy pipsqueak rather than a colleague. And if they weren’t so distractingly, deliciously handsome.\nUm, don’t tell them I said that part.\nI’m sure my cheerful optimism will win them over so we can all get back home in one piece. That is, as long as I don’t blow us all up along the way...\n*This is the first book in a light-hearted reverse harem urban fantasy series featuring a plucky heroine with chaotic powers, morally grey monstrous men, and a paranormal catastrophe none of them were prepared for. If Suicide Squad and Stranger Things had a baby in a paranormal reform school, you'd get Misfit Monsters.*","description_hash":-8014397701638236641},{"title":"Apocalypse, Fairies, and Demons","fiction_id":"87344","link":"https:\/\/www.royalroad.com\/fiction\/87344\/apocalypse-fairies-and-demons","tags":["Post Apocalyptic","War and Military","Psychological","Multiple Lead Characters","Action","Adventure","Fantasy","Supernatural","Male Lead","Non-Human Lead","Magic","Low Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":29,"chapters_count":1,"last_update":1716909296,"description":"Apocalypse ,Fairies, and Demons is a quick paced story following the experiences of Jake Hansen, a young man that watched the world his parents grew up in crumble around him when he was still just a child. After humanity lost everything to the nightmares and legends that had for so long been laughed off as superstition and and relics of humanity's naive past, they now seek to find a place for themselves in the new world. Jake will have to fight to carve out a place for him and his friends in this new hostile world while the increasing aggression of the near bye Fae Enclaves puts him and their group of survivors at risk and mysterious circumstances begin to lead him to question his past and the collapse of human civlization.","description_hash":7949424045863515751},{"title":"Solderor: From Soldier to Emperor in Another World ","fiction_id":"87343","link":"https:\/\/www.royalroad.com\/fiction\/87343\/solderor-from-soldier-to-emperor-in-another-world","tags":["Portal Fantasy \/ Isekai","Ruling Class","Male Lead","Slice of Life","Harem","Action","Adventure","Fantasy","Romance","Reincarnation","Strong Lead","Magic","High Fantasy"],"lable":"Original","following_count":9,"rating":5.0,"page_count":79,"view_count":1304,"chapters_count":12,"last_update":1718141273,"description":"If someone asks me about my secrets, I could say, without exaggeration, that I have too many.\n \nOf course, secrets are secrets, so I couldn't disclose them. But memories would come to mind of when I wasn't called Rendal. Memories of my dog, Alexander the Great, and of my past life on a planet called Earth.\n \nI would also recall the way I died and the strange sensation that the event that caused my death still hasn't ended.\n \nNeither can I talk about the strange power I discovered in this new world. My mentor has forbidden me from doing so; according to her, it could even make me a god... Personally, I would settle for getting a stable job.\n \nAnd what better job than that of a high-ranking soldier in times of peace? Maybe I could even earn a small position in the nobility! Well, perhaps that's asking too much.\n \nFirstly, to ascend in the ranks, having been born a mere villager, I need to excel in times of war...\n \nThe problem is, as you may recall, I can't freely use my magic. I can't even use my sword, my family's heirloom. Why? Well... that's also a secret.","description_hash":-2476051071301109277},{"title":"DBZ: New Game Plus","fiction_id":"87342","link":"https:\/\/www.royalroad.com\/fiction\/87342\/dbz-new-game-plus","tags":["LitRPG","Time Travel","Martial Arts","Male Lead","Strong Lead","Action","Adventure","Fantasy"],"lable":"Fan Fiction","following_count":14,"rating":4.5,"page_count":59,"view_count":922,"chapters_count":6,"last_update":1718159536,"description":"To ever believe the gods had his best interest in mind was the most idiotic belief Vidar ever had. Summoned to be a Time Patroller, he is cursed and rejected even after spending decades loyally serving them. Therefore, he will make a wish. A wish to be thrust back to the beginning, his sights set on toppling the divine hierarchy.\n\"A game?\" Although muffled by the god's vice-like grip, Vidar lightly chuckled. \"It always has been.\"\n\nUpdates are on Mondays, Wednesdays, and Fridays.","description_hash":-738088171129243129},{"title":"Lose","fiction_id":"87341","link":"https:\/\/www.royalroad.com\/fiction\/87341\/lose","tags":["LitRPG","Urban Fantasy","Grimdark","Multiple Lead Characters","Action","Adventure","Fantasy","Horror","Magic","High Fantasy","First Contact","Dystopia"],"lable":"Original","following_count":1,"rating":0.0,"page_count":29,"view_count":115,"chapters_count":3,"last_update":1717434084,"description":"\"Certainly, we are in a constant state of loss.\"\nThe loss of humanity, the loss of morality, the loss of sanity. Set in the backdrop of a near apocalyptic event, we - the readers - are dropped into worlds to experience first hand the spiraling downfall of man. But will we? \nThey say, 'In the darkest of days, and the coldest of nights, one shall truly see how bright they really shine.\" So join us, dive deep into the complexities of mankind. Stare deep into the abyss, and let the abyss stare back at you - look into your soul, at night.","description_hash":-5587663703614408744},{"title":"Secondhand Karma | Re: Forest & Fire","fiction_id":"87339","link":"https:\/\/www.royalroad.com\/fiction\/87339\/secondhand-karma-re-forest-fire","tags":["LitRPG","Reincarnation","Dungeon","Female Lead","Slice of Life","Adventure","Fantasy","Magic","High Fantasy","Progression"],"lable":"Original","following_count":3,"rating":0.0,"page_count":56,"view_count":381,"chapters_count":8,"last_update":1718629251,"description":"Secondhand Karma | Re: Forests & Fire\nBorn to Dream, Reborn to Adventure - Adventure & Fantasy\n\nSecondhand is an idiom that means something has been owned or used by someone else and is not new. Karma is the sum of a person’s actions in life and is viewed as a deciding factor in their next existence.\n\nInvesting her karma, Marsha buys a consultation before reincarnating into her second life in a fantasy world. During the discussion, she chooses to be born to a couple with infertility instead of investing her karma into more power. Passing her karma on to her parents and twin brother, will Marsha regret her compassion once she meets them?\n\nChapters will TRY to be regular, Monday Releases. Information may change.\nhttps:\/\/www.patreon.com\/sweetpea96_stories\n*Updated June 4, 20204* Gender couldn't be decided, so different options were tested. The gender bender tag has been dropped. The conflict\/pressure explored fits better with a female main character.","description_hash":-6835400584598368193},{"title":"Bright Eye","fiction_id":"87337","link":"https:\/\/www.royalroad.com\/fiction\/87337\/bright-eye","tags":["Urban Fantasy","Progression","Anti-Hero Lead","Male Lead","Slice of Life","Adventure","Drama","Fantasy","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":76,"chapters_count":1,"last_update":1716867130,"description":"[Title is a WIP] \nThe stars aligned multiple times before his birth and again on the day he was born. Yet, as far as anyone outside his own mind knew—and for those few who might believe him—Marley came into existence just like everyone else.\n—\nMarley wasn’t like many of his classmates at Covenwood. Introverted—avoidant, more accurately—he hid from others unless absolutely necessary, giving rise to rumours among his peers. Nothing malicious, he didn't think, just whispers: mute, secretive, asshole.\n\nMarley also had a rather strange appearance, albeit only strange because those around him ranged from the ages of 12 to 17. His brown hair was streaked with ginger and white, a trait he inherited from his mother but shared with none of his six siblings.\n\nBut what truly set Marley apart was his magic. He could see what others could not and had long given up trying to explain it. He saw people's souls and their lack thereof. He perceived the darkest corners of their beings, their purities, blessings, and secrets, all with one long stare. (He exaggerated this a bit, but it didn’t matter—no one ever believed him.)\n—\nMarley was not part of any prophecy. The stars never called his name, never aligned to form his destiny, never etched sigils into the palms of his hands. He was perfectly content to stay as far away from the action as possible, as the stars had not decreed it, thank you very much.","description_hash":-3404959883366608012},{"title":"Kingdom Of Wracralan","fiction_id":"87335","link":"https:\/\/www.royalroad.com\/fiction\/87335\/kingdom-of-wracralan","tags":["War and Military","Female Lead","Drama","Action","Mystery","Male Lead","Strategy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":46,"chapters_count":1,"last_update":1716857643,"description":"After over 500 years of slavery and savagery of Wracralan by the hands of Cesar Talgus(when he killed the second ruler and took over) the 3rd bearer of Wracralan, Hagred Bryneiros and Mildred Bryneiros(his wife) brought Wracralan to a state where it was  at least livable, after the king of a neighboring kingdom called Marth Villalobos of the Aipiral Dynasty signed a contract with Wracralan. This contract entails a trade agreement where Wracralan would transport some valuable minerals that is present in their location and in return, the Aipiral Dynasty agreed to help them with development. In the meantime, both potential successors of Wracralan, Argo Bryneiros and Myra Bryneiros are in feud to become the successor, after the mysterious death of their brother.\n(This story is based on a fictional world and does not have anything to do with real-time events.)","description_hash":-4494745370819238675},{"title":"The Great Mother Tree ","fiction_id":"87334","link":"https:\/\/www.royalroad.com\/fiction\/87334\/the-great-mother-tree","tags":["Comedy","Drama","Action","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":34,"chapters_count":1,"last_update":1716854823,"description":"In the world of Ashtier, the hands of justice sway while the horns of progress sound, heralding a time where sacrifice becomes the key method of ushering in a time of true stability. \nAmidst this era, Kita and her sister Regale, Rynths of Misquare, witness a new chapter unfold in the great and sacred land. \nMeanwhile, Sindrina, a princess of Shalo City in the great land of Lionstear, grapples with a unique condition that puts her life in jeopardy.\nDeeper within the chaos, Amanui struggles with the transformative changes in his life as he faces the daunting task of completing the crossing rite, a longstanding tradition for the men of his people. \nAs the world evolves, stories arise and fall, yet the question remains: how will their stories truly unfold?\nWelcome to Ashtier, the land born from the ashes of old, brought to life by the Great Mother who watches over all things current and passed.","description_hash":2457584577531501962},{"title":"Power and Desire","fiction_id":"87333","link":"https:\/\/www.royalroad.com\/fiction\/87333\/power-and-desire","tags":["Reincarnation","Time Travel","Progression","Anti-Hero Lead","Xianxia","Fantasy","Male Lead","Strong Lead","Villainous Lead"],"lable":"Original","following_count":6,"rating":4.9,"page_count":74,"view_count":2425,"chapters_count":25,"last_update":1718087568,"description":"In a world where Karma was real, where sinners truly faced divine punishment, you would expect there to be peace, would you not? But things are never that simple.\nSome people devote themselves to the art of fooling Karma and their sins go unseen. They are hated by much of the world, who call them brutes, monsters and of course, demons.\nBut a true demon is not merely a wicked man, a true demon is the bane of Karma itself. Demons are the only beings who are free to do as they please, the only beings who can sin without consequence. \nThis is the story of a demon, the story of Seifer Nox and his journey to the top.","description_hash":7272105415319389520},{"title":"Eternal Darkness","fiction_id":"87332","link":"https:\/\/www.royalroad.com\/fiction\/87332\/eternal-darkness","tags":["Martial Arts","Psychological","Male Lead","Tragedy","Action","Fantasy"],"lable":"Original","following_count":1,"rating":5.0,"page_count":120,"view_count":1085,"chapters_count":21,"last_update":1718230373,"description":"The life story of a little boy forced to live in a small hut.","description_hash":-1856546572676702876},{"title":"Refusing the Demon’s Proposal Thousands of Times","fiction_id":"87331","link":"https:\/\/www.royalroad.com\/fiction\/87331\/refusing-the-demons-proposal-thousands-of-times","tags":["Non-Human Lead","Drama","Adventure","Fantasy","Romance","Supernatural","Female Lead","High Fantasy"],"lable":"Original","following_count":5,"rating":3.75,"page_count":101,"view_count":1670,"chapters_count":21,"last_update":1718575233,"description":"Anna, who had crossed into another world, found herself relentlessly pursued by a demon who constantly possessed different people to propose to her.\nWith her own cheat abilities allowing her to see through everything, Anna was deeply moved but repeatedly turned him down.\n—So, when will he finally leave her alone??\nThe Abyssal Duke, Demon Rotgar, needed to get a hundred human women to agree to marry him within six months to win a bet with his friend. Unexpectedly, the first human woman he encountered in the human world rejected him outright.\nDidn't like the handsome lord's son? What about the young genius mage, or the noble and pure temple's holy son?\nYet... that human woman rejected him every single time!\nEnraged and humiliated, Rotgar became fixated on her.\nSix months later... Rotgar lay humbly on the ground, kissing Anna's instep, his blood-red eyes dazed as he looked up at her, panting, \"Please punish my insolence...\"\nAnna: \"...\" When he comes to his senses, I'm dead for sure!\nWhatever! I would rather die than surrender!","description_hash":-3738766165993179090},{"title":"Tainted Genesis: The Silent Dawn","fiction_id":"87330","link":"https:\/\/www.royalroad.com\/fiction\/87330\/tainted-genesis-the-silent-dawn","tags":["Post Apocalyptic","Female Lead","Fantasy","School Life","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":6,"rating":4.5,"page_count":40,"view_count":404,"chapters_count":6,"last_update":1718568009,"description":"Bumble has lived her whole life hidden away from the human world, guided only by her guardian, Alaric, in a secluded forest sanctuary. Now, Alaric believes she's ready to face a new adventure-human society. Thrust into the complexities of high school, Bumble must navigate this unfamiliar terrain, where every interaction is a lesson and every challenge a test of her upbringing. As she struggles to adapt to the broader world's intricacies, will Bumble manage to hold true to herself amid the chaos of her new life?\n---\nThe drawing was created using Dall-E.\nNew chapter every Wednesday and Sunday around 23.00 - 00.00 (UTC+03:00)","description_hash":-7663053040774871755},{"title":"THE HANGED WOMAN","fiction_id":"87329","link":"https:\/\/www.royalroad.com\/fiction\/87329\/the-hanged-woman","tags":["Psychological","Female Lead","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":28,"view_count":41,"chapters_count":1,"last_update":1716852683,"description":"Eva has lived a decent life. It was love and marriage that saved her from herself, over a decade ago. Now, she enjoys a normalcy she once only dreamed of attaining. But when a trip to Scotland goes wrong, and old demons rear their heads in the shadows, she stands to lose everything she's fought so hard to gain.","description_hash":-6848812912975281096},{"title":"the search of immortality","fiction_id":"87328","link":"https:\/\/www.royalroad.com\/fiction\/87328\/the-search-of-immortality","tags":["LitRPG","Portal Fantasy \/ Isekai","Time Loop","Urban Fantasy","Post Apocalyptic","Action","Adventure","Fantasy","Contemporary","Slice of Life","Supernatural","Male Lead","Non-Human Lead","Magic","GameLit","Low Fantasy","Time Travel","Technologically Engineered"],"lable":"Original","following_count":7,"rating":3.62,"page_count":137,"view_count":3112,"chapters_count":36,"last_update":1718591222,"description":"in the 2024 the system of dreams is activated in the earth, a system that help any body to accomplish they dreams, but also demands to fight against the lorgs, monsters from other universe that invade the universe, our mc have panic to dead and start an adventure to reaches all the kinds of immortality","description_hash":-4223843666218541734},{"title":"A Nightwalker's Darkness","fiction_id":"87327","link":"https:\/\/www.royalroad.com\/fiction\/87327\/a-nightwalkers-darkness","tags":["Progression","Anti-Hero Lead","Grimdark","Action","Adventure","Fantasy"],"lable":"Original","following_count":5,"rating":4.5,"page_count":183,"view_count":1723,"chapters_count":20,"last_update":1718323205,"description":"~A Royal Road Original~\n\nYou might have heard tales of Yoki. A name spoken in hushed tones, often seen disappearing into the shadows. Starting as a young boy defending a stranger in a desolate alley, he now traverses a path marked by Tearings, serial-killings, and ancient prophesies.\nYoki trained his entire life for the single purpose of attending The Academy. He didn’t know what he was training for, but he trusted in his father. Yet, despite his rigorous preparation, nothing could fully ready him for The Academy. From the entrance tests to the graduation trials, every step was a new challenge. And all along, Yoki is shadowed by the haunting presence of the Painkiller, a specter of his past and a guide in his darkest hours.\nYoki’s story is one of tragedy and transformation, where friends may turn to foes, and myths are not just stories but living things. He’s danced with the dead, challenged the elements, and learned from masters whose names are lost to time. Yet, throughout it all, he is trying to harness the chaos within himself, but will he be consumed by the very darkness he battles?\nAfter losing everything, including who he thought he was, Yoki is forced down a path he has no say in. The only thing he can choose is who to listen to. . . and who to believe.\n\nSince I've had a few questions about it, yes, there will be a time when Yoki goes to The Academy. ACT I and ACT II are the backstory to develop Yoki's character. ACT III will be when Yoki first goes to The Academy. There will be five ACTS to book 1, with the climax being in ACT IV.","description_hash":8715555592698772624},{"title":"To be Human","fiction_id":"87326","link":"https:\/\/www.royalroad.com\/fiction\/87326\/to-be-human","tags":["Urban Fantasy","Comedy","Male Lead","Slice of Life","Action","Fantasy","School Life","Supernatural","Low Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":43,"view_count":546,"chapters_count":7,"last_update":1718572177,"description":"What happens when your humanity is so strong it overpowers any attempt at turning you into a supernatural creature?\nWhen Robin Blackwell's parents die leaving him a very wealthy orphan a previously unknown uncle shows up in his life. Far from wanting anything to do with Robbie's riches, his uncle Foster offers Robbie a chance to live with him in a small town of which Foster is a mayor. That's how an unbelievable adventure full of magic and supernatural creatures begins for the boy. Only... why did he not turn into a werewolf after being bitten? And how is he going to survive as the only human in a fully supernatural town? Follow Robbie as he struggles to make friends, do his homework on time and live up to his uncle's expectations.","description_hash":6634012841618823224},{"title":"Please Don’t Serve Me On A Platter!!","fiction_id":"87324","link":"https:\/\/www.royalroad.com\/fiction\/87324\/please-dont-serve-me-on-a-platter","tags":["Dungeon","Villainous Lead","Female Lead","Fantasy","Horror","Romance","Mystery","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":43,"view_count":398,"chapters_count":8,"last_update":1718303403,"description":"An office lady somehow got reincarnated into the game she was working on as the villainess who destined to die miserably in the End. Oh what should I do!? Run away or- huh why is the heroine keep looking at me like that?","description_hash":3548632398918910939},{"title":"Becoming Hokage","fiction_id":"87323","link":"https:\/\/www.royalroad.com\/fiction\/87323\/becoming-hokage","tags":["Reincarnation","Progression","Anti-Hero Lead","War and Military","Martial Arts","Action","Adventure","Drama","Psychological","Male Lead","Strategy"],"lable":"Fan Fiction","following_count":5,"rating":0.0,"page_count":9,"view_count":127,"chapters_count":2,"last_update":1716997482,"description":"A guy is reborn as a five year old in Konoha.","description_hash":753750387167441900},{"title":"Zombie Rebirth","fiction_id":"87322","link":"https:\/\/www.royalroad.com\/fiction\/87322\/zombie-rebirth","tags":["LitRPG","Urban Fantasy","Progression","Anti-Hero Lead","War and Military","Action","Adventure","Comedy","Fantasy","Martial Arts","Supernatural","Male Lead","Strong Lead","Non-Human Lead","Magic","Low Fantasy","First Contact"],"lable":"Original","following_count":9,"rating":0.0,"page_count":37,"view_count":405,"chapters_count":6,"last_update":1718409605,"description":"Death isn't the end, not for Alabaster Blackwood. In fact, death is only the beginning. Reborn as a Zombie during the first incursion on Earth as the System Initiation occurs, he is the first. Not just in the world, but the greater universe. What will it take to return his humanity, and when he gets there, will he even want it back?","description_hash":-6605750641998030812},{"title":"Ruinhunters","fiction_id":"87321","link":"https:\/\/www.royalroad.com\/fiction\/87321\/ruinhunters","tags":["Reincarnation","Dungeon","Strategy","Action","Adventure","Fantasy","Mystery","Magic","High Fantasy","Progression"],"lable":"Original","following_count":1,"rating":0.0,"page_count":21,"view_count":109,"chapters_count":2,"last_update":1717160787,"description":"A world long left to ruin by a demon run rampant, slain by the world hero Gerard, an inspiration to adventurers far and wide including a little boy known by the name of Kaluar, join his journey as he traverses the region to make his dream reality, to travel the world and become a great RuinHunter.","description_hash":-5924425511192399071},{"title":"Atsip: A Sárkányfog odüsszeiája (Hungarian)","fiction_id":"87320","link":"https:\/\/www.royalroad.com\/fiction\/87320\/atsip-a-sarkanyfog-odusszeiaja-hungarian","tags":["Time Loop","Post Apocalyptic","Adventure","Fantasy","Historical","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":28,"chapters_count":1,"last_update":1716852041,"description":"Egy viking hajó és legénysége viharba kerül, majd olyan dolgokat fedeznek fel, amelyek miatt az egész világnézetük összeomlik. Kövesd végig, hogyan élik túl mindezt, és milyen kalandokba keverednek még.\nThis is the hungarian version of Atsip: The Odyssey of Dragontooth.","description_hash":-2757194266564196887},{"title":"The Eternius System","fiction_id":"87319","link":"https:\/\/www.royalroad.com\/fiction\/87319\/the-eternius-system","tags":["GameLit","Reincarnation","Time Travel","Progression","War and Military","Action","Adventure","Fantasy","Romance","Slice of Life","Male Lead","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":24,"view_count":109,"chapters_count":3,"last_update":1717105762,"description":"Very original name I know, named after Lovus Eternius, the Supreme Grand High Archlord of Creation who decided to do his own thing at the end of the universe after a cult decided to destroy all of existence.\nThe Eternius System in its infinite wisdom saw it fit to revert Lovus to his previous state and after living alone for untold aeons, he is overcome with emotion and resolves to do things better this time.","description_hash":6371261243726300508},{"title":"Journey Of Kayn","fiction_id":"87318","link":"https:\/\/www.royalroad.com\/fiction\/87318\/journey-of-kayn","tags":["Portal Fantasy \/ Isekai","Anti-Hero Lead","Action","Adventure","Fantasy","Romance","Reincarnation","High Fantasy"],"lable":"Original","following_count":3,"rating":5.0,"page_count":38,"view_count":428,"chapters_count":7,"last_update":1717058336,"description":"Jonas was born into a harsh world, with an even harsher upbringing. Growing up in poverty forced him to explore the darkest and most depraved sides of humanity. After living a terrible life of hardships, he is finally bested by the horrific plague that slowly claimed his world. He finds himself reincarnated into a world of magic with a different sort of plauge, his journey to save himself is fraught with dangers and wild encounters that he must manage while balancing his tense relationships. Just what will it take for him to live the relaxed life he has always dreamed of?\nAuthor note: This is my first novel and really want to improve so all feedback is appreciated. Hit me with all the constructive criticism you can. God bless you all thank you for taking the time to read my novel.","description_hash":-3445195495306752539},{"title":"Rags","fiction_id":"87317","link":"https:\/\/www.royalroad.com\/fiction\/87317\/rags","tags":["Anti-Hero Lead","Male Lead","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":39,"view_count":194,"chapters_count":5,"last_update":1718226048,"description":"What would happen to a child born and raised on a normal farm with a happy normal family who just plays around all day and has fun with his friend, not knowing suffering, pain or loss, what would happen if one day it was all taken away from him, his family, his friends, his place in this accursed world and his will to live, leaving nothing but a empty shell of his former self  with nothing left to fill his heart and mind but hatred and despair… that child is Yuri of Tamworth.","description_hash":7659055050863418649},{"title":"A Trek of Love and War","fiction_id":"87316","link":"https:\/\/www.royalroad.com\/fiction\/87316\/a-trek-of-love-and-war","tags":["Multiple Lead Characters","Tragedy","Drama","Historical","Romance","Male Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":21,"view_count":118,"chapters_count":2,"last_update":1716864418,"description":"Borimir Baur is a farmer living in ealry 1900s Sarajveo Bosnia. He is a hardworking man of mixed enthic backgrounds and a nationalist, deeply aganist the Empire and royalty. He has a rivalary with a young noblewomen going to a boarding school in the city named Catherine von Rosenberg. They start off as enemies, agruing about the politics of the day, and viewing one another as either inferior, or privileged. However, their more humain sides begin to show, and the two start a friendship, which leads to a romantic interest. Just as they are becoming close, Franz Ferdinand is assassignated in Sarajevo, causing WW1. Borimir is sent to the eastern front, and Catherine and her family flee to Salzburg. From there is is about a journey for the two to reunite, seeing the horrors of the First World War, and the presectives that each side shows.","description_hash":5930710268266411396},{"title":"The Soccer Dreams ","fiction_id":"87315","link":"https:\/\/www.royalroad.com\/fiction\/87315\/the-soccer-dreams","tags":["Multiple Lead Characters","Contemporary","Drama","Action","Sports","Male Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":37,"chapters_count":1,"last_update":1716841359,"description":"Set in future Japan. You can be either the Japanese or Indonesian new hero or player that part of team that won All Japan Middle School Soccer Tournament.  New challenge ahead as you graduated from Middle School and can choose where to play as you continue your soccer career at high school. Bring your school to win the All Japan National High School Tournament and have a chance to be scouted for U-17 National Team!\n\nI will be posting this story on RoyalRoad.com","description_hash":8418100279072268590},{"title":"Conquerors of Nimeya","fiction_id":"87314","link":"https:\/\/www.royalroad.com\/fiction\/87314\/conquerors-of-nimeya","tags":["Anti-Hero Lead","War and Military","Multiple Lead Characters","Slice of Life","Drama","Fantasy","Romance","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":21,"view_count":175,"chapters_count":5,"last_update":1717012803,"description":"A world at war.\nA country in turmoil.\nA dreaded family secret.\n\nTen years ago, Greysen Lraksen escaped the chaos of North Aulvania for the relative safety of the Kurrith Empire. There, he found hope and love, dreaming of a peaceful future. But those dreams are shattered when he receives a message from home: his father, a legendary explorer has died. Despite his desire to stay away, North Aulvania, rife with conflict and dark memories, calls him back. Greysen must face his past and the shadows that linger in his homeland.\nToma Kaggervon Lraksen has always felt out of place. Her mixed heritage makes her an outsider in a society that doesn't accept her, and her unique ability to perceive the world in extraordinary ways isolates her further. When her father dies suddenly, Toma is left alone, struggling to understand herself and her abilities. Her world is turned upside down when a stranger from her father's past arrives, revealing secrets that challenge everything she knows. This stranger opens a gateway to a world of unimaginable wonders and horrors. As North Aulvania teeters on the edge of civil war and chaos, Greysen and Toma's paths cross in a whirlwind of intrigue and peril. Together, they must navigate a treacherous landscape, unearth hidden truths, and confront the ancient curse that threatens their lives and their world. Can they unravel the mysteries of their pasts and forge a new future, or will the darkness consume them both?\n\n\nFor readers who enjoy cozy, slice-of-life, fantasy epics, 'Conquerors of Nimeya' is set in an old timely fantasy world reminiscent of our late 19th and early 20th century.\nAuthor's note: This ongoing story is complete! If you're worried about author abandonment--do not, fret! If you would like to follow along as the story progresses, two chapters will be released every three days. So without further ado, please enjoy the story and feel free to comment on anything that sticks out to you!Enjoy!","description_hash":8343341650002049055},{"title":"The Outsiders","fiction_id":"87313","link":"https:\/\/www.royalroad.com\/fiction\/87313\/the-outsiders","tags":["Portal Fantasy \/ Isekai","Martial Arts","Adventure","Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":2,"view_count":47,"chapters_count":1,"last_update":1716841181,"description":"Two best friends teleported to fantasy world with different path. They must choose on how to go home and helping that world. Can they make it together? Or will they choose different path...","description_hash":8695368582451323720},{"title":"Welcome to the O.M.G.","fiction_id":"87312","link":"https:\/\/www.royalroad.com\/fiction\/87312\/welcome-to-the-omg","tags":["LitRPG","Portal Fantasy \/ Isekai","Urban Fantasy","Progression","Post Apocalyptic","Action","Adventure","Comedy","Fantasy","Cyberpunk","Slice of Life","Supernatural","Male Lead","Strong Lead","Non-Human Lead","Magic","Anti-Hero Lead","Grimdark","GameLit","High Fantasy","Super Heroes","Mythos","War and Military","Ruling Class","Soft Sci-fi","Dystopia","Attractive Lead"],"lable":"Original","following_count":9,"rating":4.5,"page_count":155,"view_count":2472,"chapters_count":28,"last_update":1718472600,"description":"Old, Tired and Broke, I found a new lease on life. In a moment of peace, I was pulled into a larger game. From Nightmare Clowns and Faerie Castles to Space Pirates and Cyber Cities. Do I want to return home? Obtain Power? Have Fun until another end comes? Sure why not.\n6\/8\/24 - Okay, I'm gonna state this here. While I'm trying to create a cohesive write style, think of this less as a book or serial story and more as me running an campaign using a metric  load of homebrewed randomization charts, from 30+ years of GM notes and charts and stories, kludged together from many, many sources.\nAnywhere something random or strange happens or in some cases explicitly stated as such are dice rolls.\nI will abide by the rolls, regardless of whether I want to or not. Yes, there are combinations of rolls that could lead to the MCs death, or worse. If it happens, I'll start a new story with the same framework in place.\nAlso there are words, I am avoiding as a challenge to myself. Try to guess what that are, as a fun minigame if nothing else.\nFurther Notes: I would like to reference some of my favorites games and books, but also try to keep it legally distinct as they say. So since, I suck at naming things I'll probably be creating some incredibly goofy names as parodies.\nSex will probably occur, I will probably do the fade to gray. Or not, and I'll embarrass myself by writing bad lemon. \n\nBook Cover is a Placeholder and Just to Cover the Bases:Image is by Elijah Hiett onStock SnapEdited with BeFunkyRequests, Issues or Concerns email [email protected]","description_hash":6848200456724538687}]