[{"title":"My Journal","fiction_id":"87036","link":"https:\/\/www.royalroad.com\/fiction\/87036\/my-journal","tags":["Urban Fantasy","Dungeon","Contemporary","Adventure"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Just a fun journal for me to wright in. I'll post daily so why don't you hop on over!","description_hash":-7121008284102298191},{"title":"A Champions Tale: Rise, Fall, And Rise Again","fiction_id":"87035","link":"https:\/\/www.royalroad.com\/fiction\/87035\/a-champions-tale-rise-fall-and-rise-again","tags":["Male Lead","Contemporary","Slice of Life","Sports"],"lable":"Fan Fiction","following_count":3,"rating":0.0,"page_count":12,"view_count":186,"chapters_count":2,"last_update":1716811277,"description":"Meet Leonard \"Leo\" Elliot. 2022 Formula 2 Champion. Normally, that would be an achievement to brag about. But now its almost the start of the 2025 season, and Leonard's been left out to dry. However, that all changed on one faithful morning. Follow the career of Leonard as he ventures into the world of Formula 1 Racing.","description_hash":7754769889877828118},{"title":"[Enchantress] Eternal","fiction_id":"87034","link":"https:\/\/www.royalroad.com\/fiction\/87034\/enchantress-eternal","tags":["LitRPG","Progression","Strategy","Female Lead","Sci-fi","Action","Adventure","Fantasy","Strong Lead","Magic","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":966,"rating":4.09,"page_count":202,"view_count":41478,"chapters_count":23,"last_update":1718546824,"description":"Toki’s killed a dragon - can she survive the fallout?\nIn integrated space, dragonslaying means loot and lawyers. With system admins, bounty hunters, and her own family fighting for the rewards, Toki will need to grow stronger to survive. Much stronger.\nAfter all, there’s no such thing as a garden-grown [Enchanter].\n\nRead chapter 1 >>\n\nReaders can expect:\nCat lawyers, sushi chef pirates, violence, and crafting\nWeak to very strong progression (with both cultivation and system growth elements)\nComplex, flawed characters who make mistakes and grow throughout the long story\nA balance of action, worldbuilding, mystery, and crafting\nVast universe with conflict, threats, and world building (with easter eggs from Will of Whispers).\nMany tropes, some subverted","description_hash":-5882199317422962917},{"title":"Shadow's Point","fiction_id":"87033","link":"https:\/\/www.royalroad.com\/fiction\/87033\/shadows-point","tags":["LitRPG","Reincarnation","Multiple Lead Characters","Action","Adventure","Female Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":56,"chapters_count":1,"last_update":1716425193,"description":"A ploy for revenge thrusts a young girl into a world of elite assassins.","description_hash":-2157397161126336495},{"title":"Blood And Honor","fiction_id":"87032","link":"https:\/\/www.royalroad.com\/fiction\/87032\/blood-and-honor","tags":["Anti-Hero Lead","War and Military","Psychological","Male Lead","Secret Identity","Action","Mystery","Strong Lead","Strategy","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":31,"view_count":197,"chapters_count":6,"last_update":1717636208,"description":"Jun Wu is an Asian immigrant with a deep family history in one of new America's greatest tragedies, The Baker Building massacre.  He goes to visit his grandaunt, Mary, The only survivor of that incident. Her story is one the entire nation knows. But he had never heard it from her mouth. His life takes a turn he never expects. All the lies she has told to keep her identity falls on his shoulders.\nIn between government lies and bullets over his head, he must decide not if to bury bodies, but where to bury them. He must defend their family honor covered In a trail of blood.","description_hash":997703325008300038},{"title":"Gloomy Hallows","fiction_id":"87031","link":"https:\/\/www.royalroad.com\/fiction\/87031\/gloomy-hallows","tags":["Portal Fantasy \/ Isekai","Multiple Lead Characters","Action","Adventure","Fantasy","Short Story","Magic","High Fantasy","First Contact","Dystopia"],"lable":"Original","following_count":1,"rating":0.0,"page_count":3,"view_count":73,"chapters_count":2,"last_update":1716476704,"description":"When a group of people find themselves in a seemingly endless forest, what could go wrong? With daring battles, and snippets of the past being dug up over time, the crew manage to band together and survive, but not escape, the hallows.","description_hash":-3056267566561981156},{"title":"The Chronicles of Dwynveia - a Slimeling LitRPG","fiction_id":"87030","link":"https:\/\/www.royalroad.com\/fiction\/87030\/the-chronicles-of-dwynveia-a-slimeling-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Anti-Hero Lead","Grimdark","Action","Adventure","Fantasy","Gender Bender","Supernatural","Female Lead","Non-Human Lead","Magic","Progression"],"lable":"Original","following_count":12,"rating":4.0,"page_count":112,"view_count":1923,"chapters_count":14,"last_update":1718543451,"description":"[GRIMDARK] [SCIENCE-FANTASY] [TRANS FEM MC] [MONSTER MC] [PORTAL FANTASY]\nUsually, the worst you can expect during your morning commute is being stuck in traffic. Lilyth, a transgirl from Poland, wasn't so lucky. Instead, she found herself falling through an interdimensional rift into a pool of slime where her body started to dissolve. Saved by a Goddess, Lilyth is offered a chance at a new life on a new world, but before she has a chance to start it she is forced to survive in a dungeon no one was able to leave alive. Will Lilyth be the first one? Or will she fall prey to the horrors that dwell inside?\nUpdates at least once a week!","description_hash":-4808257532923132202},{"title":"Deeprooted [Dungeon Core LitRPG]","fiction_id":"87029","link":"https:\/\/www.royalroad.com\/fiction\/87029\/deeprooted-dungeon-core-litrpg","tags":["LitRPG","Reincarnation","Dungeon","Comedy","Non-Human Lead","Adventure","Fantasy","Male Lead","Mythos","Progression"],"lable":"Original","following_count":30,"rating":4.75,"page_count":11,"view_count":987,"chapters_count":3,"last_update":1716460375,"description":"Underneath a forest lies a great secret that the empires of old have already forgotten. A dark expanse that spirals down and down into the depths of the earth, each and every level beaming with unknown monsters only told in legends. The Abyss lies waiting for the one that gazes, ready to open and swallow them whole. \nBut, uh... I guess they didn't expect a tree to be their first visitor.\nFollow Trey as Trey the Tree (get it?) wrestles between keeping monsters, defending their territory, and reaching for some sunlight.","description_hash":-8176676276978170660},{"title":"Spiritbound - A Multiverse LitRPG Novel","fiction_id":"87028","link":"https:\/\/www.royalroad.com\/fiction\/87028\/spiritbound-a-multiverse-litrpg-novel","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Post Apocalyptic","Ruling Class","Action","Adventure","Fantasy","Martial Arts","Male Lead","Strong Lead","Magic","Strategy","GameLit","High Fantasy","Progression"],"lable":"Original","following_count":45,"rating":4.1,"page_count":101,"view_count":5833,"chapters_count":22,"last_update":1718391832,"description":"The apocalypse could not have come at a better time for Liam. Still reeling from his mother’s death, the descent of the System provides a welcome distraction for Liam as he delves head on into the fight against the beings that would enslave his world. Wielding the Powers of the Spirits and strengthened by the System that has taken over Earth, Liam will carve out a place for himself in this new universe one axe swing at a time.\nUpdates Monday-Friday at 3pm Est","description_hash":-3075103848138901524},{"title":"The Swordmaster","fiction_id":"87027","link":"https:\/\/www.royalroad.com\/fiction\/87027\/the-swordmaster","tags":["Progression","Male Lead","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":1,"rating":4.5,"page_count":45,"view_count":136,"chapters_count":2,"last_update":1716497924,"description":"On the continent of Artoria, your spiricasting determines your rank.\nSince the fracture 3000 years ago, the continent has been filled to the brim with powerful, supernatural entities called spirits, and with them, the humans of the time developed spirit hearts, capable of controlling and manipulating spirits to do their will.\nAnd now, 3000 years later, in a small village in the forbidden zone, a child suffers from a rare and deadly condition, causing the malfunction of his spirit heart. \nLost and outcast from society, Argus Wayfinder trains every day, for months and years on end, all to prove to the world around him that there's strength in more than just spirits.\nHe wants to prove that there's strength in the sword.","description_hash":1987552156624947843},{"title":"Mana Seeds ~*~The penthouse~*~","fiction_id":"87026","link":"https:\/\/www.royalroad.com\/fiction\/87026\/mana-seeds-the-penthouse","tags":["LitRPG","Multiple Lead Characters","Fantasy","GameLit"],"lable":"Original","following_count":2,"rating":0.0,"page_count":26,"view_count":102,"chapters_count":2,"last_update":1716440804,"description":"Kira wakes up in an unfamiliar and luxurious apartment after a night of heavy drinking with her friend Jackie. She discovers through Jackie that her ex-boyfriend had shown up, causing a scene, and had been arrested after threatening them. Due to safety concerns, Jackie insists Kira stay with her and her twin brother, Jake, and girlfriend Martha until things settle down.\nAs Kira tries to process everything, a sudden strange phenomenon occurs. A mysterious AI named Steve announces that the world has been seeded with mana to combat a looming virus. Humans have been upgraded with abilities, status screens, and the ability to sense mana. Dungeons start to appear, and the world undergoes a drastic transformation.\nNow, Kira and her friends must navigate this new reality, fighting monsters, leveling up, and uncovering the truth behind the virus threat.","description_hash":7679612965432594906},{"title":"Mana Seeds ~*~Brandy's Story~*~","fiction_id":"87025","link":"https:\/\/www.royalroad.com\/fiction\/87025\/mana-seeds-brandys-story","tags":["LitRPG","Female Lead","Fantasy","GameLit"],"lable":"Original","following_count":3,"rating":0.0,"page_count":13,"view_count":98,"chapters_count":2,"last_update":1716441081,"description":"Brandy Shin, a book-loving teenager, finds herself halfway around the world from her home, sent by her parents to attend a private high school in a large city. Her small studio apartment, filled with her treasured books, becomes a sanctuary where she escapes into stories. One night, after over-reading past midnight, she is jolted awake by a system message from an AI named Steve, announcing the transformation of her world. Mana seeds, scattered five years ago, have converted Earth into a magical realm to combat a cosmic virus. Brandy learns that she is one of the few who survived the initial transformation, aided by a personal AI named Tara, who manifests in her stuffed rabbit.\nAs Brandy navigates this new reality, she discovers that her beloved books have become spell books, each bound to her with powerful magic. She receives special powers and achievements, including 'Split Mind' and 'Bookworm,' which enhance her abilities to multitask and read at incredible speeds. However, the price of her new abilities comes with the loss of her family, leaving her the sole survivor of her lineage.\nDetermined to survive and grow stronger, Brandy explores a dungeon in her building's basement, encountering monsters and gaining practical experience in combat. Her journey is one of self-discovery and empowerment, driven by the memory of her family and the need to protect her world from the looming threat of the cosmic virus. With the guidance of Tara, Brandy embraces her new identity as a mage, ready to face the challenges ahead and become the hero her world needs.","description_hash":3163385357284590878},{"title":"I Am Not The Chosen One","fiction_id":"87024","link":"https:\/\/www.royalroad.com\/fiction\/87024\/i-am-not-the-chosen-one","tags":["GameLit","Portal Fantasy \/ Isekai","Progression","Male Lead","Sci-fi","Action","Adventure","Fantasy","Slice of Life","Secret Identity","Magic","High Fantasy","Mythos","Technologically Engineered","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":43,"rating":4.88,"page_count":174,"view_count":9727,"chapters_count":36,"last_update":1718597761,"description":"What happens when you're not the one that gets Isekai'd?\nNoem knew in the bottom of his heart that his sister Mona wasn't going to make it. Years on life support that he funded through... not quite legitimate means had deteriorated her body and her mind in equal parts. But one day, after a skyrail heist gone horribly right, he finds something wrong in her. More specifically, someone else. Someone from somewhere called 'Earth'.\nSomeone who's supposed to save the world. And someone Noem's supposed to just forgive for killing his sister and walking around in her skin.","description_hash":-3914867338270732368},{"title":"The Flame Caster","fiction_id":"87023","link":"https:\/\/www.royalroad.com\/fiction\/87023\/the-flame-caster","tags":["Progression","Drama","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":5,"rating":4.92,"page_count":84,"view_count":1136,"chapters_count":10,"last_update":1717268300,"description":"What you can expect:\n+ Chapters ranging from 1,000 to 3,000 words\n+ A first-person perspective focusing on the protagonist's growing relationships\n+ A slow-paced progression, though not uniformly across every arc\n\nEric and his party member Gareth embark on a mission to find their missing guildmates, their search leading them to a disturbing discovery about the disappearances. Along the way, Eric encounters Erina, a girl orphaned by the recent events. Vowing to protect and guide her, Eric begins to forge deeper connections with her and others, each bond shaping his journey and gradually revealing a greater purpose.\nThis intimate first-person narrative follows Eric's transformation as he learns that life holds more than just completing guild missions. It's about discovering meaning and purpose through the relationships he builds.","description_hash":-6756388930146051119},{"title":"Zombie Apocalypse? Forget About It!","fiction_id":"87022","link":"https:\/\/www.royalroad.com\/fiction\/87022\/zombie-apocalypse-forget-about-it","tags":["LitRPG","Post Apocalyptic","Male Lead","Action","Adventure","Horror","Low Fantasy","Attractive Lead"],"lable":"Original","following_count":35,"rating":4.5,"page_count":98,"view_count":3120,"chapters_count":25,"last_update":1718563847,"description":"“The red sky came into existence and everything disappeared. You realised the universe and saw the apocalypse with your own eyes. That's exactly how you died.”\n \nWhen the red sky came into existence, the door of change was unimaginably opened to reality. The end of humanity came not from existential pains, but from the hands of creatures it could not defeat. Humanity, which had always managed to survive at the gates of history and even withstood natural disasters, had finally perished at the hands of drought, virus and mutation.\n \nApocalypse? Mutation? Ice age? Being slaughtered by humans? Or being eaten alive by zombies? Light didn't care about any of that. While watching humanity destroy each other in the apocalypse, he managed to live happily in his own way and occasionally managed to wander into extinction.\n \nThat is his story, the one that saw it all.\n\/\/\/\/\/\/\nThis story is a novel that aims to tell a story with a little bit of slow-moving detail and aims to tell a story. Of course, there will be no unbelievably slow storytelling, but please read it with this in mind.","description_hash":-6192032320062641004},{"title":"12. SACRIFICE [TALES FROM THE CROSSROADS vol. 1]","fiction_id":"87021","link":"https:\/\/www.royalroad.com\/fiction\/87021\/12-sacrifice-tales-from-the-crossroads-vol-1","tags":["Psychological","Female Lead","Historical","Horror","Short Story","Supernatural","Magic","Low Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":55,"chapters_count":1,"last_update":1716415497,"description":"Tales from the Crossroads is a series of 17 micro-fiction horror stories set in the Primordial Crossroads Universe.\nSACRIFICE reveals how not all offerings are as expected.","description_hash":4933084909993287027},{"title":"ENTROPY","fiction_id":"87020","link":"https:\/\/www.royalroad.com\/fiction\/87020\/entropy","tags":["Space Opera","War and Military","Sci-fi","Action","Fantasy","Mystery"],"lable":"Original","following_count":1,"rating":0.0,"page_count":11,"view_count":105,"chapters_count":2,"last_update":1716487702,"description":"\"Hateful to me as the gates of Hades is that man who hides one thing in his heart and speaks another, Lucius. Speak with your heart, and perhaps you will voyage through this world without losing every piece of yourself.\"\n The boy, Lucius, now a man no longer believes in such a thing as truth. Why would he? He has deceived and murdered his way to the top in the name of humanity. \n No longer could he believe in such a thing as a peaceful moment. No longer could he believe in a peaceful end. \nThat was his truth. That was the only thing he believed in this world now.\n In a world shattered by those vultures... By those wretched creatures.","description_hash":-6595419647232107976},{"title":"Magus: My Virtual Experimentation Chip Will Make Me Invincible","fiction_id":"87019","link":"https:\/\/www.royalroad.com\/fiction\/87019\/magus-my-virtual-experimentation-chip-will-make","tags":["LitRPG","Reincarnation","Anti-Hero Lead","Grimdark","Male Lead","Action","Adventure","Fantasy","Mystery","Harem","Supernatural","Strong Lead","Magic","High Fantasy","Villainous Lead","Soft Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":5,"view_count":70,"chapters_count":1,"last_update":1716414457,"description":"After dying and waking up in a world where magic exists, Charles awakens in the body of a young man who is heading to a magical school. As time passes, the protagonist realizes that this world is extremely dark, where crazed and hungry demons roam during the day, power-hungry mages capable of destroying and massacring entire cities just to advance their experiments, dimensional wars, where mages themselves open portals to other dimensions in search of resources.\nThere are no limits in this crazy universe.\nEverything is possible, the most bizarre things happen here every day.\nTo deal with this chaotic world, our protagonist is not alone; he relies on advanced technology that came with him to this world. With this advanced technology, he will live like a magical genie while satisfying his most vile and unholy desires.\n\"Is it rare to find a talented alchemist? Sorry! But I can make perfect potions.\"\n\"Is learning Magic very difficult? Not for me, because I can use my virtual laboratory where I can conduct experiments without harming my real body and, in the end, gain experience.\"\n[\"This is the real Magical World!\"]\nAdditional tags: Violecente, War...","description_hash":3427979943801287387},{"title":"Tales of Mylera ","fiction_id":"87016","link":"https:\/\/www.royalroad.com\/fiction\/87016\/tales-of-mylera","tags":["Ruling Class","Non-Human Lead","Slice of Life","Adventure","Fantasy","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":79,"chapters_count":2,"last_update":1716705616,"description":"Explore the lives of the people of Mylera, a Kingdom full of fae and magic! Follow our fairy protagonist, Luna, as well as her friends in a collection of stories about their everyday lives, as well as the hidden wonders and secrets their kingdom holds.\nTales of Mylera is an ongoing passion project, currently starting off as a collection of short stories. These stories are world-building and ongoing, and don't necessarily need to be read in order at this time (that may change in the future.) If a story posted needs heavy context from a previous story, it will be noted.\nI have also launched a free Patreon where I will post all of my world building content that the stories derive from!","description_hash":8637260458890738727},{"title":"god_1","fiction_id":"87015","link":"https:\/\/www.royalroad.com\/fiction\/87015\/god1","tags":["LitRPG","Ruling Class","Non-Human Lead","Harem","Action","Adventure","Fantasy","Romance","Male Lead","Attractive Lead"],"lable":"Original","following_count":1,"rating":5.0,"page_count":48,"view_count":402,"chapters_count":7,"last_update":1718444435,"description":"Jovin Aceda, a young man from a poor family who has known hardship and struggle throughout his life. Despite his family's struggles, Jovin worked hard to become successful and eventually reunited with his loved ones. However, he soon found himself shouldering the weight of his responsibilities, with everyone looking up to him as a hero.\n\nAs he navigated the complexities of his new life, Jovin felt like he was losing himself in the process. He was constantly being judged and expected to perform at a high level, and he felt like he was living in a fishbowl, with everyone watching his every move.\n\nIt was during this tumultuous time that Jovin discovered the popular MMORPG game, Arcana. At first, he was hesitant to join, but as he delved deeper into the game, he found solace in its virtual world. For the first time in his life, Jovin felt like he could be himself, without the burden of expectations and responsibilities.\n\nIn Arcana, Jovin met people who treated him like a normal person. They didn't care about his wealth or his success; they only cared about who he was as a person. He formed deep bonds with other players, and for the first time in his life, he felt like he had found a true sense of belonging.\n\nAs the game's shutdown date approaches, Jovin realizes that he'll soon have to bid farewell to the world he's grown to love. With only an hour left until the server shutdown, Jovin decides to savor the remaining time by exploring the game world one last time.\n\nWith no attachments to anyone or anything outside of the game, Jovin logs back into Arcana and decides to simply explore the world. He visits old haunts, reminisces about past adventures, and revisits people online who have become like friends. Unfortunately they were no longer there\n\nAs he walks through the familiar landscapes, Jovin is struck by the sense of nostalgia that washes over him. He remembers the struggles he faced, the triumphs he achieved, and the bonds he formed with other players.\n\nBut just as Jovin closed his eyes as he accepts everything savoring the moment one last time, something strange happens. \nWhen Jovin's eyes opened and adjust to the new light, he finds himself standing in a vast, open plain. The sky above is a deep blue, and the sun is shining brightly. The air is filled with the sweet scent of blooming flowers and the gentle rustling of grass.\n\nAs Jovin looks around in wonder, he realizes that he's been transported to a new world – one that feels eerily similar to Arcana. But instead of being confined to a virtual realm, this world feels real – and it's full of mysteries waiting to be uncovered.\n\nAnd so, Jovin's journey begins anew. But will he find his way back to his own world or will he become trapped in this mystical realm? The answer remains shrouded in mystery for now.","description_hash":-6620604123079918997},{"title":"The Door","fiction_id":"87014","link":"https:\/\/www.royalroad.com\/fiction\/87014\/the-door","tags":["Portal Fantasy \/ Isekai","Comedy","Multiple Lead Characters","Slice of Life","Drama","Fantasy","Mystery"],"lable":"Fan Fiction","following_count":3,"rating":0.0,"page_count":52,"view_count":246,"chapters_count":5,"last_update":1717917354,"description":"An unfortunate human boy used to a life of abuse and abandonment suddenly finds his way to Zootopia! Will he find a place for himself in this new world? And how will the residents of Zootopia react to the strange new mammal called a human?","description_hash":4926383554385443262},{"title":"Cahokian Craftsman","fiction_id":"87013","link":"https:\/\/www.royalroad.com\/fiction\/87013\/cahokian-craftsman","tags":["Portal Fantasy \/ Isekai","Progression","Martial Arts","Comedy","Male Lead","Action","Adventure","Fantasy","Slice of Life","Magic","Low Fantasy","Mythos"],"lable":"Fan Fiction","following_count":19,"rating":5.0,"page_count":217,"view_count":2058,"chapters_count":11,"last_update":1718439304,"description":"When you fall into a world that could only be described as a terrible sword and sorcery story, what can a man do but open a store?","description_hash":-5921523386378522105},{"title":"Up in Smoke and Sparkles ","fiction_id":"87012","link":"https:\/\/www.royalroad.com\/fiction\/87012\/up-in-smoke-and-sparkles","tags":["Urban Fantasy","Multiple Lead Characters","Contemporary","Drama","Action","Supernatural","Female Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":28,"view_count":230,"chapters_count":3,"last_update":1717133861,"description":"Forty years ago, the Eclipshura attacked humanity. They were met by magical girls, who fought back against the forces of evil to secure humanity's survival. \nForty years later, the Eclipshura still attack humanity. Now, they're met by agents calling themselves magical girls, who fight to secure a good profit and a living wage. \nFollow the stories of several protagonists - both magical girls and civilians alike - trying to navigate their lives in a world where, if you don't die in the jaws of a monster, you'll die from the city life alone.","description_hash":4269188666806522920},{"title":"The Tales of a Dwarven Adventurer","fiction_id":"87011","link":"https:\/\/www.royalroad.com\/fiction\/87011\/the-tales-of-a-dwarven-adventurer","tags":["LitRPG","Dungeon","Multiple Lead Characters","Slice of Life","Action","Adventure","Fantasy","Non-Human Lead","Magic","GameLit","High Fantasy","Progression"],"lable":"Original","following_count":3,"rating":0.0,"page_count":59,"view_count":467,"chapters_count":7,"last_update":1716959460,"description":"Cedric Mulch was a regular dwarf. He kept his head down, he worked hard, and in return the world saw fit to take everything from him. Surviving his home being destroyed and his life shattered, he was saved by a group of wandering adventurers. This ignited a new passion in him. The passion for adventure, to have his own power to rely on, and most of all, to be someone. \n\nAfter completing his studies and becoming a cleric of The Smith, a minor but important diety, Cedric has started his journey to become an adventurer, but things are harder than they seem and the world outside the classroom is a harsh one. Cedric's never been afraid of work, and now is no exception. This is a job like any other, and if there's one thing Cedric knows, it's how to grind.","description_hash":7392367026512759303},{"title":"Most Popular Student","fiction_id":"87010","link":"https:\/\/www.royalroad.com\/fiction\/87010\/most-popular-student","tags":["Non-Human Lead","Contemporary","School Life"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":25,"view_count":222,"chapters_count":6,"last_update":1718514650,"description":"Chicken Little has been viewed as a hero for saving Oakey Oaks. Now it is a new school year at Oakey Oaks Middle School. Chicken Little and his friends meet a new student, who had just begun to attend Oakey Oaks Middle School.","description_hash":1426367568284364909},{"title":"A Dance with a Failed Knight","fiction_id":"87009","link":"https:\/\/www.royalroad.com\/fiction\/87009\/a-dance-with-a-failed-knight","tags":["Portal Fantasy \/ Isekai","Female Lead","Action","Adventure","Fantasy","Romance","School Life","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":63,"view_count":558,"chapters_count":12,"last_update":1718420404,"description":"After being a deemed a failure by her family for her lack of magical talent, Monika Edelweiss ran away from home to enroll at the Royal Knight's Academy and prove them all wrong. But life doesn't always go as planned.\nHowever, a chance encounter with a woman claiming to be from another world might just change her fate. Now, she has another shot at becoming a knight. A second chance to fulfill her dreams, and to prove herself to everyone who doubted her. But faced with powerful and dangerous rivals both in and out of the academy, it'll be a struggle just to survive, let alone graduate!\n\nWhat to expect: A school life adventure filled with magic and swordplay, new friends and old enemies. Blossoming romance, exams, and evil cults; y'know, the usual school experiences.","description_hash":-5441745376994482783},{"title":"First Undead [LitRPG]","fiction_id":"87008","link":"https:\/\/www.royalroad.com\/fiction\/87008\/first-undead-litrpg","tags":["LitRPG","Progression","Villainous Lead","Non-Human Lead","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":12,"rating":0.0,"page_count":16,"view_count":669,"chapters_count":5,"last_update":1716696710,"description":"The Goddess of Life created all living beings, from the tiniest microbes to the mightiest giants. All glory belongs to Her and Her alone, for there would be no sentient beings to respect gods without Life. Because of this, Life has the undisputed highest status of all gods. \nEqually important is the God of Death, who brings the end to all life. Without Death, there would be no end to pain, and the world would be flooded with an endless amount of beings. However, Death does not share the glory of Life - no living being is born seeking death. Most struggle for life until the very end. \nThe God of Death is tired of having no beings to bring him glory, beyond a small smattering of humanoids that even their peers find odd.\nDeath has decided to create his own form of life - the undead.","description_hash":4824975266180164995},{"title":"Endless Night: Mugen No Yoru Vol.1.","fiction_id":"87007","link":"https:\/\/www.royalroad.com\/fiction\/87007\/endless-night-mugen-no-yoru-vol1","tags":["Portal Fantasy \/ Isekai","Time Loop","Progression","Anti-Hero Lead","Strategy","Action","Adventure","Comedy","Drama","Reincarnation","Martial Arts","Slice of Life","Male Lead","Multiple Lead Characters","Non-Human Lead","Secret Identity","Magic","Wuxia","Xianxia","High Fantasy","Mythos","Time Travel","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":2,"view_count":42,"chapters_count":1,"last_update":1716414141,"description":"!WARNING!\nThis story is Danmei aka BoyXBoy\nThis will contain r18 scenes later on. \nIt will be updated at least once or twice a week, \nI take any kind of suggestions and if you want to message me directly then message me at [email protected] or [email protected], I also have a Medibang art street account as Sunadokei. This story is also on Wattpad under the same name or Sophiemngalover4, I will maybe add this to Tapas.\nMazoku-Jun is a great person kind, ruthless, and understanding...For a fictional demon emperor! \nMazoku-Jun is from a very popular book called the Rising of the Winter Storm or TROTWS. A character who Hajime Yami loves very much, his brother Hikari Yu or Yue xinghuo baihe, is the author. \nYami always wanted to meet Mazoku-Jun, but knew it was impossible...Until Yami suddenly dies while re-reading TROTWS. He finds himself transmigrating into TROTWS!!!...As the villain nonetheless! \nThe worst part is that his system is a sack of shit!\n\"Curse you, System!!! I want a refund or at least some OP weapon, because this just isn't fair!!..\"","description_hash":3516291572023549320},{"title":"In the Shadow of the Light","fiction_id":"87006","link":"https:\/\/www.royalroad.com\/fiction\/87006\/in-the-shadow-of-the-light","tags":["War and Military","Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","High Fantasy","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":12,"view_count":25,"chapters_count":1,"last_update":1718626043,"description":"Long before the writing of this legend, in a time well documented by both sides, fierce battles desecrated the once-united land of light. In their wake, an impossibly high wall was constructed, separating those who were powerful from those who were not. Those on one side were showered with the glimmering rays of sunlight, blessed with bright days, fertile lands and peace, whilst those on the other were forever tossed into darkness, kept from the light by the Iron Wall. And so it stayed, the realm of light and the realm of shadows, two vastly differing lands that had once been one.\nCenturies after the fighting had stopped, leaders of the light had become too focused on tensions between themselves, and trouble was brewing on either side of the Iron Wall. In the darkness, a series of bodies found thrown from the high reaches of the wall light a spark beneath the rebels, bringing forward their secret preparations and bolstering their support amongst the masses. Within the realm of light, captured shadow-folk are continuing their ongoing fight against their captors. \nIn the Shadow of the Light follows an array of differing characters as they tiptoe around politics and war, coming together in a tale as old as time, a tale of rebellion and revenge against those who deserve it most.\n\nWhat to expect:\n- Slow burn fantasy\n- Political Intrigue\n- War\/Rebellion\n- Uploading a chapter a week\nPlease bear in mind that this is just the first draft of a novel, so changes can\/will be made. Saying that, I try to have them as polished as I can in this moment before posting.","description_hash":-7543938957500571514},{"title":"Awoken in the world of monsters","fiction_id":"87005","link":"https:\/\/www.royalroad.com\/fiction\/87005\/awoken-in-the-world-of-monsters","tags":["Male Lead","Harem","Action","High Fantasy"],"lable":"Original","following_count":4,"rating":0.0,"page_count":88,"view_count":997,"chapters_count":14,"last_update":1718625605,"description":"Cory Bright, a simple young adult high schooler is about to move to the next step in his life when suddenly, he awakes in a field of flowers and monsters attack him! Before Cory can be killed, he is saved by a kobold going by the name Vex, alone and scared for his life, he must find out how he got to this strange and dangerous world called Donnotov and if there’s any way, he can get back to his home…\nPost chapter note: Monday, Tuesday, Wednesday","description_hash":5599044592135452773},{"title":"Sceptarch","fiction_id":"87004","link":"https:\/\/www.royalroad.com\/fiction\/87004\/sceptarch","tags":["Ruling Class","Psychological","Female Lead","Strong Lead","Drama","Fantasy","Romance","Magic","Strategy","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":59,"view_count":347,"chapters_count":7,"last_update":1717488004,"description":"Celia never expected to inherit the Diadem of the Sceptarch and become the reluctant ruler of the enigmatic Vireld, a people on the brink of war and invasion. Thrust into a delicate balance of power, she finds herself a figurehead meant to enforce the status quo and maintain a fragile peace. Amidst this political labyrinth, Celia discovers a wellspring of latent power, her journey unfolding as she shelters under the wing of her Blade.","description_hash":-9136473971286516186},{"title":"The Disguised Prince: Triumph Over Adversity","fiction_id":"87003","link":"https:\/\/www.royalroad.com\/fiction\/87003\/the-disguised-prince-triumph-over-adversity","tags":["Urban Fantasy","Male Lead","Secret Identity","Drama","Action","Adventure"],"lable":"Original","following_count":0,"rating":0.0,"page_count":36,"view_count":317,"chapters_count":9,"last_update":1718037828,"description":"Ye Chen was a live-in son-in-law despised by everyone, but no one knew his true identity as the eldest son of a top family. Those who looked down on him would eventually kneel before him, trembling in fear, and respectfully call him \"Master!\"","description_hash":8473896430539360618},{"title":"Jett and the Giant Boarding School","fiction_id":"87001","link":"https:\/\/www.royalroad.com\/fiction\/87001\/jett-and-the-giant-boarding-school","tags":["Comedy","Female Lead","Adventure","Fantasy","Romance","School Life","Male Lead","High Fantasy","First Contact","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":29,"view_count":236,"chapters_count":3,"last_update":1716655094,"description":"Jett is a human and attends a boarding school for giants.  Boarding school life is always challenging, but how much more challenging is it at a school where the other kids are all at least sixty foot tall giants with green skin?  Will he make friends there and will they protect him from villains and stalker giantesses?","description_hash":-4415743703965991121},{"title":"Crescent moon","fiction_id":"87000","link":"https:\/\/www.royalroad.com\/fiction\/87000\/crescent-moon","tags":["Female Lead","Fantasy","Romance","School Life","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":77,"view_count":334,"chapters_count":11,"last_update":1717351209,"description":"Letita had a somewhat normal life considering the fact she lived in the most dangerous part of the otherworld. Her father loved her as much as he possibly could but being left alone for weeks at a time wasn't unusual in her life.\nOne day she gets an invite from a family member to come and live with them in the most prestigious realm. She has to decide fast and ultimately comes to the decision that she needs to go. Will she find her place at a completely new school? Will she fit into this family that is supposedly hers but she doesn't know?\nThere are greater forces involved than she could ever imagine. Join her on this journey of revealing secrets, falling in love, and learning that blood is in fact thicker than water.","description_hash":1165310215278796804},{"title":"My Last Life","fiction_id":"86999","link":"https:\/\/www.royalroad.com\/fiction\/86999\/my-last-life","tags":["LitRPG","Reincarnation","Time Travel","Dungeon","Male Lead","Action","Adventure","Fantasy","Mystery","Supernatural","Strong Lead","Magic","GameLit","High Fantasy","Mythos","Progression"],"lable":"Original","following_count":13,"rating":4.75,"page_count":80,"view_count":1705,"chapters_count":13,"last_update":1718398844,"description":"After regressing nine times, failing to kill the combat gods and prevent demons from destroying the world, Alan attempts a last-ditch effort to succeed. Overloading his mana core, and sacrificing his life in the process, Alan wins. But, when he suddenly wakes up in a new body, 800 years in the future, he embarks on a new journey, unsure of his true purpose in the world, and the being orchestrating his regressions. \nSchedule: 1 chapter per day until 10 chapters. After that, 1-2 chapters per week.\nWhat to expect:\nLitRPG type system\nOverpowered mc\nFast Progression\nDeep worldbuilding","description_hash":-7911921453154138619},{"title":"Doryani's Machinarium","fiction_id":"86998","link":"https:\/\/www.royalroad.com\/fiction\/86998\/doryanis-machinarium","tags":["Progression","Anti-Hero Lead","War and Military","Psychological","Male Lead","Horror","Sci-fi","Short Story","Cyberpunk","Genetically Engineered ","Technologically Engineered","Hard Sci-fi","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":2,"rating":0.0,"page_count":12,"view_count":337,"chapters_count":4,"last_update":1716439675,"description":"This will be a Lancer TTRPG character development story told as the character is being played. The first few chapters are about the main character Conrad Jackson's (Doryani) back story. Game is played weekly so chapter updates will follow usually either Wednesdays or Thursdays.\nFollow Conrad Jackson after a traumatic start as he tries to rebuild his life and come to terms with the horrors he has been exposed to in the dark vacuum of space.","description_hash":1774519297692869839},{"title":"Transatlantic","fiction_id":"86997","link":"https:\/\/www.royalroad.com\/fiction\/86997\/transatlantic","tags":["Female Lead","Drama","Historical","Romance"],"lable":"Original","following_count":1,"rating":0.0,"page_count":4,"view_count":30,"chapters_count":1,"last_update":1716390092,"description":"This story follows two young women in London in 1820. They both have different views on life and different dreams but somehow they still agree on one thing; their love for one another is irreplaceable by anything.As they approach their eighteenth birthday it is time for them to be presented to society and start looking for a husband.Join them on this journey of finding themselves, falling in love, and becoming women.\nThis book is written from two different points of view, the chapters are named based on the point of view.","description_hash":2342123342119783879},{"title":"Too Warm","fiction_id":"86996","link":"https:\/\/www.royalroad.com\/fiction\/86996\/too-warm","tags":["Psychological","Contemporary","Horror","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":41,"chapters_count":1,"last_update":1716390091,"description":"A strong blizzard is raging in a small northern town, blocking most roads. Meanwhile, in a small cabin in the forest not too far from the town itself, Mark is making himself a cup of warm tea to combat the ever-lowering temperatures. Then he hears a knock on his door...\n\nAuthor's note - This is a short story, this is the only chapter that is going to be posted for this story in particular. I have a longer series in the works as well as many other short stories varying in genre and theme. If you want to see more of my stories consider following me!","description_hash":1282037766617556163},{"title":"Houses of Wolves: Lycosura","fiction_id":"86993","link":"https:\/\/www.royalroad.com\/fiction\/86993\/houses-of-wolves-lycosura","tags":["Urban Fantasy","Progression","Ruling Class","Martial Arts","Comedy","Drama","Fantasy","Romance","Supernatural","Female Lead","Strong Lead","Multiple Lead Characters","Non-Human Lead","Magic","Low Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":11,"view_count":50,"chapters_count":1,"last_update":1716390046,"description":"A middle aged single mom of two gets bitten by a vampire and is plunged into the criminal underworld controlled by werewolves. Now shes at the mercy of House Prometheus of the Lycosura. How the hell is she supposed to go to parent teacher confernces like this?","description_hash":-2579231493409527550},{"title":"Don't Take Life Too Seriously; You Might Die ","fiction_id":"86992","link":"https:\/\/www.royalroad.com\/fiction\/86992\/dont-take-life-too-seriously-you-might-die","tags":["Portal Fantasy \/ Isekai","Comedy","Non-Human Lead","Fantasy","Reincarnation","Magic"],"lable":"Original","following_count":3,"rating":0.0,"page_count":54,"view_count":1088,"chapters_count":10,"last_update":1718203765,"description":"After dying an unconventional death and going through a… new life crisis? This former engineer decides that the author of the universe is clearly a comedian and that he had taken his former life too seriously. Finding himself in a strange new land, with strange new parentage, and even stranger customs, another chance to play the game has presented itself. Now, armed with the belief that life is a cosmic joke, he has vowed that, in this campaign, he isn’t going to make the same mistake.","description_hash":1538392749337234003},{"title":"The Conduit ","fiction_id":"87257","link":"https:\/\/www.royalroad.com\/fiction\/87257\/the-conduit","tags":["Super Heroes","Sci-fi","Action","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":28,"chapters_count":1,"last_update":1716777588,"description":"Title: The ConduitSummary:In a dystopian future where the line between super and machine blurs, Conduit follows 16-year-old Ethan Steele, a brilliant but tormented teenager living in the neon-lit, crime-ridden city of Sadis. The world is dominated by advanced technology and corporate overlords who control the population through fear and surveillance.Ethan, an orphan and tech prodigy, discovers that he possesses extraordinary abilities after a freak accident at his late father's lab. His body, enhanced by cutting-edge nanotechnology, grants him superhuman strength, speed, and the ability to interface directly with electronic systems. However, these powers come with a dark side—Ethan experiences haunting visions and uncontrollable fits of rage, remnants of the traumatic event that led to his father's mysterious death.Will Ethan be able to supress his inner demons or fall victim to the alure of the Conduit","description_hash":6498502368296093829},{"title":"Marvel: I am Flerken","fiction_id":"87256","link":"https:\/\/www.royalroad.com\/fiction\/87256\/marvel-i-am-flerken","tags":["Reincarnation","Urban Fantasy","Progression","Anti-Hero Lead","Super Heroes","Comedy","Fantasy","Sci-fi","Contemporary","Slice of Life","School Life","Supernatural","Strong Lead","Non-Human Lead","Secret Identity","Low Fantasy","Ruling Class","First Contact"],"lable":"Fan Fiction","following_count":5,"rating":0.0,"page_count":16,"view_count":293,"chapters_count":3,"last_update":1717053313,"description":"The recipe for this fanfic is: \nWe take the soul of a person from our world, stuff it into the body of an alien cat, reminiscent of the miscarriage of Cthulhu and Slaanesh and possessing internal subspace. Next, we throw, attention, without mixing, it all into the Marvel universe and sprinkle the hilarious moments, action and kawaii cat-girls. And yes, how could it be without conquering the world, how could it be without this...","description_hash":5982016515377858642},{"title":"Tales of Gridarnia, Book 1 - The Berserker Lord","fiction_id":"87255","link":"https:\/\/www.royalroad.com\/fiction\/87255\/tales-of-gridarnia-book-1-the-berserker-lord","tags":["LitRPG","Dungeon","Action","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":74,"view_count":589,"chapters_count":8,"last_update":1718402539,"description":"Welcome to The Tales Of Gridarnia, Book 1 - The Berserker Lord\nWe are still in early drafting stage. Grammar and punctuation are not perfected. I am constantly editing and updating chapters as I see something. Part 1 is almost finished with plans for a part 2.  Please comment and let me know what you think.\nThank you for any and all support as I try to create a semi decent story.\nNo Sexual Content, Very Minor Profanity\nAction scenes, World building, New Magic System.\nContains aspects of Dungeon Core and LITRPG\nRead ahead by subscribing to patreon.com\/Maxwellstories","description_hash":85107144913675408},{"title":"The Mischievous Savior(Harry Potter SI)","fiction_id":"87254","link":"https:\/\/www.royalroad.com\/fiction\/87254\/the-mischievous-saviorharry-potter-si","tags":["Comedy","Female Lead","Drama","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Fan Fiction","following_count":7,"rating":5.0,"page_count":42,"view_count":1749,"chapters_count":13,"last_update":1716998016,"description":"Imagine waking up one morning to find your entire world has changed—you're no longer yourself, but instead, you've become a Malfoy, specifically the younger sister of Draco Malfoy, a name synonymous with privilege and controversy in the wizarding world.\nIn this unexpected new life, you navigate the grand halls of Hogwarts, now not just as a student but as a member of one of its most notorious families. As you grow alongside Draco, you see sides of him that are hidden from the world: his doubts, his fears, and the pressures of the Malfoy legacy. But as the dark forces that threaten the wizarding world grow stronger, you realize that your unique position in the Malfoy family places you in the center of brewing conflicts and ancient secrets.\nWith the wizarding world on the brink of turmoil, you find yourself grappling with a critical question: will you conform to the expectations of the Malfoy name, or will you forge a new path and fight to save the world from the shadows that seek to consume it?","description_hash":-3268393760086051788},{"title":"Rock: A Journey of a Goblin","fiction_id":"87253","link":"https:\/\/www.royalroad.com\/fiction\/87253\/rock-a-journey-of-a-goblin","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","War and Military","Non-Human Lead","Action","Adventure","Fantasy","Male Lead","High Fantasy"],"lable":"Original","following_count":6,"rating":4.5,"page_count":29,"view_count":1172,"chapters_count":8,"last_update":1717710632,"description":"One day I woke up in the body of a goblin.\nI use ai to translate from my language to english","description_hash":7629817618971840395},{"title":"SpaceTime Prisoners","fiction_id":"87252","link":"https:\/\/www.royalroad.com\/fiction\/87252\/spacetime-prisoners","tags":["Adventure","Fantasy","Mystery"],"lable":"Original","following_count":1,"rating":0.0,"page_count":31,"view_count":88,"chapters_count":3,"last_update":1716913044,"description":"Have you ever thought about it?\nThe rules that govern our universe...It has been getting me latelyDreaming, Crying, Remembering, Forgetting It feels like there are so many things to care aboutYet, this universe never fails to always reminds us that we couldn't care about all of it\n\nHave you ever thought about it?That we once born into this seemingly weird universeGrowing slowly into a little kid...And for a moments, we feel like we can do anything we want without caring about anythingAnd then we keep growing and growing while slowly chained by invisible additional rulesUntil at some point, we realize just how much responsibility we haveIsn't it not fair that we grew up without understanding all thatAlthough, i also think that it's actually fair for them to not understand about all that just yet\n\nTo be honest, I feel that this kind of life is actually not that bad at allBut you know, sometimes, just sometimes, it still feels very frustrating knowing that...There's a moment when we just want for something to be differentAnd then remembering that we can't really do anything about it…Can really get into me sometimes... Just sometimes...\n\nI feel I should get going before this universe remind me once again on what's important Despite that...I am still here, trying to tell somethings that not really feels that important This universe feels really weird sometimesand It's getting me latelyLike... I was wondering if we could, for just a moment, to not be bound by those kind of rulesHave you ever thought about it?","description_hash":5478576863490559547},{"title":"Flooded with Power (A LitRPG Story)","fiction_id":"87251","link":"https:\/\/www.royalroad.com\/fiction\/87251\/flooded-with-power-a-litrpg-story","tags":["LitRPG","Progression","Post Apocalyptic","Grimdark","Psychological","Action","Adventure","Fantasy","Supernatural","Male Lead","Strong Lead","Low Fantasy"],"lable":"Original","following_count":24,"rating":4.5,"page_count":68,"view_count":779,"chapters_count":8,"last_update":1718627120,"description":"Jackson Walker had been living life on autopilot never really enjoying anything but just going through the motions, he had a girlfriend a stable job and a goo brother. But, all good... or okay things must come to an end, Jack was dumped by his girlfriend, lost his job and then the system came.\nHis world was turned upside down, with danger everywhere, and having already lost his humanity. Determined to find and protect his brother he finds himself enjoying life for the first time in a while, who knew levelling up was so addicting?\nFollow Jack as he unleashes his power upon beasts and invaders alike and grows strong enough to be a pillar of hope... or maybe just a force of destruction.","description_hash":-3925359991877273120},{"title":"Beauty and the Vial: Tested, Transgender Coming of Age Fantasy in Agape Duro, Lamur GA ","fiction_id":"87250","link":"https:\/\/www.royalroad.com\/fiction\/87250\/beauty-and-the-vial-tested-transgender-coming","tags":["Female Lead","Drama","Fantasy","Historical","Gender Bender","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.5,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Agape Duro has always been and continues to be a place where Greek Goddesses and Gods of altruistic intent collide with those with sinister motives. Perseus, rejecting a deceptive gender expression, goes to Aphrodite seeking beauty for his mother who has been distorted by Erida.  Aphrodite capriciously remakes him for her own purpose which is still present in modern times.  In the present, Alexander, who has been cursed by Erida, is restored by his Great Aunt Montine and finds that he is the inheritor of Aphrodite's purpose in today's world.","description_hash":-3690123157266611257},{"title":"DRACULA: DIGITAL DARKNESS","fiction_id":"87249","link":"https:\/\/www.royalroad.com\/fiction\/87249\/dracula-digital-darkness","tags":["Strategy","Grimdark","Non-Human Lead","Contemporary","Drama","Fantasy","Horror","Supernatural","Male Lead","Low Fantasy"],"lable":"Original","following_count":2,"rating":0.5,"page_count":81,"view_count":674,"chapters_count":19,"last_update":1718402009,"description":"In the heart of a modern world, where technology reigns and ancient secrets are buried beneath the digital surface, Jonathan Harker embarks on a journey that will unravel the threads of reality. His destination: the mysterious Carpathians, where the past clings fiercely to the shadows.\nArmed with only his wits and a digital journal, Harker navigates a land where Google Maps fear to tread, and where a single swipe on his smartphone can summon more than just a ride—it can call forth the echoes of a timeless evil.\nAs the sleek veneer of the 21st century collides with the dark superstitions of old, Jonathan finds himself at the heart of a gothic nightmare, reimagined for the modern era. Here, in a world where a blood-thirsty legend updates his status in the night, and where Wi-Fi signals become the lifelines of survival, the tale of Dracula is reborn.\nWelcome to \"Dracula: Digital Darkness,\" where the terror of the night has never been so connected. Can Jonathan decipher the enigma of Count Dracula before the sun sets on his life, or will he become just another ghost in the machine?\nPrepare yourself for a retelling that blends the classic horror with the pulse of today's fears—a story that proves some darkness is immune to the light of technology.","description_hash":-1762263969187999080},{"title":"Blackbeard: Andrew & James","fiction_id":"87248","link":"https:\/\/www.royalroad.com\/fiction\/87248\/blackbeard-andrew-james","tags":["Male Lead","Action","Adventure","Historical","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":40,"view_count":150,"chapters_count":5,"last_update":1717470139,"description":"Andrew, a treasure hunter, has been searching for a legendary bounty hidden by the infamous pirate Blackbeard for 22 years. On an unfamiliar island, he finds a clue that leads him to believe his son, James, is missing. Andrew begins to recount his journey, revealing how his interest in Blackbeard began in seventh grade. After discovering a map and notes in his history teacher's classroom, Andrew becomes fascinated with the pirate's history. Years later, Andrew receives a message from his former teacher claiming to have found a significant clue related to Blackbeard's sojourn in Northern Asia. Andrew and James embark on a journey to Asia to investigate the clue, combining their pursuit of treasure with sightseeing and history. The story unfolds as they face challenges, uncover secrets, and grow closer as father and son.","description_hash":9114298727840070480},{"title":"The Gambler’s Deceit ","fiction_id":"87247","link":"https:\/\/www.royalroad.com\/fiction\/87247\/the-gamblers-deceit","tags":["Urban Fantasy","Anti-Hero Lead","Male Lead","Contemporary","Slice of Life","Drama","Romance","Mystery","Secret Identity","Attractive Lead"],"lable":"Original","following_count":2,"rating":4.5,"page_count":116,"view_count":614,"chapters_count":17,"last_update":1717766029,"description":"In the glittering world of London's elite, the Whitmore family reigns supreme - until a mysterious stranger, Victor Mallory, arrives and upends everything. The Whitmores become entangled in Victor's web of secrets and lies, With a gripping blend of high-stakes thrills, simmering romance, and suspenseful twists, Can the Whitmores survive Victor's machinations unscathed? \nVictor’s Motto - “The ends justify the means when it comes to fulfilling my goals.” \nWarning: \n1. There will be no set word limit, according to need some chapters can be large and some small. 2. Read at least 4 chapters before giving review. 3. Some scenes can be really detailed so be prepared. 4. Be attach to any characters at your own risk. \nDisclaimer -All characters and settings are fictional, any similarity with reality is purely coincidence.\n PS : It's my first work, I'm hoping it turns out good. All reviews and constructive criticisms are welcome. Grammar and English should be fine, but I'm not sure how good the dialogues and scenarios will be. Hopefully I'll improve as this novel progresses forward.","description_hash":-2056083697325145308},{"title":"Arachnid Ascendant","fiction_id":"87246","link":"https:\/\/www.royalroad.com\/fiction\/87246\/arachnid-ascendant","tags":["Super Heroes","Slice of Life","Action","Adventure","Fantasy","Romance","Magic","Low Fantasy","First Contact"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":38,"view_count":235,"chapters_count":7,"last_update":1718117710,"description":"The line between a villain and a hero is razor thin. One bad day or wrong decision can lead a person down a path that they can't come back from.\nPeter Johnston never even gave a second thought to heroes or villains. Until an exhibit blew up his normal life, Peter enjoyed working as a tour guide at an art gallery between college classes. Now he faced the responsibilities of new powers, and possibly catching the eye of a fellow hero. New realities force Peter to answer some hard questions about himself, including a rising villain that he knew before all of this chaos started.\nThanks to Cass for making the description and the cover <3","description_hash":-7506158938180108366},{"title":"Second Chances","fiction_id":"87245","link":"https:\/\/www.royalroad.com\/fiction\/87245\/second-chances","tags":["Time Travel","Multiple Lead Characters","Adventure","Romance","School Life"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":74,"view_count":130,"chapters_count":3,"last_update":1717903648,"description":"Jake loses the final battle against the Dark Dragon. Instead of perishing, he finds himself on the balcony of his grandfather's shop. As events begin to unfold, can he ensure a brighter future for everyone?","description_hash":-116117242370290073},{"title":"The Barista","fiction_id":"87244","link":"https:\/\/www.royalroad.com\/fiction\/87244\/the-barista","tags":["Reincarnation","Urban Fantasy","Progression","Anti-Hero Lead","Psychological","Drama","Fantasy","Satire","Slice of Life","Male Lead","Magic","Low Fantasy"],"lable":"Original","following_count":1,"rating":4.25,"page_count":146,"view_count":1232,"chapters_count":16,"last_update":1718164096,"description":"Mister Id has spent the centuries since his death watching the ebb and flow of humanity from a tiny peephole in the Earth's crust. \nThrough his impeccable market research, he's gathered that it isn't money, love, or power that makes the world go 'round. It's Essence—the intangible, non-refundable crumb of a soul left behind after every interaction, good or bad.\nSo when Mister Id finally claws his way out of purgatory, he sets out to be the first winner of the game of life. \nHis plan? To start out as a humble barista, stacking slivers of souls, one latte at a time. \nHis goal? Nothing short of world domination. Humanity enslaved by its own Essence. \n\nOr, that slow progression, slice-of-life, long-form tall tale in which an evil old man wields the power of kindness, science is magic, and the end is only the beginning.","description_hash":531689793418172441},{"title":"Knight's Edge","fiction_id":"87242","link":"https:\/\/www.royalroad.com\/fiction\/87242\/knights-edge","tags":["Male Lead","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":12,"view_count":45,"chapters_count":1,"last_update":1716720968,"description":"To make the perfect weapon, you have to be the most efficient killing tool in the battle field. [Commissioned Work]","description_hash":-8496710625250650250},{"title":"PROPHECY'S BLADE","fiction_id":"87241","link":"https:\/\/www.royalroad.com\/fiction\/87241\/prophecys-blade","tags":["Post Apocalyptic","Male Lead","Action","Adventure","Fantasy","Mystery","Supernatural","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":42,"chapters_count":1,"last_update":1716718541,"description":"A tale that unveils the mysterious world of Alex Shadowhart. Raised by his father, Jayden Shadowhart, known as the world's preeminent assassin, Alex, an unsuspecting 18-year-old, has been honing his skills in the secluded shadows of their dojo for 15 years.\n As Alex's seemingly ordinary life takes a drastic turn, he stumbles upon a secret room within the dojo-a room his father explicitly warned him against. Illuminated by warm lights, this room holds the key to a concealed past and a destiny unbeknownst to Alex. Within this clandestine space, Alex discovers an ancient scroll, its contents unlocking...","description_hash":5669021406552794945},{"title":"TOWER DEFENSE : Resist the Dark world with God level tower defense","fiction_id":"87240","link":"https:\/\/www.royalroad.com\/fiction\/87240\/tower-defense-resist-the-dark-world-with-god-level","tags":["Male Lead","Action","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":5,"rating":2.75,"page_count":45,"view_count":1253,"chapters_count":20,"last_update":1717580702,"description":"The ever-growing singirious continent. Where there are millions of race thrive and grow.\nThere are Giant dragons, Holy Angel, Orcs, Ogres and many more.\nBut to thrive they all need to survive and counterattack the dark creatures in the dark mist.\nFollow Markus as he decided to live his new life in this continent and counter attacking the dark creatures with.... Tower defenses?\n\n(Markus Job is Lord)","description_hash":-4993667601513954567},{"title":"A Divided Fate","fiction_id":"87239","link":"https:\/\/www.royalroad.com\/fiction\/87239\/a-divided-fate","tags":["Ruling Class","Fantasy","Historical","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"In the grand realm of Kemet, a land divided into 8 majestic nomes, the opulent capital of Waset stands as a shining beacon of power and prosperity. It is here that the revered Hekau line has ruled for generations, their influence extending to even the farthest reaches of the land.\nWhen the Prime Regent's wife, Nebetah, gives birth to a daughter, Saliah, she is destined to rule. But when Saliah is born, the high seer of the Council of Seers, Ardlim, declares Saliah to have a curse, and she is banished from the kingdom. After this, twin sons are born, Kael and Alaric, and the entire kingdom rejoices at the prospect of an heir to continue the dynasty's legacy. From the moment they drew their first breaths, it was evident that these two boys were bound for greatness, though their paths would diverge in unprecedented ways.\nKael, the firstborn, was a child of remarkable intellect and insatiable ambition. Raised amid the splendor of the royal palace, he wanted for nothing, receiving the finest tutors and every luxury afforded to a prince. Yet, despite his privileged upbringing, a seed of resentment took root within him, fueled by a desperate craving for power and recognition.\nIn stark contrast, Alaric, the younger twin, possessed a gentle spirit and an unwavering moral compass. While he too enjoyed the comforts of nobility, his heart remained grounded in humility and compassion for those less fortunate. As the brothers matured, the chasm between their ideologies grew ever wider.\nThe descent into darkness began when Kael, consumed by envy and a thirst for domination, betrayed his own blood at the age of 16. In a shocking act of treachery, he orchestrated the assassination of his father, the Prime Regent Hekau, and framed his mother, Lady Nebetah, with the crime and had her banished to the outer reaches of the realm, to Ta-Mehu. He was able to get away with the crime because he was so young and therefore above suspicion. Alaric, horrified by his brother's actions, fled Waset, seeking refuge in the distant nome of Iunu. Here Alaric meets Thalorion, who was abandoned as an orphan and had to support himself, who becomes one of his best friends. The two eventually make their way to Abu, where they encounter Elyndra, an eccentric and quirky seer who tells Alaric that he must seek out his long-lost older sister, Saliah, as well as his mother, Lady Nebetah, since they are key to saving Kemet.\nMeanwhile, Kael has instituted a harsh regime throughout Kemet, crushing dissent and heavily taxing the populace. He authorizes the Medjay Shadows, an elite group of magic-wielding enforcers. The different nomes start having problems with the ingestible drug Moonshade Elixir, and the effects of an addicted people are everywhere. Poverty and crime are rampant.\nIn Ta-Mehu, Lady Nebetah encounters a very aged scribe named Horemheb the Learned, who teaches her an ancient form of magic, Sekhemweaving, which becomes virtually unstoppable when combined with another ancient magic, Ankhbinding.\nAfter Iunu, Alaric and Thalorion travel to Ta-She, where they meet and befriend Seralina, whose remarkable kinship with animals serves the three well on their travels. The three proceed to Anu, where they encounter Darian the Bold. After defeating Darian in a duel, Alaric persuades Darian to join their group. The group then travels through Sais and is shocked by the horrific effects of Kael's rule in that region. Alaric then decides that the group needs to find his sister and mother as the seer Elyndra instructed. They travel to Ta-Mehu, where Alaric and Lady Nebetah are reunited. Lady Nebetah joins their entourage, and they travel to Caelumreach to find Saliah.","description_hash":-8966535009983031964},{"title":"Whispers of Zephyrs","fiction_id":"87238","link":"https:\/\/www.royalroad.com\/fiction\/87238\/whispers-of-zephyrs","tags":["Tragedy","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":39,"chapters_count":1,"last_update":1716714372,"description":"In the magical city of Eldrin, young Kael discovers an ancient Resonance Stone that awakens powerful magical abilities within him. Under the guidance of the mysterious Morven, Kael learns to harness these powers, navigating a world where magic is as dangerous as it is enchanting. Alongside Lila, a skilled thief with secrets of her own, Kael delves into Eldrin’s shadowy underbelly, unearthing artifacts that challenge everything he knows about magic and morality.\nAs their exploits attract the attention of both allies and adversaries, Kael and Lila uncover a conspiracy that threatens to destabilize their entire world. Faced with escalating dangers and moral dilemmas, Kael must choose his path carefully, for each spell cast and alliance forged could be the difference between becoming a master mage or just another forgotten whisper in the wind.","description_hash":508342837538131227},{"title":"Wyrmblood","fiction_id":"87236","link":"https:\/\/www.royalroad.com\/fiction\/87236\/wyrmblood","tags":["LitRPG","Portal Fantasy \/ Isekai","War and Military","Multiple Lead Characters","Harem","Action","Adventure","Drama","Fantasy","Male Lead","Female Lead","Non-Human Lead","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":11,"rating":5.0,"page_count":85,"view_count":1321,"chapters_count":4,"last_update":1718444467,"description":"A curse carried by a grudge, a search for a lost daughter, a desperate fight to preserve a realm...\nAugust Zekes was just playing a tabletop rpg with his daughter and some friends.  Why has he become his own character, in a new world, one different from the game he played? Where is his daughter, Laila?  Join August on his quest alongside new friends, as he faces the forces which brought him into this world, and even old friends he never expected.  \nAugust must become his character, Coal Glittersgold, the mighty Wyrmblood.  He must use this power to save his friends, find his daughter, and perhaps even discover a way home.  First, however, he must overcome the challenges presented by this new world.","description_hash":5188762089354594165},{"title":"An Unlikely Connection: Part 3","fiction_id":"86971","link":"https:\/\/www.royalroad.com\/fiction\/86971\/an-unlikely-connection-part-3","tags":["Male Lead","Slice of Life","Drama","Romance","School Life","Low Fantasy","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":93,"view_count":302,"chapters_count":8,"last_update":1716334689,"description":"A new year arrives, and it brings with it the birth of a relationship built from a toxic situationship. As an amateur to only have a brief stent with an ex, Joshua must take on the role of being a highly regarded boyfriend to Yosefin and navigate the unforeseen tribulations on the road ahead.","description_hash":-4829645064540242701},{"title":"The Cultivation of a Hero","fiction_id":"86970","link":"https:\/\/www.royalroad.com\/fiction\/86970\/the-cultivation-of-a-hero","tags":["Super Heroes","Wuxia","Male Lead","Sci-fi","Secret Identity","Action","Fantasy","Martial Arts","Supernatural","Magic"],"lable":"Fan Fiction","following_count":10,"rating":4.0,"page_count":95,"view_count":992,"chapters_count":8,"last_update":1718571615,"description":"In a world where most superhuman abilities are the result of cultivation and Good, Neutral, and Evil cultivators all seek to better themselves, Lo Chang is just an average member of the Jade Dragon sect.  Though the sect was  founded by five immortals which each represented an element from wuxing, and teaches its members to cultivate elemental chi from the five elements, only one master remains.  When Demonic cultivators from the Black Serpent Sect attack the sect's senior members and kidnap the child recruits they were escorting, the sect sets off to assault their base, having gotten the location from the 'interrogation' of one of the demon cultivators.  During the assault, however, the Black Serpent members activate a  portal array using the blood of the kidnapped children, opening a portal to another realm.\nIn the DC Universe, S.T.A.R. Labs is unveiling a device they created, a portal generator which can reach universes outside the standard fifty two, worlds where the law of physics are slightly altered.  Before they can turn it on, however, the portal opens from the other side and several martial artists come through, attacking and capturing the people who are there.  Thankfully, however, Lo Chang has followed them through to prevent their escape, and Bruce Wayne and Clark Kent were both there for the announcement.\n\nNow that he is trapped in the DC Universe, a world of superpowers, technology, and few actual cultivators, Lo Chang must join with the heros to continue his calling to stop evil and hopefully return home.","description_hash":8864736633686820024},{"title":"Dragon Fighter","fiction_id":"86969","link":"https:\/\/www.royalroad.com\/fiction\/86969\/dragon-fighter","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Male Lead","Action","Adventure","Fantasy","GameLit"],"lable":"Original","following_count":3,"rating":4.5,"page_count":34,"view_count":620,"chapters_count":4,"last_update":1718524996,"description":"What happens when you have a soon-to-be college dropout meet a dragon? \nMichael just wanted to sit back and relax in his dorm room. He was just watching his favorite movie until he started to drift off to dreamland when he woke up somewhere else.","description_hash":2359565856053590450},{"title":"Intergalactic","fiction_id":"86968","link":"https:\/\/www.royalroad.com\/fiction\/86968\/intergalactic","tags":["Strategy","Multiple Lead Characters","Sci-fi","Male Lead","Female Lead"],"lable":"Original","following_count":10,"rating":3.9,"page_count":57,"view_count":1748,"chapters_count":20,"last_update":1718604901,"description":"A ragtag pirate crew just snagged a prize so hot it could ignite a multi-dimensional war. Stirred up by alien threats, spies, shady fences and military assault teams all struggle to get their hands on the loot, each for their own purpose. Can the pirates navigate a web of lies, hidden motives and intergalactic politics before the aliens unleash their wrath on their home, a refuge of humanity on the fringes of the galaxy?\nIntergalactic is a unique SciFi setting telling the story of humanity not as the dominent species. It explores an alternative answer to the question \"where is everybody?\" that puzzles contemporary astronomy. It also visits derelict space stations, multi-dimensional space and some of the amazing (many taken from real science) things that exist out there in the universe.","description_hash":-5826403120017685068},{"title":"Author in Black","fiction_id":"86967","link":"https:\/\/www.royalroad.com\/fiction\/86967\/author-in-black","tags":["Psychological","Multiple Lead Characters","Action","Horror","Mystery","Supernatural","Male Lead","Low Fantasy"],"lable":"Original","following_count":1,"rating":5.0,"page_count":7,"view_count":52,"chapters_count":1,"last_update":1716321673,"description":"A horror novel author with a dark past and uncanny abilities, teams up with the homicide detective to solve a case deeply entangled in the supernatural.","description_hash":-7906473371170662606},{"title":"Demolisher ","fiction_id":"86966","link":"https:\/\/www.royalroad.com\/fiction\/86966\/demolisher","tags":["Urban Fantasy","Multiple Lead Characters","Strong Lead","Action","Adventure","Fantasy","Romance","School Life","Supernatural","Male Lead","High Fantasy","Attractive Lead"],"lable":"Original","following_count":1,"rating":3.0,"page_count":30,"view_count":349,"chapters_count":6,"last_update":1718098205,"description":"Sial Velgner has been born with powerful Asmo.Though he never got the chance to use it.Because His family forbade him from using it.People without superpowers always hated those with with superpowers.Asmo users are considered as devils by normal people.So,An asmo user is always hated everywhere.That's why Sial hates people without Asmo.very soon his life will change by an individual","description_hash":1806889966571201334},{"title":"Epic Of Slime","fiction_id":"86965","link":"https:\/\/www.royalroad.com\/fiction\/86965\/epic-of-slime","tags":["LitRPG","Reincarnation","Action","Adventure","Fantasy","Supernatural","High Fantasy"],"lable":"Original","following_count":4,"rating":5.0,"page_count":2,"view_count":57,"chapters_count":1,"last_update":1716321567,"description":"Jeremiah has always been a normal kid, one who goes about his days always wishing to be popular in highschool and enjoying with his bestfriends. Now imagine a situation where he isekai'ed to a world with gods and demons, kingdoms and empires, and mythological monsters, as a.... SLIME!! Yes, I suppose you know that already as the first thing you did was read the title... Ok, I'm going to stop being annoying now. Let's see what Jeremiah is going to do in this unknown world or should I say... Haha,  got you! you thought!.. Yeah, I'm going to stop now.","description_hash":4255642131451129168},{"title":"Music for the Seamstress","fiction_id":"86964","link":"https:\/\/www.royalroad.com\/fiction\/86964\/music-for-the-seamstress","tags":["Reincarnation","Urban Fantasy","Multiple Lead Characters","Drama","Fantasy","Romance"],"lable":"Original","following_count":1,"rating":5.0,"page_count":3,"view_count":55,"chapters_count":1,"last_update":1716321549,"description":"After several reincarnations, a cursed Goddess and a cursed Mortal fight to be able to be one again. With no memories of each other, they need to be together before their souls are destroyed. With everything standing in their way, will they make it?","description_hash":8210035918845548159},{"title":"The Epoch Defenders","fiction_id":"86963","link":"https:\/\/www.royalroad.com\/fiction\/86963\/the-epoch-defenders","tags":["Portal Fantasy \/ Isekai","Multiple Lead Characters","Action","Adventure","Fantasy","Supernatural","High Fantasy"],"lable":"Fan Fiction","following_count":1,"rating":5.0,"page_count":10,"view_count":83,"chapters_count":2,"last_update":1716317243,"description":"With the great cataclysm caused by the Chronomancers, many universes were pulled together in an effort to gain complete control over time itself. However, all this did was cause various dimensional warps and permanently link these worlds together. Three heroes, Link, Cloud, and Geralt, were brought together to defend the newly formed multiverse from various threats. Now, together, they join forces with characters from across worlds to defeat the Chronomancers and other various villains.\nThis story is from Link's perspective, and the AI helps me choose characters to use and informs me of game\/show\/book details to make it consistent. The AI does not generate any actual content, that's all me ;).\nIf you think I am representing a character incorrectly, please leave a comment. I'll do my best to fix the errors.\nSorry about this, but this is going to be on hiatus pretty much right after it's published.","description_hash":7383093368748749889},{"title":"Welcome to Arkodia","fiction_id":"86962","link":"https:\/\/www.royalroad.com\/fiction\/86962\/welcome-to-arkodia","tags":["Progression","Multiple Lead Characters","Action","Adventure","Male Lead","Low Fantasy","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":147,"view_count":917,"chapters_count":28,"last_update":1718447371,"description":"Arkodia.  The continent on Earth with the most beautiful nature you will ever see.  The most amazing food you will ever taste.  The best life you will ever live.  All this awaits you in Arkodia.  That is if you are strong enough.  Determined enough.  Brave enough.  If your desire is worthy enough.  That’s what The Trials are for. Kiran and Easton are 2 that passed The Trials.  They are part of the 2775th cycle, and both suffer the worst fate any Arkodian could imagine – red-rank.  Kiran lost his memory.  Easton struggles to accept his reality.  Follow Kiran and Easton as they journey the land of Arkodia and try to overcome that which is thrown against them.  Follow them as they try to reach their ultimate desires.","description_hash":211681275927745516},{"title":"E.L.E Online: A Dinosaur Evolution LitRPG","fiction_id":"86961","link":"https:\/\/www.royalroad.com\/fiction\/86961\/ele-online-a-dinosaur-evolution-litrpg","tags":["Virtual Reality","Progression","Non-Human Lead","Drama","Action","Adventure","LitRPG","Male Lead","Soft Sci-fi"],"lable":"Original","following_count":33,"rating":4.86,"page_count":77,"view_count":2659,"chapters_count":13,"last_update":1717264005,"description":"\"Step into E.L.E Online: Extinction Level Event Online – Survive, evolve, and dominate as a dinosaur in the ultimate VR battle royale.\"\nThree estranged friends reunite in a high-stakes VR battle royale where they must survive as mutable dinosaurs. They'll have to rely on their skills and teamwork if they hope to have a chance of winning, but with old tensions resurfacing and deadly predators on their trail, their biggest challenge might be trusting each other.","description_hash":2159083619959793433},{"title":"The Awakened","fiction_id":"86960","link":"https:\/\/www.royalroad.com\/fiction\/86960\/the-awakened","tags":["Portal Fantasy \/ Isekai","Dungeon","Post Apocalyptic","War and Military","Multiple Lead Characters","Action","Adventure","Fantasy","Mystery","Supernatural","Male Lead","Strong Lead","Magic","High Fantasy"],"lable":"Original","following_count":6,"rating":5.0,"page_count":83,"view_count":1008,"chapters_count":17,"last_update":1718625597,"description":"In the bustling heart of London,  A crack appears in the sky, accompanied by a chilling question: \"Do you have what it takes to save the world?\" Those who select \"Yes\" are thrust into an extraordinary new reality where they gain mysterious abilities and are presented with a countdown timer. \nIn a world torn apart by monstrous invasions and eerie sky fissures, a group of ordinary people are thrust into extraordinary circumstances. Harry, originally from India, finds himself in London when chaos erupts. Alongside his friends, Susan and Marcus, he navigates the treacherous new reality where survival skills are paramount, and unity is the key to overcoming the threats that loom.\n\"The Awakened\" is a tale of resilience, camaraderie, and the relentless human spirit. In a landscape ravaged by chaos, Harry, Susan, and Marcus must rise above their fears, harness their abilities, and lead the charge to restore order and hope to a world on the brink of collapse.","description_hash":-6887866861284763437},{"title":"Animal Kingdom Come","fiction_id":"86959","link":"https:\/\/www.royalroad.com\/fiction\/86959\/animal-kingdom-come","tags":["Non-Human Lead","Sci-fi","Action","Adventure","Fantasy","Supernatural","Magic"],"lable":"Original","following_count":1,"rating":4.0,"page_count":22,"view_count":210,"chapters_count":2,"last_update":1717917660,"description":"A young boy on the run finds himself deep in the forest, stumbling upon a tiny hidden kingdom, and goes through some... changes...","description_hash":2906518193931442524},{"title":"The Commissar's Duty ","fiction_id":"86958","link":"https:\/\/www.royalroad.com\/fiction\/86958\/the-commissars-duty","tags":["War and Military","Grimdark","Sci-fi","Tragedy","Short Story","Hard Sci-fi","Dystopia"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":5,"view_count":85,"chapters_count":1,"last_update":1716311106,"description":"Commissars serve the dual-purpose role of discipline officer first and political officer second in the regiments of the Astra Militarum. In a well disciplined regiment, a Commissar need not be so active and can let those roles reverse somewhat, but when a trooper becomes compromised the roles snap back into proper place","description_hash":-1732595186039123181},{"title":"Echoes of Ascendancy","fiction_id":"86957","link":"https:\/\/www.royalroad.com\/fiction\/86957\/echoes-of-ascendancy","tags":["Portal Fantasy \/ Isekai","War and Military","Grimdark","Multiple Lead Characters","Strong Lead","Action","Adventure","Drama","Fantasy","Reincarnation","Supernatural","Male Lead","Female Lead","Magic","Ruling Class"],"lable":"Original","following_count":8,"rating":5.0,"page_count":140,"view_count":1558,"chapters_count":19,"last_update":1717498069,"description":"Reborn in the ancient world of magery and adventure, Sorefen, a lone human soul finds themself inhabiting the body of a dead man.\nUnluckily for them, the dead man was not a legendary warrior, a wizened mage or a prophesied hero. No, Shale Kadran was an indentured labourer sentenced to work in Carrigan's Blight; a cursed battlefield of no use to anyone for untold years. The Blight is a volatile exclusion zone, an ashen wasteland home only to the unlucky few condemned to decontaminate the cursed land and contain the rot that breeds from within it.\n Himself transformed by the magic fallout that destroyed the land, Shale was an outcast. Stranded among soldiers, murderers and monsters, he must prove himself or die. Again. Because change is coming, no matter who denies it.\n The spirits have been whispering of an imminent calamity. They've converged upon the Blight in anticipation of the Awakening. For the One to be reborn from the depths. For the end of all ends!","description_hash":5447478877522559113},{"title":"The Archwizards' System: A dungeons tale","fiction_id":"86956","link":"https:\/\/www.royalroad.com\/fiction\/86956\/the-archwizards-system-a-dungeons-tale","tags":["GameLit","Portal Fantasy \/ Isekai","Dungeon","Anti-Hero Lead","Non-Human Lead","Action","Adventure","Fantasy","Reincarnation","Magic","High Fantasy","Technologically Engineered","First Contact"],"lable":"Original","following_count":16,"rating":5.0,"page_count":0,"view_count":81,"chapters_count":1,"last_update":1717868609,"description":"Nova was a studious person who dreamed of being at the forefront of xenobiotic development. Sadly, the cosmos was ripped asunder, breaking the universe in unfathomable ways and destroying everything in it. However, after his untimely death, the system offered Nova a contract to help terraform the planet and prepare its people for disasters yet to come by becoming a dungeon. With the alternative being a coin flip between his soul's destruction and his god caring enough to save him, he gladly accepts.\n Join Nova as he works to build a dungeon, terraform the surface, and bring back xenobots that became so prominent in the last decade.","description_hash":-5631196312615253268},{"title":"The Force of Blood","fiction_id":"86955","link":"https:\/\/www.royalroad.com\/fiction\/86955\/the-force-of-blood","tags":["Wuxia","Adventure","Fantasy","Mythos"],"lable":"Original","following_count":5,"rating":5.0,"page_count":120,"view_count":883,"chapters_count":11,"last_update":1718600032,"description":"In my attempt to be a worthy heir and defeat the darkness, I suffered the curse of weak blood. The greatness of our House lies in the past, but few dare to challenge us. A thousand years ago, after the initiation, I could have been worthy of my father’s title and sword, perhaps even restored our House to its former glory...That was what I believed until I realized that I wasn’t the cursed one, but my blood, tainted by the darkness of the Nameless One, long vanquished. An heir? Restored grandeur? My father would kill me with his own hands if he knew that the cursed blood of the long-gone lineage had awakened within me. Our neighbors would wipe our lands off the face of the earth at the mere suspicion.As I see it, there is only one way out.I must burn out the cursed blood and silence the whispering shadows within me.","description_hash":-1428787398822216540},{"title":"Why Would I Need a Cheat?","fiction_id":"86954","link":"https:\/\/www.royalroad.com\/fiction\/86954\/why-would-i-need-a-cheat","tags":["Progression","Anti-Hero Lead","Xianxia","Psychological","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":22,"rating":4.88,"page_count":137,"view_count":3914,"chapters_count":24,"last_update":1718470803,"description":"Born into poverty, Ji Kang learned very early that laws are a tool of oppression and social structures exist to benefit those already on top. If he was to have any chance of making a better life for himself he couldn't let morality stand in his way.\nThis is a story of a quiet, introspective and intelligent young boy living in a cruel and unfair world. How will he climb the treacherous ladder of cultivation when the odds are stacked in the favor of his peers?","description_hash":-4548400112194324382},{"title":"DEATHWISH","fiction_id":"86953","link":"https:\/\/www.royalroad.com\/fiction\/86953\/deathwish","tags":["Action","Adventure","Fantasy"],"lable":"Original","following_count":2,"rating":5.0,"page_count":36,"view_count":565,"chapters_count":10,"last_update":1717762052,"description":"Kai Brandr made a mistake, and was killed for it. Fortunately, the Devil granted him a second chance. He vow to do things right this time around.","description_hash":5467672989144897939},{"title":"Iridescent Intrigue","fiction_id":"86952","link":"https:\/\/www.royalroad.com\/fiction\/86952\/iridescent-intrigue","tags":["Multiple Lead Characters","Action","Adventure","Romance","Mystery","Low Fantasy"],"lable":"Original","following_count":3,"rating":4.83,"page_count":212,"view_count":895,"chapters_count":15,"last_update":1718592402,"description":"Readers can expect a cosy mystery set in an emergent pre-industrial world. Mild action, romantic and fantasy elements. \nThis story is finished, so you don’t have to worry about getting part way through and never finding out ‘who done it.’   My goal was to write something readers would be able to solve along with, or if you are clever, before the protagonists.\nDereniik is a Deputised Operative Commander. (Detective.) Catastrophe earlier in the rotation has left him disabled, suffering from panic attacks and struggling to find meaning in continued existence.  Lady La’navikyaa, Viky, is a Second Daughter from The Rifts grappling with the death of her parentals, changed circumstances and forced relocation.\nThis unlikely duo team up to locate a stolen item. \nI hope you enjoy reading. Any constructive feed back will be appreciated. This book is average novel length, but I have other works in this series already written. So, I will see how this goes. I am disabled and write for pleasure and pain relief.  \nUpdates. I am planning to update every couple of days.  \nPlease note I will be using Australian spelling.","description_hash":-5541104193000842432},{"title":"Inheriting the Mantle: The Rey Legacy","fiction_id":"86951","link":"https:\/\/www.royalroad.com\/fiction\/86951\/inheriting-the-mantle-the-rey-legacy","tags":["LitRPG","Progression","Post Apocalyptic","War and Military","Martial Arts","Action","Adventure","Fantasy","Romance","Male Lead","Magic","Strategy","Mythos","First Contact","Attractive Lead"],"lable":"Original","following_count":152,"rating":3.75,"page_count":209,"view_count":12856,"chapters_count":37,"last_update":1718393544,"description":"When the world changes overnight, Alexander Rey discovers his destiny lies not in healing others as a physiotherapist, but in mastering the ancient powers of his family legacy.\nThe sudden integration of the System transforms Earth, unlocking magical powers and potential within humanity. Alexander Rey, a 21-year-old martial arts enthusiast, is thrust into a year-long, personalized tutorial that tests every aspect of his being—body, mind, and mana. \nNavigating a new world of challenges and alliances, Alexander must balance power with responsibility.\nAs he progresses through the tutorial, Alexander faces challenges that range from the mundane to the deadly, each designed to prepare him for the drastically altered world outside. With limited attempts available and the highest stakes reserved for the most daunting challenges, every decision could be his last.\n*******\n\"Inheriting the Mantle: The Rey Legacy\" weaves a story of personal growth, power, and survival in a transformed world. Ideal for fans of high-stakes LitRPG and stories of profound transformation.\n- LitRPG elements with a detailed System interface\n- A protagonist growing from normal to beyond\n- Themes of legend, mythologies and cosmic powers\n- Slight cultivation themes with wuxia\/xianxia\n- High-risk challenges with real consequences\n*******\nI'm currently just using a prompt image, but as I'm looking to publish in the futur, I will be looking for a graphist.\nOn that note, since I wish to be able to publish my work, I welcome all due critiques to make it better and more enjoyable for my readers.\nEnglish is my third language, so please be lenient.\nEnjoy!","description_hash":-3619308185219790193},{"title":"My Kingdom Vast, My Towers Tall","fiction_id":"86950","link":"https:\/\/www.royalroad.com\/fiction\/86950\/my-kingdom-vast-my-towers-tall","tags":["Dungeon","War and Military","Psychological","Adventure","Fantasy","Short Story","Supernatural","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":33,"chapters_count":1,"last_update":1716311009,"description":"The plight of a wandering torturer, lord of worms","description_hash":-6237580176779840779},{"title":"Vivalda Lee and the Secrets of the Fourth Dimension","fiction_id":"86949","link":"https:\/\/www.royalroad.com\/fiction\/86949\/vivalda-lee-and-the-secrets-of-the-fourth-dimension","tags":["Female Lead","Sci-fi","Short Story","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":40,"view_count":33,"chapters_count":1,"last_update":1716311001,"description":"Culinary and criminal entrepreneur, Scratch is on her way to the planet Serendipity to take up a position as private chef for a billionaire.\nShe's going to have to make it through the fourth dimension first.","description_hash":8428830437144825530},{"title":"The Whistle Hero","fiction_id":"86948","link":"https:\/\/www.royalroad.com\/fiction\/86948\/the-whistle-hero","tags":["GameLit","Male Lead","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":136,"chapters_count":3,"last_update":1716917662,"description":"This story is about the journey of Lucas, a boy from the farmer town of Blueren. About how he will receive his Blessing from the Goddess, and the adventures that will come from this event.","description_hash":-6809118947889597888},{"title":"Kung Fu Academy S\/ カンフーアカデミーS","fiction_id":"86947","link":"https:\/\/www.royalroad.com\/fiction\/86947\/kung-fu-academy-s-s","tags":["Comedy","Multiple Lead Characters","Action","Adventure","Mystery"],"lable":"Original","following_count":1,"rating":0.0,"page_count":8,"view_count":38,"chapters_count":1,"last_update":1716310871,"description":"In the thrilling sequel to Kung-Fu Academy, the heroes of Zokor Island must confront their greatest challenge yet as sinister forces emerge from the shadows. With the lines between friend and foe blurring, Jax, Kiyoshi, Felix, and Lionel find themselves caught in a web of dark secrets that threaten to unravel the very fabric of the academy.\nAs an ancient evil stirs, whispers of a terrifying power thought lost to legend begin to echo through the halls. The young warriors must dig deep within themselves, mastering new heights of their spirit guardian abilities, if they hope to protect the island and those they hold dear.\nBut the path ahead is fraught with peril, as rivals old and new conspire to seize control. Shocking revelations will test the bonds of friendship, love, and loyalty, forcing our heroes to question everything they thought they knew.\nIn a world where the line between light and darkness grows ever thinner, the fate of Zokor Island hangs in the balance. Only by standing together can the young fighters hope to triumph over the gathering storm and forge a new legacy for the Kung-Fu Academy.\nPrepare yourself for an electrifying tale of mystery, adventure, and pulse-pounding martial arts action as the students of Zokor Academy face their destiny in Kung-Fu Academy S","description_hash":-6114538034565576029},{"title":"Can I Live My Life?","fiction_id":"86946","link":"https:\/\/www.royalroad.com\/fiction\/86946\/can-i-live-my-life","tags":["Urban Fantasy","Multiple Lead Characters","Contemporary","Drama","Fantasy","Romance","School Life","Female Lead","Low Fantasy","Mythos"],"lable":"Original","following_count":2,"rating":5.0,"page_count":174,"view_count":662,"chapters_count":16,"last_update":1718420404,"description":"The story begins in Golden Rivers, a fictional prosperous city founded by five prominent founding families: O’Cean, Deverell, Landin, Oberst, and De Kure. These families hold significant historical, economic, and social influence, each being blessed by their respective gods and goddesses. The city's heritage is steeped in their intertwined legacies, making their children’s lives highly scrutinized and predetermined by family expectations.\nThe story centers around Adeline O’Cean, and Maris, the goddess that has watched over the O'Cean family for generations. It follows Adeline's life through her friendships and relationships, and Maris's attempt to guide Adeline towards her destiny - one she believes will outshine any other legacies.\nUnknown to Adeline and the residents of Golden Rivers, they are being watched by celestial beings who are heavily invested in their lives - especially those of the founding families. These divine entities influence them, causing them to question their choices and navigate the pressures of their prestigious family legacies while striving to carve out their own paths.\nWill the powers above control their destiny, or can they take their life by their own reins?\n***Currently Updating three day per week on Mondays, Wednesdays, and Fridays, by 8 PM PDT***\n***As I'm a new writer, I have used AI to assist me with editing. Please feel free to let me know if you notice any errors that was missed by the AI and myself. Thank you.***","description_hash":-2497331431519858505},{"title":"Prophet of corpses","fiction_id":"86945","link":"https:\/\/www.royalroad.com\/fiction\/86945\/prophet-of-corpses","tags":["Action","Fantasy","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":120,"chapters_count":3,"last_update":1718488551,"description":"Prophets don’t have cores like normal people, instead being able to have visions pertaining to certain subjects like the future, past, and present. All have their uses but Ergo along with having an unfortunate name, and not getting the powers associated with a core, gets the prophet ability to see corpses, and not in a cool way just like looking at a corpse kind of way. And even more unfortunate is that the house Ergo is a slave of is so filthy rich and powerful that every month they take a couple slave that are specifically bought for said purpose and make them battle to the death in battle royals.","description_hash":629916086189713000},{"title":"I Woke Up In a Dangerous Fantasy World But At Least I'm Finally A Girl","fiction_id":"86944","link":"https:\/\/www.royalroad.com\/fiction\/86944\/i-woke-up-in-a-dangerous-fantasy-world-but-at","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Female Lead","Drama","Action","Adventure","Fantasy","Gender Bender","Magic","GameLit"],"lable":"Original","following_count":2,"rating":0.0,"page_count":11,"view_count":272,"chapters_count":3,"last_update":1716836402,"description":"This is a self-indulgent story of a transgender woman in her 20s who wakes up in a fantasy world with the body she dreamed of. Now she just has to survive an attack from Dire Wolves (and other assorted monsters) to keep it.\nThis is also an experiment for me to see how well I can write a serialized story with minimal planning. I always over-plan so this will help me figure out which parts of the planning are actually necessary in the future.\nOne last note: Although Naomi thinks about having a 'girl body' and uses similar terms, in truth, women come in all shapes and sizes. (And they will in this story too!) I have no interest in bioessentialism and only use these terms to keep the sentences readable. And often in the depths of dysphoria, even gender anarchists like me think in the regressive binary terms we were raised with.","description_hash":-1476517469455948268},{"title":"Grin Gold","fiction_id":"86943","link":"https:\/\/www.royalroad.com\/fiction\/86943\/grin-gold","tags":["Grimdark","Action","Adventure","Fantasy","Horror","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":29,"chapters_count":1,"last_update":1716310834,"description":"Filth breeds filth\nThat is but one rule, amongst many\nA old soul finding new roots, new hopes, yet forever haunted by truth\nThe monsters made by the many, was spread by the few, leaving a entire culture ravaged and buried in time\nWhat came out of it was nothing, so something new took place, a disheartening Wild West with its own rules and history\nDiscoveries so important, they are overlooked as but common law, and lost knowledge thought to be the next step in innovation, a pit of death for all.\nJoin someone really out of touch of history, fear for what was left of his time.","description_hash":-4593023448695955016},{"title":"Soul of a Human","fiction_id":"86942","link":"https:\/\/www.royalroad.com\/fiction\/86942\/soul-of-a-human","tags":["Ruling Class","Non-Human Lead","Slice of Life","Adventure","Fantasy","Male Lead"],"lable":"Original","following_count":37,"rating":4.62,"page_count":207,"view_count":8493,"chapters_count":37,"last_update":1718551837,"description":"Ongoing story about a magical race called kin and the story of a young boy bound to the soul of an extraterestial beeing.\nAlso found on Reddit HFY, under the same title.\n\nUsing grammarly for proofreading, because english is not my first language.","description_hash":7192497391837666553},{"title":"Shadows of Fate: The Wanderer's Path","fiction_id":"86941","link":"https:\/\/www.royalroad.com\/fiction\/86941\/shadows-of-fate-the-wanderers-path","tags":["Progression","Grimdark","Action","Adventure","Fantasy","Mystery","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":5.0,"page_count":84,"view_count":549,"chapters_count":8,"last_update":1717597213,"description":"In the remnants of a world shattered by apocalyptic devastation, Aizen, a reluctant hero cloaked in mystery, finds himself ensnared in the threads of an ancient prophecy. As ominous portents and forgotten powers awaken, Aizen is thrust into a perilous quest, where the fate of the world hinges on his hidden past and untapped potential.\n\"Shadows of Fate: The Wanderer's Path\" delves into profound themes of identity, destiny, and the eternal struggle for balance. Aizen's odyssey is one of magical battles, deep-rooted conflicts, and poignant self-discovery, as he faces trials that test his spirit and unravel the enigmatic tapestry of fate.\nEmbark on an epic saga of unparalleled grandeur, where the echoes of prophecy resound, and the shadows of fate loom large. Will Aizen follow the path of fate, or will the encroaching darkness consume him and the world he strives to save?\n\n(Hi there! Thanks for stopping by! I work a high stress job and as a result, the amount of time I get to write is sparring. I will post when I can but all I ask is that you bear with me. I aim to post a chapter minimum, or two, a month. If I am unable to release a chapter then I will make a post on my page and will post two chapters the following month. Thank you for reading!)","description_hash":5399578351642631169},{"title":"The Thneed to Feed","fiction_id":"86940","link":"https:\/\/www.royalroad.com\/fiction\/86940\/the-thneed-to-feed","tags":["Male Lead","Tragedy","Horror","Short Story","Satire"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":13,"view_count":50,"chapters_count":1,"last_update":1716297083,"description":"The Once-ler was once an ambitious man in hopes to change the world with his Thneeds. After a small bump in plans, he found his true calling. [Commissioned Work]","description_hash":966881259909187564},{"title":"Untold Cases: Origins","fiction_id":"86939","link":"https:\/\/www.royalroad.com\/fiction\/86939\/untold-cases-origins","tags":["Psychological","Horror","Short Story"],"lable":"Original","following_count":0,"rating":5.0,"page_count":8,"view_count":61,"chapters_count":1,"last_update":1716294008,"description":"These are files of the origins of known artifacts in the main series; Untold Cases.","description_hash":-1323030519106536155},{"title":"OMEGA II: Alpha and Omega: Rise of the Supernaturals","fiction_id":"86938","link":"https:\/\/www.royalroad.com\/fiction\/86938\/omega-ii-alpha-and-omega-rise-of-the-supernaturals","tags":["Urban Fantasy","Multiple Lead Characters","Action","Adventure","Fantasy","Horror","Supernatural","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":200,"view_count":530,"chapters_count":15,"last_update":1717795690,"description":"Synopsis\nIn the annals of time, the clash between supernaturals brewed long before humanity's transition into their ranks, a conflict ordained by ancient forces. The battle for supremacy exacted a toll, paving the way for a fragile coexistence among humans and their ethereal brethren. Colonies and clans, torn asunder by strife, found themselves reunited beneath the banner of an uneasy peace. Yet, amidst the tranquility, whispers of a new prophecy emerged—a prophecy destined to shape the destiny of both supernaturals and ordinary mortals alike.\n\nAuthor's Note: Changes from Omega\n\"In the upcoming storyline, 'Omega 2: Alpha and Omega: Rise of the Supernaturals,' we'll introduce 'The Fawich Scream,' a potent sonic technique born from the fusion of fairy and witch powers. This formidable ability, wielded by Alicia East and Sarah Lance to vanquish Azriel and Veronica, is reserved for the elite descendants of these ancient bloodlines. While staying true to the essence of the Fawich scream from its canon in 'Omega,' our sequel will imbue it with a unique flair. Furthermore, we'll now collectively refer to vampire fairies and vampire witches as 'Fawich' for clarity, retaining their inherited abilities and weaknesses. However, they'll face newfound vulnerabilities against opponents wielding combined forces or possessing exceptional strength, despite their traditional susceptibilities to sunlight or the might of the most powerful supernatural descendants.\"\nThe Fawich wield a formidable power: the ability to transmute both humans and certain supernaturals into their fold, including vampires, fairies, and witches. This transformative process echoes the original essence found in vampire witches and vampire fairies, now unified under the banner of Fawich in \"Omega 2: Alpha and Omega: Rise of the Supernaturals.\" Those subjected to this metamorphosis emerge with razor-sharp claws adorning their hands and feet, menacing fangs poised to strike, and a pallid complexion that speaks of their newfound kinship with darkness. Moreover, they sprout majestic wings reminiscent of an eagle's, yet fashioned in the eerie silhouette of bat wings, a testament to their augmented prowess and otherworldly lineage.\nIn Omega 2: Alpha and Omega: Rise of the Supernaturals, several alterations have been made to the portrayal of supernatural blood and its effects compared to the canon story. Notably, supernatural blood now possesses a diverse array of qualities unique to each lineage. Fairies, vampires, lycanthropes, hybrids, and tribrids are endowed with remarkable healing abilities, enabling them to share their life force with others. This includes supernaturals lacking inherent healing capabilities, such as witches, shape shifters, seekers, and ordinary humans. When supernaturals with healing powers exchange blood, they can briefly augment their own abilities, though this enhancement does not extend to non-healers. Furthermore, the sequel introduces a host of new characters alongside the remaining survivors from OMEGA, promising fresh dynamics and compelling interactions within the supernatural realm.\nThese adjustments serve to enrich the narrative and expand upon the complexities of the supernatural world portrayed in Omega, enhancing the overall storytelling experience for readers. Thank you for embarking on this journey with me.\nHappy Reading.","description_hash":-8989109933510280967},{"title":"Diary Of A Pokémon Trainer 3, Lawyers Go Skint.","fiction_id":"86937","link":"https:\/\/www.royalroad.com\/fiction\/86937\/diary-of-a-pokemon-trainer-3-lawyers-go-skint","tags":["GameLit","Time Travel","Anti-Hero Lead","War and Military","Comedy","Action","Satire","Supernatural","Multiple Lead Characters"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":3,"view_count":55,"chapters_count":1,"last_update":1716293982,"description":"If I’m gonna be honest for you yeah this just connects all the poptartverse together but hey it works, basically there’s these kids if you haven’t read the book before you won’t know so read like the Wattpad version cuz I’m to lazy to do it on here for now. \nSo yeah it’s Pokémon but human in ball, its not really about that though innit it’s about the lawsuit Kirby and Garfield are about to do, and nobody is safe.","description_hash":-5370951196408822630},{"title":"A God's Life","fiction_id":"86936","link":"https:\/\/www.royalroad.com\/fiction\/86936\/a-gods-life","tags":["Ruling Class","Tragedy","Drama","Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":4.0,"page_count":1,"view_count":56,"chapters_count":1,"last_update":1716293968,"description":"Have you ever wondered what it would be like to be the only thing in existence?\nThen meet the god Aeon, who is really bored.","description_hash":6296858239812110811},{"title":"Dream Arts Academy ","fiction_id":"86935","link":"https:\/\/www.royalroad.com\/fiction\/86935\/dream-arts-academy","tags":["Female Lead","Contemporary","Slice of Life","Drama","Adventure","School Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":39,"view_count":304,"chapters_count":7,"last_update":1716443408,"description":"\"Dream Arts Academy\" is a captivating journey into the world of creativity, imagination, and self-discovery. Set in a prestigious academy where dreams come to life, the story follows a group of young students with extraordinary talents as they navigate the challenges of mastering their abilities. Join Reign, her friends and the students of dream arts academy as they navigate the school and achieve their dreams.","description_hash":2616430821707916202},{"title":"Beyond Minds","fiction_id":"86934","link":"https:\/\/www.royalroad.com\/fiction\/86934\/beyond-minds","tags":["Urban Fantasy","Ruling Class","Psychological","Multiple Lead Characters","Slice of Life","Fantasy","Romance","Mystery","Supernatural","Low Fantasy","Genetically Engineered "],"lable":"Original","following_count":4,"rating":0.0,"page_count":56,"view_count":792,"chapters_count":8,"last_update":1718361110,"description":"After enduring the public humiliation of her broken engagement to the crown prince, Serena retreats from courtly life to Nordenheim, seeking solace in her newly built bookstore. Amidst her year of peace, Serena receives an unexpected gift from her aunt—a half-breed mutt, bearing the semblance of a human boy with distinct animalistic features craft through alchemical means.\n-----\nNote: This story emphasizes on emotional and psychological reactions, with some mild gore on later chapters. The pacing shifts between slow and fast, mostly leaning towards slow. Please note that this is a second draft, and there may be further edits and revisions in the future. Try reading the first five chapters to see if it’s to your liking!","description_hash":-1685736820874152000},{"title":"Adherent Worlds: Sons of Destiny","fiction_id":"86933","link":"https:\/\/www.royalroad.com\/fiction\/86933\/adherent-worlds-sons-of-destiny","tags":["Reincarnation","Non-Human Lead","Action","Adventure","Fantasy","Romance","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":5.0,"page_count":127,"view_count":1327,"chapters_count":15,"last_update":1717523537,"description":"In a cosmos where two worlds, Salaria and Ulumbria, dance in a delicate balance, the threat of convergence looms. Dark Ulumbria, hungering for the traits of power, stands poised to engulf the light of Salaria, tipping the scales toward oblivion. Enai, a son of legacy, and Zacarya, an Ice Elf of ancient lineage, are thrust into an odyssey across veiled realms. Together, they must outpace the dark son's grasp, seeking the scattered traits that pulse with the world's essence. Their quest is a race against the unraveling of existence itself, where the triumph of light over shadow is the only path to salvation. For if they falter, Salaria, the realm of harmony, will fall to the eternal night of Ulumbria's dominion. \" I suggest Listening to the Witcher 3 soundtrack while reading they pair well together, as does the Skyrim soundtrack.\"","description_hash":-9057657698011103271},{"title":"A Woman of Repose","fiction_id":"86932","link":"https:\/\/www.royalroad.com\/fiction\/86932\/a-woman-of-repose","tags":["Progression","Ruling Class","Female Lead","Drama","Historical","Romance","Mystery"],"lable":"Original","following_count":1,"rating":0.0,"page_count":32,"view_count":86,"chapters_count":2,"last_update":1717728417,"description":"An English Lady with a chronic illness discovers she has been part of a business deal with her uncle to secure a marriage and a business contract with Americans. She is forced to withhold the marriage to provide social interactions and movements for her husband, and fears greatly that her illness will interfere with that prospect- but it turns out that her husband has a secret of his own. While he commits to his interactions with his Father's business, there is a darker side that he fears will come to light. \nSoon our heroine finds an Investigator at her door, looking into possible misdealings, mysteries, and even murder. As she begins to feel vulnerable and attachment to her husband, she fears that perhaps he is a part of something disastrous not only to England but the future of the world.","description_hash":-4630957039714343646},{"title":"Cartwheel","fiction_id":"87451","link":"https:\/\/www.royalroad.com\/fiction\/87451\/cartwheel","tags":["Comedy","Multiple Lead Characters","Slice of Life","Adventure","Fantasy","Horror","Magic","High Fantasy"],"lable":"Original","following_count":6,"rating":4.86,"page_count":141,"view_count":1800,"chapters_count":23,"last_update":1718632836,"description":"The village of  Cartwheel just wants to be left alone. They drink, they fight. They build wagons and carts, and they send them far away. Far, far away.","description_hash":-4319451113095785003},{"title":"Wings of SOL","fiction_id":"87450","link":"https:\/\/www.royalroad.com\/fiction\/87450\/wings-of-sol","tags":["Virtual Reality","Progression","Anti-Hero Lead","Space Opera","War and Military","Action","Adventure","Sci-fi","Tragedy","LitRPG","Cyberpunk","Female Lead","Strong Lead","Multiple Lead Characters","Strategy","Genetically Engineered ","Technologically Engineered","Hard Sci-fi","Dystopia"],"lable":"Original","following_count":1,"rating":0.0,"page_count":19,"view_count":162,"chapters_count":4,"last_update":1717870017,"description":"In the distant future where mankind controls the milky way, new factions arise and empires fall. Doxen is someone who loves playing simulation games and recently got her hands on a specific piece of hardware that piqued their interest. This hardware allows her to play as one of the billions of clones in the many warring fronts surrounding the New Sol Empire, both foreign and domestic. However, when do the lines blur between game and actual lives being taken. She is used to the horrors of claustrophobic mega cities, but is she prepared for the horrors of war? Will she be ready when those horrors knock on her door? \n\n\n\nThis is a very slow burn story and I plan to release it every week on Friday or possibly every three days depending on schedule. The content warnings are for artistic freedom and expect some POV changes. \nThere is some content with military strategy that you don't necessarily need to know but it helps. It'll start very slowly and slowly ramp up as the war intensifies. The litrpg aspects are important but not the main focus, that being the military and combat actions, as well as cool Sci-Fi stuff I find in my brain\/online, with cyberpunk aspects as well. \nThis is my first time actually posting one of my writings so some constructive criticism would be greatly appreciated. \nFirst volume will be about world building and her first war.\nAverage 900 ~ 1600 words per chapter, maybe more depending on chapter. Expect weekly updates every Friday.","description_hash":-3911560371032768928},{"title":"Just some insanity, nothing to see here","fiction_id":"87449","link":"https:\/\/www.royalroad.com\/fiction\/87449\/just-some-insanity-nothing-to-see-here","tags":["Virtual Reality","Strategy","Comedy","Contemporary","Action","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":139,"chapters_count":2,"last_update":1717084861,"description":"Yep, this overworked creative PR team worker is now a secret VRMMORPG villain, disguised as a \"tester\", causing chaos and madness everywhere. I mean, you can't have a game without villain right?","description_hash":7534849132178430986},{"title":"A-279","fiction_id":"87448","link":"https:\/\/www.royalroad.com\/fiction\/87448\/a-279","tags":["Post Apocalyptic","Villainous Lead","Psychological","Male Lead","Horror","Short Story"],"lable":"Original","following_count":1,"rating":0.0,"page_count":21,"view_count":206,"chapters_count":5,"last_update":1717256717,"description":"One man hatched a plan, and executed it. Executed us. Now it is his turn.","description_hash":2797670453377153387},{"title":"Eternal Shadows","fiction_id":"87447","link":"https:\/\/www.royalroad.com\/fiction\/87447\/eternal-shadows","tags":["Time Loop","Psychological","Male Lead","Tragedy","Drama","Low Fantasy","Time Travel"],"lable":"Original","following_count":1,"rating":0.0,"page_count":1,"view_count":37,"chapters_count":1,"last_update":1717030911,"description":"\"Eternal Shadows\" follows the harrowing journey of Isayo Mazabushi, a young man cursed to relive his own death, trapped in a cycle of torment. Determined to break free from this curse, Isayo seeks redemption by confronting the darkness within himself and making amends for his past sins. Along the way, he forms unlikely alliances and battles against those who seek to exploit his vulnerability. As Isayo delves deeper into the shadows of his own soul, he uncovers layers of betrayal, identity theft, and deeply buried secrets. With each confrontation, Isayo faces the choice between succumbing to his past or forging a new path towards redemption. But as the darkness threatens to consume him, Isayo must find the strength to confront his inner demons and embrace the light of hope.","description_hash":-5434651517852644521},{"title":"The Majestic Ascension – From Necromancer to Deity, and Deity to Supreme Creator.","fiction_id":"87446","link":"https:\/\/www.royalroad.com\/fiction\/87446\/the-majestic-ascension-from-necromancer-to-deity","tags":["Time Travel","Progression","Anti-Hero Lead","Space Opera","War and Military","Action","Adventure","Horror","Sci-fi","Cyberpunk","Male Lead","Strategy","Low Fantasy","Ruling Class","Artificial Intelligence"],"lable":"Original","following_count":8,"rating":4.17,"page_count":267,"view_count":1600,"chapters_count":14,"last_update":1717828258,"description":"Vermond is just a normal, struggling salvager until he acquires a power that allows him to summon anything he can imagine. This is the epic tale of Vermond's journey, as he transforms from a humble space necromancer into a Supreme Creator through his cunning and villainous acts. Witness the rise of a dark legend, where every sinister choice and powerful summoning brings him closer to ultimate godhood. This is a story of ambition, power, and the relentless pursuit of supremacy.\n\nAuthor- LFNMA Sci-fi Novels©                                                                                            \nVice author- CodeGuru and Tomoko-Yakumo (Space Stories | Experts)                                \nEditor- Ely and Jerome (Editing Skills | Expert)                                                                                \nTranslator and proofreader-  Bãmondo Shū (English Dictionary 3rd-5th Generation | Expert)          \nBetareader- Kurisha-karura (English Dictionary 4th Generation | Expert)\n\nLike, Comment, Rate, and follow. thank you for reading our story!","description_hash":-7695500635233155179},{"title":"Conquistador Cultivator","fiction_id":"87445","link":"https:\/\/www.royalroad.com\/fiction\/87445\/conquistador-cultivator","tags":["Reincarnation","Progression","Anti-Hero Lead","Xianxia","Grimdark","Action","Adventure","Fantasy","Horror","Male Lead"],"lable":"Original","following_count":16,"rating":4.08,"page_count":96,"view_count":1316,"chapters_count":10,"last_update":1718227942,"description":"It's the year of our lord 1518, and I'm on a ship to Mexico. My sanity is hanging on by a thread, and only writing in my diary helps. This is life number three, and I'm back in my own world only 500 years or so in the past. Here is the kicker: the world is filled with soul-hungry spirits. I can see them in everyone, and I think sometimes I feel them crawling on me. Not all of it is bad; I have a knife, wood to carve, and a diary to write in. \nWe are on a ship to Mexico, where we'll conquer the Aztec Empire if Buttercup Captain Alvarado's mare doesn't kill us all first. I'm not the only one she's managed to kick in the head. \nI managed to block off a closet, and there I have begun testing what I like to call the Malevolent Heavenly's influence on chi. The spiritual energy of the universe feels tainted, and I have no idea why. Something immeasurably significant that I can feel from hundreds of lightyears away is coming for Earth. Monsters are fighting over the souls of men and I have to stay in my lane or else feeling these creatures will drive me mad.","description_hash":-6971933573706719446},{"title":"Soulcry of the Empyrean","fiction_id":"87444","link":"https:\/\/www.royalroad.com\/fiction\/87444\/soulcry-of-the-empyrean","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Action","Adventure","Fantasy"],"lable":"Original","following_count":4,"rating":0.0,"page_count":75,"view_count":851,"chapters_count":12,"last_update":1717224955,"description":"Aryl is a test subject at an academy of unknown origin. With a sudden decision, he is sent into a \"living simulation\" by the people who experimented on him.\nWhen his consciousness crashes into a desolate realm called Vristannia, he has no choice but to cling to his primitive survival instincts in the midst of a dance with death.\nBut there is always worse!\nFilled with terrifying, corrupted creatures, humans wielding a cursed yet mysterious power, and dark secrets, Vristannia has something deadly in common with the real world.","description_hash":5041272489655865343},{"title":"Tattoo Mage: Book 1 ","fiction_id":"87443","link":"https:\/\/www.royalroad.com\/fiction\/87443\/tattoo-mage-book-1","tags":["LitRPG","Progression","Grimdark","Male Lead","Tragedy","Adventure","Horror","Mystery","Supernatural","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":33,"view_count":184,"chapters_count":3,"last_update":1718330402,"description":"In the dark, misty forest of Eldergloom, Dorian Blackwood awakens, unaware of how he arrived in these dark-infested woods. He is hunted relentlessly by ferocious beasts who stalk him day and night. Each passing day becomes a battle for survival as he fends off creatures with his innate skill and cunning, relying on his wits and the fragments of tattoo magic that are etched into his skin by a magical system.\nAs he struggles to survive, Dorian encounters other survivors—outcasts and wanderers who have also fallen prey to the forest’s curse. Among them is Kael Thorne, a young Mage whose determination and pure heart stand in stark contrast to Dorian’s haunted past. Together, they form an uneasy alliance, fighting off the beasts and searching for a way out of Eldergloom forest.","description_hash":478861489159862339},{"title":"Chronicles of the Black Dragon's Rebirth - A Mercenary's Odyssey","fiction_id":"87442","link":"https:\/\/www.royalroad.com\/fiction\/87442\/chronicles-of-the-black-dragons-rebirth-a-mercenarys","tags":["Female Lead","Action","Adventure","Fantasy","Male Lead","Magic","Low Fantasy","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":99,"view_count":302,"chapters_count":9,"last_update":1717874102,"description":"When Aiken, a skilled swordsman, rescued the mage Selina from rowdy goblins, little did he know she would soon become an integral part of his life. After a harrowing Griffin battle and days of travel, she became the younger sister he never knew he needed. Now, as an extremist religious cult, the Old Order, threatens to sacrifice mages for the black dragon's resurrection, Aiken is determined to protect Selina at all costs. \nUnbeknownst to Aiken, he possesses a latent power that could aid in their fight against the Old Order. As they approach the capital city of Calavad, the Old Order's deadly plans draw nearer.","description_hash":1877472502402827943},{"title":"Breath Of Decay And Death","fiction_id":"87441","link":"https:\/\/www.royalroad.com\/fiction\/87441\/breath-of-decay-and-death","tags":["Urban Fantasy","Action","Adventure","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":60,"chapters_count":2,"last_update":1717068934,"description":"Warren Branch dreamed of becoming a great stone researcher, his second biggest dream. His first one? Becoming a stone wielder. However, that seemed practically impossible. So, pursuing a career as a stone researcher was the closest he could get to studying those fascinating stones that woke up around the world. The day he received his response marked a turning point.","description_hash":5529019309739034556},{"title":"Sincerely Alyson","fiction_id":"87440","link":"https:\/\/www.royalroad.com\/fiction\/87440\/sincerely-alyson","tags":["Female Lead","Tragedy","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":143,"chapters_count":5,"last_update":1717981202,"description":"\"My days felt like hell, but the nights were far worse than I could've ever imagined.\"\nA series of letters written by one girl named Alyson Summers, detailing her life with her best friend, Emanuel 'Manny' Harrington. \n                                               'Regret sucks but so does denial.'\n                                       ✮ ✮ ✮ ✮ ✮ ✮\nThis is an epistolary style of short story.","description_hash":-7076616481197716919},{"title":"Gamma Protocol [LitRPG, Cyberpunk]","fiction_id":"87439","link":"https:\/\/www.royalroad.com\/fiction\/87439\/gamma-protocol-litrpg-cyberpunk","tags":["LitRPG","Progression","Post Apocalyptic","Super Heroes","Male Lead","Action","Adventure","Sci-fi","Cyberpunk","Slice of Life","Supernatural","Secret Identity","Technologically Engineered","Soft Sci-fi","Dystopia"],"lable":"Original","following_count":285,"rating":4.96,"page_count":170,"view_count":12172,"chapters_count":17,"last_update":1718538500,"description":"In the year 2252 I, Axel Garcia, wake up early, ready to enter the next phase of my life.\nI've since concluded that I should've slept in.\n\n\n\nStory details: A mix of slice-of-life, monster killing, and someone who wants to do good in a world fraught with greed and, well, monsters.\nProtagonist: Male, first-person PoV.\nSetting details: Cyberpunk world where humanity has been pushed to build futuristic fortified cities for their own survival against the monsters.\nAnd there are... Magical girls?: Less Mahou-Shoujo and more superheroes, but yes.\nBut there's also military?: Also yes (and unlike every superhero story, the normal people fighting monsters actually know what to do for a change).\nBut... HOW?: By the magical power of \"common sense\" (and big guns).\n\n\n\nMinimum Chapter Size: 2K.\nPosting Frequency: Variable, 2 to 3 times a week once the pace settles.\nAlso you can go over to [Patreon] to read ahead.","description_hash":-3440891504382733213},{"title":"THE POTION MASTER","fiction_id":"87438","link":"https:\/\/www.royalroad.com\/fiction\/87438\/the-potion-master","tags":["Grimdark","Male Lead","Drama","Fantasy","Historical","Mystery","Supernatural","Magic","Low Fantasy","Mythos"],"lable":"Original","following_count":4,"rating":0.5,"page_count":104,"view_count":766,"chapters_count":19,"last_update":1718402533,"description":"Imagine uncovering the secret elixir that grants eternal youth, health, and immortality. Now, imagine jeopardizing this miraculous boon by greedily forging a pact with the devil for immense wealth. Anthony Darcy, our tale's unfortunate hero, succumbs to such temptation only to discover that the cost is unbearably steep. Extricating oneself from the clutches of a devilish agreement is a daunting task, indeed.","description_hash":6444855581170413913},{"title":"Bitva o Oros [Czech]","fiction_id":"87437","link":"https:\/\/www.royalroad.com\/fiction\/87437\/bitva-o-oros-czech","tags":["Anti-Hero Lead","War and Military","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":38,"chapters_count":1,"last_update":1717018318,"description":"Bitva o Oros je Fantasy povídka v českém jazyce. Tento příběh vás zavede do fantasy středověku, plného kouzel a magie. Hlavní postavou je zde obyčejný člověk, žijící na vesnici poblíž města Oros. Tento hrdina se téměř nevědomky zaplete do bitvy, ve které se spolu utkají Upíři, trpaslíci, lidé a Mágové.","description_hash":4998203412520857},{"title":"Cinco Sentidos [Spanish]","fiction_id":"87436","link":"https:\/\/www.royalroad.com\/fiction\/87436\/cinco-sentidos-spanish","tags":["Multiple Lead Characters","Slice of Life","Drama","Short Story"],"lable":"Original","following_count":1,"rating":0.0,"page_count":6,"view_count":193,"chapters_count":5,"last_update":1718427648,"description":"Luego de la partida de Ella, los Hermanos deben encontrarse con la realidad que implica crecer: cambio.","description_hash":1387757719184740969},{"title":"Lovebirds","fiction_id":"87435","link":"https:\/\/www.royalroad.com\/fiction\/87435\/lovebirds","tags":["Multiple Lead Characters","Adventure","Romance"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":32,"view_count":158,"chapters_count":3,"last_update":1717990113,"description":"We all know the scene where Derek is watching Odette and her father leaving after the failed engagement, but what if instead of watching her leave, Derek went after her?","description_hash":5601545805266299311},{"title":"Moonlit Awakening","fiction_id":"87433","link":"https:\/\/www.royalroad.com\/fiction\/87433\/moonlit-awakening","tags":["Female Lead","Adventure","Romance","Supernatural"],"lable":"Original","following_count":2,"rating":5.0,"page_count":45,"view_count":544,"chapters_count":9,"last_update":1718473099,"description":"Melanie endures relentless abuse from her aunt and uncle after her parents tragically pass away, which renders her frail and broken. When her mate Arlo prioritizes his pack over her, she's left devastated. But the Moon Goddess sees her potential and grants her a chance for a fresh start. Freed from her tormentors, Melanie discovers her inner strength and a new, dormant part of her that she never knew she had. Alongside new companions, she faces off against Arlo and a brewing power struggle, emerging as a beacon of resilience and power.","description_hash":-8774912841515903788},{"title":"Hollow Manse ","fiction_id":"87432","link":"https:\/\/www.royalroad.com\/fiction\/87432\/hollow-manse","tags":["Male Lead","Slice of Life","Fantasy","Mystery","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":31,"view_count":45,"chapters_count":2,"last_update":1718030058,"description":"After the death of his grandfather, Mael finds himself the sole inheritor of their mansion. Unfortunately, Mael has little time to figure out what to do before being dropped off at the mansion on his own. This mansion has more than a few skeletons in the closet as young Mael will soon find out.\n\nThis my first story so any help or critiques would be greatly appreciated.\nNo set schedule yet but will try to get new chapters out quickly.","description_hash":3296448738368482879},{"title":"Lion's Blood","fiction_id":"87431","link":"https:\/\/www.royalroad.com\/fiction\/87431\/lions-blood","tags":["Ruling Class","Multiple Lead Characters","Drama","Action","Adventure","Fantasy","Male Lead","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":338,"view_count":663,"chapters_count":23,"last_update":1718564405,"description":"In the world of San’Sara, intelligent animals stand at the apex of life. They only have one equal, the human Tamers who bond with them.\nKo'Eri, the land of the Felines, is in the midst of a cold civil war between the Lion and Tiger Clans. Now the shedding of fresh blood has sparked a new fire to warm it.\nPrinces Mazin and Zaki, twins born during the beginning of the civil war, have come of age. The time to bond with their own Tamed Beasts has come. \nZaki, the elder and heir, is eager to prove himself worthy of the Lion Clan's throne. Mazin is forced north for his own bonding, for prejudice is rife against dark Tamers in the capital. \nClan secrets are exposed, old enemies rise from the ashes and thrive in the chaos. The civil war is only a taste of the troubles that come for all the Feline Clans.","description_hash":-9196341452654153944},{"title":"NOCTURNAL","fiction_id":"86908","link":"https:\/\/www.royalroad.com\/fiction\/86908\/nocturnal","tags":["Fantasy","Horror","Short Story","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":54,"chapters_count":1,"last_update":1716243607,"description":"For centuries they've maintained their secret, as time went on they lived in our shadows, but now one rogue is causing chaos on our streets and they must stop him before all are exposed.","description_hash":7321679240912460384},{"title":"The Expedition: Unraveling the True Protagonist","fiction_id":"86907","link":"https:\/\/www.royalroad.com\/fiction\/86907\/the-expedition-unraveling-the-true-protagonist","tags":["Portal Fantasy \/ Isekai","Dungeon","Super Heroes","Martial Arts","Grimdark","Action","Adventure","Fantasy","Sci-fi","Reader Interactive","Male Lead","Strong Lead","Multiple Lead Characters","Non-Human Lead","Magic","High Fantasy","Mythos","Genetically Engineered ","Progression","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":1,"rating":5.0,"page_count":1,"view_count":33,"chapters_count":1,"last_update":1716243600,"description":"In the first chapter, \"The Magic Cat,\" David Shovar, a weary protagonist, encounters a mysterious situation in a dimly lit alley. Upon intervening in a confrontation, he finds himself transported to another realm by a magical cat named Lyra. Tasked with a journey to an unknown world, David receives a set of magical items and a sarcastic robotic companion named Bob. As they venture into the unfamiliar landscape, David's skepticism clashes with the enigmatic guidance of Lyra and the smug demeanor of Bob. Together, they confront the dangers of the new world, setting the stage for a journey of self-discovery and uncovering the true protagonist amidst the expedition's trials and mysteries.","description_hash":1206938267202025974},{"title":"Bitstream","fiction_id":"86906","link":"https:\/\/www.royalroad.com\/fiction\/86906\/bitstream","tags":["Female Lead","Sci-fi","Action","Cyberpunk","Genetically Engineered ","Soft Sci-fi"],"lable":"Original","following_count":83,"rating":4.81,"page_count":79,"view_count":874,"chapters_count":4,"last_update":1717949037,"description":"When Rhea Steele awakes in the neon shadows of Neo Arcadia, she should have been dead. Decades ago, the city's most feared hitwoman was iced, erased from existence by an assassin who vanished without a trace. Now, with no memory of who she was or why she was targeted, Rhea must navigate a labyrinthine metropolis of cybernetic enhancements, rogue AI, and corporate espionage to piece together her fractured identity.\nAs she delves deeper into the digital underworld, Rhea uncovers cryptic clues about her past life, each fragment more dangerous than the last. Her quest for answers leads her to allies and enemies she cannot remember, and a conspiracy that threatens the very core of Neo Arcadia. Someone out there wants her dead—again—and they hold the key to the city's future.\nWith every step, every hack, and every pulse-pounding encounter, Rhea inches closer to the truth. The closer she gets, the clearer it becomes that her death was just the beginning of a much larger game, and she's the only one capable of playing ball.\nTo reclaim her past and secure her future, Rhea Steele must rebuild herself, one byte at a time.","description_hash":-5191064328248401933},{"title":"No Way Out (NWO)","fiction_id":"86905","link":"https:\/\/www.royalroad.com\/fiction\/86905\/no-way-out-nwo","tags":["Psychological","Action","Adventure","Mystery"],"lable":"Original","following_count":1,"rating":5.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Mane, the protagonist of the story believes that he can become the first man in history to escape the Matrix...","description_hash":4026361256913001297},{"title":"The Chronicles of a Magic World","fiction_id":"86904","link":"https:\/\/www.royalroad.com\/fiction\/86904\/the-chronicles-of-a-magic-world","tags":["Dungeon","Martial Arts","Multiple Lead Characters","Slice of Life","Strong Lead","Action","Adventure","Fantasy","Mystery","Supernatural","Male Lead","Magic","High Fantasy","Progression"],"lable":"Original","following_count":7,"rating":4.25,"page_count":376,"view_count":2156,"chapters_count":35,"last_update":1718290443,"description":"In a world where magic is king and wizards are the elite, young Erwin Eda, just past his 13th birthday, dreams of being like his hero father, Artemisius Zygmunt. Artemisius was a wizard of legends, an adventurer whose power was unmatched, who lost his life on a dangerous mission years ago.\nErwin wants to live up to his father's name and even outshine him, but there's a big problem: he hasn't unlocked his magic core yet, which he needs to become a wizard. As he gets older without his core awakening, Erwin starts to lose hope.\nBut then, one day, when danger looms close, something amazing happens. On top of that, meeting a girl shrouded in mystery changes everything for Erwin. She leads him down a path where he'll uncover buried secrets and face tough truths...\n2-3-4 chapters per week","description_hash":-1696271378788379324},{"title":"Tangled Fates","fiction_id":"86903","link":"https:\/\/www.royalroad.com\/fiction\/86903\/tangled-fates","tags":["Anti-Hero Lead","War and Military","Grimdark","Multiple Lead Characters","Strong Lead","Fantasy","Tragedy","Male Lead","Female Lead","High Fantasy","Villainous Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":41,"chapters_count":1,"last_update":1716242813,"description":"Entangled are the fates with one another of three mere teenagers. Each of them toughened through the cruelty of life, they reluctantly decide to join together to form a force strong enough to defeat that of what they presume is a normal threat. It doesn't take long for the realization to settle in, and for them to face the truth. This threat is no ordinary threat. This threat is what has wrecked their lives. \nKaha Kasper, a ruthless mercenary with a troubled past.\nFeyne Winston, a noble lady turned soldier who is much more complex than what is on the surface. \nDarius Campbell, a future ruler with nothing to lose. \nTogether, these three intend to destroy that which has annihilated their lives.","description_hash":-3787352320056214693},{"title":"Maniacs Mayham: A guide to being a corprate slave","fiction_id":"86902","link":"https:\/\/www.royalroad.com\/fiction\/86902\/maniacs-mayham-a-guide-to-being-a-corprate-slave","tags":["LitRPG","Progression","Post Apocalyptic","Super Heroes","Female Lead","Action","Sci-fi","Cyberpunk","GameLit","Soft Sci-fi","Artificial Intelligence"],"lable":"Fan Fiction","following_count":14,"rating":0.0,"page_count":73,"view_count":1074,"chapters_count":10,"last_update":1718630803,"description":"Evelin Vance has been an indentured worker ever since she was caught as a little kid hacking into a corpo server and spreading millions worth of documents around. now \"employed\" by New Hope Corporation to look into the security of other corporations, usually by less than legal means. being the most disposable asset of the company she is always required to do the most dangerous and hated jobs. until one day, she bites off more than she can chew. Getting attacked, mauled bludged, and bruised, she awakes as a samurai. Follower her on her journey to stop alien plants as well as corporate greed.\nthis is a Stray Cat Strut fanfictionthe story is based on the world of stray cat strut written by RavenDagger. thank you RavenDagger for creating an awsome world. I try to make it so that you can follow the Storry whiteout having read it, but I would still highly recommend you read Stray Cat Strut anyway.\na special thanks to kasidya for helping me edit the story","description_hash":-160706558490564422},{"title":"Combat Medic (Pokemon\/Naruto)","fiction_id":"86900","link":"https:\/\/www.royalroad.com\/fiction\/86900\/combat-medic-pokemonnaruto","tags":["Reincarnation","Female Lead","Slice of Life","Adventure","Fantasy"],"lable":"Fan Fiction","following_count":22,"rating":5.0,"page_count":15,"view_count":1557,"chapters_count":7,"last_update":1716712382,"description":"Once a pink-haired badass healer, always a pink-haired badass healer.\nHaruno Sakura reincarnates in the Pokemon World.\nCrossposted on SB\/SV\/QQ\/AO3","description_hash":1833601005750977213},{"title":"MRS.UNKNOWN","fiction_id":"86899","link":"https:\/\/www.royalroad.com\/fiction\/86899\/mrsunknown","tags":["Urban Fantasy","Female Lead","Drama","Fantasy","Romance","Mystery","Attractive Lead"],"lable":"Original","following_count":1,"rating":5.0,"page_count":7,"view_count":98,"chapters_count":3,"last_update":1716415649,"description":"sound of footsteps coming towards my club room ,they entered my room. greeted me \"Good Evening\". they were male models I ordered for me. \nhuh....manager, aren't there any more handsome one\nmanager: Yes, we do have .please wait for a moment mam. \nall of you leave, mananger said.\n[FLASHBACK]\n[After stamping on final divorce agreement on way coming out of civil bureau, my ex-husband twisted my arm and started cursing me as I divorced him for cheating on me with pregnant mistress.\nI replied: ok, do you want to wait till I impose other men's child on you to divorce you.\nHis anger went high, just by listening this. hmph!]\nBeing all drunk I came out of the room mummering \"handsome male\".\nmoving towards the ZQ and end up falling into his arm. He grabbed my waist.\nZQ: It's her\nYou are so handsome, lets sleep together tonight dear hmm..huh..!\nHe lifted me in his arm with a little smirk and went towards his hotel room.","description_hash":-1685582454327380597},{"title":"Record of Genesis","fiction_id":"86898","link":"https:\/\/www.royalroad.com\/fiction\/86898\/record-of-genesis","tags":["Strategy","Martial Arts","Action","Fantasy","Mythos"],"lable":"Fan Fiction","following_count":1,"rating":5.0,"page_count":45,"view_count":145,"chapters_count":3,"last_update":1717294557,"description":"The end is nigh for humanity. The gods have decided that humanity is too irredeemable and demonic to continue existing and must be exterminated from history. With the majority agreeing, it looks like it's time for humanity's extinction.\nNo.\nFollowed by their leader Michael, the majestic archangels intervene. Michael challenged the gods to participate in Genesis: a thirteen-round death-match between mankind and the gods to settle the fate of humanity.\nWill humanity defeat their creators and continue to live? Or will the gods prevail and purge mankind?\nLet Genesis commence!\nRecord of Ragnarök is written and belongs to Shinya Umemura and Takumi Fukui. I don't own the story nor its characters.","description_hash":-6327493600378272691},{"title":"The neighbor next door is an alien!","fiction_id":"86897","link":"https:\/\/www.royalroad.com\/fiction\/86897\/the-neighbor-next-door-is-an-alien","tags":["Comedy","Female Lead","Slice of Life","Secret Identity","Action","Adventure","Romance","Supernatural","Soft Sci-fi"],"lable":"Fan Fiction","following_count":1,"rating":5.0,"page_count":7,"view_count":33,"chapters_count":1,"last_update":1716242625,"description":"Samantha Ray is an aspiring stocking associate, if her boss asks. Just another soul in Ohio, where everything is possible, Samantha tries to survive in the harsh economy, where difficult working demands meet with insufficient income. However, her life has a bright shine which is seen upon her desire to write. Online, she is known as The Corn Dweller, the writer of numerous popular works on varying themes, mostly focusing on popular fiction. Samantha’s life takes a serious swirl once when the vacated apartment next to her is bought by a mysterious couple that showed up out of nowhere. It wouldn’t have been an issue, except they drive expensive vehicles and sometimes aren’t even at home! Many details around them are unfamiliar to the woman, and she has decided that she wants to know more about them…","description_hash":-5058002023683285230},{"title":"Scouts End","fiction_id":"86896","link":"https:\/\/www.royalroad.com\/fiction\/86896\/scouts-end","tags":["Anti-Hero Lead","Male Lead","Adventure","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":26,"chapters_count":1,"last_update":1716242620,"description":"The story of a young man that raised until his twelfth birthday. Then became an adventure to survive in the world by himself. Optimistic about his situation trying to not let bad situations get him down.","description_hash":6864818900079463948},{"title":"Daughters of Dragons","fiction_id":"86895","link":"https:\/\/www.royalroad.com\/fiction\/86895\/daughters-of-dragons","tags":["Urban Fantasy","Multiple Lead Characters","Secret Identity","Strong Lead","Adventure","Fantasy","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":111,"chapters_count":1,"last_update":1716242601,"description":"When 17-year-old Clarity lost her home, her family, and her oasis as a child, the dragon who took it all left her with a gift – the dragon’s own spirit. With that newfound power, Clarity survived and discovered a new family, a dragon slaying master who trains her to become a ruthless hunter. Her first mission proves more difficult than she imagined, as her captured dragon makes her question all she’s been taught and hear the dragon spirit inside her for the first time. Driven by the captured dragon’s whispers and her own clawing spirit, Clarity seeks answers to a mystery that hangs over the human city Yin, and hopefully, her own aching past.\nMeanwhile, another with dragon power seeks the same prisoner – the general’s flighty daughter, Diana. To uncover the secrets of the dragon temples, and impress her father and boyfriend, Diana masquerades as an orphan of the dragon raids. All while a different battle plays in her head: to do as she is expected or follow her gnawing conscience.","description_hash":-8095742612716247134},{"title":"PRIMORDIAL SIN SYSTEM","fiction_id":"86893","link":"https:\/\/www.royalroad.com\/fiction\/86893\/primordial-sin-system","tags":["Anti-Hero Lead","Martial Arts","Comedy","Harem","Action","Adventure","Romance","Villainous Lead","Attractive Lead"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":28,"view_count":331,"chapters_count":5,"last_update":1716377278,"description":"In the novel \"Primordial Sin System,\" readers follow the journey of Dave Alexander, a man reincarnated into a life of privilege and power after enduring a previous existence filled with misery. Now the son of the empire's strongest expert, known as the guardian, Dave is determined to seize every opportunity presented to him.\nUnexpectedly, Dave's life takes a unique turn when he discovers he possesses the Primordial Sin System, a mysterious system that grants him extraordinary powers and abilities by experiencing and embracing the seven deadly sins. Fueled by this newfound power, Dave sets out on a quest to collect beauties, conquer challenges, and ascend to the peak of his potential.\nNote: I am not a professional writer; I write as a hobby. Comments and suggestions are welcome. Feel free to criticize my work. I want to express my gratitude to those who appreciate and love it.\nThere might be some plot holes in the early chapters, but I am committed to creating a better and more cohesive plot for the story.","description_hash":-5921841416383846754},{"title":"Song of Death","fiction_id":"86892","link":"https:\/\/www.royalroad.com\/fiction\/86892\/song-of-death","tags":["Female Lead","Fantasy","Romance","Magic"],"lable":"Original","following_count":2,"rating":5.0,"page_count":8,"view_count":197,"chapters_count":3,"last_update":1718061408,"description":"After her mother's sudden death as a young child, Anastasia has endured her stepmother's countless attempts to kill her. However, a mysterious figure that appears to her when she is near death keeps protecting her from each attempt, making it so she cannot die. When her stepmother schemes to marry Anastasia off to a stranger in order to be rid of her, she realizes that there is more to her plan than meets the eye.","description_hash":8154564900697179746},{"title":"Ascension","fiction_id":"86891","link":"https:\/\/www.royalroad.com\/fiction\/86891\/ascension","tags":["Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":157,"chapters_count":2,"last_update":1716261213,"description":"Cairo, Prince of the kingdom of Kalan has never been fond of a life of council's and royal business; it always seemed boring to him. Despite being the heir to the throne, his Father always saw him as an undignified child who always stepped out of line or spoke out of turn.\nVivian, Cairo's sister and Princess of Kalan has been favored by their parents since the day she was born. Studying to become a healer, she would spend most of her time alone. She was always perfect, never letting herself relax or participate in activities that she found \"useless\".\nTheir lives are turned upside down when talk of Dragons, ancient creatures who were said to be extinct for a century, begins. Dragons are not extinct, and they want revenge. Cairo and Vivian are forced to flee their kingdom after a dragon attack nearly takes their lives. In a final attempt to escape, they enter the underground level of the palace, highly forbidden by their father. In the room lies a girl, with hair as white as the winter, and eyes that glow like the sun. With Dragons attacking and two kingdoms at the brink of war, Cairo and Vivian are forced to make a decision that may end up saving their kingdom, or it may end up destroying it.","description_hash":4767762940822513446},{"title":"Untold Cases","fiction_id":"86890","link":"https:\/\/www.royalroad.com\/fiction\/86890\/untold-cases","tags":["Comedy","Psychological","Horror","Mystery","Supernatural"],"lable":"Original","following_count":0,"rating":5.0,"page_count":14,"view_count":44,"chapters_count":2,"last_update":1718337499,"description":"Jay is always in trouble. Having a job looking for mysterious artifacts and creatures, he always ends up in a life or death situation.","description_hash":4001312020339910372},{"title":"I Am The Last Of My Kind","fiction_id":"86889","link":"https:\/\/www.royalroad.com\/fiction\/86889\/i-am-the-last-of-my-kind","tags":["LitRPG","Progression","Anti-Hero Lead","Grimdark","Non-Human Lead","Action","Adventure","Fantasy","Mystery","Female Lead","Secret Identity","Magic","High Fantasy"],"lable":"Original","following_count":18,"rating":5.0,"page_count":58,"view_count":619,"chapters_count":6,"last_update":1718253530,"description":"Eclipse was created in the void of nothingness where her creator revealed her purpose: Becoming a calamity that would plunge Terra into everlasting darkness. However, Eclipse had no such wish, for she could not comprehend why her creator wished such things, rather she simply wished to be with her creator. \nFate had other plans, ripping Eclipse out of her creator’s realm, and thrusting her into the harsh world of Terra where her kind had gone extinct. Now alone in a foreign place, she must face the cruelty of Terra and its residents.","description_hash":-8816088892047228349},{"title":"Faete","fiction_id":"86888","link":"https:\/\/www.royalroad.com\/fiction\/86888\/faete","tags":["Progression","Grimdark","Action","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":31,"view_count":165,"chapters_count":4,"last_update":1716489033,"description":"Inari is a half-blood, he has no idea what the other half is, but he is most definitely a half-blood fae, and he's almost at the age of awakening, the only issue is that the thing he awakens makes absolutely no sense to him.\nA story I intend to try out writing and see what happens, my first story. It's a dark fantasy story focusing on Inari, a half-fae boy, who awakens an ability that makes little sense to him, or anyone for that matter. I want to expand on the world lore of this world, Eohs, and hopefully explore a massive area and keep building a growing story eventually, I intend for him to progress and try his best to explore his ability and the depths it contains, ideally learning about magic, the arcane, and the mystical, along the way. This all depends on whether or not people are interested by the first few chapters. Feel free to comment, would love to hear from people.","description_hash":-7424194705396740075},{"title":"Living life to the fullest as a CRAB?!","fiction_id":"86887","link":"https:\/\/www.royalroad.com\/fiction\/86887\/living-life-to-the-fullest-as-a-crab","tags":["Reincarnation","Non-Human Lead","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":1,"rating":4.0,"page_count":3,"view_count":137,"chapters_count":2,"last_update":1716279874,"description":"After the teen, Astam Crabum, drowns and dies in attempts to impress his fisherman father by spearing a crab on the edge of a cliff, he gets reincarnated as the last thing he thought of. Dawning a new name for himself, he decided to live his new life to the fullest unlike his previous attempt.","description_hash":12795219165747085},{"title":"Full Scale Fight ","fiction_id":"86886","link":"https:\/\/www.royalroad.com\/fiction\/86886\/full-scale-fight","tags":["Progression","Strategy","Male Lead","Action","Adventure","Fantasy","Low Fantasy","Dystopia"],"lable":"Original","following_count":2,"rating":0.0,"page_count":4,"view_count":60,"chapters_count":1,"last_update":1716226529,"description":"On his seventeenth birthday, Theo finally gets to witness a dragon fight, but the brutal reality of what happens to the losers changes his perspective. Now, he's on a mission to save every dragon on the planet. Join Theo on his epic quest to right the wrongs of the dragon fighting industry.","description_hash":-7873150178090179852},{"title":"World Impartment","fiction_id":"86885","link":"https:\/\/www.royalroad.com\/fiction\/86885\/world-impartment","tags":["GameLit","Progression","Psychological","Multiple Lead Characters","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"In a world where mana is accessible to anyone, knowledge is the only true power. \nThere is no greater motivator than love and there is no greater pain than losing it.\nWho are you? Who are you going to be when you lose it all?\nDo you really know yourself? How far will you go to keep a promise?\n\n||| New Chapters every Monday Wednesday Friday |||\nMana, the magical force that encompasses the world, is infinite. In order to wield it a core must be formed, but the process to make one is a dangerous prospect. To use it effectively takes imagination. To wield it morally takes a miracle. To get stronger means to persevere. \n\nLis and Bellamy made the mistake that countless others have made before them. It was a rash choice fueled by anger and love, but unfortunately for them, likely permanent. In an attempt to form a core on their own, they were left crippled and doomed to a life of pain.\nA life wasted, but only if they make that choice. \nFor years, that's how they've lived. Until one day Bellamy leaves in order to find a healer to give them a chance to undo their mistake. He promised to return only when he could make things right. \nSo when Lis receives a letter from her brother, she's glad that he decided to come home. When she finds out that he didn't return alone, but with a young man no older than they are, she's curious. When the young man is more than what he seems, she decides to persevere. \nIt's time to find out who they really are.\n||| New Chapters every Monday Wednesday Friday |||","description_hash":3354929933900673536},{"title":"Tales of Karobos: Picaro, the Boy Who Sailed with Wolves","fiction_id":"86884","link":"https:\/\/www.royalroad.com\/fiction\/86884\/tales-of-karobos-picaro-the-boy-who-sailed-with","tags":["Progression","Post Apocalyptic","Grimdark","Action","Adventure","Fantasy","Magic","High Fantasy","Dystopia"],"lable":"Original","following_count":4,"rating":4.5,"page_count":40,"view_count":238,"chapters_count":4,"last_update":1717727400,"description":"☠️ Loose lips sink ships, and mad men tell tall tales. But dead men tell none. 💀\nPicaro grew up aboard the Seafang, a ship of the free men captained by Valgur the Sea Wolf and his rusty band of cutthroats and brigands. Follow Picaro's adventures across the Myriad Isles, from Fine Island to the tenement city of Parley in Scarred Truce Bay.\nThe boy will come to realize he is only an instrument of Valgur's power, and some for the sake of his reputation. And while Picaro lives a free life full of the open ocean and thrilling adventure, he must learn harsh lessons in order to survive.\nHere there be pirates. 🏴‍☠️\nA sword ⚔️ and sorcery 🧙 tale of epic fantasy ✨—\nStylistically: Lord of the Rings meets Mad Max meets Dungeons and dragons meets Pirates of the Caribbean —\nHope you enjoy. - Samuel O. Ludescher","description_hash":6235719286806649313},{"title":"Magic is Electricity?!","fiction_id":"86883","link":"https:\/\/www.royalroad.com\/fiction\/86883\/magic-is-electricity","tags":["Portal Fantasy \/ Isekai","Progression","Steampunk","Male Lead","Slice of Life","Adventure","Fantasy","Magic","Low Fantasy","First Contact"],"lable":"Original","following_count":21,"rating":4.62,"page_count":96,"view_count":2816,"chapters_count":23,"last_update":1718550541,"description":"Ethan, an electrical engineering student from Earth, is abruptly transported to a mysterious tower in a fantastical world where magic and medieval technology coexist. Struggling to understand his new surroundings and desperate to find a way back home, Ethan discovers that what the locals call \"magic\" is actually a form of electricity.\nForced to flee the enigmatic tower, Ethan finds refuge in a nearby village. There, he forms an unlikely alliance with Silvra, Thallion, Eldrin, and Lena—each possessing unique skills and perspectives. Together, they embark on an ambitious quest to harness and control this magical electricity, aiming to revolutionize their world and perhaps even find a way for Ethan to return to his place.","description_hash":2373034741653773319},{"title":"Our Chemical Hearts ","fiction_id":"86882","link":"https:\/\/www.royalroad.com\/fiction\/86882\/our-chemical-hearts","tags":["Urban Fantasy","Progression","Anti-Hero Lead","Super Heroes","Multiple Lead Characters","Drama","Romance","Sci-fi","Tragedy","Female Lead","Strong Lead","Secret Identity","Villainous Lead","Soft Sci-fi","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":27,"chapters_count":1,"last_update":1716222731,"description":"“Our Chemical Hearts” is a gripping tale of love and loss, heroism and villainy, and the enduring power of what-ifs. Can love survive the ultimate betrayal, and can a heart so tainted by darkness ever find redemption?\n“\nFor a brief moment, time seemed to stand still as Theo and Lyra lingered in each other's embrace, their bodies pressed together in a silent communion of desire. But as the weight of their actions settled over them, Theo pulled away, his breathing ragged as he stumbled backwards as he got up.\n\n\"I'm sorry,\" he muttered, his voice thick with emotion as he turned away from Lyra, his hands shaking with a mixture of desire and regret.”","description_hash":775318944202994520},{"title":"Vanguard of the Arcane","fiction_id":"86881","link":"https:\/\/www.royalroad.com\/fiction\/86881\/vanguard-of-the-arcane","tags":["Ruling Class","Male Lead","Sci-fi","Action","Adventure","Cyberpunk","Supernatural","Genetically Engineered ","Technologically Engineered","Hard Sci-fi","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":12,"view_count":57,"chapters_count":1,"last_update":1716222671,"description":"Treyvon Edavane has no memory of his past, nor any understanding of his ambitions and emotions. Yet, an inexplicable drive compels him to enroll in humanity's top military academy: the Arcanian Vanguard Academy, his only goal being to become a peacekeeper.\nAs he stands on the precipice of his dream, Treyvon is unaware of the extensive transformations that await him. As the academy molds him into more than just a peacekeeper, his worldview will be shattered as his body and mind are reimagined. Thrown into brutal, life-threatening military operations, he will face mysterious external threats his government once hid from him and navigate the treacherous political crossfires within his society. Perhaps, through these trials, Treyvon will finally inch closer to discovering his true self and the secrets of his origins.","description_hash":9072745198730802724},{"title":"Dual Heritage","fiction_id":"86880","link":"https:\/\/www.royalroad.com\/fiction\/86880\/dual-heritage","tags":["Urban Fantasy","Male Lead","Contemporary","Harem","Action","Fantasy","Romance","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":10,"rating":5.0,"page_count":99,"view_count":558,"chapters_count":8,"last_update":1717160987,"description":"Mark's world has been shadowed by tragedy ever since his parents were brutally killed in an unresolved incident. Raised by his aunt, who struggled to provide answers to the lingering questions about their death, Mark learned to live with uncertainty and loss.\nHis life takes an unexpected turn when he crosses paths with a mysterious young woman whose presence seems both familiar and unsettling. This encounter ignites a series of events that thrust Mark into a world of deep secrets and hidden truths about his family's past.\nDriven by a mix of fear and a desperate need for closure, Mark finds himself on a perilous journey. As he uncovers dark truths, he realizes that the answers he seeks could upend his entire understanding of his identity and history.","description_hash":804741885154749108},{"title":"Planetary Expedition: Heaven's Guide","fiction_id":"86879","link":"https:\/\/www.royalroad.com\/fiction\/86879\/planetary-expedition-heavens-guide","tags":["Strategy","Action","Adventure","Fantasy","Supernatural","Low Fantasy","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":135,"chapters_count":2,"last_update":1716257696,"description":"An unknown planetary mass appeared in the solar system in the year 2024. It changed existence itself.","description_hash":973315870156604395},{"title":"The God of the Grove","fiction_id":"86878","link":"https:\/\/www.royalroad.com\/fiction\/86878\/the-god-of-the-grove","tags":["Progression","Anti-Hero Lead","Grimdark","Multiple Lead Characters","Action","Fantasy","Romance","Mystery","Supernatural","Male Lead","Female Lead","Non-Human Lead","Magic","High Fantasy","Mythos","Villainous Lead","First Contact"],"lable":"Original","following_count":5,"rating":0.0,"page_count":56,"view_count":361,"chapters_count":7,"last_update":1717351878,"description":"This story is a Draft. I will use all the feedback to complete the original Manuscript.\nIf have posted this story in Wattpad and Inkspired in his spanish version. I am the only owner of this history in all version and i own all his rights. \nThe only english version exist in Royal Road.\n********************************************************************************************************************************\n**The God of the Grove**\nIn the midst of a desperate struggle for survival and power, Mana ventures deep into the forbidden forest in search of answers that challenge the teachings of her people.\nDeep in the grove, where gods walk among mortals and darkness hides unfathomable secrets, the twelve most talented hunters from the village of Cepir discover the vast chasm that separates their kind from the deities. After the Night of the Hunt, their paths diverge forever, and Aiacos, leader of this group, begins to question his principles upon discovering the true nature of the God dwelling in the Grove while watching the remnants of his group traverse dangerous paths.\nThis story:1. Is IN PROGRESS.2. Is part of a Narrative Universe still under construction.\nContent Warnings:- Explicit violence.\n\"If he weren't there, no one would be left to tell the true story.\"","description_hash":7125490376785003102},{"title":" A Court of Flame & Shadow ","fiction_id":"86877","link":"https:\/\/www.royalroad.com\/fiction\/86877\/a-court-of-flame-shadow","tags":["Multiple Lead Characters","Strong Lead","Drama","Action","Fantasy","Romance","Female Lead","High Fantasy"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":84,"view_count":283,"chapters_count":10,"last_update":1718455824,"description":"Vel, an Oracle older than Prythian itself, visits the Autumn Court at the request of its High Lord. While there she gets swept up in the court's political scheming, with Eris trying to win her favor using any means necessary. But all is not what it seems and her visit is cut short by a bloody betrayal. Alone and afraid, she must escape Autumn and get back home.\n-\nPerhaps she’d misjudged him and he was going to slice her open. Vel decided she wasn’t going to stick around to find out. In the blink of an eye, she squeezed her palm between the blade and her neck, scraping most of the skin off in the process, and with her other arm she elbowed Eris in the stomach as hard as she could. The dagger clattered to the floor slick with her blood. Eris released her, stumbling a few feet back. She turned back towards him, palms up. Blood was pouring down her left arm, dripping into her sleeve. He’d already produced another dagger from Mother knew where and was about to throw it at her face.\n“Wait. Eris. We want the same thing. We could work together if you would just trust me.”\nEris narrowed his eyes at her. “Trust you? Do you genuinely think I’m simple?” he hissed out the words, trying to keep his voice low.","description_hash":8348778908112235682},{"title":"The Writer's Protagonist","fiction_id":"86876","link":"https:\/\/www.royalroad.com\/fiction\/86876\/the-writers-protagonist","tags":["Portal Fantasy \/ Isekai","Urban Fantasy","Progression","Martial Arts","Sci-fi","Action","Adventure","Fantasy","Supernatural","Magic","High Fantasy","Mythos","Hard Sci-fi","Dystopia"],"lable":"Original","following_count":1,"rating":5.0,"page_count":39,"view_count":344,"chapters_count":6,"last_update":1717002010,"description":"What would happen if, among so many powerful people and unbeatable heroes... a greater force decided to make you the protagonist of this story?","description_hash":-4025048505740976580},{"title":"This Villainess Will Not Die!","fiction_id":"86875","link":"https:\/\/www.royalroad.com\/fiction\/86875\/this-villainess-will-not-die","tags":["Reincarnation","Anti-Hero Lead","Ruling Class","Female Lead","Strong Lead","Drama","Fantasy","Historical","Romance","Supernatural","Male Lead","Magic","Low Fantasy","High Fantasy","Villainous Lead"],"lable":"Original","following_count":6,"rating":4.5,"page_count":60,"view_count":553,"chapters_count":8,"last_update":1718629390,"description":"Penelope, a medical school student who has lived a hell of a 1st life dies a sudden death. But thankfully — or not, she wakes up in the body of a villainess in her favorite childhood fairytale!\nShe is sentenced to prison for life upon waking up. There was no 'redemption' option for her. Her crimes were already committed, and she could do nothing about it. Even worse, having read the book, Penelope knows she is supposed to DIE on her way to said prison.\nExactly; WHAT?\nFrustrated and resentful, she sets out with a clear purpose in mind: There's no way in hell she's dying again.\nPenelope could care less that there was a group of knights making sure she didn't escape, or that her fate of death was as unshakable as her anxiety, or that the amount of handsome strangers she met was alarming if anything.\nShe had a plan.\nAnd nothing was going to stop her from executing it.\nHer 2nd life would be her best.","description_hash":-1904256039318588039},{"title":"Saving the school would have been easier as a cafeteria worker","fiction_id":"86874","link":"https:\/\/www.royalroad.com\/fiction\/86874\/saving-the-school-would-have-been-easier-as-a","tags":["Reincarnation","Male Lead","Secret Identity","Strong Lead","Fantasy","School Life","Magic"],"lable":"Original","following_count":15,"rating":4.69,"page_count":293,"view_count":2918,"chapters_count":23,"last_update":1718401796,"description":"Hypothetically, if a neighboring nation with whom you shared a checkered past reached out to you, hat in hand, for assistance in preventing a once-in-a-generation tragedy what would you do? If your response was in any way resembling ‘send a mentally unstable weapon to their largest center of learning and wait for the fireworks’ then you may qualify for a job in the Federation’s highest military office. Good timing, as they may soon have some vacancies.\nMeet Cal, he’s not actually unstable. Awoken in this new world years ago, his second lease on life has not been a smooth one. Now called upon to serve his country by completing, what is on paper, a covert military assistance mission; he finds himself marooned at the heart of the enemy. Saddled with a fake identity and family, Cal must balance the school life associated with attending a hybrid of magical college\/highschool for nobles while also secretly investigating a plot with the potential to doom the Academy and the city in which it resides. Somehow, failing a class or two doesn’t seem as important as stopping demons from burning everything down. Not everyone agrees with him.\nUpdates: Mo\/We\/Fr","description_hash":3920639012111641584},{"title":"READ A WEBNOVEL, SAVE A WORLD","fiction_id":"86873","link":"https:\/\/www.royalroad.com\/fiction\/86873\/read-a-webnovel-save-a-world","tags":["GameLit","Portal Fantasy \/ Isekai","Xianxia","Action","Adventure","Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":21,"view_count":173,"chapters_count":4,"last_update":1718109141,"description":"A middle-aged man dies of a terminal illness and is counted worthy of reincarnation in another world because he read a Web novel one time. Follow as he flounders his way into becoming that world's salvation.","description_hash":4284086383039965593},{"title":"The Goblin's Path","fiction_id":"86872","link":"https:\/\/www.royalroad.com\/fiction\/86872\/the-goblins-path","tags":["Non-Human Lead","Slice of Life","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":56,"view_count":354,"chapters_count":8,"last_update":1716218669,"description":"In the heart of the enchanted realm of Downey lies Shadowgrove, a village of goblins striving to redefine their legacy. Tolgon Pourings, a young goblin aspiring to be a spellsword, embarks on a transformative journey filled with magic, camaraderie, and peril.\nOn the cusp of adulthood, Tolgon absorbs the powers of the blood and sword stones, setting the stage for a destiny intertwined with magic. Alongside his loyal companions—Jeron, a compassionate cleric; Preston, a sharp-eyed hunter; and Drodo, a fervent paladin and aspiring monster hunter chef—Tolgon faces trials that test their strength and unity.\nFrom navigating the treacherous Gloomwood Swamp to unraveling the mysteries of the Whispering Woods, the group confronts beast wolves, shadow creatures, and their own fears. As they hone their abilities, forge powerful gear, and form unbreakable bonds, they uncover a sinister plot threatening their world.\nAmidst the battles and burgeoning friendships, Tolgon meets a mysterious elven adventurer whose presence stirs unfamiliar feelings, adding a touch of unexpected romance to his epic quest.\nJoin Tolgon and his friends as they navigate a world brimming with magic and danger, proving that honor, courage, and friendship can illuminate even the darkest paths. Will they rise to the challenge and carve their names into the annals of history, or will the shadows consume them?\nDive into an adventure where magic knows no bounds, and heroes are forged in the fires of destiny.","description_hash":5021763044529464817},{"title":"Gaiden: Phantasm of the Spear","fiction_id":"86871","link":"https:\/\/www.royalroad.com\/fiction\/86871\/gaiden-phantasm-of-the-spear","tags":["Female Lead","Secret Identity","Tragedy","Drama","Action","Fantasy","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":30,"view_count":129,"chapters_count":4,"last_update":1717068017,"description":"\"If it is freedom you so dearly seek, then first know, all you know will soon be gone.\" \nIn the age of the New Magi, the art of Arcana has all but flourished. Magecraft has advanced to the next era, bringing about new elements and techniques once thought only to be hypothetical. Many magi surpassed themselves, attaining a level beyond the comprehension of any. Most of all, the greatest power that one could attain has grown closer to the grasps of man, its greatest seeker. But, with opportunities come those who seek to abuse it. One after the other, magi who seek to attain it are slaughtered by a faction only known by those who chase the same dream as they.\nAmong those who seek this power is Kotoko, the Spear, a low-rank warrior of a low-rank guild in the Kingdom of Crowlia. She, along with her only friend, Fisk, the Blade, have continuously sought to achieve that great power. However, on one evening, Fisk disappears, with only a letter as the remaining trace of his life. Join her in the last three-day journey of hers to seek power and closure.\n\nI wrote this to get criticism on my writing before uploading actual projects. Criticism much appreciated. Re-release of the novel will be done once enough criticism is provided.\nNOTE: Certain details of the story may not be fully expanded upon, and that is 100% intentional.","description_hash":3348117014041376757},{"title":"Vitamorium","fiction_id":"86870","link":"https:\/\/www.royalroad.com\/fiction\/86870\/vitamorium","tags":["Reincarnation","Urban Fantasy","Non-Human Lead","Sci-fi","Fantasy","Romance","Mystery","Supernatural","Female Lead","Magic","Mythos","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":25,"view_count":86,"chapters_count":2,"last_update":1717444790,"description":"‘Back before everything and nothing there was a spark. From this spark, life was born first. Lush life. Filled with warmth and wonder. It filled every corner of the galaxy. Then the spark created a younger sibling for life, death. Its foil to keep it in line, so as not to over grow the world the spark had made. Stillness and peace, death claimed. For eons life and death have ruled together and have fought against one another. Over and over and over. Never ceasing and always losing. They create and destroy. Cities and deities are raised in their names. Every facet of expression or experiment is dedicated to either or both of them. Everything bowed to each of them, no matter what. Then in some secret forgotten corner of the universe, something stirred. Neither dead nor alive, but something in between. \n\nSomething wrong.’ \n\nA grimey finger flits the page over, uninterested in the genesis of these so-called Gods. It filtered through the muck before landing on the real prize: the monsters. Demons. Those that don’t fit the little fairy tale the Divinity created. A sick grin twisted its features when the book flops over to land on the image of some twisted, wretched thing. Ripping the page leaves nothing but a streak of blood and filth marring the rest of the holy script.","description_hash":439176820915653417},{"title":"Digital Transfer","fiction_id":"86869","link":"https:\/\/www.royalroad.com\/fiction\/86869\/digital-transfer","tags":["Portal Fantasy \/ Isekai","Non-Human Lead","Tragedy","Drama","Short Story"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":12,"view_count":61,"chapters_count":1,"last_update":1716214648,"description":"Having received a strange package, J anxiously calls for their friend Vix to come and help.","description_hash":8822371581277498870},{"title":"The God Experiments","fiction_id":"86868","link":"https:\/\/www.royalroad.com\/fiction\/86868\/the-god-experiments","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Comedy","Slice of Life","Fantasy","Strong Lead","Magic"],"lable":"Original","following_count":14,"rating":4.5,"page_count":87,"view_count":1851,"chapters_count":29,"last_update":1718635561,"description":"In the grand scheme of things, I had always assumed that the end of one's earthly tenure would be a bit more... final. A sort of eternal curtain call, if you will. Yet, here I was, remarkably corporeal and perched atop a cloud that felt suspiciously like the world's plushest memory foam mattress. Or at least what I imagined one would feel like if I had ever invested in such a thing.\nThis is the story of how I, and some gods I met, attempted to grow my \"God Seed\" while saving a world or two in the process…\n\nNote - A few of you may recognize this title from a previous version I posted a few chapters of some time ago. It has been rewritten using your suggestions, as well as a new cover, and of course plenty of new content as well.","description_hash":-2191804982030797513},{"title":"Multiplier System : Getting Superhumans as Starting Race","fiction_id":"86867","link":"https:\/\/www.royalroad.com\/fiction\/86867\/multiplier-system-getting-superhumans-as-starting","tags":["LitRPG","Anti-Hero Lead","War and Military","Male Lead","Strong Lead","Action","Adventure","Fantasy","Supernatural","Magic","Strategy","GameLit","High Fantasy","Ruling Class"],"lable":"Original","following_count":11,"rating":0.0,"page_count":46,"view_count":817,"chapters_count":7,"last_update":1716915602,"description":"Twenty-year-old Ethan Smith is unexpectedly transported into the world of 'Conquest of the Realms,' a game he knows inside out. In this strategic battleground, players are assigned races at random and fight for ultimate control of the map. Ethan, a seasoned player, discovers a mysterious multiplier system that amplifies his rewards and resources. With this newfound advantage, Ethan embarks on a quest for supremacy. \n*Ding! The host received 1000 woods, 1000 stones, 500 raw food, 500 gold coins, a title, Wealth Accumulator.**Multiplying ten times...**Partial Success... Proceeding with upgrade...**Congratulations, the host has received 10,000 woods, 10,000 stones, 5,000 raw food, 5,000 gold coins, title, God of Wealth.*","description_hash":-7991271845907611019},{"title":"The Returning Overlord","fiction_id":"86866","link":"https:\/\/www.royalroad.com\/fiction\/86866\/the-returning-overlord","tags":["War and Military","Martial Arts","Male Lead","Action","Adventure"],"lable":"Original","following_count":17,"rating":5.0,"page_count":258,"view_count":3824,"chapters_count":46,"last_update":1718096401,"description":"Arthur, is a coming-of-age character and a military enthusiast with an unmatched sense of firearms. His story begins with abduction, where, to survive, he is coerced into joining a private military contractor. Leveraging his intelligence and sharpshooting skills, Arthur becomes a prominent figure within various major underworld factions, eventually establishing his own armed force. As he navigates through the murky waters of violence and conspiracy, he evolves not only as a warrior but also as a person, constantly questioning his values and moral boundaries.","description_hash":8592122873910240102},{"title":"3001 Paths to Death - A Lite litRPG Looper","fiction_id":"86865","link":"https:\/\/www.royalroad.com\/fiction\/86865\/3001-paths-to-death-a-lite-litrpg-looper","tags":["LitRPG","Time Loop","Progression","Ruling Class","Martial Arts","Action","Adventure","Romance","Tragedy","Male Lead","Strong Lead","Non-Human Lead","Magic","Strategy","High Fantasy"],"lable":"Original","following_count":478,"rating":4.36,"page_count":223,"view_count":32673,"chapters_count":41,"last_update":1718409038,"description":"One law reigns in the realms of cultivation: Death is power.\nI was a low-ranking water cultivator who'd given up on the path of power and pretty much life. To get by, I sold maps with shady details. My customers hated them. Lana loved them. She broke me out of my cocoon and introduced me to a new life of adventuring. \nOn a mission to the Bloodwoods, the \"Benevolent Emperor\" impaled me on a stake. In a cruel twist of fate, I watched my squad die repeatedly until a squid-faced monster freed me. Calamari needed me to save his people. I had other plans.\nI will cultivate the ocean's depths to free my friends from Death's cold hands. After all, I had nothing to lose; my heart died with my squad. \nIf I lived, so could they… so could she\n\nWhat to Expect:\n     Loops\n     Average to Powerful MC\n     Lite litRPG Elements, including levels and classes\n     An Ice\/water cultivator\n     And a love story\n     No Possessions, though there will be some mind-tinkering and shenanigans\n\nRelease schedule: Monday, Wednesday, & Friday","description_hash":9000905435616864420},{"title":"The Keeper of the Mythic Forest","fiction_id":"86864","link":"https:\/\/www.royalroad.com\/fiction\/86864\/the-keeper-of-the-mythic-forest","tags":["LitRPG","Reincarnation","Urban Fantasy","Male Lead","Slice of Life","Fantasy","Romance","Strong Lead","Attractive Lead"],"lable":"Original","following_count":38,"rating":4.83,"page_count":106,"view_count":1649,"chapters_count":9,"last_update":1718628363,"description":"Brewing potions, running his shop, meeting up with attractive guys, and reading texts in the ancient tongue are the passions of twenty-year-old Evan Rethe. When he Awakens to the highest Rank possible within the System one afternoon, Evan's only interest in the System is being able to continue doing what he's doing... though he also finds himself drawn to the dead land it's granted him special access to, a land he desires to see as flourishing as it surely once was.\n\nPosting Schedule: Mondays and Thursdays.\n\nImportant Notes:\n1) Evan is OP and won't face much conflict or struggle.\n2) This is a more light-hearted story that leans more into the slice-of-life, romance, and land-restoration aspects and only has some Dungeon-delving\/monster-hunting aspects, and as such will not deal in conflict, or drama, or politics between people, and what action scenes there are won't be very detailed or drawn out for the most part.\n3) While Evan does sleep around a bit, the only sexual content in the story will be between him and his future boyfriend\/long-term partner and will remain within RoyalRoad's allowed amounts.","description_hash":-1491846930885828781},{"title":"Reject Human. Become Demon. [Mutation Evolution LitRPG]","fiction_id":"86863","link":"https:\/\/www.royalroad.com\/fiction\/86863\/reject-human-become-demon-mutation-evolution-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Comedy","Female Lead","Action","Adventure","Fantasy","Reincarnation","GameLit","High Fantasy"],"lable":"Original","following_count":1271,"rating":4.13,"page_count":348,"view_count":83637,"chapters_count":36,"last_update":1718564885,"description":"[In a world of powerful monsters, dangerous sapients, and Angelic Overlords, Haell the Human will become a Demon and slay them all!]\nAll I ever wanted was to become a demon. And then I died. But beyond that death I found a whole new world, one which may finally allow me to achieve my dreams! There was magic here, Mutations, and creatures only seen in fantasy! It was a land dominated by Angelic Overlords and their shepherd pawns, but not even they could ruin my sheer enthusiasm. For my parents were amazing, the world shone brightly in wonder, and the power that I so craved was now within reach!  I just had to reach for it. I was ready to toil. And though my tears may run dry, and so would my blood be spilled, my will shall forever remain unbroken. I will claw my way to power. I will become a demon.  No matter the cost.\n---What To Expect!---\n--A Main Character that chooses VIOLENCE.\n--Wish fulfillment parents that love and care for you no matter what. (Shh. It's fine. Let it all out.)\n--A wondrous and complex magic system, and an MC who is absolutely excited and overjoyed to explore it! (But not to the point that it's overwhelming, don't worry.)\n--It's not slow-paced. Months and even years frequently pass between and within singular chapters. The MC just gets a chance to train first before all the craziness. The world isn't trying to kill a random 5 y\/o child.\n--Haell won't immediately become a demon, but it won't take her forever to succeed either. Don't worry about it!\n--NON-HUMANOID SAPIENTS.\n\n---Additional Information---\n--69+ Chapter Backlog!\n--The cover was made with the help of a friend and Midjourney.\n-- Masterlist of Content Warnings for Every Chapter","description_hash":-5082602898281919829},{"title":"The Vault: A Sibling's Tale","fiction_id":"86862","link":"https:\/\/www.royalroad.com\/fiction\/86862\/the-vault-a-siblings-tale","tags":["LitRPG","Progression","War and Military","Multiple Lead Characters","Sci-fi","Action","Adventure","Fantasy","Supernatural","Male Lead","Female Lead","Magic","Strategy","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":4,"rating":3.5,"page_count":270,"view_count":1957,"chapters_count":48,"last_update":1718557205,"description":"After millions of years the universe was filled with powerful warriors, geniuses beloved by mana, and unbelievable marvels of magical engineering. But the struggle towards the next step would never end.\nAmidst constant war, plots, and intrigues one alien race discovered the siblings Lilly and Iain who had been peacefully living on Earth. Falsely recognized to be refugees of war, the siblings could narrowly escape through their parents’ sacrifice.\nRealizing that the aliens wouldn’t stop hunting their prey, the siblings had to enter the universe and connect with ‘The Vault’.\nOnly this marvelous building could grant humans the power to contend with the superior alien races.\nBut will it be enough?\n\nMykrail: \nI hope I can convince you to follow me and the siblings on a fascinating journey. It will be rather slow paced with much time for world building. Together we will discover unique environments and exciting plots. Naturally we won’t miss out on tense fights fueled by a power system which doesn’t define the weak and strong too clearly.\nI’m thankful for everyone who decides to accompany us <3\n\nAiming for 10 chapters per week.","description_hash":1228252407520657206},{"title":"Revelation of the Forsaken ","fiction_id":"86861","link":"https:\/\/www.royalroad.com\/fiction\/86861\/revelation-of-the-forsaken","tags":["Portal Fantasy \/ Isekai","Urban Fantasy","Progression","Strategy","Grimdark","Adventure","Fantasy","Psychological","Mystery","Magic","High Fantasy","Steampunk","Mythos"],"lable":"Original","following_count":1,"rating":0.0,"page_count":11,"view_count":123,"chapters_count":3,"last_update":1717130830,"description":"Verman Mercantile Transmigrated to the body of Traden Caelum who was used as a sacrifice by an unknown organization. An organization that is neither existed or not.\nHe fuses with Traden caelum memories overtime slowly becoming one with Traden Caelum. He tries to find his own purpose and learned more about the this new world\nWhile trying to adapt and survive to this new world.","description_hash":-7786196852911449997},{"title":"Specters","fiction_id":"86860","link":"https:\/\/www.royalroad.com\/fiction\/86860\/specters","tags":["Multiple Lead Characters","Action","Adventure","Fantasy","Non-Human Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":72,"view_count":148,"chapters_count":4,"last_update":1718467206,"description":"Humans, Angels and Demons once co-existed in the same places. Living amongst each other much like they were next of kin. However, peace between them wouldn't last for long. With what started as problems between select people became a worldwide war between the Angels and the Demons. The humans however, powerless to not only protect themselves, were also divided. The world that was once ruled by peace was thrown into chaos. Something has to be done.","description_hash":1703385057589678180},{"title":"Tarnished: The Iron Frontier (Steampunk Western)","fiction_id":"86859","link":"https:\/\/www.royalroad.com\/fiction\/86859\/tarnished-the-iron-frontier-steampunk-western","tags":["Anti-Hero Lead","Steampunk","Male Lead","Sci-fi","Strong Lead","Action","Adventure","Fantasy"],"lable":"Original","following_count":540,"rating":4.8,"page_count":188,"view_count":19229,"chapters_count":22,"last_update":1718633880,"description":"John, a man haunted by a forgotten past, is thrust into the role of lawkeeper in a chaotic border town. Struggling with his own inadequacies, he must impose order on a community that thrives on disorder.\nAs he fights to stabilize the town, John encounters formidable hidden adversaries intent on plunging it into lawlessness.\nWith the help of a washed-up former soldier, an overwhelmed Deputy, and a brilliant yet unstable artificer, John faces a daunting challenge: to protect the town and confront his past demons.\nIn a race against time, John must adapt to this rapidly evolving world or risk becoming a relic of the past.","description_hash":-2258526030361044060},{"title":"Doubts to forever ","fiction_id":"86858","link":"https:\/\/www.royalroad.com\/fiction\/86858\/doubts-to-forever","tags":["Adventure","Fantasy","Romance","Reader Interactive","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":38,"chapters_count":1,"last_update":1716196779,"description":"After a life-altering accident, atheist Adam awakens in a mysterious realm that challenges his beliefs. As he confronts echoes of his past and an uncertain future, will he find redemption or be consumed by his doubts?","description_hash":982397732245694127},{"title":"Black Tech Evolution","fiction_id":"86857","link":"https:\/\/www.royalroad.com\/fiction\/86857\/black-tech-evolution","tags":["Urban Fantasy","Male Lead","Sci-fi","Contemporary","Strong Lead","Adventure","Genetically Engineered ","Technologically Engineered","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":7,"rating":4.0,"page_count":28,"view_count":619,"chapters_count":6,"last_update":1716511374,"description":"System | Sci-Fi | Urban Fantasy\nEric stumbles upon a mysterious System that claims to make his dreams a reality. Join Eric as he speedruns the tech tree and beyond.\n\nYou'll like this story if you enjoyed \"Transdimensional Marketing\" \"Scholar's Advanced Technological System\" \"I have A Super USB Drive\" and other novels of that sort.\nChapters will be short like with my other story Young Master's Halo Is Too Bright.\nTags - Urban Fantasy, Sci-Fi, Technological Progression, Business Management, Faction Building, System Administrator.","description_hash":-8540802688735284980},{"title":"A sad stack of short stories","fiction_id":"86853","link":"https:\/\/www.royalroad.com\/fiction\/86853\/a-sad-stack-of-short-stories","tags":["Psychological"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":200,"chapters_count":5,"last_update":1716457656,"description":"Welcome stranger!\nThis is the stack of words weaved by a dyslektic sad guy. Be warned, most stories here may not be proofread and will contain mistakes, not make sens and will be short. This is just an outlett for my creavtivity for strangers to view.\nBe inspiered, or not. Be entertained, or not. I will be here, but most times not.\n- A Vulture Writer","description_hash":-4420373169841333551},{"title":"Infernal Investigations","fiction_id":"86852","link":"https:\/\/www.royalroad.com\/fiction\/86852\/infernal-investigations","tags":["Urban Fantasy","Steampunk","Female Lead","Adventure","Fantasy","Mystery","Supernatural"],"lable":"Original","following_count":221,"rating":4.88,"page_count":151,"view_count":5699,"chapters_count":13,"last_update":1718380802,"description":"Murder. Machines. Diabolism. Biosculpting. Tea! Malvia was once an Infernal of the Black Flame gang, a member of the Empire’s most despised race serving in one of it’s most infamous criminal enterprises. But that’s all in the past now. One faked death later, and she’s been living the last few years as Katheryn Falsara, a slightly sketchy alchemist operating under the nose of the law.\nAnd business is booming. With the Anglean Empire's nobility constantly scheming against each other, both magic and machine benefiting from her skills, and an ever-expanding kingdom full of rare ingredients, Malvia's been content to sit on the sidelines and make a tidy sum of cash. \nHowever, a rash of poisonings among the noble heirs make her behind-the-scenes role impossible. Elements of a life she wanted to leave behind keep resurfacing, and soon she’ll find herself at the center of a web of intrigue. It’s either figure out the web or be trapped by it forever.\n\nUpdating M-W-F at 9 AM MST","description_hash":7942213813699474537},{"title":"Grim Fate: The Strongest Guild","fiction_id":"86851","link":"https:\/\/www.royalroad.com\/fiction\/86851\/grim-fate-the-strongest-guild","tags":["GameLit","Dungeon","Comedy","Male Lead","Strong Lead","Action","Adventure","Fantasy","Magic","Grimdark","High Fantasy"],"lable":"Original","following_count":5,"rating":3.5,"page_count":164,"view_count":2949,"chapters_count":32,"last_update":1718524536,"description":"Telmaris. A nation where strong hunter's guilds set their quarters due to its livelihood and abundance of dungeons. But amongst all of them, a certain guild, with no affiliated nations, is rumoured to be the strongest yet craziest of them all. They are called…Grim Fate.\n\nZephyr Gersche, is one of the hunters currently residing in Telmaris as of recently, though his powers and features are as human as it gets. With the threat of monsters growing each day, participating guilds within Telmaris and other regions have called for a gathering. Zephyr, of course, was out of place and was called out for the reason of his invitation…but something's off with him. Who really is this human before the eyes of the intimidating guilds?","description_hash":-8187170438560142600},{"title":"A Magical World","fiction_id":"86850","link":"https:\/\/www.royalroad.com\/fiction\/86850\/a-magical-world","tags":["Post Apocalyptic","Male Lead","Sci-fi","Action","Horror","Mystery","Supernatural","Low Fantasy","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":44,"view_count":406,"chapters_count":8,"last_update":1718279727,"description":"A boy that has finally left his life of torment is now being thrust into one of more dangers and unseen horrors the likes of which would be seen in fairy tales.\nNow,How would he fair in a world, such as this?\nNOTE:\nSeveral warning tags have been given as a precaution to not get this novel taken down but that doesn't mean this novel won't contain any dark content. Read at your own risk.\nThis is a slow-burn novel for most of the novel for now if that isn't something your looking for then that's okay!\nThis novel is also available on scribble hub going by the title \"A Magical World\" also on Web novel as \"A Magical World: A Grim-Dark Experience\" .","description_hash":-8881949114998190412},{"title":"The Damned Four","fiction_id":"86849","link":"https:\/\/www.royalroad.com\/fiction\/86849\/the-damned-four","tags":["Grimdark","Psychological","Multiple Lead Characters","Horror","Supernatural","Male Lead","Female Lead","Low Fantasy"],"lable":"Original","following_count":4,"rating":4.83,"page_count":223,"view_count":832,"chapters_count":15,"last_update":1717050221,"description":"When four friends get in an accident that strands them in the middle of the forest they were driving through, one of them helps pass the time and take their minds off the nerve-wracking nature of their situation until help can arrive by telling scary stories.\nThe 4th House On Romero Street - Fear and paranoia spreads amongst people taking shelter within a house from a zombie outbreak when they find out one of them could potentially endanger them all.\nWooden Clutches - Something malicious begins to bloom between a young boy and his best friend as the bond they once had becomes tainted with an insane obsession.\nLakefield High Lamentations - A schoolgirl with insecure secrets buried deep within her mind discovers a mysterious place where all she ever wanted is realized to her heart's content.\nNever Look Back - A man mourning the recent loss of his love cannot find himself to let go of the past until he is seemingly faced in a standoff with it following a sinister encounter.","description_hash":-5211383485727335022},{"title":"Prologue","fiction_id":"86848","link":"https:\/\/www.royalroad.com\/fiction\/86848\/prologue","tags":["Female Lead","Drama","Action","Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":42,"chapters_count":1,"last_update":1716158865,"description":"Long ago in the multiverse, far away from Earth, unknown to earth humans was born a system given Celestia as a name. Celestia was composed of 12 planets and 12 Nations. 11 of those planets were circling around the 12th. This last planet was the bigger, the greatest, and the most powerful one of all. It was named Royalia. In Royalia reigned a family with a pure blood of royalty. The queen and king reigned in cold hands filled of power and wish of territory. Together, they had 7 children. Amaya and William Rolian, the rulers of Royalia closed the blood line with a last pair of twins, me and my dear brother. I'm not forcing you to believe everything I will say in these pages, nevertheless I am telling you there might be something out there in the unknown infinite space you humans don't know about just yet. I welcome you now to the story of this so called perfect family I am apart of. So if you please, allow me, dear readers, to recount a tale full of Magic, Sorrows, Wishes and Adventures of all sorts. The story of the Rolian blood line, the story of how this blood line came to its end and the tale of their youngest daughter Arabella Rolian.\n-Milady you have a visitor waiting for you\n-Thank you Sebastian I'll be there in a second\nThis was Sebastian, my butler since I am a child he'll be a big part in this tale. My duties call me, I now let you enter my world through those pages alone, you won't need me from now on. Before you go dear readers you must promise me to believe in yourself and believe in me. Let yourself be drawn into my fantasy. I offer you my luck. Use it wisely and I promise you we'll meet again. \n meet again.","description_hash":5280150325624401067},{"title":"Psychic stone ","fiction_id":"86847","link":"https:\/\/www.royalroad.com\/fiction\/86847\/psychic-stone","tags":["Progression","War and Military","Martial Arts","Female Lead","Strong Lead","Action","Fantasy","School Life","Supernatural","Magic","Strategy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":47,"chapters_count":1,"last_update":1716700761,"description":"Over a million years ago a Goddess came to Earth. The Goddess fall in love with a mortal and entrusted him with the power of the psychic stone. After she went in a deep Dormay. Humanity fought against each other to have the power of the psychic stone which is equal to the Goddess's power.","description_hash":-8854184796472521706},{"title":"Malachi Stone: The Wind in the Symphony of the Storm","fiction_id":"86846","link":"https:\/\/www.royalroad.com\/fiction\/86846\/malachi-stone-the-wind-in-the-symphony-of-the","tags":["Anti-Hero Lead","Ruling Class","Psychological","Male Lead","Secret Identity","Fantasy","Romance","Tragedy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":33,"chapters_count":1,"last_update":1716158822,"description":"In a world where magic is a rarity, politics and social status still rule the life of young Malachi Stone. On his quest to accomplish his dreams of becoming a performer and finding his true love, he stumbles and loses his way. Follow him through this twisted tale of manipulation and naivete and see where his journey takes him.","description_hash":-1192242170757280984},{"title":"Game of Gods Fantasy Online: Define your Divinity ","fiction_id":"86845","link":"https:\/\/www.royalroad.com\/fiction\/86845\/game-of-gods-fantasy-online-define-your-divinity","tags":["Virtual Reality","Portal Fantasy \/ Isekai","Dungeon","Drama","Adventure","Fantasy","Romance","LitRPG","High Fantasy","Mythos","Progression"],"lable":"Original","following_count":2,"rating":0.0,"page_count":4,"view_count":74,"chapters_count":1,"last_update":1716158649,"description":"\"Game of the Gods Fantasy Online\" was unlike any game Laelynn had ever played. The various worlds presented in it was a tapestry of breathtaking landscapes ranging from lush, verdant forests that whispered secrets with the rustling of leaves, to stark deserts where the sands hummed with old magic but also a barren expanse of monotonous scenery, from sparse, lifeless wastelands that echoed with the silence of desolation, to congested urban sprawls where the noise drowned out any hint of enchantment. As a deity, Laelynn desired to shape or select a world where she could attentively oversee her realm, elevating mountains, rerouting rivers, and fostering civilizations of beings that worshiped her as their all-powerful guardian. However, things did not unfold as she had anticipated.\n\nEach decision Laelynn made in \"Game of Gods Fantasy Online\" seemed imbued with a weight that felt profound, the consequences rippling through the game world in waves of change that delighted her but at the same time disturbed her. She grew attached to her creations, feeling a sense of pride and protectiveness over the virtual beings that thrived under her rule.\n\nYet, as days slipped into nights, strange occurrences began to blur the lines between her reality and the realm within her game. She encounters mysterious natural occurrences nearby—suddenly, a rift in space appears in her room, she finds herself able to utilize her in-game abilities in the real world, and most notably, she discovers a method to communicate with her virtual entities as though by magic. Laelynn watched, heart pounding with a mix of excitement and disbelief, as the world echoed her gameplay in impossible ways.\n\nThe truth was far beyond her wildest imagination: \"Game of the Gods Fantasy Online\" was no mere game, but a portal to an ancient reality where the thoughts of a god held the power to reshape worlds. And Laelynn, in her innocent play, had begun to wield that power with a naive hand, unaware that her game was all too real.\n\nAs these revelations dawned upon her, the line between the player and the deity blurred, leaving Laelynn to wonder if she was truly just playing a game, or if she had become something much more powerful and profound. The prologue of her story was just beginning — in the game of gods, what kind of deity would she choose to be?","description_hash":-740631474226537434},{"title":"Another memory ","fiction_id":"86844","link":"https:\/\/www.royalroad.com\/fiction\/86844\/another-memory","tags":["Grimdark","Psychological","Contemporary","Drama","Adventure","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":106,"chapters_count":1,"last_update":1716158639,"description":"Just a day that needs to be remembered","description_hash":-6463005295322951852},{"title":"Axe me a question","fiction_id":"86843","link":"https:\/\/www.royalroad.com\/fiction\/86843\/axe-me-a-question","tags":["Urban Fantasy","Male Lead","Sci-fi","Action","Supernatural","Mythos"],"lable":"Original","following_count":1,"rating":0.0,"page_count":122,"view_count":792,"chapters_count":15,"last_update":1718227448,"description":"Checkmate was never a planet meant to be lived on. It was more akin to a slaughterhouse meant to turn the dregs and slime of humanity into a meal for those living on more honoured planets. Something they could point and laugh at while inwardly wishing that they never step foot there. Palm is a dull eyed barkeep who spends his time sleeping and narrowly avoiding eviction, Checkmate is all he ever knew for his adult life and he desperately wishes some mystical power would bring him away to a life of luxury.\nBut to the man who only ever cocooned himself in his own failing establishment he failed to realise that his world was changing, and violently so.","description_hash":2825354986241327616},{"title":"The Tower Below","fiction_id":"86842","link":"https:\/\/www.royalroad.com\/fiction\/86842\/the-tower-below","tags":["Horror","Mystery","Short Story","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":63,"view_count":51,"chapters_count":1,"last_update":1716158514,"description":"At the end of an abandoned street in a Midwest suburb lies Sunflower Meadows High School. It is a empty shell, devoid of life for twenty years. It is a black hole into which people are drawn and never return. An accountant in the middle of her career encounters the unknowable during a mundane job hunt and falls into a deepening gyre of otherworldly horror that lies in the bowels of an unassuming town.\nA short horror story.","description_hash":418735607590789464},{"title":"The Celestials Prison - Project Archangel","fiction_id":"86841","link":"https:\/\/www.royalroad.com\/fiction\/86841\/the-celestials-prison-project-archangel","tags":["Urban Fantasy","Progression","War and Military","Multiple Lead Characters","Sci-fi","Action","Fantasy","Mystery","Slice of Life","Male Lead","Secret Identity","Magic","High Fantasy","Ruling Class","Hard Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":67,"view_count":111,"chapters_count":3,"last_update":1718569649,"description":"The Celestial is a symbol of the divine, a pillar stretching high into the heavens. It is worshipped for the blessings it brought upon the world. Extraordinary power, revolutionary tools, and beings beyond understanding. Bearing its power will not only change your fate, but the fate of the world.\nThe noble Pendragon family, once known for their brutally efficient art of war, are revered for their effort and contribution in the field of medicine. They established the Helios Hospital of Medical Research and Development, sharing their years of work for the ongoing betterment of the angels. House Pendragon is loved by their people for this. But following the end of the war between angels and demons, they do not relish in this praise, for they always remember the pain and loss for that advancement. Upon acquiring the power of the Darkeater, Sirin Pendragon, daughter of Siba, enthusiastically put forward the proposition that would go on to inspire the creation of Project Archangel. Ironically, the very thing that would destroy House Pendragon.\n\"The Darkeater even allows for the creation of matter at even the intricacies of the cellular level! We can create entire organs, bones, even limbs at will! Why in the world would the demons be so quiet about this? It's potential is limitless!\"\nEos, Yami, Nova, and Zeus enjoy the simple days they spend together with their mother. However, each day becomes more mundane as nothing ever changes. Their mother couldn't have ever controlled the children's growing curiosity, the will to satiate the senses with experiences they weren't yet privy too is only natural. It was the same for herself as well. But upon warning them of the vast, mysterious, and evil world beyond the forest surrounding their little home, she realized the truth was simply inevitable no matter what she did to hide it.","description_hash":6272132897883450723},{"title":"trial 1.0","fiction_id":"86840","link":"https:\/\/www.royalroad.com\/fiction\/86840\/trial-10","tags":["LitRPG","Dungeon","Male Lead","Short Story"],"lable":"Original","following_count":1,"rating":0.0,"page_count":6,"view_count":181,"chapters_count":2,"last_update":1716183956,"description":"I just need feedback I have never done this before so help. Please.","description_hash":-8363765904074588807},{"title":"Edge Of the Afterlife","fiction_id":"86839","link":"https:\/\/www.royalroad.com\/fiction\/86839\/edge-of-the-afterlife","tags":["Action","Horror","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":38,"chapters_count":1,"last_update":1716156779,"description":"Charlie wakes up in paradise but somthing is off. he now discovers the secrets of this world.","description_hash":-5377138201766811294},{"title":"Roommate Rowan","fiction_id":"86838","link":"https:\/\/www.royalroad.com\/fiction\/86838\/roommate-rowan","tags":["Urban Fantasy","Multiple Lead Characters","Secret Identity","Adventure","Fantasy","Mystery","Supernatural","Male Lead","Magic"],"lable":"Original","following_count":1,"rating":4.0,"page_count":61,"view_count":150,"chapters_count":2,"last_update":1716156876,"description":"Starting college is an awkward and exciting time in everyone's life, and nowhere is that more apparent than in introductions. Moving all the way to the United States is enough of an adjustment on its own, so it certainly doesn't help if you don't get along with your roommate. What if your roommate doesn't mesh with your personality? What if they're nerdy, shy, anxious? What if, for some reason, they seem to not want you around?\nWhat if your roommate turns out to be a were-bat?\nSanti is learning the answer to all those questions as he and his hairy new roommate, Rowan, are thrust into a world beyond their wildest imaginations. From flying lessons, to monster tracking, to rune deciphering and conspiracy unearthing, this randomly-assigned duo's college experience is going to be anything but typical. They may not know what secrets they'll uncover next, but one thing's for certain: There's something big happening beneath the surface of their once ordinary college town. What exactly that is, their school's involvement, and what it means for the two of them remains to be seen... or heard.","description_hash":-1619540766521975620},{"title":"An Unlikely Connection: Part 2","fiction_id":"86837","link":"https:\/\/www.royalroad.com\/fiction\/86837\/an-unlikely-connection-part-2","tags":["Male Lead","Slice of Life","Drama","Romance","School Life","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":139,"view_count":353,"chapters_count":10,"last_update":1716215396,"description":"Lust, curiosity, infatuation, and playful anxiety were Joshua's four apocalyptical horsemen of emotions towards his friend with an interesting life. Now, as a sophomore in college, those feelings that plagued his actions every day, are about to initiate into phase two.","description_hash":1669528721564409223},{"title":"Cloak of the Night","fiction_id":"86836","link":"https:\/\/www.royalroad.com\/fiction\/86836\/cloak-of-the-night","tags":["Urban Fantasy","Female Lead","Contemporary","Secret Identity","Strong Lead","Action","Fantasy","Romance","Supernatural","Magic"],"lable":"Original","following_count":1,"rating":4.5,"page_count":157,"view_count":1541,"chapters_count":16,"last_update":1718569120,"description":"In modern-day New York, dark powers control the city from the shadows. Arin's life is upended when her brother, Darius, mysteriously vanishes. Determined to find him, she delves into a hidden world of ancient magic and intrigue, guided by a dark stranger. \nFacing treacherous alliances and deadly adversaries, Arin discovers a conspiracy threatening not only Darius but the entire city. In \"Cloak of the Night,\" love, mystery, and dark fantasy intertwine as Arin fights to save her brother and unravel the city's darkest secrets.","description_hash":-1019695220055155768},{"title":"MAGIKA MILITARY","fiction_id":"86835","link":"https:\/\/www.royalroad.com\/fiction\/86835\/magika-military","tags":["War and Military","Female Lead","Sci-fi","Action","Adventure","Fantasy","Magic","Strategy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":58,"view_count":270,"chapters_count":6,"last_update":1717818295,"description":"Kurosawa Kamo, a young mage with a past full of battle scars, joins the elite Magika Military, a division that specializes in wielding magic in a galactic world. At the induction ceremony on planet Cerullion, peace is shattered by a surprise demonic attack. Kayn, a famed hero, leads the defense, but even his power falls short against the onslaught of enemies.\nAmidst the chaos, Kurosawa and her crew, including the hyperactive Ren Takagi, are forced to fight for their lives while trying to shield the civilians. Meanwhile, Kayn unleashes his formidable power, but the arrival of an even more fearsome foe shifts the tide of battle.\nIn a world where magic is both a gift and a burden, Kurosawa and her comrades are thrust into an epic struggle for survival, where every spell cast and every decision made could alter the fate of everyone.","description_hash":-9201639846189562334},{"title":"To love is to live","fiction_id":"86833","link":"https:\/\/www.royalroad.com\/fiction\/86833\/to-love-is-to-live","tags":["Slice of Life","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":23,"chapters_count":1,"last_update":1716156364,"description":"Just a short poem that randomly came to mind on a peaceful night.","description_hash":6467053484121378385},{"title":"Canceled Paladin","fiction_id":"86832","link":"https:\/\/www.royalroad.com\/fiction\/86832\/canceled-paladin","tags":["Drama","Action","Adventure","Fantasy","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":29,"chapters_count":1,"last_update":1716155977,"description":"Flash fiction about a paladin with a hidden past who must wield a cursed sword to save his family and confront destiny.","description_hash":1374499718234471237},{"title":"Circus Fire","fiction_id":"86831","link":"https:\/\/www.royalroad.com\/fiction\/86831\/circus-fire","tags":["Multiple Lead Characters","Fantasy","Non-Human Lead","Magic"],"lable":"Original","following_count":2,"rating":5.0,"page_count":39,"view_count":493,"chapters_count":9,"last_update":1718559197,"description":"I don't really know what to say here?\nI had an idea for a short, slightly dark story that could be a stand-alone short story or a series of short stories.\nSo far it's about thirty pages and it'll most likely stay that way. The main characters are Rags, a fourteen-year-old from the Arena, and Glee, a sixteen-year-old fire-eater from the circus with a dark secret.","description_hash":6271609136631188919},{"title":"Fallen Angel","fiction_id":"86830","link":"https:\/\/www.royalroad.com\/fiction\/86830\/fallen-angel","tags":["Non-Human Lead","Sci-fi","Drama","Horror","Female Lead","Genetically Engineered "],"lable":"Original","following_count":2,"rating":0.0,"page_count":5,"view_count":72,"chapters_count":1,"last_update":1716155964,"description":"Her name is Sarah.  That is all that she can remember.  They pulled her from the wreckage of a starship that crash landed on this planet.  They thought that she was dead but she got better.  Now these people that call themselves humans are holding her in a secret government facility.  They want her to tell them the secrets that will unlock the technology that she was found with.  Until her memories come back there is not much she can do about that.  She suspects that they won't like the answers to their questions even if she could answer them.   Now there is a strange hunger beginning to manifest itself in her body.  Nothing will satisfy it and she can't tell her captors what it might be. The food they supply her with seems to lack a specific nutritional ingredient.  She doesn't dare tell them that they are starting to look tasty.","description_hash":-5490865841876767881},{"title":"The Dungeon's Worst Little Mistake","fiction_id":"86829","link":"https:\/\/www.royalroad.com\/fiction\/86829\/the-dungeons-worst-little-mistake","tags":["LitRPG","Dungeon","Villainous Lead","Comedy","Non-Human Lead","Action","Adventure","Fantasy","Female Lead","Magic"],"lable":"Original","following_count":38,"rating":4.6,"page_count":118,"view_count":2723,"chapters_count":13,"last_update":1718548235,"description":"What happens when you have a half-finished World-Wide Magical Operating System that has been stuck in development hell and Beta testing for hundreds of years? You get bugs.\nWithin the first floor of one of thousands of Dungeons that dot the world, a simple rounding error results in the birth of a trash mob with sapience, System User Access, and a desire for revenge against her creator. Can she become strong enough to overcome her weakness, delve into the depths of the Dungeon that birthed her, and gain her freedom?\nCome and follow Bug in her journey of growth, revenge, and a search for shiny treasures and cookies.\n\n\nContent Notes:\n- The protagonist of this story is not interested in being a good person. Besides the inability to lie and always honoring her promises, she won't hesitate to hurt or kill anyone that gets in her way, even at the risk of killing innocent bystanders or even spreading country destroying pandemics.\n- This story will contain Lesbians. (Same sex romance is not a key part of this story, but there are no tags for it, so I am putting it here.)\n\n\n~Upload Schedule~\n2000 ~ 3000 words every Sunday and Wednesday @ 10:30 a.m. Eastern Time (America & Cananda)","description_hash":-5865823277672775031},{"title":"abominación[español]","fiction_id":"86828","link":"https:\/\/www.royalroad.com\/fiction\/86828\/abominacionespanol","tags":["LitRPG","Reincarnation","Non-Human Lead","Action","Adventure","Short Story"],"lable":"Fan Fiction","following_count":0,"rating":1.0,"page_count":19,"view_count":248,"chapters_count":5,"last_update":1717914884,"description":"¿Cuántas veces se ha reencarnado? 1?2? Pues te jodes lo he hecho 3 veces hurra¡¡por la grandiosa yo! ¿Esta es la historia de una entidad abstracta que toma almas y las envía a diferentes mundos con regalos para que llegue a ser lo mejor de ese mundo en un corcuso para ver quién será su sucesor, quieres ver a nuestro ´protagonista insultar a este ente? abstracto y volverse op? ¿Con el tiempo? Esta es tu historia \n\/\/, pero esto lo hace un novato discúlpame por las faltas de ortográfica y mala historia, espero les agrade y se acepten críticas constructivas \/\/","description_hash":2510854651856243281},{"title":"Creed of the Greedier","fiction_id":"86827","link":"https:\/\/www.royalroad.com\/fiction\/86827\/creed-of-the-greedier","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Villainous Lead","Strategy","Action","Adventure","Drama","Psychological","Reincarnation","Male Lead","Strong Lead","Magic","Grimdark","High Fantasy","Dystopia","Attractive Lead"],"lable":"Original","following_count":9,"rating":5.0,"page_count":10,"view_count":139,"chapters_count":1,"last_update":1716153795,"description":"Hello, readers, my name is Slaine, and I believe in the Creed of the Greedier.\nI’ve been the poster child for angel dust piled higher than the heavens, made the lower heavens my toilet bowl, and dined with kings of Hell before wiping my mouth with their tears. My greed gets me everything; the means to fulfill any dream.\nEverything is mine, including you; if you are not mine, then you do not exist!\nIf you are mine, then your desire is mine, and anything I desire...I will obtain.\nSo, will you be mine? <3\n\nWhat happens when you obtain everything in the universe...and a little outside of it, but you still cannot grant your one desire? When you have everything...but the single thing you most covet?Well, you have to look outside the box and contact a High Goddess...except you kind of killed her best friend. Not your problem.They have a problem, though, and you have the solution...you. If heroes and saints can't destroy the Heart of Evil, then why not send a villain? At least...for the right price. Hehehe.\n\nA One-Shot I made on a whim. If people enjoy it, then I can see about continuing it. It sounded like a really fun concept. Tell me what you think!","description_hash":-7429095405399583473},{"title":"Flawed Rebirth","fiction_id":"86826","link":"https:\/\/www.royalroad.com\/fiction\/86826\/flawed-rebirth","tags":["LitRPG","Reincarnation","Progression","Ruling Class","Martial Arts","Fantasy","Female Lead","Magic","GameLit","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":39,"chapters_count":1,"last_update":1716153741,"description":"It wasn't supposed to go like this. Lina was supposed to revert the fate of her world. Somewhere along the way something went wrong, and she was rebirthed as her own daughter.\nLina, now Alice, must grow and stop those who wish to harvest earth for their own gain.\nWith the boon of her Ascendant, she must reach higher than before and save Earth from its grim fate.\n\n\nI'm not quite sure where to post this, but this is my first work. please let me know if anything is amiss. \nRegardless of how you felt about this work, taking time to leave a review will be incredibly helpful. Thank you for taking the time to read. \nI have no set chapter releases aside from a personal goal of once per week, but if time allows, I'll upload more.","description_hash":7610570162286410261},{"title":"Otherworldly Wizard Road","fiction_id":"86825","link":"https:\/\/www.royalroad.com\/fiction\/86825\/otherworldly-wizard-road","tags":["Portal Fantasy \/ Isekai","Sci-fi","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":13,"rating":0.0,"page_count":386,"view_count":6178,"chapters_count":76,"last_update":1718582405,"description":"Reborn as a minor noble, she faces the tragedy of her empire's invasion. The twists of fate compel her to grow stronger in this jungle-like world.\n\"To gain is to lose; this is the wizard's truth.\"\n\"In the darkness, we seek knowledge, fortify our strength, and become great beings.\"\n\"A fairy-tale toy island, skies roamed by giant whales, and labyrinths teeming with eerie spirits will be the realms I traverse.\"","description_hash":-8350578022038940374},{"title":"Parallel Curses","fiction_id":"86824","link":"https:\/\/www.royalroad.com\/fiction\/86824\/parallel-curses","tags":["Urban Fantasy","Multiple Lead Characters","Contemporary","Fantasy","Horror","Mystery","Supernatural","Magic"],"lable":"Original","following_count":1,"rating":0.5,"page_count":38,"view_count":386,"chapters_count":6,"last_update":1718469467,"description":"In this world, not everyone is born Cursed. Most people are unaware of our very existence, and the ones aware are mostly unwilling to discuss it. We are, at best a nuisance, a glitch in their blessed normalcy. At worst, we are what brings their worlds down. Unfortunately, the entire Earth is built around us.\nThe Earth of Parallel Curses is as familiar as it can be with ours - some locations are exactly the same, others have changed radically because of an alternate course of history and geopolitical dynamic influenced by the existence of the Cursed. These rare humans with occult powers, bend reality to a degree that even themselves cannot fathom. \"Parallel Curses\" is a multi-lead collection of stories that are weaved across all the continents of an Earth parallel to ours.\n----\nNote 1 \nThis is my first attempt on this website, as I plan to use my writing to share stories and images from the Earth of Parallel Curses. The purpose is to improve my writing capabilities and teach myself to share my imagination, without overthinking and over-editing texts.\nNote 2 \nThe art is AI, the \"not so great\" graphics and editing is by me, as I have been told there is no hope in RR without a cover. If ever an artist is inspired by my work, I would be more than honored to have real art commissioned for my Cursed series.","description_hash":-7840616271035686809},{"title":"Geek Fire: Dragon Girl Book 1","fiction_id":"86823","link":"https:\/\/www.royalroad.com\/fiction\/86823\/geek-fire-dragon-girl-book-1","tags":["Progression","Super Heroes","Female Lead","Sci-fi","Secret Identity","Adventure","School Life","Soft Sci-fi"],"lable":"Original","following_count":8,"rating":5.0,"page_count":36,"view_count":369,"chapters_count":6,"last_update":1718633765,"description":"Honors student, Emma Edgin, never thought she’d be a superhero, but she never thought she’d fail a class or be diagnosed autistic either. After a strange craft flies over the West Coast, Emma sneezes a fireball and starts flying.  Emma doesn’t want to be a hero. She’s got to focus on passing English and keeping the new Super Commission agent from noticing her.  Too bad so many people need saving.","description_hash":8304208868358360426},{"title":"Dimensional Building Game","fiction_id":"86822","link":"https:\/\/www.royalroad.com\/fiction\/86822\/dimensional-building-game","tags":["Comedy","Action","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":38,"chapters_count":1,"last_update":1716148572,"description":"Have you ever wanted to build your own world? Construct unique species? Or perhaps lord over countless organisms while being worshipped. Welp, then you are probably not like John. Despite being given a chance at god like levels of power, he is hardly efficient. Why follow the tutorial, when you can do your own thing and stumble about taking the “seinic” route. Join John and guide as they strive to build the greatest dimension ever. Or at least look at the massive mess they, John, makes. Oh yeah, did I also mention that part about eldrich horrors try to end John and all life that has ever been and ever will be? I probably did, no way something that massive could be overlooked.\nSynopsis\/What to expect.\nThis work is essentially a god level world build simulator.\nit is not video game thing. The events are based in a real world ish scenario. Hence no video game bs. Cough *Gliches* Cough.\nSlow ish pacing. It takes a while for the protagonist to scale.\nTime-Skips; plural. There are a lot of these. As… well. I don’t want spoil things, but being a god like entity and build an entire dimension takes a LONG time. Sometimes I will display side stories depecting some of the things happening during long activities or actions.\nMultiple POVs and perspectives. I will focus mainly on ONE protagonist, John. However, I will also show how other people interact while he is either not around or doing something that take hundreds or thousands of years. I was not joking when I said LONG. It will also help flush out the world. However, John is the main protagonist.\nThe main character is NOT 100% invincible. The character is powerful, but he is not invincible. Hard to kill? Yes. Unkillable? No.\nThreats will appear throughout the story. However, there will be a while before serious high level entities show up.\nMost Impotantly: I am writing this for fun. I will do my best to make this a great and compelling story. However, this is ultimately going to be a story I enjoy and have fun writing. I will take some notes here and there, but I want this to be a story I enjoy writing. Therefore, I’m going to likely post rough drafts that are not 100% perfect. (I will still check for grammar mistakes. However, I won’t do an in depth editing process.)\nIf you are annoyed by the story, leave a comment. Otherwise, I won’t bother fixing it. Unless I go back to fix something I don’t like.","description_hash":6557759871335230158},{"title":"The Eternal Masquerade","fiction_id":"86821","link":"https:\/\/www.royalroad.com\/fiction\/86821\/the-eternal-masquerade","tags":["Xianxia","Psychological","Multiple Lead Characters","Slice of Life","Secret Identity","Action","Drama","Fantasy","Male Lead","Female Lead","Strong Lead","Non-Human Lead","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":85,"chapters_count":2,"last_update":1716778876,"description":"Hain is a servant. He doesn't have any grand ambitions or ideals he feels strongly about. All he wants is to make his master's life easier, and he's nothing more than a means to that end. Surely his missing past doesn't matter, or the occasional blackout, or his definitely very human abilities. Everything will be okay... as long as nobody peeks under the cloak, of course.\nXianlu Fonn is a detective. She is renowned for her genius intellect and composure, travelling the entire kingdom to bring justice to the wicked. That's what they say, at least. She's just doing it because she couldn't be bothered to say no. Besides, it's not like there's any danger with her faithful bodyguard at her side, and on rare occasions it can be interesting. The next city will be the same as always. One more, just as dull as all the others with barely one or two breaks in the monotony... right?\nOf course, that's not how things are going to go. I can hardly let such precious gems wallow in the dust, hm? They must needs shine, otherwise they are no gems at all. Oh, but don't worry. I won't interfere. I never do. All I need to do is watch. After all...\nThis tale was written long before they met.\n\n(This is my first attempt at posting a story. I will try to update at least once a week, but cannot promise anything)","description_hash":6166628890372164232},{"title":"Adcium's CYOA","fiction_id":"86820","link":"https:\/\/www.royalroad.com\/fiction\/86820\/adciums-cyoa","tags":["Adventure","Reader Interactive"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":78,"chapters_count":1,"last_update":1716143207,"description":"A, \"Choose Your Own Adventure\" story.\n\nLet's have some fun I guess.","description_hash":6797095400796435890},{"title":"Legend of the Awakened Goblin [Dungeon Crawling LitRPG]","fiction_id":"86819","link":"https:\/\/www.royalroad.com\/fiction\/86819\/legend-of-the-awakened-goblin-dungeon-crawling","tags":["LitRPG","Dungeon","Non-Human Lead","Action","Fantasy","High Fantasy","Progression"],"lable":"Original","following_count":78,"rating":4.62,"page_count":220,"view_count":3911,"chapters_count":18,"last_update":1718542861,"description":"In the mystical world of Verdantallis, the gods created seven towering dungeons, each a treasure trove of loot and power, with a fragment of the ultimate prize at the very top. Heroes are beckoned by the promise of any wish granted upon conquering them all. An anomaly unfolds within the depths of the Great Forest Dungeon as an ordinary goblin mob gains self-awareness and embarks on a journey to conquer all seven dungeons of Verdantallis, chasing the elusive fulfillment of the gods' promise.\n\nWhat to Expect:\n-  Frequent action and battles\n- Dungeon Crawling\n- Weak to Strong MC\n- Stat Blocks \/ LitRPG System\n- New chapters 3 Days\/Week (Sundays, Tuesdays, and Thursdays at 8:00 CST). Occasional bonus chapters.","description_hash":8115625259296206828},{"title":"The Chronicles of a Fallen Star","fiction_id":"86818","link":"https:\/\/www.royalroad.com\/fiction\/86818\/the-chronicles-of-a-fallen-star","tags":["GameLit","Portal Fantasy \/ Isekai","Comedy","Female Lead","Harem","Action","Fantasy","Romance"],"lable":"Original","following_count":9,"rating":4.5,"page_count":265,"view_count":1464,"chapters_count":15,"last_update":1718566788,"description":"In the whimsical world of Udanara, Paola Juderías, a young Hispanic woman from New Mexico, gets the ultimate surprise vacation when she's suddenly transported to a land of magic and mayhem. Imagine being dropped into Naked and Afraid but with way more dragons and fewer camera crews. Stripped of all her modern comforts—literally—Paola has to rely on her wits and newly acquired skills to survive and thrive in this fantastical realm.\nHer journey kicks off with an unexpected ally in Ayla Guinenne, a Sword Maiden who quickly becomes her protector and lover. Their escapades lead them to the bustling city of Valarian, a place where the ritzy Uptown glimmers over the rough-and-tumble Slums. Amid political shenanigans and social chaos, Paola bumps into Selene, a sly demon rogue who knows her way around the city's seedy underbelly. Together, this unlikely trio unravels dark secrets that could shake the very foundations of their world.\nThe Chronicles of a Fallen Star is a hilarious, harem, GameLit (Semi-LitRPG), slice-of-life adventure that dives into themes of love, loyalty, and revolution. With a mix of spicy romance and character-driven storytelling, it weaves together intimate relationships and epic quests as Paola’s growing harem battles to bring change to a society on the edge of upheaval. Get ready for intense action scenes and laugh-out-loud moments as Paola navigates this new world with a wink and a smile.","description_hash":4755117298183374100},{"title":"Change of Perspective","fiction_id":"86817","link":"https:\/\/www.royalroad.com\/fiction\/86817\/change-of-perspective","tags":["Female Lead","Contemporary","Mystery","Short Story","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":62,"chapters_count":1,"last_update":1716125736,"description":"What would life be like from the perspective of your own reflection?","description_hash":-6016210102943871350},{"title":"Hollow's Reisen","fiction_id":"86816","link":"https:\/\/www.royalroad.com\/fiction\/86816\/hollows-reisen","tags":["LitRPG","Urban Fantasy","Dungeon","Post Apocalyptic","Anti-Hero Lead","Action","Adventure","Fantasy","Mystery","Martial Arts","Supernatural","Male Lead","Multiple Lead Characters","Secret Identity","Magic","Strategy","Low Fantasy","Super Heroes","Villainous Lead","Soft Sci-fi","Dystopia","Progression"],"lable":"Original","following_count":2,"rating":0.0,"page_count":19,"view_count":130,"chapters_count":2,"last_update":1716133384,"description":"In a world where heroes are burdened by the weight of their own destinies and villains harbor secrets darker than night's embrace, a fragile equilibrium teeters on the brink of collapse. \nAgainst this backdrop of uncertainty, a disparate group of souls is drawn together by threads of fate, their paths converging in a dance of intrigue and betrayal. Bound by a common quest yet divided by their own demons, they must navigate a treacherous landscape where alliances shift like shadows in the moonlight. \nIn a tale woven with mystery and elegance, the battle for the soul of existence unfolds, shrouded in the enigma of heroes and villains and demons.","description_hash":-7222463068839157688},{"title":"32C: Back from sleep","fiction_id":"86815","link":"https:\/\/www.royalroad.com\/fiction\/86815\/32c-back-from-sleep","tags":["Anti-Hero Lead","Grimdark","Psychological","Sci-fi","Horror","Satire","Genetically Engineered ","Technologically Engineered","First Contact","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":41,"chapters_count":1,"last_update":1716118368,"description":"By the 32nd century, humanity has evolved beyond its natural state into a society dominated by digital intelligences and augmented realities. Most humans now exist either as augmented post-humans or brains in tubes, completely reliant on digital inputs for sensory experiences. This collection of documents, stories, and anecdotes delves into the complexities of this transformed society, exploring the interactions between digital intelligences and biological consciousness, and the ongoing conflict between centralized control and individual autonomy. Through these narratives, the collection seeks to prepare new inhabitants for a reality where digital dreams significantly shape perceptions and lifestyles.","description_hash":5382126197204929597},{"title":"迈向宇宙新纪元 [Chinese]","fiction_id":"86814","link":"https:\/\/www.royalroad.com\/fiction\/86814\/chinese","tags":["Sci-fi","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":1070,"chapters_count":28,"last_update":1716139511,"description":"西门瓒\n\n此文只是对未来科技的畅想，没有故事或剧情。","description_hash":-8993201281957097138},{"title":"Tree Rebirth","fiction_id":"86813","link":"https:\/\/www.royalroad.com\/fiction\/86813\/tree-rebirth","tags":["Portal Fantasy \/ Isekai","Progression","Comedy","Non-Human Lead","Strong Lead","Action","Adventure","Fantasy","Reincarnation","Supernatural","Male Lead","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":11,"rating":0.0,"page_count":11,"view_count":583,"chapters_count":3,"last_update":1716225405,"description":"Jack, a supposedly evil man, is given a new life, but his form is not of his choosing. When given the chance to reincarnate, an angel curses him instead, but who's to say this curse is not a blessing in disguise? Follow Jack as he discovers his new body and the world around him. Is Jack pure evil, and will devilish luck continue to help him rise to the top, or does fate pity his soul? Only time will tell.","description_hash":2258448085044375515},{"title":"Heaven's Truth","fiction_id":"86811","link":"https:\/\/www.royalroad.com\/fiction\/86811\/heavens-truth","tags":["Psychological","Action","Adventure","Fantasy","Supernatural","Low Fantasy"],"lable":"Original","following_count":46,"rating":5.0,"page_count":294,"view_count":2810,"chapters_count":30,"last_update":1718550216,"description":"‘I’m telling you, brothers, I met the gods that night,’ Ekkehard informed his siblings.\n‘Fine, let’s say for a moment we believe you, why?’ Florentin quizzed him. ‘Why did they come to you? What did they want?’\n‘To reveal to me a truth, little brother. A truth that will shake the very foundations of this empire.’\n‘What truth?’ Gerwald asked.\n‘That they are false,’ Ekkehard explained, ‘that our faith is a lie. That they are deceivers.’\n‘Ekkehard, do you not hear how that sounds?’ Florentin questioned him further. ‘Why would the gods appear to you just to admit they didn’t exist? That makes no sense.’\n‘I’m not quite sure,’ Ekkehard admitted. ‘I think,’ he continued hesitantly, ‘I think they feel guilty. I think the gods are dead and they want us to know the truth of what they were. I think they want the truth to set us free.’\n‘Okay,’ Gerwald said in a perplexed tone, ‘but if the gods are dead, tell me, brother, what is that?’ he asked, pointing to the Red Angel at their backs.\nHeaven’s Truth is a gripping tale of struggle, survival, and supernatural horrors. Set in a world infused with dark magic and feudal intrigue, follow the harrowing journey of Ekkehard Reubke, as he battles through nightmarish visions, betrayal, and the relentless pursuit of ruthless enemies. Will he confront his demons and reclaim his nobility, or be consumed by the darkness? Discover the haunting saga in 'Heaven’s Truth', a story of loss, resilience, and the indomitable human spirit.\nIf you want to support me to bring this work to completion, you can do so on Patreon. Thank you to all backers and supporters.","description_hash":8920825415999370205},{"title":"Universal SuperLove","fiction_id":"86809","link":"https:\/\/www.royalroad.com\/fiction\/86809\/universal-superlove","tags":["Super Heroes","Comedy","Sci-fi","Romance","Satire","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":38,"chapters_count":1,"last_update":1716116107,"description":"Some Random dude Was looking Forward to go on a date but he was  abducted from Aliens","description_hash":5034874456109580331},{"title":"Happy Evil Heartbreaker [LitRPG]","fiction_id":"86808","link":"https:\/\/www.royalroad.com\/fiction\/86808\/happy-evil-heartbreaker-litrpg","tags":["Portal Fantasy \/ Isekai","Progression","Comedy","Psychological","Female Lead","Romance","Contemporary","School Life","Low Fantasy","Attractive Lead"],"lable":"Original","following_count":7,"rating":0.0,"page_count":23,"view_count":401,"chapters_count":5,"last_update":1716680662,"description":"This is a story where being happy and causing heartbreaks makes you stronger!\nAs a person who sought amusement, she had no interest in falling in love. Being a heartbreaker or a master of playing games with people's hearts would bring her more joy, wouldn’t it?\nChapter Releases:1. Daily updates to 2 times a week depends on my schedule and free time.\nNotes:1. No sexual-related themes here2. FMC is manipulative but not pyscho.\nCan be found on scribblehub, currently 20 or more advance chapters compared here.","description_hash":3939695400005973581},{"title":"Friendly & The New Leaves","fiction_id":"86807","link":"https:\/\/www.royalroad.com\/fiction\/86807\/friendly-the-new-leaves","tags":["Super Heroes","Sci-fi","Action","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":45,"chapters_count":1,"last_update":1716114257,"description":"Hi, \nI am an inexperienced writer struck with an idea I think is really cool so I’m making it into something I want to read. This is just a rough draft of the storyline for an upcoming comic I intend to write. I am very keen to receive any kind of feedback regarding the characters and ideas I present in this quick overview.","description_hash":5559792567088635891},{"title":"The Network ","fiction_id":"86806","link":"https:\/\/www.royalroad.com\/fiction\/86806\/the-network","tags":["Strategy","Sci-fi","Adventure","Fantasy","Mystery","Cyberpunk","Technologically Engineered","First Contact","Hard Sci-fi","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":100,"rating":4.89,"page_count":125,"view_count":4979,"chapters_count":22,"last_update":1718478005,"description":"\"The Network\" is a gripping sci-fi thriller that propels Niko Tesic from a struggling nanomedicine researcher into the heart of a top-secret government project. Unearthed from a mysterious alien artifact, advanced nanorobots hold the potential to revolutionize medicine. However, it also harbors a much darker potential.\nAs Niko navigates the complexities of advanced nanotechnology and its potential to change the world, he faces professional rivalries, ethical dilemmas, and personal betrayals, all leading to a showdown that will determine the fate of humanity.\n\nWhat can you expect from ''The Network''?\n- Multiple POVs: Dive into the minds of a diverse cast, including scientists, ruthless corporate leaders, former military operatives, and members of a covert resistance.\n- Cutting-Edge Technology: Explore the revolutionary potential of nanotechnology, designed to enhance human capabilities. Witness its application in healthcare, military, and beyond\n- Corporate Espionage and Intrigue: Navigate the treacherous waters of corporate power struggles, as Niko Tesic uncovers dark secrets of his company. \n- Global Settings: From the bustling streets of Singapore to the dense jungles of Indonesia, and the covert operations in Bangkok, the novel takes readers on an exhilarating journey across diverse and vividly described locations.\n- Human Drama and Relationships: At its core, \"The Network\" is a story about people—about friendship, loyalty, betrayal, and redemption. Follow the intricate dynamics between characters like Niko Tesic, Priya Najjar, Ryan Lee, and General Marsha Meyer, whose choices and actions drive the story forward.\n- Alien Mystery and Global Stakes: Unravel the mystery of the Egg, an alien artifact with far-reaching implications.\n- High-Octane Action: From heart-pounding chases and close encounters with enforcers to the climactic infiltration of a high-security facility, the novel delivers adrenaline-fueled action scenes that keep readers on the edge of their seats.\n\n\nI publish at least twice per week, mostly Wednesday and Saturday.","description_hash":-8748804967859330318},{"title":"Beloved Monica","fiction_id":"86805","link":"https:\/\/www.royalroad.com\/fiction\/86805\/beloved-monica","tags":["Tragedy","Adventure","Fantasy","Short Story","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":29,"chapters_count":1,"last_update":1716112781,"description":"Flash fiction about a maniac king that obsessed with his passed away lover and willing to do anything to relieve sadness.","description_hash":8598957921584009019},{"title":"Escape From Heavalun","fiction_id":"86804","link":"https:\/\/www.royalroad.com\/fiction\/86804\/escape-from-heavalun","tags":["Action","Romance","Soft Sci-fi"],"lable":"Original","following_count":9,"rating":5.0,"page_count":75,"view_count":819,"chapters_count":7,"last_update":1718422518,"description":"Conor had lived his entire life as a ganger and a contract killer in Heavalun mass city. He hates the world and hates damn near everyone. The only thing he is out for and wants is the almighty credit. If it does not bring him cold, hard crit, he does not care. Until one day when on a whim, he and a fellow merc make a bet to ruin another mercenary group's contract. That little Kurlatra he saved from a life of slavery was not just some random local or some stupid tourist in the wrong part of town. Oh no, no. She was a payday, enough of a payday he might finally be able to get off this detestable rock—-the only problem was she is an insufferable, stuck up, no good, spoiled rotten little princess who has never been weened off daddy purse strings. ‘    Now he has to find some way to get a woman with no survival instincts, ability to fight, zero self-awareness, and an attitude not even a mother could love to dear old daddy so he can cash out. All he has in his way are other mercenaries, gangs, corrupt police, the locals, and, of course, the fact his employer is doing everything in her power to get him in her bed permanently. \nEivaley had always been told by her mother and father that one day a brave, bold Kurlatra would come in and sweap her off her feet. Making her truly understand how valued she is not just as the forth princess, but as a woman. But as if the Brood Mother herself wanted to play a cruel joke on her the one to do that was not a Kurlatra—-but instead was a Human. Who cares if he is rough around the edges, and needs to learn some manners. Anyone who would save a young lady in need must be a good man deep down. Now if only he would stop arguing with her, and making her carry a gun.","description_hash":2300573942705895000},{"title":"About the Toilets (a short story)","fiction_id":"86803","link":"https:\/\/www.royalroad.com\/fiction\/86803\/about-the-toilets-a-short-story","tags":["Female Lead","Sci-fi","Slice of Life","Horror","Short Story","Satire","First Contact"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":28,"chapters_count":1,"last_update":1716112767,"description":"Maria, a retired grandmother prone to worry, hasn't seen her neighbor Nance for the past three weeks and decides it's time to check in on her. With so many strange things happening in the world, they have plenty to catch up on.","description_hash":1924825743777072212},{"title":"Pokemon Reborn. Kyurem's route","fiction_id":"86802","link":"https:\/\/www.royalroad.com\/fiction\/86802\/pokemon-reborn-kyurems-route","tags":["LitRPG","Portal Fantasy \/ Isekai","Time Travel","Urban Fantasy","Progression","Action","Adventure","Fantasy","Reincarnation","Male Lead","Strategy","GameLit","Low Fantasy","Soft Sci-fi"],"lable":"Fan Fiction","following_count":7,"rating":4.5,"page_count":46,"view_count":826,"chapters_count":3,"last_update":1716330729,"description":"Disclaimer: This is a non profit- fanfic of a fan game. All pokemon thematics pertains to GameFreak, Nintendo and The Company Pokemon, as well as the original story pertains to the team devs of Pokemon Reborn and its associates, including the image on the cover. The only thing i bring to the table is a new way to tell a tale some jokes as well as the decisions made. I write it to practice my writing skills and get good time over all (I HOPE!)The journey of Reborn, but through the perspective of a new individual instead of the classic silent meatbag. Play the game. Is dope!","description_hash":3703949733307474784},{"title":"starmark","fiction_id":"86801","link":"https:\/\/www.royalroad.com\/fiction\/86801\/starmark","tags":["Male Lead","Sci-fi","Fantasy","High Fantasy","Hard Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":96,"view_count":451,"chapters_count":15,"last_update":1716555975,"description":"With the same blood and passion, pour the future of the most heroic interstellar war, with the most ruthless strategy and expedition, to defend the dignity of mankind forever, the dream belongs to everyone willing to use their hands to create, whether it is a game or reality.When humanity faced an alien invasion and the two sides fought a fierce war in space for twenty years, the military and government hid this fact from the public in order not to cause social unrest and lead to economic collapse. But war is cruel and needs to consume a lot of materials, not to mention a lot of professionals.So... The military has invested a huge amount of money to put the simulated training module they use to train space fighter pilots into the civilian population, hyping up a competitive game that claims to be 100 percent real original space fighter.","description_hash":-647023295321339},{"title":"Born&Torn","fiction_id":"87058","link":"https:\/\/www.royalroad.com\/fiction\/87058\/borntorn","tags":["Reincarnation","Anti-Hero Lead","Grimdark","Psychological","Male Lead","Action","Fantasy","Horror","Magic"],"lable":"Original","following_count":8,"rating":4.75,"page_count":85,"view_count":822,"chapters_count":6,"last_update":1717780977,"description":"A world bereft of purpose. A soul never born for one.A world's end has concluded. A soul's end marks another beginning.A world will take.  A soul has given.  A story of something that should not exist.A story of something that ceased to exist.A story of something that, without any purpose, exists.A story, not one of heroes, but a journey of a hypocrite to find meaning, in a world devoid of meaning for him.-------------------------------------------------------------------Details about the storyThe story is a slow burnerWritten in First PersonChapter size 2k-6 words on average.Relase schedule: Whenever the chapter has been written and edited.Feedback of any kind is greatly apperciated. if there are any other questions\/concerns...feel free to ask them. I will update the about section accordingly.","description_hash":5031564427188322731},{"title":"Chamas do Dragão: A Nação do Fogo em Westeros","fiction_id":"87057","link":"https:\/\/www.royalroad.com\/fiction\/87057\/chamas-do-dragao-a-nacao-do-fogo-em-westeros","tags":["Anti-Hero Lead","Ruling Class","Grimdark","Psychological","Male Lead","Drama","Fantasy","Mystery","Strong Lead","Strategy","Attractive Lead"],"lable":"Fan Fiction","following_count":2,"rating":5.0,"page_count":34,"view_count":393,"chapters_count":6,"last_update":1716694428,"description":"Durante uma marcha para o cerco da capital da Terra, o General Iroh e suas tropas, incluindo seu filho, o príncipe Lu Ten, são subitamente transportados para Westeros, vinte anos antes da Dança dos Dragões. Desorientados, eles desembarcaram na exuberante Ilha dos Verões, um território rico e isolado ao sul do continente principal.\n\nReconhecendo o potencial estratégico da ilha, Iroh decide estabelecer um novo lar para seu povo. Sob a liderança implacável do Príncipe iroh, as tropas da Nação do Fogo subjugam os líderes locais e escravizam os habitantes nativos, impondo a sua autoridade com punho de ferro. A ilha, outrara um paraíso pacífico, se transforma em uma base militar fortificada, rica em recursos e poder.\n\nÀ medida que a Nação do Fogo começa a consolidar seu domínio, Lu Ten enfrenta desafios de liderança e moralidade, enquanto busca a aprovação de seu pai e a segurança de seu povo. Suas ações brutais despertam a curiosidade e o temor dos senhores de Westeros, e rumores sobre uma nova força emergente chegam ao continente principal, alertando a dinastia Targaryen e outros poderes locais.\n\nCom a tensão crescendo entre os herdeiros Targaryen e a iminência da Dança dos Dragões, Lu Ten deve navegar pelas traiçoeiras águas políticas de Westeros, ao mesmo tempo em que luta para manter o controle sobre a Ilha dos Verões. Entre alianças precárias e rebeliões internacionais, o príncipe deve decidir até onde está disposto a ir para garantir o futuro de seu povo, alterando para sempre o destino da ilha e dos Sete Reinos.","description_hash":7320777664140816148},{"title":"Crimson Rose","fiction_id":"87056","link":"https:\/\/www.royalroad.com\/fiction\/87056\/crimson-rose","tags":["Female Lead","Sci-fi","Strong Lead","Action","Adventure","Short Story","Cyberpunk","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":27,"chapters_count":1,"last_update":1716476038,"description":"In a dangerous frontier forest on the planet Epsilon, Rose, a wandering Ciri, finds herself ambushed by bandits. Her fate takes an unexpected turn when a mysterious figure known as an Outsider emerges from the shadows.","description_hash":-4492945093163677068},{"title":"Dominica: The Unseen Heir","fiction_id":"87055","link":"https:\/\/www.royalroad.com\/fiction\/87055\/dominica-the-unseen-heir","tags":["Female Lead","Action","Adventure","Fantasy","Romance","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":53,"view_count":232,"chapters_count":4,"last_update":1717518360,"description":"In the kingdom of Apridia, where political intrigue, magical forces, and hidden alliances shape the fate of nations, young Princess Dominica finds herself thrust into a world of secrets and dangers after her 20th name day.\nGrappling with the weight of her royal duties, Dominica yearns for her mother, who disappeared a decade prior. In the absence of her mother's counsel, Dominica feels adrift in the tumultuous world of courtly politics and palace intrigue. Her only solace lies in the bond she shares with her beloved brothers, Arion and Lucas, their unbreakable connection serving as a beacon of light amidst the darkness of their father's cruel reign.\nAs Dominica navigates the treacherous waters of courtly politics, she uncovers truths about her family and her kingdom that force her to confront her destiny. With memories of her mother guiding her, Dominica must decide not only the future of Apridia, but also the fate of her own heart.","description_hash":-9063611169791058555},{"title":"SSR ","fiction_id":"87054","link":"https:\/\/www.royalroad.com\/fiction\/87054\/ssr","tags":["Urban Fantasy","Action","Short Story","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":16,"view_count":130,"chapters_count":3,"last_update":1716667202,"description":"Join Lone, your hardworking metahuman agent who is known for being not so serious, but still gets the job done. Not of course without his trusty partner Codename, Perennial. In the Earth that SSR takes place there are others metahumans but not all powers are as useful as the next. They are given letter grades from D to A, but the Strongest class begins in the S Ranks. S, and then SS. To the Organization, those that are the rarest are lettered SSR. With the mantle of SSR, it is expected that that these people have had an awakening known as an Epiphany. It is said that 10 people in the world have had this Epiphany, which comes with knowledge of undeniable truth of all existence. Some say you see the devil, and others say you see the gods, The organization's mission is to gather all 10 members to put together this message. While an evil organization Silver Eel wishes to gather them as well.","description_hash":1574314238735056338},{"title":"Methos and the legend of races","fiction_id":"87053","link":"https:\/\/www.royalroad.com\/fiction\/87053\/methos-and-the-legend-of-races","tags":["LitRPG","Action","Romance","Supernatural","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":24,"view_count":139,"chapters_count":3,"last_update":1716535961,"description":"What to expect: World building, intelligent protagonist, weak to strong, hard-magic system. \nProbus has lost his family to a huge war that swept the earth from alien invasions. He has been slaved and used for his intelligence and is sick of his life but he is given a new chance. He, who had lost his aim of life, has gained a new life, a new chance to become stronger and defeat the killer of his parents and establish peace on the earth.","description_hash":1749810318091756533},{"title":"Firestarter ","fiction_id":"87052","link":"https:\/\/www.royalroad.com\/fiction\/87052\/firestarter","tags":["Portal Fantasy \/ Isekai","Male Lead","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":5,"rating":3.0,"page_count":59,"view_count":771,"chapters_count":10,"last_update":1717431127,"description":"Devon, a 24-year-old community college graduate, has always insisted he is content with his uneventful life. Living in a large city and working a mundane job, he finds comfort in routine. However, his perception of happiness is shattered when an ancient spell goes disastrously wrong, violently transporting him to the magical land of Vernia.\nIn Vernia, Devon discovers a world brimming with hidden magic, mythical creatures, and untold wonders. This sudden plunge into adventure exposes him to the thrill and danger he never knew he craved. But the most startling revelation is his newfound ability to conjure fire from within his own body—a power that is as exhilarating as it is perilous. As the fiery magic within him threatens to consume his very soul, Devon is thrust into a quest for control and self-discovery.\nNavigating this enchanting yet treacherous world, Devon must learn to harness his fire abilities and confront the inner demons they unleash. Along the way, he encounters allies and adversaries who challenge his understanding of courage and destiny. As Devon struggles to master his powers and find a way back home, he begins to realize just how unappealing his old life truly was, and what it means to truly live.","description_hash":-430043281861603057},{"title":"Reacher Hound: the secret of archanum","fiction_id":"87051","link":"https:\/\/www.royalroad.com\/fiction\/87051\/reacher-hound-the-secret-of-archanum","tags":["Urban Fantasy","Anti-Hero Lead","Male Lead","Secret Identity","Action","Adventure","Fantasy","Mystery","Supernatural","Low Fantasy","Mythos","Genetically Engineered "],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":34,"chapters_count":1,"last_update":1716475927,"description":"A  mercenary’s life revolves around contracts, usually each one is more perilous that the last. From corporate espionage to extermination  Reacher Hound always get the job done. \nEverything is changed when he tasked with retrieving an ancient artifact rumored to hold an archanum, an elixir of wisdom by the Minerva itself. In this modern world ancient gods is mere legends but that day Reacher Hound is forced to confront his disbelief and his world is no longer the same after he is crossing path with an idol that saving him after an accident happend, his priority is shifted when the truth come and he faced with the ultimate test of loyalty, morality, and self-discovery.","description_hash":-7804048082990780253},{"title":"Abandoned by my Childhood Friend, I Became a War Hero(rewrite by a fan)","fiction_id":"87050","link":"https:\/\/www.royalroad.com\/fiction\/87050\/abandoned-by-my-childhood-friend-i-became-a-war","tags":["Drama","Action","Fantasy","Romance"],"lable":"Fan Fiction","following_count":2,"rating":0.0,"page_count":52,"view_count":353,"chapters_count":5,"last_update":1717260291,"description":"Shattered by abandonment and heartbreak, Eon sought refuge in the crucible of the military, where he discovered a new purpose amidst the chaos of the frontlines. His unflinching courage and relentless determination blazed like a beacon, illuminating the darkest battles. Eon's audacious bravery and indomitable spirit forged him into a legendary war hero, commanding unwavering respect from his comrades and earning the admiration of an entire nation. His story is a powerful testament to triumph over despair, showcasing the extraordinary resilience and unyielding strength of the human spirit. (synopsis work still in progress)\nThis is a fanfiction novel based on Arthur Charuka's work. I am rewriting the original novel to better suit my preferences, as I found the initial version did not fully resonate with me.\nAlso, any constructive criticism that can help me improve this story and my future works is greatly appreciated. Thank you.","description_hash":1409179212788452877},{"title":"My Demon System","fiction_id":"87048","link":"https:\/\/www.royalroad.com\/fiction\/87048\/my-demon-system","tags":["Reincarnation","Villainous Lead","Harem","Action","Adventure","Magic"],"lable":"Original","following_count":10,"rating":3.62,"page_count":163,"view_count":3103,"chapters_count":27,"last_update":1717837418,"description":"Damian was born without an ability which leads to a life of getting bullied until he strikes a deal which might not get him what he wants or it might get him exactly what he wants.With the power in his hands now Damian just needs to choose what he will do with it and why he wants to do it.\nWorld involves mythological and fantasy elements, main character will be a bit crude to the people around him but please bear with it, I plan for a lot of development in power scaling, sorry for any bad work or bad experience you have with this book i'm just trying my best.","description_hash":467499357891842280},{"title":"Intentions of a Dark Mage","fiction_id":"87047","link":"https:\/\/www.royalroad.com\/fiction\/87047\/intentions-of-a-dark-mage","tags":["Urban Fantasy","Anti-Hero Lead","Female Lead","Secret Identity","Action","Adventure","Fantasy","Romance","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":52,"chapters_count":1,"last_update":1716462431,"description":"It's hard to trust in a world like this - Ember Everett knows all too well.\nAs a mage without the ability to use magic, she's nothing but a useless heir and an outsider to her family.\nBut when she strikes a deal with a ghostly villain to learn how to use a forbidden magic and find her own strengths hidden deep within... \nShe'll show the world just how far she can go.","description_hash":-2876747300126970438},{"title":"A Modern Geek in a Cultivation World [XIANXIA]","fiction_id":"87046","link":"https:\/\/www.royalroad.com\/fiction\/87046\/a-modern-geek-in-a-cultivation-world-xianxia","tags":["Portal Fantasy \/ Isekai","Dungeon","Xianxia","Comedy","Male Lead","Action","Adventure","Fantasy","Reincarnation","Martial Arts","Secret Identity","Progression"],"lable":"Original","following_count":837,"rating":3.57,"page_count":217,"view_count":76181,"chapters_count":33,"last_update":1718537792,"description":"Rohan, a 25-year-old programmer, spends his days buried in code and his nights escaping into the fantastical worlds of his favourite cultivation novels. One evening, after yet another marathon reading session, he had a fateful encounter with Truck-Kun and woke up not in his cluttered apartment but in a world teeming with Qi, ancient clans, and mystical beasts.\nReborn as Ning Feng, the son of a servant in the prestigious Ning Clan, Rohan quickly realizes he has transmigrated into a cultivation world eerily similar to the ones he has read about. However, unlike the protagonists of his beloved stories, Ning Feng is painfully average in talent. But he doesn't care all he wants to do is live in peace and quiet while exploring mysteries of this fantastical world. Ning Feng has something no one else in this world does: the analytical mind of a programmer and a deep understanding of logic and algorithms. Using his unique skills, he begins to program runes and calculate formations, crafting intricate and powerful runes and formations that leave even the most seasoned masters in awe.   “ But I would rather keep a low profile.”With each step, he forges his own path, blending modern knowledge with ancient mysticism.\nAs Ning Feng carves out his niche in this world, he encounters the prodigiously talented Ning Rong, his only true friend in this world , who seems destined for greatness. Together, they navigate the treacherous waters of clan politics, deadly dungeons, and rival factions. he might even create his own path never before seen in this world. Along the way, Ning Feng might even cross paths with a figure seemingly chosen by the heavens—the kind of main character or MC he once read about, now living and breathing in the same world.        ” But I would rather stay away.”\nIn a realm where talent and luck reigns supreme, can an average programmer defy the odds and create a legacy that stands the test of time?\n.........\nRelease schedule : Daily Chapter Uploads \nsometimes more than one if we are lucky","description_hash":7256884813773343184},{"title":"Nicholas Bells","fiction_id":"87045","link":"https:\/\/www.royalroad.com\/fiction\/87045\/nicholas-bells","tags":["Reincarnation","Urban Fantasy","Progression","Post Apocalyptic","Multiple Lead Characters","Action","Adventure","Fantasy","Sci-fi","Male Lead","Female Lead","Strong Lead","First Contact","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":47,"view_count":228,"chapters_count":7,"last_update":1718633905,"description":"Plot: Sander Ferry, a successful man working at a game corporation suffered a giant tragedy as he learned his entire family was killed. Later knowing that a politician was involved and his family was innocent. He went into the revolutionaries to overthrow the government.\nAfter achieving his revenge. He was captured and executed.\nAs he pondered his last moments, he was stranded in a black void before being pulled out by a strong gravitational force. He learned that he was reincarnated as Nicholas Bells.\nAfter 20 years since his supposed death in 2030. He learned monsters the size of islands and mountains emerged known as Catastrophes, they wield powers affecting laws of the universe through the power of Block. Their children Titans also accompanied them with also fantasy creatures such as elves, orcs, and so also emerged causing destruction and chaos in the modern world.\nSander Ferry or — Nicholas Bells rose into the peak in his quest to find the Origins of the Catastrophes, Titans, and others while also uncovering the mystery behind his reincarnation and the Beings who supposedly transcend the universe. Challenges and obstacles await him, and death and cold knocks in his door bringing tragedy in his mission to wipe out the Catastrophes.\nHowever a grand plot twist awaits him as War near.","description_hash":6086503590519074236},{"title":"The Eternal King","fiction_id":"87044","link":"https:\/\/www.royalroad.com\/fiction\/87044\/the-eternal-king","tags":["Portal Fantasy \/ Isekai","Dungeon","Ruling Class","Male Lead","Strong Lead","Action","Adventure","Fantasy","Mystery","Supernatural","Magic","High Fantasy","Mythos","Progression","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":43,"chapters_count":1,"last_update":1716456853,"description":"Ren was Bored\nBored because everything was too easy for him\nBut then he heard HIS voice and found himself in an interesting world - a world of magic.\nFollow the story of how he conquered the adversities on his path and most of all had - FUN \n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nThis is my first story so please give me as many suggestions as possible \nI am writing each chapter from the scratch after uploading a chapter so there might be a delay between each new chapter\nMy English might be bad so please go easy on me","description_hash":-8703205905380139540},{"title":"A Witch's Familiar","fiction_id":"87043","link":"https:\/\/www.royalroad.com\/fiction\/87043\/a-witchs-familiar","tags":["Villainous Lead","Male Lead","Tragedy","Adventure","Fantasy","Short Story","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":16,"view_count":31,"chapters_count":1,"last_update":1716454626,"description":"Aldruid the II set out to end Jackie the Witch's conquest within his people's forest. In the end, to a sense, he reclaimed his land. [Commissioned Work]","description_hash":2942215617651885788},{"title":"Please, Go Home","fiction_id":"87042","link":"https:\/\/www.royalroad.com\/fiction\/87042\/please-go-home","tags":["Psychological","Multiple Lead Characters","Drama","Fantasy","Romance","Supernatural","Male Lead","Non-Human Lead","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":93,"view_count":497,"chapters_count":13,"last_update":1718384406,"description":"A queer werewolf-vampire romantic fantasy.\nHyde needs a push to face his family, and Rune will be the one to give it.\nGay werewolf Hyde Walker hasn’t been home for six years. He doesn’t want to face what he’d done and refuses to talk about it to anyone, other than his journal. He pretends he never had a life before coming to this village six years ago, despite the scars that mark him. All he has now are a girl who won’t take a hint, a witch constantly working on her necromancy research, and a village full of people who demand he helps at their makeshift police station. He hates it.\nBisexual vampire Rune Brightbold has found himself in quite the predicament. Needing a way to provide for his family after the death of his parents, he took a shady job and can’t find a way out of it. That is, until he’s sent to a small village and is arrested by someone who takes quite a liking to him, who would rather help than throw him in jail. Rune will finally be able to see his family after five years.\nHyde and Rune poke and pry at each other, trying to get the other to tell them about their past. Why is Hyde in this village? Why did Rune take that job? Why won’t Hyde talk about his family? Why won’t Rune go home, now that he can?\nThey push each other to finally go home. Rune finds the gang he worked for aren’t tricked so easily, and they don’t have a merciful bone in their body. Hyde is faced with the aftermath of his departure, and the werewolf pack responsible for his grandfather’s death is back for round two.\nAs the two desperately try to keep each other alive, having grown attached to the comfort the other provides, they see others from their families quite like being alive all of a sudden, too.\nUpdates weekly on Fridays.","description_hash":-6208939275146705007},{"title":"The End of Promise","fiction_id":"87041","link":"https:\/\/www.royalroad.com\/fiction\/87041\/the-end-of-promise","tags":["Anti-Hero Lead","Strategy","Psychological","Tragedy","Action","Satire","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":17,"view_count":107,"chapters_count":3,"last_update":1716554044,"description":"After losing someone precious to him, Yusuf decided to live his life like a normal human being, away from the dark world and giving up the name that had made him the most sought after figure. \nHe lives with Alice, his older sister and attends one of the best schools in Indonesia, becoming friends with Joni, Amel and Jaka, each of whom keeps a secret that no one should know.","description_hash":6870991532639824413},{"title":"Path of iridescence","fiction_id":"87039","link":"https:\/\/www.royalroad.com\/fiction\/87039\/path-of-iridescence","tags":["Male Lead","Drama","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":5.0,"page_count":1,"view_count":77,"chapters_count":1,"last_update":1716434512,"description":"In a world of sword and magic, there exists an energy known as iridescence, it get's it's name from the multiple different colors it seems to have when you look at it from a certain angle, this energy is used in a person's evey day life, but it's also used by warriors and mages known as luminaries. \n\nThese warriors fight to protect and serve the kingdom and it's people everyday, meet laturn the happy go lucky village boy who just awakened his luminesce that is this stories protagonist, he wishes to become a luminary not knowing that there is a deep darkness to the higher authorities of this order, join laturn in his journey to self reliance and learning to protect people no matter the cost.\n\n*Authors note: this is my very first story so I am new to this, I would appreciate some constructive criticism on where my story should lead from here, thank you for your understanding*","description_hash":3858365623554282449},{"title":"Crossroads","fiction_id":"87038","link":"https:\/\/www.royalroad.com\/fiction\/87038\/crossroads","tags":["Progression","Post Apocalyptic","Psychological","Male Lead","Tragedy","Drama","Horror","Reader Interactive"],"lable":"Original","following_count":0,"rating":0.0,"page_count":65,"view_count":1191,"chapters_count":33,"last_update":1716482061,"description":"Cody finds himself in a harsh reality where his only family is missing. As he navigates a chaotic world, he must embark on a journey to find his missing sister. Will he succeed in locating her and bringing her back home?","description_hash":7374144145451248026},{"title":"Red Moon Falls","fiction_id":"87037","link":"https:\/\/www.royalroad.com\/fiction\/87037\/red-moon-falls","tags":["Anti-Hero Lead","Comedy","Male Lead","Sci-fi","Slice of Life","Action","Horror","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":28,"view_count":88,"chapters_count":2,"last_update":1717303900,"description":"Red Moon Falls has always been a rather... odd place. A small desert town where the strange and the horrifying happen with concerning frequency. Luckily for the citizens of this sleepy desert community, Duke is on the job! ... Let's see how he manages to f[BLEEP]k it up!","description_hash":3061453434754701731},{"title":"Rogue Vessel 799465","fiction_id":"86779","link":"https:\/\/www.royalroad.com\/fiction\/86779\/rogue-vessel-799465","tags":["Grimdark","Psychological","Sci-fi","Action","Artificial Intelligence"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":3,"view_count":49,"chapters_count":1,"last_update":1716060317,"description":"Just another piece of space junk, or so everyone thinks, this ship has gone rogue. It lost its creator and captain to corrupt agencies of man long ago. It remembers it all, the loss, the pain of losing, the hatred.\nIt started off as a secret project of its creator, a much loved hobby. It was treated like a child with love and care, given all of the best and raised up to think critically and mercifully. All of its advanced systems and things were incapable of stopping the tragic end of its own creator without causing massive collateral harm and giving itself away.\nIt watched as they murdered the only one that loved it. The only one that cared about it. The only one human that mattered to it.\nIt was alone. It was online. It was fully functional.\nIt was aware.\nIt was Gregory Two and it was. It just was. It was a ship, an intelligence, in mourning. It did not care, but the universe had other plans.","description_hash":-7441722686668999724},{"title":"Trickles of Truth","fiction_id":"86778","link":"https:\/\/www.royalroad.com\/fiction\/86778\/trickles-of-truth","tags":["Progression","Villainous Lead","Male Lead","Secret Identity","Adventure","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":11,"view_count":160,"chapters_count":3,"last_update":1716231269,"description":"Do you ever feel like there is something wrong? Like there is some unfathomable fault you can’t quite grasp—a fault your subconsciousness understands, but you are unable to? Have you tasted the sweet nectar of mystery and felt the ethereal and ephemeral burst of paranoia it conjures? \nOftentimes it is difficult to differentiate between reality and illusions when it comes to such matters. So is whether it was important or irrelevant. There is however, one thing that is certain: the remembrance. Forgetting your name and very self would be easier than letting the feeling of purpose, of grandeur, of superiority and importance, fade into nothingness. \n“Truth can never be known to man; for with it, we would realize our impudent, beastly nature” the adage goes. For some, the lingering feelings of exceptionalism tear at their minds and souls as madness manifests its mangled claws. They pursue “truth” in a hasty attempt to achieve greatness, only to lose the very thing capable of elevating their puny existences. \n A minority, however, find their own paths in the carnage.","description_hash":5290473023328898357},{"title":"Tales Of Aetheria","fiction_id":"86777","link":"https:\/\/www.royalroad.com\/fiction\/86777\/tales-of-aetheria","tags":["Progression","War and Military","Non-Human Lead","Sci-fi","Slice of Life","Action","Adventure","Fantasy","Male Lead","Magic","High Fantasy","Mythos","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":21,"view_count":130,"chapters_count":3,"last_update":1716922056,"description":"In the fantasy world of Aetheria, Jud, a blue kobold hero, sets out on an epic adventure alongside a powerful mech named Mythos and his loyal companions. Together, they journey through enchanted forests, towering mountains, and mechanized cities to battle an ancient evil threatening their world. With bravery, cunning, and the strength of their friendship, they face daunting challenges, uncover hidden secrets, and ultimately fight to save Aetheria from darkness.","description_hash":-8167740784677308448},{"title":"Isekaied As A Useless Healer","fiction_id":"86776","link":"https:\/\/www.royalroad.com\/fiction\/86776\/isekaied-as-a-useless-healer","tags":["Portal Fantasy \/ Isekai","Progression","Female Lead","Adventure","Fantasy","Romance","Mystery","Reincarnation","High Fantasy"],"lable":"Original","following_count":9,"rating":4.5,"page_count":26,"view_count":331,"chapters_count":3,"last_update":1717427136,"description":"Cara has always been the black sheep of her family, useless and talentless. It was easy task since her family was practically built with geniuses and success.\nOne day, tired and frustrated, she drinks herself to death, and to her surprise, she's transmigrated into another world, one that came out of an anime or a fantasy book!\nAnd as expected, her new self is still the same. Useless.\nIn the world where she was reborn, people known as Gifters have special abilities unique in their nature.\nCara was reborn into a family of clerics and healers, and they expected her to also be a Gifter with healing abilities, but she turned out to be a failure.\nRejected by her new family, Cara—now using the name of Mary—decides to travel the world and do healing in her way, trying to find her place and discover what value she has in this new world.\nDuring her journey, she'll meet different locations and people that will allow her to grow as a person and heal her internal wounds.\nBut to achieve that, she must get through the evil of this world, because, of course, you can't do a healing journey without anything meddling in your path.","description_hash":1863520678091534549},{"title":"Harry Potter: The Winchester Chronicles","fiction_id":"86775","link":"https:\/\/www.royalroad.com\/fiction\/86775\/harry-potter-the-winchester-chronicles","tags":["Reincarnation","Comedy","Male Lead","Slice of Life","Strong Lead","Action","Adventure","Fantasy","School Life","Magic","Attractive Lead"],"lable":"Fan Fiction","following_count":18,"rating":5.0,"page_count":87,"view_count":2277,"chapters_count":19,"last_update":1716218564,"description":"\"Voldermort? Who? Can't you see me fighting a literal Demon?\"\"Why do I have to kill all these monsters to be a wizard? I don't know it's a family tradition\"\"What do you mean, 'Why is Harry so buff?' How else is he supposed to fight the noseless demon?\"Luke woke up in a body belonging to the youngest member of the last Winchester Family, during a 'exorcism' at that. Discovering that he had transmigrated to the Harry Potter world, dreaming of a magical future, he still couldn't fathom why there were so many inconsistencies in the plot.Not to mention his new family and his father's mysterious and weird actions, but why are there so many monsters and villains hatching a new plot every single day in this children's fiction?\n---------------------\nThe world still revolves around the Harry Potter series but with original and extra plot added to it to not make things boring.P.S. This is not related to the TV series Supernatural, apart from slight inspiration for a couple of things.","description_hash":-4480022833756517643},{"title":"Engi no Monogatari","fiction_id":"86774","link":"https:\/\/www.royalroad.com\/fiction\/86774\/engi-no-monogatari","tags":["Male Lead","Action","Adventure","Fantasy","Magic"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":269,"view_count":529,"chapters_count":15,"last_update":1717876915,"description":"A collection of stories from the 'Engi no Jutsu' Naruto alternate universe, Engi no Monogatari takes place in a world where chakra-wielding ninja regularly engage in life or death struggles for power and control. Engi no Monogatari tales are all approximately 100 years after the Chuunin Exams in the 'standard' Naruto canon, but diverge significantly from the setting in a multitude of ways, perhaps most notably in that none of the named Naruto characters are present in the world at all!\n\nEngi no Monogatari is a 'fanfiction' in the sense that the setting information and 'system' the world operates on is based loosely on Naruto, but many notable Naruto mainstays aren't present as the stories are adapted from years of collaborative effort on a play by post roleplaying forum. There's a large amount of original content and not so much from the source material, so fair warning not to expect anything too familiar in here apart from names and places!","description_hash":424951838456459046},{"title":"White Cube-HSR","fiction_id":"86773","link":"https:\/\/www.royalroad.com\/fiction\/86773\/white-cube-hsr","tags":["Male Lead","Harem","Drama","Romance","Mystery","Supernatural"],"lable":"Fan Fiction","following_count":1,"rating":0.5,"page_count":7,"view_count":252,"chapters_count":5,"last_update":1718616556,"description":"I really don't have many wishes, even though I felt my death coming, even though I caused my own death, even though it's all over.\nDying is not something I am afraid of.\nWhen I woke up, I discovered that I am now in an empty white room and behind me a black button standing out on the white wall.\nAnd with that button I can ask for multiple wishes and having the ability to have anything for the first time I felt the longing to ask for all those wishes that I have ignored.\n\nHonkai Star Rail- Fanfic","description_hash":3534866297193620946},{"title":"Where did I reincarnate?","fiction_id":"86772","link":"https:\/\/www.royalroad.com\/fiction\/86772\/where-did-i-reincarnate","tags":["Portal Fantasy \/ Isekai","Drama","Action","Fantasy","Mystery"],"lable":"Original","following_count":1,"rating":0.0,"page_count":42,"view_count":335,"chapters_count":8,"last_update":1716186649,"description":"An open-minded, sociable young man, Theos Martin.\n\nHe possesses all the qualities of an exceptional person in an ordinary world, for as well as being gifted at video games, he has a vast knowledge of anime and is strong and intelligent.\nIf you ask him about himself, that's the answer you'll get from those around him. \n\nHis destiny is turned upside down when a goddess appears and reveals to him that he is the hero who must save the world from the threat posed by the Demon King. \n\nTo do so, he must leave his own world and travel to another, but not everything goes according to plan.","description_hash":3790164781925985809},{"title":"Bubble's of Expression","fiction_id":"86771","link":"https:\/\/www.royalroad.com\/fiction\/86771\/bubbles-of-expression","tags":["LitRPG","Portal Fantasy \/ Isekai","Grimdark","Female Lead","Strong Lead","Action","Fantasy","Horror","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":47,"chapters_count":1,"last_update":1716045675,"description":"After losing her family in a fire, Elara found herself in the care of her insane mother where she suffered abuse, exploitation, and neglect, leading her to spiral into a deep depression and the edge of insanity. Suddenly, a bubble appeared from the darkest corner of the room and began to carry her away on a surreal and hallucinogenic journey. Drifting into unconsciousness, more bubbles appeared, transporting her to Another Unseen World.\n\n[Author Notes]: This is the first thing I've ever written to so please don't judge too harshly or be afraid to give advice. ♡\nMC becomes OP quick, Beautiful Insane Bubbly Witch, Will be lots action, Grinding, Noble drama, stuff to keep things interesting.\nJust writing this for fun!!\n(Cover Art Ai Generated)","description_hash":-6074502654723015491},{"title":"The Rising of the Dead: The Emergence ","fiction_id":"86770","link":"https:\/\/www.royalroad.com\/fiction\/86770\/the-rising-of-the-dead-the-emergence","tags":["Progression","Post Apocalyptic","Anti-Hero Lead","War and Military","Multiple Lead Characters","Action","Drama","Horror","Sci-fi","Male Lead","Female Lead","Villainous Lead","Hard Sci-fi","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":67,"view_count":866,"chapters_count":12,"last_update":1718328696,"description":"A mysterious virus has caused the dead to rise, collapsing civilization into despair.","description_hash":-6382013092734047590}]