[{"title":"Finding Love Under the Rain","fiction_id":"88654","link":"https:\/\/www.royalroad.com\/fiction\/88654\/finding-love-under-the-rain","tags":["Male Lead","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":24,"chapters_count":1,"last_update":1718597710,"description":"\"Finding Love Under the Rain\" is a sweet romance centered on a university student's unexpected encounter with a captivating young woman.","description_hash":633954754838086721},{"title":"Pokemon: the unwanted journey","fiction_id":"88653","link":"https:\/\/www.royalroad.com\/fiction\/88653\/pokemon-the-unwanted-journey","tags":["Multiple Lead Characters","Action","Adventure","Reader Interactive","Male Lead","Non-Human Lead"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":12,"view_count":38,"chapters_count":2,"last_update":1718635501,"description":"Valen Ardent is a young adult from Canalave city who has just turned 18. And thus he is finally leaving home to do something, well more like being forced to. After doing exceptionally bad in school he is going down a bad path. His only chance to be successful? A job with pokemon, because while being the most dangerous type of profession, it also has the most rewards.\n\n-a much darker take on the pokemon world while being more realistic \n\n(This will be set In sinnoh in a fan world with a few things from the game and anime)\n(All the characters but my OC's are property of the pokemon company)\n<span;>(I am using some fakemon from DelaMancha2, he's on deviant art you should check him out)","description_hash":-3868508265479839281},{"title":"Spire of Madness: The Anthology","fiction_id":"88652","link":"https:\/\/www.royalroad.com\/fiction\/88652\/spire-of-madness-the-anthology","tags":["Portal Fantasy \/ Isekai","Time Travel","Anti-Hero Lead","Space Opera","Strategy","Action","Horror","Sci-fi","Short Story","Supernatural","Male Lead","Female Lead","Strong Lead","Multiple Lead Characters","Non-Human Lead","Magic","Grimdark","Low Fantasy","High Fantasy","Mythos","Villainous Lead","Genetically Engineered ","First Contact","Hard Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":33,"chapters_count":1,"last_update":1718597697,"description":"This is anthology series based on my series \"Spire of Madness\" which is a high fantasy world in which eldritch creatures torment the minds of the weak and manipulate them into summoning such creatures. These short stories can range from sci-fi to grimdark high fantasy and more.","description_hash":-3757084138339539507},{"title":"Belladonna","fiction_id":"88651","link":"https:\/\/www.royalroad.com\/fiction\/88651\/belladonna","tags":["Strong Lead","Horror","Mystery","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":20,"chapters_count":1,"last_update":1718597663,"description":"A strained livelihood. Tough life. Serendipitous actions. Horryfying consequences. Unrequited love. Yin Yang and the Karmaic Cycle. False conditions met with absolute certainty. \nA person, a traveler, coming back to where it all began. A lifeless moan. A characterless grin.","description_hash":-3626470535782326273},{"title":"Optimistic Nihilism ","fiction_id":"88650","link":"https:\/\/www.royalroad.com\/fiction\/88650\/optimistic-nihilism","tags":["Slice of Life","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":25,"chapters_count":1,"last_update":1718597658,"description":"A little spur of the moment philosophical musing written in poetry.","description_hash":8756459785663299769},{"title":"Crown Eater","fiction_id":"88649","link":"https:\/\/www.royalroad.com\/fiction\/88649\/crown-eater","tags":["Reincarnation","Progression","Ruling Class","Martial Arts","Male Lead","Action","Adventure","Fantasy","Mystery","Secret Identity","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":6,"view_count":29,"chapters_count":1,"last_update":1718597639,"description":"On a planet ruled by ancient cults and martial families, Kallen's life turns for the worse the day he is cursed with the mark. He, along with other children, is kidnapped and raised to serve under the infamous House Bathory as spies and assassins. Their mission? Infiltrate their eternal rivals and orchestrate the heist of the century: Stealing the Crown fragment that turned heroes into kings and nations into an empire.\nIn this ruthless world, ambition and cunning are survival tools, whether you're in the wild, on the battlefield, or navigating royal courts. Secrets act as currency, and a seemingly simple power play can conceal a century-old plot that transcends space and time.\nTorn between his quest to protect his loved ones and his morality, Kal's humanity will be put to the test as he navigates through political struggles greater than himself. Immersed in a suicide mission that could disrupt the foundation of a society on the brink of implosion, he quickly realizes that failure goes beyond death.\n\n\n\nHey I'm L:1. This is my first try at online writing and there is a short list of what to expect from this story.\n\nWhat to expect:\n- Character building\n- Martial art oriented action with a power system\n- Betrayals, schemes, and mysteries\n- Dark scenes\n- Worldbuilding\n- Slice of life including comedy and romance\n-Slow burn\n\n\n\nNotes: This world and story have been brewing for a long time. I can confirm that a lot of it comes from my love for heist and old martial arts movies haha. English isn't my first language but I trained hard to be able to be completely fluent and I'm happy to finally be able to write with minimal fears. The plot will take its time to truly kick in. To install the roots of key narratives properly, the story will start at Kallen's kidnapping. The goal is a coming-of-age\/rise-to-power origin story from start to finish.\nOh and for my reincarnator aficionados, I decided to execute it with a little twist that should appear fairly early in the story.\nFeel free to tell me what you think and I hope you can have an enjoyable time.\nL:1\n\n\n**Updating on Sundays (Thursday too when backlog allows it)**","description_hash":-9181335995175838770},{"title":"Divine Playthings: The God's Isekai Experiment","fiction_id":"88648","link":"https:\/\/www.royalroad.com\/fiction\/88648\/divine-playthings-the-gods-isekai-experiment","tags":["Portal Fantasy \/ Isekai","Female Lead","Fantasy","Short Story","Male Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":39,"chapters_count":1,"last_update":1718597625,"description":"Synopsis:\nIn the celestial realm of Elysium, where time flows differently and cosmic beings oversee galaxies like a grand tapestry, resides an ancient and somewhat bored deity known simply as the Game Master. Eons of existence have left the Game Master jaded with the monotony of divine responsibilities. Seeking amusement, the Game Master devises a whimsical experiment: to select souls from various realms across the multiverse and reincarnate them into a new world for entertainment.\nEnter Alex, a software engineer from 21st-century Earth, and Mei-Ling, a martial artist from ancient China. Both unexpectedly find themselves ripped from their respective lives and thrust into the fantastical realm of Arkania. Here, magic reigns supreme, and mythical creatures roam freely under the twin moons of Lumina and Umbra.\nUnbeknownst to Alex and Mei-Ling, their arrival in Arkania is orchestrated by the enigmatic Game Master. Watching from the ethereal realm, the Game Master delights in observing how these ordinary souls adapt and thrive—or falter—in their new environment.\nAlex, armed with modern knowledge and analytical skills, quickly becomes a skilled enchanter and strategist. Meanwhile, Mei-Ling, with her disciplined martial prowess, earns the respect of local warriors and learns to harness elemental magic tied to her inner chi.\nAs they navigate Arkania's intricacies—forging alliances with eccentric guilds, unraveling ancient prophecies, and battling formidable adversaries—Alex and Mei-Ling discover their shared connection to the whimsical deity manipulating their fate. They are determined to uncover the truth behind their reincarnation and find a way to return home.\nBut the Game Master's influence is not purely passive. Challenges arise as rival gods intervene, seeking to disrupt the experiment for their own amusement. Alex and Mei-Ling must navigate political intrigue, moral dilemmas, and their growing bond to uncover the true purpose of their existence in Arkania\n--------------------------------------------------------------\nI use this as a learning experience pleas write reviews or me sad \n( ͡❛ ‿‿ ͡❛)","description_hash":606185328740306633},{"title":"A Necessary Evil: The Death Of Cultivation In The Jade Sovereignty ","fiction_id":"88647","link":"https:\/\/www.royalroad.com\/fiction\/88647\/a-necessary-evil-the-death-of-cultivation-in-the","tags":["Progression","Anti-Hero Lead","Xianxia","Action","Adventure","Wuxia","Low Fantasy","Villainous Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":33,"chapters_count":1,"last_update":1718597621,"description":"For over a hundred generations the Jade Sovereignty has stood as a beacon of peace and harmony within the realm. Cultivation is taught in the academies for the expressed purposes of knowledge and meditation. Violence has become a relic of a bygone age. \nOne fateful night, Lingqi's life is torn asunder when the barbaric Khalkans of the south raided and pillaged his village, slaughtering all along their path. \nAs war looms on the horizon, the Jade Sovereignty remains steadfast in their ways - hesitant to go to war, they seek to compromise with the barbarians, who grow increasingly bold. \nStruggling between the desire for peace and the drive for conflict, Lingqi embarks on a journey of self-discovery, where he finds that salvation may come at the cost of cultivation as the Sovereignty knows it. \nAnd such truth will forge him into a Necessary Evil. \n\nWhat To Expect\n*Slow Burn Power Progression [In-Universe\/\"Meta\" explanation for \"low\" level cultivation]\n*Hero -> Anti-Hero -> Villain Progression \n*A Heavy and Dense Philosophical Narrative with a blend of action, adventure, romance, and more \n*Rewards Readers Who Pay Attention To Detail\n\nRelease Schedule: \nTwo chapters a day up to the first ten chapters\nThen a steady release of Five Chapters A Week (Mon-Fri) at 7 AM (EST\/USA)\nChapter Length - 1.5k\/2k Words","description_hash":3262374115712898281},{"title":"Help! Evil Wizards Turned Me Into A Girl!","fiction_id":"88646","link":"https:\/\/www.royalroad.com\/fiction\/88646\/help-evil-wizards-turned-me-into-a-girl","tags":["Portal Fantasy \/ Isekai","Strategy","Martial Arts","Strong Lead","Action","Adventure","Fantasy","Gender Bender","School Life","Supernatural","Magic","Low Fantasy","Mythos","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":18,"view_count":134,"chapters_count":2,"last_update":1718599576,"description":"On his way home from a tournament, Nathan is attacked by a wizard and the polarity is reversed on his gender as a result. Now she must navigate the strange culture of a fantasy world while balancing saving the universe with the need to get her life back the way it was before it all went crazy.Updates Fridays until further notice.","description_hash":1819496879703332149},{"title":"Into The Abyss","fiction_id":"88645","link":"https:\/\/www.royalroad.com\/fiction\/88645\/into-the-abyss","tags":["Sci-fi","Action","Fantasy","Cyberpunk","Magic","Genetically Engineered "],"lable":"Original","following_count":2,"rating":0.0,"page_count":46,"view_count":48,"chapters_count":2,"last_update":1718630408,"description":"Draven must stop a madman intent on releasing the Harbinger, a creature of pure chaos. But Draven must first battle the demons within himself and conquer his rage before it conquers him. Luckily, Draven has an ally on his side to guide him. His long-time friend and mentor, Master Al'Manti Sygvar, is well aware of Draven's hot temper. Can these two stop the Harbinger from being freed? Or will they die trying?\nWhat to expect:\nThis is a draft with light editing.","description_hash":-4950585858939321429},{"title":"My other space life - The James Hamill Chronicle Book 1","fiction_id":"88644","link":"https:\/\/www.royalroad.com\/fiction\/88644\/my-other-space-life-the-james-hamill-chronicle","tags":["Male Lead","Sci-fi","Action","First Contact","Hard Sci-fi"],"lable":"Original","following_count":0,"rating":0.5,"page_count":34,"view_count":55,"chapters_count":2,"last_update":1718600693,"description":"Here is a more detailed version of the story you provided:\nJames Hamill is a young man who has dealt with a variety of common life challenges, from bullying to relationship troubles. However, his life takes an unexpected turn when he meets Adlinca, an alien scientist who has come to Earth in search of important data. \nThrough his interactions with Adlinca, James learns about incredible abilities and technologies that he could have never imagined were possible. Adlinca introduces James to advanced alien science and engineering, opening his eyes to the wonders of the vast, interconnected galaxy.\nEager to explore this new world of possibilities, James decides to join Adlinca on a journey across the stars. Together, they travel from planet to planet, encountering all manner of exotic alien species and civilizations. James is thrilled to immerse himself in these bold new environments and cultures.\nHowever, James soon finds that his journey is not without its dangers and challenges. The duo face perilous situations, difficult decisions, and even the heartbreak of lost love. James must navigate complex ethical quandaries as he grapples with the realities of this strange, new galactic existence.\nAs James traverses the cosmos, he wonders what else he might discover - justice, peace, or perhaps even a chance at true love once again? But with so many unknowns and perils lurking around every corner, there is no guarantee that James' journey will end happily. He must rely on his wits, bravery, and moral compass to overcome the obstacles he faces, both within the galaxy and within himself.","description_hash":7375310503153608125},{"title":"I don't want to be reincarnated ","fiction_id":"88643","link":"https:\/\/www.royalroad.com\/fiction\/88643\/i-dont-want-to-be-reincarnated","tags":["Portal Fantasy \/ Isekai","Villainous Lead","Non-Human Lead","Harem","Action","Fantasy","Reincarnation","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":26,"chapters_count":1,"last_update":1718597269,"description":"All he had ever known was suffering from the moment he was born. Finally, death seemed like a sweet release, a chance for peace. But just as he was about to embrace his well-deserved rest, a god with a twisted sense of humor ripped him away. Now, he's reborn into a world of magic, tangled in the politics of an elven royal family that sees him as an outcast and a symbol of darkness. With the weight of his new identity and the scars of his past, he must find a way to carve out a new life. Will he find the solace he craves, or will he challenge the very gods who wronged him?","description_hash":-6260452722353855002},{"title":"Vagabond Troupee","fiction_id":"88642","link":"https:\/\/www.royalroad.com\/fiction\/88642\/vagabond-troupee","tags":["LitRPG","Dungeon","Multiple Lead Characters","Action","Adventure","Fantasy"],"lable":"Original","following_count":1,"rating":5.0,"page_count":16,"view_count":23,"chapters_count":1,"last_update":1718597239,"description":"Jean Coux and Aslan Hawthorne, who is a merchant and veteran soldier, meet Rouvin Walker at the tavern by accident. Rouvin Walker, who turns out to be a researcher, asks Jean and Aslan for help to find the monster that has destroyed his village. When going on an adventure, Jean invites Ivan D. Syaan and Karn, enthusiastic young elves and living legends on the mainland of Weznorands to join in hunting the monster. The adventure brought them to meet Virgil Standos and Farramir Slystep. The seven of them were assisted by a druid. The native inhabitants of the forest are being invaded by the monster. The union of Aslan and Karn, a war veteran with a lot of experience and a living legend who is already famous throughout the Weznorands mainland for his cruelty in slaughtering his enemies, makes this group be reckoned with by the kingdoms on the Weznorands mainland. They also wanted to use the group for their interests and get Jean and the others involved in royal politics.\nRelease Schedule: Thursday and Saturday Every Week!","description_hash":-6558639404655737147},{"title":"MEL0DIES 0F WHISKERFIELD | WORLD OF FELINAEA #1","fiction_id":"88641","link":"https:\/\/www.royalroad.com\/fiction\/88641\/mel0dies-0f-whiskerfield-world-of-felinaea-1","tags":["Female Lead","Adventure","Fantasy","Romance","Mystery","Male Lead","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":24,"chapters_count":1,"last_update":1718597232,"description":"Discover the magic of music, the beauty of nature, and the power of love in \"Serenade in Whiskerfield.\" Follow Lyra and Orion as they unravel the mystery of an enchanted music box that holds the key to their village’s hidden past. Immerse yourself in the serene landscapes of Whiskerfield and witness a slow-burn romance that will tug at your heartstrings. With enchanting melodies, picturesque settings, and a captivating blend of adventure and emotion, \"Serenade in Whiskerfield\" promises a journey you won’t forget.","description_hash":-3804736302246142647},{"title":"The Rifts","fiction_id":"88640","link":"https:\/\/www.royalroad.com\/fiction\/88640\/the-rifts","tags":["Ruling Class","Multiple Lead Characters","Drama","Fantasy","Historical","Romance","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":6,"view_count":15,"chapters_count":1,"last_update":1718597216,"description":"Arion Snemåne and his family have being fighting an unknown enemy for years. But then he meets a woman and everything starts to change.","description_hash":-7473203698811071750},{"title":"Ancient Sacred Body","fiction_id":"88639","link":"https:\/\/www.royalroad.com\/fiction\/88639\/ancient-sacred-body","tags":["Sci-fi","Action","Adventure","Fantasy","Supernatural"],"lable":"Original","following_count":1,"rating":0.0,"page_count":87,"view_count":658,"chapters_count":16,"last_update":1718635644,"description":"Not a waste, not a bootlicker, the tyrant of heaven, an invincible and awesome protagonist. Jun Xiaoyao crossed over to a fantasy world and became the son of an ancient and powerful family, possessing an unbeatable background and shocking talent. He also obtained a check-in system, starting with checking in to obtain an ancient sacred body at the peak level. He checked in at the Taiyue Ancient Stele and received a six-star reward, the power to suppress the heavens! At his tenth birthday banquet, he checked in and received a seven-star reward, the supreme bone! At the Bronze Immortal Palace, he checked in and received an eight-star reward, the Ding of All Creations! In the Boundless Sea, he checked in and received a ten-star reward, the ability to transform freely! Countless years later, Jun Xiaoyao sat atop the Ninth Heaven, pointing his sword towards the heavens and proclaimed, \"Through the nine heavens and ten earths, I rule over all. At the end of the immortal path, I stand at the pinnacle!\"\n\nPS：If there is a tip, it will be added","description_hash":7724752518341618522},{"title":"The Purge","fiction_id":"88638","link":"https:\/\/www.royalroad.com\/fiction\/88638\/the-purge","tags":["Ruling Class","Multiple Lead Characters","Slice of Life","Drama","Fantasy","Historical","Romance","Magic","Low Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":9,"view_count":43,"chapters_count":1,"last_update":1718578072,"description":"Every mayor house fears this\nThe PURGE\nMeyda of house Giora is currently facing a choice, marry the son of the enemy\nor being purged with the rest of her family.","description_hash":510493255025801570},{"title":"The Memiors of the Forgotten Roman","fiction_id":"88637","link":"https:\/\/www.royalroad.com\/fiction\/88637\/the-memiors-of-the-forgotten-roman","tags":["Psychological","Male Lead","Horror","Mystery","Supernatural","Mythos","First Contact"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":27,"chapters_count":1,"last_update":1718578047,"description":"Our protagonist encounters a strange notebook in his school's library. The origin of the book is yet to be found and the book itself doesn't give a single clue on the writer of the author. Yet, he pushes on to get to the root of it.","description_hash":6488377249774575268},{"title":"The Hornless Demon: Luscious Frank","fiction_id":"88636","link":"https:\/\/www.royalroad.com\/fiction\/88636\/the-hornless-demon-luscious-frank","tags":["Urban Fantasy","Anti-Hero Lead","War and Military","Grimdark","Non-Human Lead","Action","Adventure","Fantasy","Tragedy","Slice of Life","School Life","Supernatural","Male Lead","Strong Lead","Secret Identity","Magic","Strategy","High Fantasy","Mythos","First Contact"],"lable":"Original","following_count":1,"rating":0.0,"page_count":29,"view_count":27,"chapters_count":1,"last_update":1718578042,"description":"Two boys are left outside of a raggedy church on the outskirts of the demons worlds poorest region floor 13. \n\nThis story will follow one of the boys Luscious Frank as he tries to build a life for himself despite early trauma and him not fitting in due to his lack of horns. With the story focusing on the 3 youngest brothers as they all vow that they are going to become the demon king and rule the world sparking a friendly rivalry between the brothers who will all try to become the strongest and make it to the top, While exploring this twisted and fantastical world.","description_hash":3006149392000722374},{"title":"No Strings Attached","fiction_id":"88635","link":"https:\/\/www.royalroad.com\/fiction\/88635\/no-strings-attached","tags":["Non-Human Lead","Short Story","Female Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":33,"chapters_count":1,"last_update":1718578035,"description":"Receiving a mysterious invitation from the Strung-Up Puppeteer, Kiera's left with no better option than to entertain a puppet show. [Commissioned Work]","description_hash":-7491907632762137724},{"title":"The Lord of the Hunt","fiction_id":"88614","link":"https:\/\/www.royalroad.com\/fiction\/88614\/the-lord-of-the-hunt","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Comedy","Non-Human Lead","Action","Adventure","Fantasy","Reincarnation","Supernatural","Male Lead","Strong Lead","Secret Identity","Magic","GameLit","High Fantasy","Mythos"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":5,"view_count":48,"chapters_count":1,"last_update":1718551634,"description":"He was born in a new world, as a new creature, with an absolutely overpowered system backing him. How could he not go out and do his best to have fun? \nWith the ability to devour anything and gain their skills, the power to never die? Just read as Noah subdues world's and realities while creating his own.\nAll for fun of course.\n\nJust a story of an overpowered mc doing whatever he wishes, becoming absolutely op early on, but still facing challenges with the overpowered characters within this reality.\nMight I mention that there are items, people, and abilities from other fictions in this, just read on!\nOh, and, the MC isn't the most heroic of characters, more leaning towards neutral or perhaps outright evil, depends how you view it.","description_hash":-1606740699967491187},{"title":"Fate\/Eclipse ","fiction_id":"88613","link":"https:\/\/www.royalroad.com\/fiction\/88613\/fateeclipse","tags":["Action","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":22,"chapters_count":1,"last_update":1718551629,"description":"Fate series spin off of Shadow Slave. A sudden thought","description_hash":8517142403887934665},{"title":"Bootstrap Paradox concept","fiction_id":"88612","link":"https:\/\/www.royalroad.com\/fiction\/88612\/bootstrap-paradox-concept","tags":["Time Loop","Male Lead","Sci-fi","Action","Time Travel"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":25,"chapters_count":1,"last_update":1718551625,"description":"Andrew Gray, an insecure teenager with a poignant yet insightful mind, finds himself thrust into a sci-fi situation he could have never anticipated. This is a just a a concept","description_hash":-1033510632256619468},{"title":"The Corrupted Isles ","fiction_id":"88611","link":"https:\/\/www.royalroad.com\/fiction\/88611\/the-corrupted-isles","tags":["Strong Lead","Action","Adventure","Fantasy","Mystery","Supernatural","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":1,"rating":0.0,"page_count":19,"view_count":103,"chapters_count":2,"last_update":1718551523,"description":"Follow Draven Lightfoot, an exiled thief, on his journey through The Corrupted Isles. A set of islands in the west sea, ruined by plague and taken over by beings beyond human comprehension harboring a dark secret. A dark and grueling fantasy, inspired by the likes of H.P. Lovecraft and J.R.R. Tolkien.\nWritten by Jacob C.","description_hash":-686949412807908708},{"title":"The Pyro Exorcist","fiction_id":"88610","link":"https:\/\/www.royalroad.com\/fiction\/88610\/the-pyro-exorcist","tags":["Male Lead","Action","Adventure","Fantasy","Mystery","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":95,"chapters_count":2,"last_update":1718582756,"description":"Mitchell Saunders is one of the rarest of exorcist. He holds a strange ability named \"Pure Flame\" an ability innate to the \"Abler kind\". This ability allows him to control almost any form of flames. This gave him an advantage against the Phantasms, beings that corrupts and posses creatures of their world.\nMitchell's ordinary life started to change when an organization took interest on him. He must choose to protect his long secret, or expose himself. Will he become the man he would be or will he be exposed and be thrown to the abyss?","description_hash":-5147776535896360965},{"title":"Runic End","fiction_id":"88609","link":"https:\/\/www.royalroad.com\/fiction\/88609\/runic-end","tags":["Progression","Post Apocalyptic","Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":26,"view_count":156,"chapters_count":5,"last_update":1718561520,"description":"Silen Stone needed an out. Trapped in the city of Calypso, he needed to escape from his previous employer who was close to finding him. When three mysterious people offer him a deal to leave, he takes it. His life gets turned upside down when he realizes everything he knew was a lie, and now he must battle monsters and explore ruins to uncover the truth of his fallen world. But one can only run so far before the past catches up.","description_hash":-5896966543749716618},{"title":"Zombie Dawn : The Last Survivors","fiction_id":"88608","link":"https:\/\/www.royalroad.com\/fiction\/88608\/zombie-dawn-the-last-survivors","tags":["Post Apocalyptic","Strategy","Martial Arts","Male Lead","Slice of Life","Action","Adventure","Strong Lead"],"lable":"Original","following_count":1,"rating":5.0,"page_count":2,"view_count":51,"chapters_count":1,"last_update":1718550187,"description":"Liam was trying to die in every possible way, but death refused to come to him. At a time when the world was deteriorating and zombies were beginning to appear, Liam found a new purpose in life. \nAs humanity faces collapse, Liam discovers a reason to stand and survive. He makes survival plans for himself and those around him in the face of this deadly danger.","description_hash":7563580939795039035},{"title":"New World Magic","fiction_id":"88607","link":"https:\/\/www.royalroad.com\/fiction\/88607\/new-world-magic","tags":["Female Lead","Sci-fi","Fantasy","Romance","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":19,"chapters_count":1,"last_update":1718550164,"description":"The scar on his chest was healing, the skin taut and pulled around the edges of the scab, while his bruises had faded. I studied his scar, attempting to muster the strength to look away or feel repulsed, but my heart bled a melancholic, pathetic rhythm—a silent plea for him.\nIt frightened me more than my body’s longing for his touch.\n\nPrincess Isla of Terra-II has sworn off love, focusing on archery, caring for her siblings, and accompanying midwife Selene. Her life changes when she encounters King Kyro, destined to marry her sister Lexa to secure an alliance against an impending threat.\nKyro, bearing the dark magic of the Mourning Eye, is captivated by Isla’s bravery and devotion. Forced into marriage, Isla resents him and the customs of his planet. Granted a potion called liquid gold to prevent pregnancy, she remains determined to control her fate.\nHowever, Kyro’s uniqueness lies in subtler features. Kyro possesses a split tongue, a genetic trait passed down through generations. Similarly, his fangs and thirst for blood, are rarely exposed, hidden beneath a carefully curated facade.\nAs Isla and Kyro’s love deepens, their plans are disrupted by the emergence of the Silverborn, immortal beings capable of planetary destruction. After the tragic death of Selene, Isla vows to defeat the Silver Witch and protect her planet.\nShe rallies allies, facing numerous challenges and uncovering hidden truths about her world. Isla must navigate her growing love for Kyro and the choices that come with her destiny, but her victory comes with a price, one that may haunt her forever.","description_hash":2561298105674070574},{"title":"Sky and Sea","fiction_id":"88606","link":"https:\/\/www.royalroad.com\/fiction\/88606\/sky-and-sea","tags":["Female Lead","Fantasy","Mystery","Supernatural","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":43,"chapters_count":2,"last_update":1718550021,"description":"Faith Corwell and her daughter Suzie moved to the small town of Silverfield to start over, but now Suzie is missing and strange things are happening in town. The people of Silverfield are blaming the occurrences on the nearby lake. Something is waking up in the lake.","description_hash":-9139293573519038058},{"title":"Queenly Quest","fiction_id":"88605","link":"https:\/\/www.royalroad.com\/fiction\/88605\/queenly-quest","tags":["Strategy","Multiple Lead Characters","Secret Identity","Fantasy","Historical","Romance","Mystery","Supernatural","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":24,"chapters_count":1,"last_update":1718545574,"description":"Queenly quest is about a woman named Helena who was from a poor home and background.  She was specially chosen by the Prince of Anchester Kingdom to be his wife and a queen,to give him a boy as an heir to the throne. Prince Khyan loves his wife dearly but his iron-fisted father just wants his son to have an heir before he dies. This frustrates Khyan a lot because despite all the medical attention given to Helena she couldn't bear a child.     Meanwhile, there is a force behind this royal unhappiness . Khyan is set up to marry a princess from the neighboring kingdom with no way out. Helena must embark on a queenly quest to get to the root of this royal unrest. Will she succeed before time runs out?","description_hash":-4835670521724221791},{"title":"My Hero Academia: E.S.P (My Hero Academia X OC Fan Fiction)","fiction_id":"88604","link":"https:\/\/www.royalroad.com\/fiction\/88604\/my-hero-academia-esp-my-hero-academia-x-oc-fan","tags":["Portal Fantasy \/ Isekai","Super Heroes","Multiple Lead Characters","Secret Identity","Strong Lead","Action","Drama","Male Lead","Low Fantasy"],"lable":"Fan Fiction","following_count":3,"rating":2.5,"page_count":210,"view_count":1303,"chapters_count":34,"last_update":1718623800,"description":"||My Hero Academia X OC Crossover Fan Fiction||\nAfter the harrowing run-in with the League Of Villains during a training exercise, Fletchling Hero Izuku Midoriya returns to school to continue his hero training. It would have been yet another day in the prestigious U.A Hero Academy.\nThat is, until Felix Pagonis is introduced to Class 1A as a foreign exchange student.\nBlessed with vast esper powers, the new student is eager to make friends with Izuku and the rest of the class. However, it would not be long when Izuku begins to notice something deeply amiss with this exchange student.\nHow will Izuku's life change? Who exactly is Felix Pagonis? And why is he really here?","description_hash":-4053679421791483579},{"title":"The Adventurer: Soul's Expanse","fiction_id":"88603","link":"https:\/\/www.royalroad.com\/fiction\/88603\/the-adventurer-souls-expanse","tags":["Virtual Reality","Progression","Female Lead","Action","Adventure","Fantasy","Romance","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":20,"view_count":83,"chapters_count":2,"last_update":1718516740,"description":"When a new virtual reality game is set to release, Ava couldn't wait to take part. Her physical disability had long inhibited her desires for adventure, but not even she could expect what awaited her within Fate.\n**\nHello everyone! This is my first attempt at an original story. I've read many stories over the years, and I always felt that writing was beyond me. Until now! Sorry if it isn't very good. Please be kind and insightful in your comments and reviews!\nThis endeavor has a mirrored story from the other character's point of view called The Traveler: Soul's Expanse.","description_hash":6279902265684042548},{"title":"The Traveler: Soul's Expanse","fiction_id":"88602","link":"https:\/\/www.royalroad.com\/fiction\/88602\/the-traveler-souls-expanse","tags":["Progression","Male Lead","Action","Adventure","Fantasy","Romance","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":16,"view_count":47,"chapters_count":2,"last_update":1718516858,"description":"Adriel had been wandering for many years, but he had never met a stranger individual. What will become of their fated encounter?\n**\nHello everyone! This is my first attempt at an original story. I've read many stories over the years, and I always felt that writing was beyond me. Until now! Sorry if it isn't very good. Please be kind and insightful in your comments and reviews!\nThis endeavor has a mirrored story from the other character's point of view called The Adventurer: Soul's Expanse.","description_hash":-5503228952395546225},{"title":"Friends in a Foreign Land","fiction_id":"88601","link":"https:\/\/www.royalroad.com\/fiction\/88601\/friends-in-a-foreign-land","tags":["LitRPG","Portal Fantasy \/ Isekai","Multiple Lead Characters","Slice of Life","Adventure","Fantasy"],"lable":"Original","following_count":3,"rating":5.0,"page_count":78,"view_count":277,"chapters_count":11,"last_update":1718562050,"description":"Arden is enjoying a summer cookout with friends one evening when gods from another world ask for help. Now he and his friends have all been transported to the fantasy world of Traum where they were given a few boons to help them grow and were told to go help those in need. It's all rather quick and appears to be nothing more than a bid to improve the reputation of the gods who brought them over. But the gods aren't telling the whole story.Join the group as they learn about this new world and figure out how to level up, help others, grow as individuals, and figure out what the gods really want. We'll explore different cultures and fight a few monsters, and make some friends and enemies along the way.\n\n\nWhat to Expect:\n\n- Slice of Life\n- Slow burn\n- Big dysfunctional found family: 3 main points of view, but 17 characters total.. not counting companion animals\n- Character growth: no one's a saint, flaws are real, growth takes time\n- Consistency: At the time of this writing I have six months of backlog so even when life gets in the way, the story will continue\n- Chapters release 3 times per week - Sunday, Tuesday, Thursday at 1:11 pm Central Time.","description_hash":-6814887116218853454},{"title":"Thread Of Fate","fiction_id":"88600","link":"https:\/\/www.royalroad.com\/fiction\/88600\/thread-of-fate","tags":["Male Lead","Action","Adventure","Fantasy","Mystery","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":2,"rating":5.0,"page_count":3,"view_count":68,"chapters_count":1,"last_update":1718495546,"description":"Oh humble hands that weave the strands,With gentle touch in many lands,In silence, thou knit our lives,Through love and loss, thread by thread entwines.\nIn every stitch, a story told,Of warmth and comfort, brave and bold,From birth to death, thy yarn does twine,Through joy and sorrow, clear design.\nThrough flowing time, our moments glide,In currents deep, both far and wide,Thy touch unseen, in every loop a bondIn each ripple, a story adorned.\nIn vast expanse of woven space,Thy hand in stars, in heavens trace,Through night and day, thy silent songWe journey forever, and ever long.\nIn life’s grand quilt, we find our place,In growth and change, we seek thy grace,Through every heart, through every soul,Thy purpose leads, thy presence whole.\nIn shadows deep where void does lie,We seek the truth beyond the sky,Through every end, a new beginning,In thy design, all threads are spinning.\nIn hallowed halls where knowledge dwells,Thy wisdom’s light out fear dispels,Guide us through both night and day,In thy embrace, we humbly stay.\nFor in thy weave, we find our place,A part of thy eternal grace,By thy hand, paths cross and part,With every beat of tender heart.\nThy silent song, our lives’ refrain,In laughter’s light, in deepest pain,\nIn grand design, we find our state,In this awe we praise, oh Thread of Fate\nFate is a funny word. People love to play with its meaning and its applications. Some call it destiny, others call it inevitable, and a few tend to accompany it with worlds that give it direction. ‘Thread of Fate’ – ah, if fate were a thread, what would that mean? What happens when the thread is woven? What happens when it twists? What happens when it breaks? Well… who knows?\nSometimes, the simplest of actions determine one’s life. And other times, those simple actions lead to unavoidable consequences. One is free to choose his path but must be wary of the untold challenges and hidden dangers that lie ahead. There's always a choice, so... I ask you now, what will your choice be, Apollyon?","description_hash":-2128008439587666303},{"title":"The Forgotten Darkness","fiction_id":"88599","link":"https:\/\/www.royalroad.com\/fiction\/88599\/the-forgotten-darkness","tags":["Urban Fantasy","Comedy","Multiple Lead Characters","Sci-fi","Adventure","Fantasy","Supernatural","Female Lead","Non-Human Lead","Low Fantasy","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":39,"chapters_count":1,"last_update":1718495457,"description":"What happens when you mix an over-exhausted brain, a borderline idiotic friend, and your superhero ass powers together? \nSPOILER ALERT! You don't! Well, you don't. I definitely do. And believe it or not, the other voice in my head tries their damn hardest to keep me outta trouble. \nI sound crazy, and I won't lie, I certainly seem that way. Especially when I tell ya I can turn invisible and fly. Turns out not one known person alive can Cloak like me. That's most likely the reason ol' Lawson has me locked up like Rapunzel in this 'sanctum' they boringly call The Council- Oh, no, actual spoilers... Anyway! The name's Sinead Parker, and apparently I'm the most cliche superhero plot line when I couldn't be further from that statement myself. I'm the Chosen one! Wow, that's never been done before!\nNo! Don't click away yet, because my story is one hell of a show! At least it would be if Amazon answered my damn emails... So, join me, (please don't, this might be an entertaining read, but I'm begging you don't join unless you value yourself), and let's unravel the shroud of mystery that is The Forgotten Darkness. \nOoo, scary.","description_hash":-2749533758594029270},{"title":"Sinkhole, Land of Jonrah series - book 1","fiction_id":"88598","link":"https:\/\/www.royalroad.com\/fiction\/88598\/sinkhole-land-of-jonrah-series-book-1","tags":["Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":16,"chapters_count":1,"last_update":1718495442,"description":"In a world where music is magic, prophecy says the True Voice will come from another world and restore the harmony of The Great Song, from which the entire multiverse springs...\nAlecyn Johnsenn's Florida home was swallowed up by a sinkhole. Her friends and neighbors mourn here, the victim of a one in a million random geological anomaly. A waste of a promising your life...\nBut Alecyn is not dead. And the sinkhole was far from random.  Alecyn awoke to find herself in the land of Jonrah, a pawn in an ancient battle between good and evil, with the stakes being no less than the whole world and countless others.","description_hash":-9106262811589909528},{"title":"The Haven We Seek ","fiction_id":"88597","link":"https:\/\/www.royalroad.com\/fiction\/88597\/the-haven-we-seek","tags":["Post Apocalyptic","Villainous Lead","War and Military","Martial Arts","Grimdark","Action","Fantasy","Mystery","Tragedy","Harem","Supernatural","Male Lead","Strong Lead","Multiple Lead Characters","Strategy","High Fantasy","Mythos","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":19,"view_count":49,"chapters_count":2,"last_update":1718616433,"description":"...Centuries after the first sunrise, Nosil, Bugod, Aya, Fano and Lerna, five children chosen for a special mission in the final Haven, only to find themselves in a realm destroyed 300 years ago. These young heroes must uncover the secrets of their ancestors and the cataclysm that wrought such vast devastation.","description_hash":3276353159194257370},{"title":"Urban assassin","fiction_id":"88596","link":"https:\/\/www.royalroad.com\/fiction\/88596\/urban-assassin","tags":["Urban Fantasy","Male Lead","Action","Adventure","Mystery","School Life","Supernatural"],"lable":"Original","following_count":1,"rating":0.0,"page_count":7,"view_count":59,"chapters_count":2,"last_update":1718578138,"description":"Urban assassin is my novel\/manga it is a shōnen\/action\/mystery\/school piece of work and its focus is the jet kaze and his story. In the city of “neonera” people with special abilities are known as the “gifted” each member of the gifted has the ability to  use telekinesis wether weak or strong and some members of the gifted have abilites on top of that such as flame control,gravity control,void control,vibration control,sound control,shadow control and so on. High ranking members of the government also have abilities but they have control over the public so it seems as if they are the “protectors” of neonera when really they are corrupt because of this their are  “assassins” that  slowly take out the government to free the public of their trap and take neonera back from corrupt members of the gifted.","description_hash":-5592816022310643603},{"title":"Wizard","fiction_id":"88595","link":"https:\/\/www.royalroad.com\/fiction\/88595\/wizard","tags":["Progression","Anti-Hero Lead","Grimdark","Psychological","Male Lead","Action","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":2,"view_count":35,"chapters_count":1,"last_update":1718495412,"description":"An Orphan, exiled from a lonely town in the frozen north is left to die. He survives. Having discovered an aptitude for magic on the brink of death he must stave off hunger and frostbite as he tries to uncover the mysteries of this new power. But magic isn’t a thing to be taken lightly, its dangers don’t even include others envy.","description_hash":5167143415300650102},{"title":"No Radiance in Heaven","fiction_id":"88634","link":"https:\/\/www.royalroad.com\/fiction\/88634\/no-radiance-in-heaven","tags":["LitRPG","Progression","Multiple Lead Characters","Sci-fi","Action","Cyberpunk","Male Lead","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":27,"chapters_count":1,"last_update":1718578021,"description":"Mid-level gangster Joshua Arcascos has died. Despite being riddled with bullets, Joshua survived, thanks to the intervention of his boss and the machinations of a hyper-AI dimensional matrix known as AUTOGRID SILVAN.\nNow, indebted to the AUTOGRID, Joshua must work hard to improve himself and reap the 'boons' offered by the hyper-AI. On top of that, he is determined to take revenge while exploring the wonders and rewards of his sinful life. \nWill Joshua succumb to the pressures and dangers of being a modern gangster? Or will he become a successful modern boss destined to harness the mysterious powers of the hyper-AI? \n\nChapter 1 out! - No choices, just consequences","description_hash":1188901014197438316},{"title":"King Of Thy Cross","fiction_id":"88633","link":"https:\/\/www.royalroad.com\/fiction\/88633\/king-of-thy-cross","tags":["Reincarnation","Progression","Martial Arts","Grimdark","Non-Human Lead","Action","Adventure","Fantasy","Tragedy","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":7,"view_count":30,"chapters_count":1,"last_update":1718572503,"description":"During the War of the Continent, I made a fateful decision that sealed my doom. Driven by ambition and fear, I killed my own father to seize the throne. His dying eyes, filled with a mixture of shock and disappointment, haunt me still.\nAs enemy forces breached the castle walls, I chose to flee, abandoning my people and my soldiers. Desperate to save myself, I ran through the streets, past the city gates, and onto the forest paths. The cries of my betrayed people echoed behind me, their curses ringing in my ears as they prayed for divine retribution.\nIn their wrath, they called upon the Sun God for justice. “By the name of the Sun God,” one of the fated soldiers proclaimed. The divine Spear of the Sun God struck from the heavens, piercing me from behind as I fled into the forest, creating a massive crevice where it landed.\nBut death was not the end for me. I awoke, reborn in Al’trezea, with memories of my past life intact. I am haunted by my previous failures and the murder of my father. Initially, I try to flee from the burdens of leadership once again.\nCan a fallen king rise again, or am I doomed to repeat the failures of my past?","description_hash":6713905009428148337},{"title":"[Artificial] Invasion (Book 1)","fiction_id":"88632","link":"https:\/\/www.royalroad.com\/fiction\/88632\/artificial-invasion-book-1","tags":["Urban Fantasy","Progression","Post Apocalyptic","War and Military","Psychological","Action","Adventure","Sci-fi","Cyberpunk","Male Lead","Multiple Lead Characters","Technologically Engineered","Soft Sci-fi","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Book 1 of the Artificial Series\nIn 2040, Elliot Cornerstone, the “real-life Tony Stark”, has popularized the use of AI Humanoids through his famous company, HumanTech. Tristan Clarence has admired Cornerstone since he was a child. He dreams to work in HumanTech and pave the way to the new age— the age of artificial intelligence. No matter what those crazed anti-tech fanatics say, he’ll help humanity achieve the era of efficiency.\nSuddenly, Cornerstone is assassinated, Seattle is overrun with rogue robots, and everyone is locked in their homes waiting for the next disaster to flare up. Little by little, the US crumbles under the weight of an invasion. Clusters of Americans are trying to find a way out of the wasteland that was once their home.\nSeparated from his family, Tristan faces inevitable danger as he and his sister, Sophie, cross the country to the last evacuation point— which won’t be open for much longer.\nWattpad:","description_hash":6668755804091527935},{"title":"Road to Infinity","fiction_id":"88631","link":"https:\/\/www.royalroad.com\/fiction\/88631\/road-to-infinity","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Post Apocalyptic","Strategy","Action","Adventure","Fantasy","Martial Arts","Male Lead","Strong Lead","Magic","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":54,"chapters_count":1,"last_update":1718568074,"description":"Darius goes to sleep hoping to never wake up. Life has other plans. Journey along with him as he enters into the land of dreams and nightmares, on the Road to Infinity.","description_hash":-5024924297892883732},{"title":"Since When Was Being Reborn So Hard? [Isekai LitRPG]","fiction_id":"88630","link":"https:\/\/www.royalroad.com\/fiction\/88630\/since-when-was-being-reborn-so-hard-isekai-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Action","Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":7,"view_count":53,"chapters_count":1,"last_update":1718567880,"description":"Leo had just turned the blossoming age of 18, which honestly should have been one of his peak years in his young, hopeful life. He had been accepted to a normal college, wasn't in poverty or anything, had a nice family, and was just somewhat of a normal guy. Despite this, he felt like something was missing. His life seemed directionless, which is probably normal, even if he didn't realize it. Leo thought he had already wasted his youth, wasting away, doing nothing important. Sitting in his room, playing video games, procrastinating, and always dreaming of what he wanted to do. He thought it was over until it was.\nAfter an accident, Leo finds himself waking up in an entirely new world. One so foreign to him, one that seemed like a game, despite it being reality. It was like those animes that he had seen, those isekai's that had somebody reincarnated into a new world. Leo had always thought that it was cool. Being reborn in a new world, likely with magic, different races, and maybe even having a harem surround him. It was his chance to restart. Maybe, it was for the better that he died, leaving that filthy old earth behind. Here he would have all the freedom to do whatever he wanted. This was what he wanted. Or was it?\nHis skin wasn't that usual human skin tone, instead, it was a dark blueish-gray. The people surrounding him were the same. What was he? Leo thought that he would be reborn as himself, so what was the meaning behind all of this? The people around him looked like humans, but at the same time, they weren't as tall, strong, or as beautiful as ordinary humans. He wasn't entirely human, yet not entirely monster. Maybe, this wasn't what he wanted after all.\nRealizing his new reality, Leo must overcome the struggles of being born in an entirely new world. One where nearly everything he once knew is now thrown out the window. One where dreams will surely end, and new dreams begin.\n\nI'll try to get at least 2 chapters out a week. Hopefully, at the very least, because of my work schedule. Chapter lengths will vary, but I'll try to make it worthwhile.","description_hash":-6467912050328589472},{"title":"Errant Soul","fiction_id":"88629","link":"https:\/\/www.royalroad.com\/fiction\/88629\/errant-soul","tags":["Portal Fantasy \/ Isekai","War and Military","Male Lead","Drama","Action","Adventure","Fantasy","Magic","Strategy","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":9,"view_count":30,"chapters_count":1,"last_update":1718566134,"description":"Victim to ambitious sorcery gone awry, Daniel finds himself a foreign soul, torn from his home and thrust into a world whose very fabric rejects his presence like a cancer.\n A fledgling empire bites at its own tail while an ancient horror from the arctic ice mauls its frontiers. The body Daniel lands in belonged to a duke of the Northern steppe, a hero to his people. Supplanting him, they find only a stranger anathema to magic, matter, and the gods themselves. Daniel may not be their knight in shining armour, but if he chooses his path wisely he just might be able to turn the scourge that he has become against their enemies.","description_hash":558846967263276551},{"title":"Taiji","fiction_id":"88628","link":"https:\/\/www.royalroad.com\/fiction\/88628\/taiji","tags":["Urban Fantasy","Progression","Post Apocalyptic","Anti-Hero Lead","Ruling Class","Action","Adventure","Comedy","Fantasy","Martial Arts","Supernatural","Male Lead","Female Lead","Multiple Lead Characters","Non-Human Lead","Magic","Wuxia","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":31,"chapters_count":1,"last_update":1718562842,"description":"The story starts 600 years after the fall of the human civilization. There was a war between the planes of the afterlife, this resulted in the embodiment of “lust for power”, or Ki being able to take control of the masses. The celestial being Naru, wants to stop him from creating a torturous world, but the other celestials have forbidden her and themselves from getting involved in the matters of mortals. Naru has decided that if she cannot get involved personally then she will have to find someone who can understand that there’s no such thing as good and bad. A successor.\nWe are then introduced to Ame a human boy who lives in a town of elves. His parents tried to rid themselves of him by throwing him out at the age of 4-5. This resulted in him becoming somewhat feral. He was found by an elf who took him in and raised him. He was somewhat of a wild boy. He believed in many pagan beliefs. He never thought he was worth more than the animals he killed. He did not believe in “good and bad”.","description_hash":3701806830022661121},{"title":"Emergency Protocol: A Low Fantasy Horror LitRPG","fiction_id":"88627","link":"https:\/\/www.royalroad.com\/fiction\/88627\/emergency-protocol-a-low-fantasy-horror-litrpg","tags":["LitRPG","Progression","Male Lead","Action","Adventure","Fantasy","Horror","Supernatural","Magic","GameLit","Low Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":18,"view_count":222,"chapters_count":3,"last_update":1718627124,"description":"Jared, a rookie paramedic struggling under the weight of student debt and the daily grind of his low-paying job, stumbled upon an extraordinary discovery: a \"game-like\" system that seemed to enhance his abilities. Inspired by this newfound edge, Jared embarked on a quest for a better-paying position, determined to escape financial ruin.\nHis relentless pursuit for a lifeline led him down unexpected paths until a mysterious figure contacted him directly.\n\"Your skills are exactly what we need,\" the enigmatic man offered, his words dripping with intrigue. \"Starting salary of $220,000 annually, no questions asked. Are you in?\"\nCaught between skepticism and hope, Jared's desperation for a fresh start outweighed his doubts. With a leap of faith, he accepted the offer, unaware of the dark and dangerous journey ahead.","description_hash":-7630272540060056551},{"title":"Must Save You From Evil [GameLit\/isekai)","fiction_id":"88626","link":"https:\/\/www.royalroad.com\/fiction\/88626\/must-save-you-from-evil-gamelitisekai","tags":["LitRPG","Portal Fantasy \/ Isekai","Female Lead","Adventure","Fantasy","Historical","Romance","Reincarnation","GameLit"],"lable":"Original","following_count":1,"rating":0.0,"page_count":35,"view_count":198,"chapters_count":7,"last_update":1718562528,"description":"A young woman woke up in her favourite open-world roleplaying game as an NPC, a lady named Lilivienne. Upon recalling the game lore, she remembered Lilivienne’s tragic fate. Lilivienne was meant to die during the destruction of the kingdom perpetrated by a popular character Zathrian Lestrange, an SSR anti-hero—right before the arrival of the protagonist. To change the fate of her new life as Lilivienne Van der Horst, she set out on a mission to save Zathrian from the evil path. But there was a problem, it seemed she caught the interest of both the anti-hero and the protagonist.","description_hash":-8809945723211622724},{"title":"Dark Skies","fiction_id":"88625","link":"https:\/\/www.royalroad.com\/fiction\/88625\/dark-skies","tags":["Super Heroes","Strategy","Multiple Lead Characters","Sci-fi","Strong Lead","Action","Adventure","Supernatural","Male Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":132,"view_count":176,"chapters_count":10,"last_update":1718570296,"description":"Some promotions aren't worth the headache, especially when they consist of overseeing a global superhero organization. Bernard Skies learns this all too well when a grisly, shocking murder reveals a dangerous conspiracy threatening to destroy civilization as they know it. And, as if that wasn't enough, it forces him to work with his vindictive, estranged family that'd love nothing more than to see him fail. Spectacularly.\nRealistically, though, what did he expect? It's not like his life has never been easy.\nWhy change now?\n--------------\nCover by Kira L. Nguyen - http:\/\/www.deviantart.com\/kiralng","description_hash":-8790432978770944345},{"title":"The Boxer in a World of magic ","fiction_id":"88624","link":"https:\/\/www.royalroad.com\/fiction\/88624\/the-boxer-in-a-world-of-magic","tags":["Portal Fantasy \/ Isekai","Dungeon","Anti-Hero Lead","War and Military","Martial Arts","Action","Adventure","Comedy","Fantasy","Sports","School Life","Magic","Strategy","High Fantasy","Ruling Class"],"lable":"Original","following_count":1,"rating":0.0,"page_count":10,"view_count":31,"chapters_count":1,"last_update":1718552718,"description":"For as long as he could remember, Seventeen-year-old Manny has wanted to be the best at boxing, and show the world his worth. He was able to find a talent within Boxing, and a passion had blossomed within him regarding the sport. Through rapid growth of his abilities, Manny soon found himself in a regionals final, where everything suddenly turned to black. \nSoon, he found himself in only his boxing shorts and shoes on a hilltop overlooking a vast grassy land with a walled city within the centre. Confused, dazed and slightly terrified, Manny ventured forward into the unknown, unaware of the adventures that lay ahead of him.","description_hash":4977502386718329688},{"title":"My First Full-Time Job as a Tower Climber [LitRPG]","fiction_id":"88623","link":"https:\/\/www.royalroad.com\/fiction\/88623\/my-first-full-time-job-as-a-tower-climber-litrpg","tags":["LitRPG","Dungeon","Martial Arts","Multiple Lead Characters","Action","Adventure","Fantasy","Satire","Magic"],"lable":"Original","following_count":3,"rating":5.0,"page_count":3,"view_count":40,"chapters_count":1,"last_update":1718552549,"description":"The world changed when the Tower of Ascension appeared on Earth in 2025.\nIn face of a looming threat bound to arrive in the Milky Way in 500 years, the Gods and Deities of the Milky Way designed the tower as a means of hope. Hope for the beings of the world to earn the power to defend themselves. \nAnd what could be better than simply climbing the Tower? Climbing the Tower and earning commission for each floor that is modernised using technology?!\nFresh out of college, when Leonardo Harrison, or Leo saw the job offer on LinkedOut for a Software Developer, he immediately applied for it as he did for many other companies as someone looking for a job. \nAnd he actually ends up getting the job! \nJoin Leo, as he, together with his team of Ascenders, climb the tower to bring forth the technological revolution to the Tower of Ascension!","description_hash":-2554910322568018965},{"title":"Brain Food","fiction_id":"88622","link":"https:\/\/www.royalroad.com\/fiction\/88622\/brain-food","tags":["LitRPG","Portal Fantasy \/ Isekai","Female Lead","Action","Adventure","Fantasy","Supernatural","Magic","GameLit"],"lable":"Original","following_count":7,"rating":4.0,"page_count":17,"view_count":167,"chapters_count":2,"last_update":1718554980,"description":"Things take a turn for Chatty when she starts hearing someone talking to her from inside her head. Alone in a strange world with no memories, she has to survive both the people and monsters who are out to kill her. Chatty and the voice in her head will have to work together to stay alive as they make their way through the dangerous wilderness.\n(This story has incidental transgender themes.)","description_hash":903132969553206027},{"title":"Frozen echoes interludes","fiction_id":"88621","link":"https:\/\/www.royalroad.com\/fiction\/88621\/frozen-echoes-interludes","tags":["Sci-fi","Action"],"lable":"Original","following_count":1,"rating":0.0,"page_count":4,"view_count":45,"chapters_count":1,"last_update":1718552201,"description":"This is my first attempt at writing a book, frozen echoes is a sci-fi story telling the struggle of humanity against overwhelming odds. I take inspiration from worm by wildbow, ssiaw by nivilack and red vs blue","description_hash":-603827320898783571},{"title":"Shadow of light","fiction_id":"88620","link":"https:\/\/www.royalroad.com\/fiction\/88620\/shadow-of-light","tags":["Reincarnation","Progression","Super Heroes","Strategy","Sci-fi","Historical","Mystery","Mythos","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":16,"chapters_count":1,"last_update":1718552192,"description":"As dawn breaks over the pristine oceans of Malta, a planet in the far reaches of the Delta Galaxy, Tianci, a brilliant energy research expert, and his sister Tianxin, the chief expert of the Human Star Cluster think tank, are preparing to celebrate their father's birthday. Their father, Tianzhi, a descendant of the revered Sacred Family, holds onto the legacy and responsibility that comes with their lineage, even as its significance wanes among the populace.\nThe peace is shattered when an urgent message alerts them to a severe energy shortage threatening the galaxy's core systems. Tianci and Tianxin delve into their respective fields—Tianci in advanced energy solutions and Tianxin in social stability and interspecies cooperation. Their investigations uncover a web of conspiracies involving the Lower Three Tribes (Hell, Hungry Ghost, and Wolf races) who harbor ambitions to destabilize the galaxy.\nAs they navigate political intrigue and looming threats, the siblings must unite the Sacred Family's forces and form new alliances. The first book culminates in a climactic battle where the surface victory hints at a deeper, more insidious danger, setting the stage for the greater challenges ahead.","description_hash":-1216288900342039365},{"title":"The Legend of the Great Empress","fiction_id":"88619","link":"https:\/\/www.royalroad.com\/fiction\/88619\/the-legend-of-the-great-empress","tags":["Progression","Ruling Class","Multiple Lead Characters","Drama","Fantasy","Romance","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":16,"chapters_count":1,"last_update":1718552181,"description":"A young princess who rules in her own right strives to be the best ruler she can be for her people whilst navigating through the trials of love, duplicity, friendships, and warfare, her ultimate goal being to eventually become a powerful empress one day.","description_hash":2234936463723917185},{"title":"The Shadows of Arcania","fiction_id":"88618","link":"https:\/\/www.royalroad.com\/fiction\/88618\/the-shadows-of-arcania","tags":["Reincarnation","Urban Fantasy","Martial Arts","Male Lead","Secret Identity","Action","Adventure","Fantasy","Mystery","Supernatural","Strong Lead","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":37,"view_count":93,"chapters_count":4,"last_update":1718630958,"description":"In the heart of Arcania, a city where the modern world collides with ancient magic, Adrian's life as a struggling musician takes an extraordinary turn. Awakening to powers he never imagined, Adrian discovers he is the reincarnation of the God of Light, destined to combat an emerging darkness that threatens to engulf the world.\nMentored by the enigmatic and knowledgeable Elias, Adrian begins a perilous journey of self-discovery. Together, they delve into ancient texts and forgotten legends, uncovering a dire prophecy: the return of Erebus, the God of Shadows, whose followers are already wreaking havoc in Arcania.\nTheir quest leads them to Detective Harper, a sharp-witted and skeptical young investigator. Initially dubious of Adrian and Elias’s claims, Harper's world is turned upside down as she witnesses the reality of the supernatural threats. Despite her initial mistrust, she becomes an invaluable ally in their mission to protect the city.\nAs Adrian hones his powers, he encounters the charming yet mysterious Jaxon, who presents a riddle hinting at a powerful artifact—the Lumen Core. This legendary relic holds the key to preventing a catastrophic clash between the gods. Guided by Jaxon’s cryptic clues, the trio must race against time to find the Lumen Core before Erebus's darkness spreads.\nThroughout their journey, they face formidable enemies, uncover hidden truths, and forge unexpected alliances. The stakes rise as Adrian’s dual life becomes increasingly treacherous, balancing his musical ambitions with his divine responsibilities. Every battle and discovery brings him closer to understanding the true extent of his powers and the role he must play in the impending conflict.\nAs the final confrontation looms, Adrian, Elias, and Harper prepare for a showdown with Erebus that will determine the fate of Arcania and beyond. Amidst the chaos, Adrian must embrace his destiny and harness the full strength of the God of Light to stand against the ancient darkness.\n\"The Shadows of Arcania\" is a spellbinding tale of courage, friendship, and the eternal battle between light and shadow. Rich with mythological intrigue and thrilling action, this novel will captivate readers and leave them eager for more.","description_hash":-2786540359888989817},{"title":"Chasing Shadows","fiction_id":"88617","link":"https:\/\/www.royalroad.com\/fiction\/88617\/chasing-shadows","tags":["Psychological","Horror","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":20,"chapters_count":1,"last_update":1718552152,"description":"A struggling drug addict comes into contact with a horrifying figure who chases them through their life, driving them to mistake after mistake.","description_hash":1766620766096287317},{"title":"Band of Blades: Old World","fiction_id":"88616","link":"https:\/\/www.royalroad.com\/fiction\/88616\/band-of-blades-old-world","tags":["Action","Fantasy","Horror"],"lable":"Original","following_count":1,"rating":0.0,"page_count":11,"view_count":46,"chapters_count":1,"last_update":1718551682,"description":"A serialized story version of a Band of Blades campaign that I ran about 3 years ago. This has been heavily modified to make it work for a story and its meant to record the story to share with my friends and anyone that's a fan of the game.","description_hash":4250707540608874925},{"title":"Your Path: An Urban Fantasy Tale","fiction_id":"88615","link":"https:\/\/www.royalroad.com\/fiction\/88615\/your-path-an-urban-fantasy-tale","tags":["Urban Fantasy","Action","Fantasy","Horror"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":22,"chapters_count":1,"last_update":1718551676,"description":"A strange creature stalks people in the Manhattan streets at night and you find yourself drawn to it from your far away home. Danger be damned, you will go to it and you will find out about a world that is hidden from the sight of normal people.","description_hash":849814027118438534},{"title":"Embarking on Mercenary Life with a Catgirl in the Magical World","fiction_id":"88594","link":"https:\/\/www.royalroad.com\/fiction\/88594\/embarking-on-mercenary-life-with-a-catgirl-in","tags":["Comedy","Male Lead","Harem","Adventure","Magic"],"lable":"Original","following_count":55,"rating":4.25,"page_count":499,"view_count":10165,"chapters_count":100,"last_update":1718635019,"description":"Mike, an exceptional mercenary from the era of post-apocalyptic wastelands, meets his end betrayed during a company escort mission. However, his soul crosses over into a world of swords and magic, inheriting the bloodline of giants, and begins anew on the path of a mercenary.\nCat Girl: Big guy, you're a good person.\nWizard: You're not as innocent as you look!\nTavern Landlady: Are you flirting with me?\nOld Mercenary: Kid, you were born to be a mercenary!","description_hash":2481592637371888828},{"title":"Anti-Healer","fiction_id":"88593","link":"https:\/\/www.royalroad.com\/fiction\/88593\/anti-healer","tags":["Progression","Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":9,"view_count":67,"chapters_count":1,"last_update":1718495392,"description":"Healers are generally renowned for being immediate necessities in a party. If your healer gets hurt, it may take months for your party to be able to move again. A lot of pressure is on them, too. Heal the wrong person, you run the risk of another dying.\nCody was… a bit different. \nInstead of healing, he hurts. Siphons life force from the target.\nNow, he’s left with a choice. Die, or live his life under the radar and never show himself again. \nEver since childhood, he’d been saving up to receive his class. Collecting dropped coins. Hiding them in his mouth when people threatened him. The taste of dirt still remained to this day. He was not going to let these filthy Nobles make it go to waste. They wanted to demonize him? He didn’t care. \nThis was his class. He was not going to let it rot because some idiots think he’s going to kill everybody.\nHe was going to live his own way. \nWhat to expect:\nNo harem\nNo system\nProgression is sometimes slow and sometimes fast.\nSide quests that I’ll try to keep down to one or two chapters.\nMC upkeeps his morals, no matter the situation.","description_hash":-1650813532736901956},{"title":" \"Hostel Tales: Adventures in Friendship\"","fiction_id":"88592","link":"https:\/\/www.royalroad.com\/fiction\/88592\/hostel-tales-adventures-in-friendship","tags":["Slice of Life","Drama","Adventure","School Life"],"lable":"Original","following_count":1,"rating":5.0,"page_count":5,"view_count":40,"chapters_count":1,"last_update":1718495385,"description":"\"Hostel Tales: Adventures in Friendship\" chronicles the transformative two-year journey of a young man reluctantly returning to the hostel for his high school (Grade 11th and 12th). Departing from the comforts of home once more, he grapples with the challenges of academic rigor, newfound independence, and the intricacies of building meaningful relationships.\nAs he navigates the labyrinthine corridors and strict routines of hostel life, he encounters a diverse spectrum of characters. Some become steadfast confidants, offering support and camaraderie, while others challenge his beliefs and broaden his perspectives. Each interaction shapes his understanding of friendship, resilience, and personal growth.\nThroughout his journey, he learns about the complexities of the world and the diversity of human experiences. Experiencing both highs and lows, he forms lasting bonds with those who share in his triumphs and setbacks. The story unfolds as he navigates the pressures of academics and social dynamics, all while striving to maintain his sense of self in the face of hostel life's demands.\n\"Hostel Tales: Adventures in Friendship\" is a poignant exploration of identity, adaptation, and the enduring power of friendship. It captures the essence of adolescence as he learns to blend into hostel life, undergoes personal transformation, and discovers the profound impact of shared experiences on his journey to maturity.","description_hash":-3493399894642991335},{"title":"Ciriel, the Abyssal Queen (Kancolle fanfiction)","fiction_id":"88591","link":"https:\/\/www.royalroad.com\/fiction\/88591\/ciriel-the-abyssal-queen-kancolle-fanfiction","tags":["Anti-Hero Lead","Action","Satire","Supernatural"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":18,"view_count":106,"chapters_count":3,"last_update":1718568007,"description":"A random person is kidnapped by a ROB and thrown into the Kancolle world. Given a cheat power they must weather the storm that is coming for them.","description_hash":2592759873089966744},{"title":"Scarlet in Warderland","fiction_id":"88590","link":"https:\/\/www.royalroad.com\/fiction\/88590\/scarlet-in-warderland","tags":["War and Military","Psychological","Female Lead","Sci-fi","Strong Lead","Action","Tragedy","Cyberpunk","Technologically Engineered","Hard Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":3,"rating":0.0,"page_count":3,"view_count":92,"chapters_count":2,"last_update":1718544620,"description":"In an alternate future where war has consumed every nation, soldiers fight relentlessly with enhanced technology and experimental equipment. Among them stands Eva Blackwood, known as Scarlet, a dedicated U.N.A. soldier, thrust into endless missions with little regard for her mental well-being, much like her fellow comrades.This is the gripping tale of Scarlet’s journey, filled with battles both on the field and within her own mind. As she navigates through a war-torn world, she faces not only her enemies but also her inner demons. \"Scarlet in Warderland\" explores the harsh realities of war, the unyielding spirit of a soldier, and the haunting struggles that lie beneath the surface.Join Scarlet as she dominates the battlefields and confronts the personal battles that threaten to consume her. This is her story, her fight, and her redemption.","description_hash":4140953475172683939},{"title":"Tabibito Mai (Traveler Mai)","fiction_id":"88589","link":"https:\/\/www.royalroad.com\/fiction\/88589\/tabibito-mai-traveler-mai","tags":["Time Travel","Dungeon","Anti-Hero Lead","War and Military","Steampunk","Adventure","Drama","Fantasy","Tragedy","Slice of Life","School Life","Supernatural","Female Lead","Strong Lead","Multiple Lead Characters","Secret Identity","Magic","Strategy","High Fantasy","Mythos","Ruling Class","Genetically Engineered ","Technologically Engineered","Soft Sci-fi","Progression","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":37,"view_count":143,"chapters_count":3,"last_update":1718524545,"description":"Tabibito (Traveler) -\nHere, in the land of Aischala— home to humans, demi-humans and many diverse creatures and races, long ago, the most fantastical adventurers whose hearts were pure, that burned with passion and true desire to seek out the world, were deemed honorable enough to bear the title of 'Traveler'.\n\"Nowadays, the word 'Traveler' is merely a commonplace term to describe any given person who moves from place to place throughout the land.\"\n\"Honestly, nothing special huh?\"\nAs modern advancements ushered in a new age of technology and innovation, with it came mistrust and greed, as the introduction of new technology would revolutionize not just modern living, but the capability of combat itself.\nWar soon followed between the Royal Capital of Saint-Grandis who housed impressive technology. They found themselves locked in a brutal struggle for supremacy of the land against a territory of criminals and thieves– the most heinous of indiscriminate races who were banished from society for their despicable acts against civilization, to the barren red-sand dunes of the South, bringing peace for the common good of Aischala.\nThus, the land of Aischala was brought from a time of peace back into a dark age once more, which led to poverty, strife, and left many families broken.\n\"Many children were left without families– many were left behind, orphaned as a result.\"\n\"Including myself.\"\n\"When I was around Seven years old, within the various books and scattered titles in my adoptive father’s library, I discovered my own yearning and desire to learn about the fantastical mysteries contained within each vivid page.\"\n\"Despite my passion and naivety, could I be the one to stand at the very ends of the world, to inherit the true meaning of what being a 'Traveler' is all about?\"\n\"Would I be able to withstand what this journey holds in store for me?\"\n\"Or am I just way in over my head?\"\n\"Seek the answers together with me.\"\n\"This is my journey, my story...\"\n- Tabibito Mai\n\n\nThis story is written in the narrative style of Visual Novels.\nWhenever quotes \"\" are used, it directly means that a given character is speaking out loud. When quotes are not used, it usually depicts a character's inner thoughts and monologue.\nMost things will usually be described directly from the viewpoint of the Main Character(s), you'll have to use logic and narrative cues to discern who may be thinking\/speaking at times.\nPlease be aware, this story contains:\nTraumatic and Abusive Scenarios and Situations, Occasional Violence or Violent Acts, Psychological\/Mental Themes, and other Potentially Unsettling Content.\nEach Chapter is at least 2000 to 3000 words or more.\nThis will only include up to (Prologue) Chapter 15 for now, and I'll slowly upload a Chapter or so every day until they're all uploaded, or I stop caring.","description_hash":-5903137412016941340},{"title":"Dances, games and betting.","fiction_id":"88588","link":"https:\/\/www.royalroad.com\/fiction\/88588\/dances-games-and-betting","tags":["Anti-Hero Lead","Psychological","Action","Fantasy","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":34,"chapters_count":1,"last_update":1718495181,"description":"In the game of power, lies and illusions, the main objective of each participant's action is to have more power, freedom and influence over others, regardless of the morality of these acts.\n\n   Henrique is a boy who ended up dying and reincarnated in another world. Being recognized as a potential Controller of People's Energy, he attempted to rise through the ranks of this world.","description_hash":2561726057068826114},{"title":"Children of the Moon","fiction_id":"88587","link":"https:\/\/www.royalroad.com\/fiction\/88587\/children-of-the-moon","tags":["LitRPG","Dungeon","Adventure","Fantasy","Mystery","Reader Interactive"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":448,"chapters_count":19,"last_update":1718543031,"description":"A strange woman chooses you as a child of the moon and assigns you the task of reuniting the moon star and thus saving the magical realm. But there are countless puzzles, mysterious gates and magical objects lurking along the way that could lead you to your goal or to the end.","description_hash":9194122599135073602},{"title":"Apocalyptic Wasteland: Cyber Era","fiction_id":"88586","link":"https:\/\/www.royalroad.com\/fiction\/88586\/apocalyptic-wasteland-cyber-era","tags":["Post Apocalyptic","Martial Arts","Sci-fi","Strong Lead","Action","Horror","Cyberpunk","Hard Sci-fi","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":90,"chapters_count":2,"last_update":1718511842,"description":"In a cyber world where technological advancements have exploded yet it resembles an apocalyptic wasteland, humanity has been transformed into baseline humans who no longer need to consume food for energy, surviving solely on recharging and replacing prosthetic limbs. Society is essentially in a state of anarchy. The only obligations of civilians are to pay the gene tax to their civil protectors and the scientific knight order, and to adhere to the Dyson principles. The gene tax consists of newborn babies from civilian families.\nIn this era, the class divide is as vast as a chasm. Civilians often have to sell their organs just to barely make a living. In this distorted and desperate time, Mike, with only half his head remaining, is picked up from a garbage heap. He was once a hero who led people to change the world. Now, after his defeat, he can only scavenge parts from the trash to piece together his body. Though he has forgotten many things, the one thing he remembers is his desire for revenge against this twisted and absurd world.","description_hash":3619618000369824328},{"title":"A cat named Schrodinger","fiction_id":"88585","link":"https:\/\/www.royalroad.com\/fiction\/88585\/a-cat-named-schrodinger","tags":["Time Loop","Urban Fantasy","Anti-Hero Lead","Strategy","Comedy","Drama","Historical","Mystery","Female Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":39,"chapters_count":1,"last_update":1718495146,"description":"Time has begun to loop on itself, like an ouroboros. Well... I say \"begun\" but time has been looping for... Huh, I actually don't know for how long. Well, it's been enough time for an ordinary housecat to develop sentience over thousands of years of pseudo evolution. Anyway, things have gotten weird lately (and I'm not talking about just impossible time loop weird), even through my personal definition of \"lately\" is admittedly, *ahem*  askew. Anyway, if you decide to follow me through my eventful journey. I have one piece of advice: \nRunning only attracts immortals","description_hash":4176709505482685287},{"title":"Howl in the moonlight","fiction_id":"88584","link":"https:\/\/www.royalroad.com\/fiction\/88584\/howl-in-the-moonlight","tags":["Anti-Hero Lead","Non-Human Lead","Adventure","Fantasy","Horror","Satire","Supernatural","Female Lead","Magic","Low Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":10,"view_count":215,"chapters_count":6,"last_update":1718615585,"description":"The story begins with a girl in a remote mountain village in Northern Europe. Verya is an orphan who lives with her uncle and aunt. Her uncle and aunt were mean to her and often abused her.One night, Verya got lost in the forest. She meets the werewolf Ryder. Rather than harm her, Ryder takes her back to his hideout.She and Ryder gradually fall in love. Veria learned the werewolf way of life, and she also learned to control the beast within her.However, Veria's uncle and aunt discovered her relationship with Leon. They angrily gather a group of villagers to hunt Ryder.Verya tried to stop the villagers, but it was too late. Ryder is killed by the villagers and Vilia is captured.Veria was sentenced to be burned at the stake. Before her execution, she transformed into a super werewolf and killed all the villagers.Veria fled into the forest, determined to take revenge on human society.She became a werewolf warrior who specialized in hunting cruel humans. She became mankind's nightmareBecame a werewolf warrior, specializing in hunting cruel humans. She became humanity's nightmare, also known as \"Howl at the Moonlight.\"Many years later, Veria met a kind-hearted human hunter. The hunter saw Veria's kindness and pain, and he was determined to help her.With the help of the hunter, Verya gradually learned to control her beast. She also learned to forgive those who had hurt her.\nVeria finally gave up revenge and lived a happy life with the hunter.","description_hash":-8782876623758636024},{"title":"Paramount","fiction_id":"88583","link":"https:\/\/www.royalroad.com\/fiction\/88583\/paramount","tags":["Urban Fantasy","Non-Human Lead","Sci-fi","Adventure","Fantasy","Male Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":23,"chapters_count":1,"last_update":1718495063,"description":"The Paramension, it's extremely modern, high tech, you can have an IPhone in your eyeball. The crime rate is extremely low, ParaPolice stand guard at practically ever corner. You could never be safer anywhere else. Then why am I so afraid?\nFollow Arthur Taylor, a man oblivious to the Paramension. Having spent his entire life beforehand in the Normension, he's never been on any kind of register. For this reason, rogues swarm around him, desperate for a member off the radar to commit their highly illegal jobs. Many rogue groups try to butter him up, and the seedy side of the Paramension comes to light, what can Arthur possibly do to protect himself?With an obsessed rogue group leader, and the ParaPolice head officer hot on their tails, safety couldn't be more paramount.","description_hash":8774424397200158260},{"title":"A Fortress of Pebbles","fiction_id":"88582","link":"https:\/\/www.royalroad.com\/fiction\/88582\/a-fortress-of-pebbles","tags":["Urban Fantasy","Female Lead","Sci-fi","Contemporary","Adventure","Fantasy","Magic","Low Fantasy"],"lable":"Original","following_count":5,"rating":5.0,"page_count":4,"view_count":85,"chapters_count":2,"last_update":1718566251,"description":"Former guardians of Earth must take refuge there, inadvertently becoming the apocalypse they are sworn to prevent.","description_hash":-3662828893989373294},{"title":"Historgia: The Sentry","fiction_id":"88581","link":"https:\/\/www.royalroad.com\/fiction\/88581\/historgia-the-sentry","tags":["War and Military","Male Lead","Sci-fi","Secret Identity","Action","Satire","Strategy","Technologically Engineered"],"lable":"Original","following_count":2,"rating":0.0,"page_count":14,"view_count":109,"chapters_count":3,"last_update":1718584287,"description":"The Republic of Coronias, a medium-sized archipelagic nation with four major islands, faced a major catastrophe. On the 3rd day of the 3rd month, an attack occurred on the property of one of the country's wealthiest men by an unknown faction. The government is seeking answers, and its law enforcement and intelligence services are working diligently to uncover the truth behind the attacks.\nLieutenant Colonel Joel Tolentino, a member of the country's intelligence services, the National Intelligence Services, has vowed to solve the issue. Unbeknownst to him, some other forces and factions could hinder his progress and even threaten his life. What will his future hold as he continues to uncover the truth?","description_hash":-6127168465320821154},{"title":"Error in the System","fiction_id":"88580","link":"https:\/\/www.royalroad.com\/fiction\/88580\/error-in-the-system","tags":["GameLit","Female Lead","Slice of Life","Secret Identity","Strong Lead","Adventure","Fantasy","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":16,"view_count":156,"chapters_count":3,"last_update":1718611205,"description":"In the fantastical world of Questoria, every child receives their first class from the System when they are ten, setting them on their path in life.\nMalissa Cobber was a typical ten-year-old awaiting her class assignment with some trepidation. But when the day of the ceremony arrived, a System error changed her life forever. Instead of a common class, Malissa was granted the unheard-of Administrator class, giving her unprecedented access to the System’s inner workings and secrets. Thrust into a role she never expected, Malissa must navigate the complexities of her new abilities.\nJoin Malissa on an extraordinary journey as she learns to harness her unique powers, uncovers hidden truths about Questoria, and discovers her own potential. Along the way, she makes allies and enemies, faces formidable foes, and unravels the mysteries of the System that governs their world.","description_hash":5172751010690402209},{"title":"The Core Problem","fiction_id":"88579","link":"https:\/\/www.royalroad.com\/fiction\/88579\/the-core-problem","tags":["LitRPG","Dungeon","Anti-Hero Lead","Super Heroes","Strategy","Action","Adventure","Comedy","Fantasy","Male Lead","Magic","Grimdark","High Fantasy","Villainous Lead","Progression"],"lable":"Fan Fiction","following_count":38,"rating":4.95,"page_count":93,"view_count":910,"chapters_count":7,"last_update":1718597887,"description":"Izuku Midoriya was busy recovering from the aftermath of his battle with Overhaul when suddenly he found himself transported to another world... together with Tomura Shigaraki, the man who has tried to kill him and his friends multiple times and made destroying society itself one of his life goals. \nNow they're forced to share a single body while managing a magical Dungeon (a giant death trap for adventurers), all at the behest of a definitely insane deity responsible for their appearance in this world. While constantly arguing and trying to make each other's life as miserable as possible. Oh, and their final mission is to kill a hero of all people (and only one of them is enjoying the prospect). \nThey have been isekai'd against their will and now they're going to make that everyone else's problem.\n[Once we're done with the release backlog, this fic will be published weekly, usually on Fridays].","description_hash":-6500727176973247340},{"title":"The System Awakens [LitRPG]","fiction_id":"88578","link":"https:\/\/www.royalroad.com\/fiction\/88578\/the-system-awakens-litrpg","tags":["LitRPG","Dungeon","Post Apocalyptic","Ruling Class","Xianxia","Action","Adventure","Drama","Fantasy","Martial Arts","Male Lead","Strong Lead","Magic","Wuxia","High Fantasy","Progression","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":17,"rating":4.5,"page_count":77,"view_count":1511,"chapters_count":16,"last_update":1718555574,"description":"Patreon: https:\/\/patreon.com\/TheDanzaRead up to 50 chapters ahead-Synopsis:\nJohn Jones, a young man grappling with personal turmoil and family mysteries, is thrust into an extraordinary adventure when his world is integrated into the Multiverse. During a seemingly ordinary camping trip, he encounters a mysterious system that transforms his reality, introducing him to a new universe filled with challenges, battles, and the pursuit of strength. Guided by the system, John navigates through a perilous tutorial designed to test his survival skills and resilience.\nThroughout his journey, John is joined by his friends and family, including his childhood friend Emma, his twin sister Olivia, and others who are also navigating this new world. As they face monstrous beasts and explore hidden dungeons, their abilities and resolve are continuously tested.\n'The System Awakens' is a tale of transformation, growth, and the relentless pursuit of answers in a multiverse where survival hinges on one's ability to adapt and overcome.\n[Welcome to the Multiverse.]\n-\nWhat to expect:\nYou can think of 'The System Awakens' as a cultivation novel similar to I Eat Tomatoes' novels with a system like 'The Primal Hunter' and 'Defiance of the Fall.'\nIn this novel, I try to blend my two favorite genres, which are Xianxia and LitRPG.\nLastly, I try to make my characters as realistic as possible. Most novels in this kind of genre have characters and MCs that are either sociopaths or have very loose morality straight out the gate and have no emotions when killing people. I want my MC to be like what I expect most people would be if they were thrown into this scenario. He will hate killing people. He and most others will struggle with it and try to push it off as much as they can until it's too late, and it either causes their deaths or they finally come to terms with their new reality.\n-At least 5 chapters a week (Mon-Fri)-\nDiscord: https:\/\/discord.gg\/ZYaXXtHxWv","description_hash":-7122898757623210381},{"title":"4. LUNACY [TALES FROM THE CROSSROADS vol. 1]","fiction_id":"88577","link":"https:\/\/www.royalroad.com\/fiction\/88577\/4-lunacy-tales-from-the-crossroads-vol-1","tags":["Martial Arts","Male Lead","Sci-fi","Strong Lead","Action","Horror","Short Story","Supernatural","Magic","Mythos","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":27,"chapters_count":1,"last_update":1718476519,"description":"Tales from the Crossroads is a series of 17 micro-fiction horror stories set in the Primordial Crossroads Universe.\nLUNACY explores one man's insane attempt to fight an unspeakable horror.","description_hash":6719315623079332148},{"title":"Path of the Stars","fiction_id":"88576","link":"https:\/\/www.royalroad.com\/fiction\/88576\/path-of-the-stars","tags":["Progression","Non-Human Lead","Slice of Life","Drama","Adventure","Romance","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":100,"chapters_count":3,"last_update":1718611205,"description":"When Salim, a lynx, finally establishes his own territory after a long and arduous journey, life plays its own game with him. Strange lynxes in his territory, whose lives have often already been extinguished, and his past do not make his life easy, even in freedom, and the lynx has to ask himself what is behind it all and how he can escape his fate.","description_hash":-7662143665943108037},{"title":"Eternal Return [English]","fiction_id":"88575","link":"https:\/\/www.royalroad.com\/fiction\/88575\/eternal-return-english","tags":["Time Loop","Grimdark","Psychological","Multiple Lead Characters","Adventure","Fantasy","Mystery","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":40,"chapters_count":1,"last_update":1718474291,"description":"A first-year psychology student awakens in a dark cell, chained and with no memory of his identity except the vague image of his dog, Ruffus. Haunted by a cycle of deaths and resurrections, he must unravel the mystery of his imprisonment and the reason for his selective amnesia. With each death, he develops new abilities and uncovers fragments of a betrayal that left him stranded. As he battles a relentless guard and an invisible poison, he must find a way to escape and reclaim his true identity before the loop becomes his eternity.","description_hash":781185700168633453},{"title":"The Legend of Shishen","fiction_id":"88574","link":"https:\/\/www.royalroad.com\/fiction\/88574\/the-legend-of-shishen","tags":["Reincarnation","Xianxia","Comedy","Strong Lead","Action","Fantasy","Martial Arts"],"lable":"Original","following_count":1,"rating":0.0,"page_count":12,"view_count":88,"chapters_count":2,"last_update":1718602694,"description":"It is quite normal to have a hangover after spending the entire weekend partying with friends at a bar.\nWhat is not normal, is waking up as a humanoid stone abomination after said party, not knowing what is going on.\nAnd why the hell am I at the bottom of a chasm anyway?","description_hash":-5380125845351245096},{"title":"Parallels","fiction_id":"88573","link":"https:\/\/www.royalroad.com\/fiction\/88573\/parallels","tags":["Urban Fantasy","Psychological","Multiple Lead Characters","Sci-fi","Slice of Life","Fantasy","Horror","Cyberpunk","Female Lead","Secret Identity","Magic","Genetically Engineered ","Technologically Engineered","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":27,"view_count":84,"chapters_count":3,"last_update":1718545132,"description":"His own but alien face lazily twists in the reflection. Obsessive thoughts fill your head again. Are they obsessive? Are they thoughts? Are they his? Or is this choice a forced idea? Invisible networks of consequences of seemingly insignificant choices increasingly entangle the heroes, so that at one moment they completely fetter their movements.\nJimi is a spacer. This year he enters the Academy chosen by his dad. He spent his entire life on the lands of his parents. Jimi begins a new life and for the first time, he does not compare himself to his dad. For the first time, he makes decisions himself. But at some point in the city, Papa’s colleague, who happened to be in the same place at the same time, confuses Jimi with him...\nKozet is a doctor. He is being graduated this year. At a friend's party, he meets the son of his father's former colleagues. They start a conversation, and everything seems to be fine, but Kozet's father is the only survivor of an accident at the research center years ago where those colleaguesof his died. In the same accident, Kozet’s mother died, about whom he knows nothing. And only the father knows what happened there then...\nMonica is an enchanter. Until her graduation from the Academy, due to Ma's ban, her way out of Montis was prohibited. She's not gifted, and she doesn't want to be. But everything changes when suddenly her Gift awakens. And mom seems to be more than aware of why...The author is translating their book to English from their native language. The book is finished.","description_hash":4340495446296679955},{"title":"DESOLATOR","fiction_id":"88572","link":"https:\/\/www.royalroad.com\/fiction\/88572\/desolator","tags":["LitRPG","Villainous Lead","Martial Arts","Grimdark","Non-Human Lead","Action","Adventure","Reader Interactive","Supernatural","Strong Lead","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"\"Have you the courage- no, I should say the appetite- to devour a nation?\"\nWelcome to DESOLATOR, a second-person self-insert LitRPG with audience interaction! This story follows the nameless Desolator, who awakens in an unfamiliar land with no memory of who it once was. All it feels is a deep, insatiable hunger, and a desire to sate that hunger by any means. Possessing an innate skill in combat, the Desolator quickly forms a pact with a Goddess, who can escalate him even further by transforming its wanton violence into power. In exchange, the Desolator must perform an unspeakable sin...\n\nA fast-paced and action-packed story that's full to bursting with bloody combat, meaningful level-ups, and a great sense of exploration and adventure into fantastical lands. DESOLATOR updates every Monday, Wednesday, and Friday. \n\nDESOLATOR allows the audience to interact with the story at certain intervals, usually major points in the story where audience decisions will have a lasting effect on the remainder of the narrative. When an audience prompt is given, the next chapter is skipped, and the poll is finalized on that same day; e.g. if a poll is set on Monday, Wednesday's chapter will be skipped and Wednesday is also the day that votes will be tallied. The next chapter would then come out on Friday.","description_hash":3701452170208559122},{"title":"Ambassadors","fiction_id":"88571","link":"https:\/\/www.royalroad.com\/fiction\/88571\/ambassadors","tags":["Psychological","Multiple Lead Characters","Harem","Drama","Fantasy","Female Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":21,"view_count":60,"chapters_count":2,"last_update":1718497158,"description":"Sometimes walking in someone else's shoes is instructive. Other times it can destroy your entire life!\nElena and Brooke are from opposite worlds. \nElena is an e'Silea darling. She spent her life pampered by her mother's slaves. She was taught about her position in the True and Natural Order and raised to become a fighter for her country. Brooke is the daughter of a noblewoman in the service of the king. She has been raised to marry a wealthy nobleman and take her rightful place among the gentry. When their mothers are called as Ambassadors in the opposite nations, the two girls are transplanted into each other's worlds. They begin to see the dark realities hidden inside their own privileged lives.\nBut when the consequences of facing truth begins to strain relationships and even break laws, both Elena and Brooke must decide how far they are willing to go to fight for their new beliefs. And if they are willing to destroy their own nation to bring dangerous changes.\nDarkness only exists until someone lights a fire.","description_hash":-4281506578920122194},{"title":"The Secret Service","fiction_id":"88570","link":"https:\/\/www.royalroad.com\/fiction\/88570\/the-secret-service","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","Strategy","Action","Adventure","Drama","Fantasy","Reincarnation","Martial Arts","Male Lead","Strong Lead","Multiple Lead Characters","Non-Human Lead","Grimdark","Low Fantasy","Steampunk"],"lable":"Original","following_count":4,"rating":0.0,"page_count":7,"view_count":52,"chapters_count":1,"last_update":1718474201,"description":"Chains of unfortunate events came to Adolph. The life of his parents was just ended by a recent tragic accident. His heart then collapsed and he was told his days on Earth were numbered. His friends from then on ceased to be his \"friends\". No funds, no power. He's got nothing - even hope, nor dream... nor life. Everything was extinguished. Now, this teenager wanted to end it - once and for all. \n\"Death would be a mercy.\" \nHe closed his eyes and yearned for his death. But instead of dying, he was reincarnated to a new world. A mirror in front of him bore a blurry reflection. He was in full body armor wearing an unusual, wolf-like mask. Confused, he sought to question what was happening but the words won't come out of his mouth. He couldn't blink his eyes, couldn't breathe air, nor could he feel anything. Then when he took out one of his gloves, his hand wasn't there. The sudden realization rushed to his mind. \nAdolph... became an armor? \nThis was the start of Adolph's legend and the \"secret service\" that he was about to get caught up with.","description_hash":5740015073866216282},{"title":"Rose of the Frosted Garden","fiction_id":"88569","link":"https:\/\/www.royalroad.com\/fiction\/88569\/rose-of-the-frosted-garden","tags":["Time Travel","Progression","Ruling Class","Strong Lead","Tragedy","Fantasy","Historical","Romance","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":25,"view_count":117,"chapters_count":5,"last_update":1718476380,"description":"The night Rosalia celebrated her official debutante ball on her sixteenth birthday, her only wish was for the banquet to end early on a peaceful note. But the sudden arrival of the uninvited 'Royal Rat' rendered her wish useless as she found herself being the main star of gossip that was sure to last long.\n\"I know your biggest secret too,\" the Second Prince, infamously known as the 'Royal Rat,' whispered in her ear as he took her first dance as an official young adult instead of her fiancé, the Crown Prince.\nHe, whom she didn't know at all, claimed he knew her better than anyone.\nThe parallel lines that could never meet each other changed their path, and the cogs of fate began to turn in an entirely different direction. \nThat night, the future found a new way forward.\n\n*I have also posted this Novel on Webnovel app\nhttp:\/\/wbnv.in\/a\/b1iU4nu","description_hash":4278644057481129061},{"title":"undead reaper agency","fiction_id":"88568","link":"https:\/\/www.royalroad.com\/fiction\/88568\/undead-reaper-agency","tags":["Urban Fantasy","Strategy","Comedy","Male Lead","Action","Adventure","Mystery","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"My name is Angelo Leone, and I'm a writer. I think I was, but now isn't the time for that. Listen hear and listen good, I got an story for you. What if I tell you death and chaos is at war? couldn't believe me. what if I say necromancy an vampire are real? still no. Finally, what if I told you is all real. only exist in the world between the living and the dead.\nAnd how should I know? that easy.\nI'm dead","description_hash":-4164459072727128652},{"title":"A Shadow in the Mist","fiction_id":"88567","link":"https:\/\/www.royalroad.com\/fiction\/88567\/a-shadow-in-the-mist","tags":["LitRPG","Post Apocalyptic","Multiple Lead Characters","Action","Adventure","Fantasy","Romance","Male Lead","Female Lead","Magic","GameLit","Low Fantasy"],"lable":"Original","following_count":6,"rating":0.0,"page_count":7,"view_count":39,"chapters_count":1,"last_update":1718474161,"description":"563 years after the Breaking of the World a young man named Cain Le’meer is given a Relic his father; a Mist Relic, the element considered weakest by society. Taking the oaths of a Warden he is marred to the aspirant Aranea making her a Weaver. The two are offered a chance to study at the academy of Mistwall to train in the etheric arts and combat in a high ether zone.\nAranea will discover her talent with Wards and be hailed as a prodigy. Cain will struggle to prove himself as he wrestles with old fears and feelings of weakness and inadequacy. The trails of life will assail them both as they grow in power unaware of the threats growing in power around them.\nAranea will be forced to decide who she is and what she believes; Cain will be forced to walk alone and discover just how strong he really is. Both will reshape their world as the ever present dangers of Warlocks, djinn and the fell men emerge from the Mist.","description_hash":5217733477972689096},{"title":"The Athlethan Chronicles - The Scabbard of Eternity","fiction_id":"88566","link":"https:\/\/www.royalroad.com\/fiction\/88566\/the-athlethan-chronicles-the-scabbard-of-eternity","tags":["War and Military","Female Lead","Adventure","Fantasy","Romance","High Fantasy","Ruling Class"],"lable":"Original","following_count":1,"rating":0.0,"page_count":13,"view_count":54,"chapters_count":2,"last_update":1718616786,"description":"In an age when the world was but a fledgling realm, where the forces of darkness loomed, a single blade, forged from the sacred Scatach metal, stood as the embodiment of hope. Another sword, crafted from the rarest of earth's elements, was melted down to give life to the twelve mystical swords of the twelve sovereigns, among them Amerghin, whose heart was enticed by the malevolence of the Dark Lord, Mac Roth. He was beckoned to serve as a sub-Lord, destined to rule the entire world. Yet, in the first great battle, these twelve enchanted swords met their doom, their fragments reforged within the blazing forges of Sennol Uathach to give birth to the mighty blade known as Mac-Roth.\nIn a moment of destiny, Tuatha unsheathed Salchah, the bane of Senol Uathach, from the Scabbard of Athlethan, raising it high. \"Behold, this is the very blade that has been passed down through the ages, from my ancestors and back to Daanan Findabair, the inaugural Riangbra warrior. Legend has it that he communed with the very creator and was gifted this blade.\"\n\"My true name is Tuatha Daanan Findabair, son of Aillel, the sovereign of Ath-Lethan. I am embarked upon a quest to rally the armies of all nations to wage a war against Mac-Roth.\"\nAbove all, Amerghin coveted Salchah and the Scabbard of Athlethan. He held knowledge of its hidden power, that the  ruler and guardian of the sword and its scabbard would be granted an extended life. This was the enigmatic force concealed within this coveted relic. The Dark Lord himself had drawn from a similar well to prolong his existence, but the source of his power was steeped in darkness, emanating from the deep recesses of the earth's crust. In contrast, the Scatach steel's power hailed from the stars and bore within it a luminous essence, one of healing and benevolence. However, these virtues were not the desires of Amerghin. His hunger was for power, and power alone. Only one obstacle stood in his way - Tuatha, the bearer of the Scatach Sword called Salchah encased within the Scabbard of Athlethan. Alongside his companions and newfound love, Tuatha embarked on an epic odyssey through the uncharted territories, seeking his own destiny and answering the fervent cries of the people of the deep lands.","description_hash":-501132107286747718},{"title":"Empire of Light","fiction_id":"88565","link":"https:\/\/www.royalroad.com\/fiction\/88565\/empire-of-light","tags":["Progression","Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":47,"view_count":174,"chapters_count":4,"last_update":1718496825,"description":"Stifled by years of familial pressure, Storn has spent his life training for a future he may never have. Despite being heir to the leader of largest country in the Empire of Light, he wants nothing more than to leave it behind and make it on his own. With his future on the line, will he choose between a life of safety and luxury or risk it all to forge his own path?\nGarren is on a mission for the Empire, tracking down rebels and bandits on his first mission as the unproven leader of a squad of knights. Supervised by the man who killed his parents he arrives in the Molian city of Glennfall, a backwater town dealing with civil unrest in the face of the rebel army. In his investigation, Garren suspicious evidence regarding the rebels and their origin. Is he willing to sacrifice what little is left of his morals to keep his position in the well-respected Order of Excellence.\n\nWhat to expect:\n - Weekly updates!\n - Good grammar and spelling\n - Well written story (hopefully, its my first time writing anything longer than an essay)\n - Relatively fast paced and action packed\n - Two main POV characters\n - An ending! I have everything planned and although I might make some changes as I go, I know when and where the story will finish\n\np.s I did the current cover and will be looking for an artist to make a better one ASAP, I will credit them here when I get it done","description_hash":6438712104060949570},{"title":"I Got a Cheat Skill in Another World Fanfic ","fiction_id":"88564","link":"https:\/\/www.royalroad.com\/fiction\/88564\/i-got-a-cheat-skill-in-another-world-fanfic","tags":["LitRPG","Reincarnation","Male Lead","Harem","Action","Adventure","Fantasy","Romance","Attractive Lead"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":1,"view_count":25,"chapters_count":1,"last_update":1718474103,"description":"dude gets reincarnated into an anime, fun ensues!\nHavent decided how thoroughly intimate type scenes will be so clicked it just incase lol.","description_hash":-7775440387018850803},{"title":"King of Thieves","fiction_id":"88563","link":"https:\/\/www.royalroad.com\/fiction\/88563\/king-of-thieves","tags":["LitRPG","Dungeon","Anti-Hero Lead","Sci-fi","Action","Adventure","Fantasy","Magic","Low Fantasy","Mythos","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":84,"chapters_count":3,"last_update":1718604046,"description":"In Ancient Egypt, the world's best thief and tomb raider has all of his steals, chases, and exploits charted, numbered, and saved by an unknown being. But all of the thief's exploits are at risk of being lost forever while seeking buried treasure and being chased by an elite group of the Pharaoh's soldiers. Told in present tense, light LitRPG.","description_hash":-1001332928002499594},{"title":"These Sacred Bones","fiction_id":"88562","link":"https:\/\/www.royalroad.com\/fiction\/88562\/these-sacred-bones","tags":["Male Lead","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":76,"chapters_count":2,"last_update":1718458248,"description":"Rian has always looked up to Arwel, his older brother. When Arwel joins a dangerous man with plans that could endanger the entire country of Virida, Rian is determined to stop them and get his brother back. To have any chance of saving his brother and his country, Rian must accept a fate he's terrified of. He must become the apprentice of a necromancer, and he must become the Speaker of the Dead.","description_hash":-3529367875681836413},{"title":"Save the Reaper, Save the World: A Tooms and Graves Adventure (An Urban Fantasy Mystery)","fiction_id":"88561","link":"https:\/\/www.royalroad.com\/fiction\/88561\/save-the-reaper-save-the-world-a-tooms-and-graves","tags":["Urban Fantasy","Comedy","Female Lead","Adventure","Fantasy","Mystery","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":58,"chapters_count":2,"last_update":1718592646,"description":"When a client shows up on their doorstep, kills himself, and comes back to life, Tooms and Graves are initially convinced it's a repeat of the zombie apocalypse from last year. Unfortunately, it's much worse: the client was dating the regional reaper and seems to have driven her off. Now nobody in the city can die, which sounds fun but is actually Not Super Great on a cosmic scale. The client is convinced the reaper's been kidnapped by a doomsday cult to hasten along the end of days. This sounds crazy from someone who shot himself in the head to make a point, but after some interesting portents, Graves is starting to think maybe he's right. Tooms thinks that the client's nuts and that Graves is a bit too excited about the apocalypse, but at the end of the day he'd still like to get paid. So look out, doomsday cults, unearthly bureaucracies, and nutty diabolists! Tooms and Graves are here to save the reaper and save the world!\nA modern urban fantasy buddy cop detective story. The humor is generally dark comedic elements mixed with slap-sticky dialogue. Think Monty Python, Terry Pratchett, and the Cornetto triology, with a dash of Key and Peele thrown in. \nContent warnings: death is generally treated light-heartedly here, as part of the comedy is about people not dying, but there are attempts at suicide and the aftermath sketched out in vague terms. There is also discussion about the ethics of suicide, murder, and euthanasia when it is known that there is no risk of death. Some of the characters are entertained by performing acts that would normally be considered suicide. I consider attempted suicide self-harm, which is why I've marked the Sensitive Content tag. I will give content warnings for chapters with potentially distressing content.\nUpload schedule: one chapter of about 2000 words a day until I'm through my backlog","description_hash":-4714461038084071629},{"title":"GHOST MINDS","fiction_id":"88560","link":"https:\/\/www.royalroad.com\/fiction\/88560\/ghost-minds","tags":["Virtual Reality","Time Loop","Post Apocalyptic","Sci-fi","Action","Fantasy","Mystery","Mythos","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":17,"chapters_count":1,"last_update":1718455912,"description":"The earth is a barren wasteland. the remaining survivors must seek refuge with strange gods, or fend for themselves against the nightmares in the darkness. either way, the only hope of humanity is somewhere unseen, far beyond their imagination.","description_hash":-4652014676374438262},{"title":"Swordfall","fiction_id":"88559","link":"https:\/\/www.royalroad.com\/fiction\/88559\/swordfall","tags":["Dungeon","Anti-Hero Lead","War and Military","Multiple Lead Characters","Action","Adventure","Fantasy","Low Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":74,"chapters_count":2,"last_update":1718479234,"description":"As two houses fight over a kingdom, three brothers must partake in annual ritual that lessens the bloodshed.","description_hash":2508952262739837890},{"title":"Infernal Apocalypse ","fiction_id":"88558","link":"https:\/\/www.royalroad.com\/fiction\/88558\/infernal-apocalypse","tags":["LitRPG","Progression","Post Apocalyptic","Non-Human Lead","Sci-fi","Action","Adventure","Fantasy","Male Lead"],"lable":"Original","following_count":8,"rating":0.0,"page_count":14,"view_count":214,"chapters_count":3,"last_update":1718629252,"description":"'I've stayed calm my entire life, whether it was the saddest moment or the happiest moment, I was always calm. I even stayed calm when the world ended and was thrust into a forest to fend for myself. Perfectly normal for me' - Raizen\nFollow Raizen as he journeys through the Apocalypse, growing in strentgh and influence and of course learning a lot more about himself.\nLet your flames burn Eternally, and your spear be ever swift","description_hash":7110097039715132996},{"title":"My Siblings are About to Start a Civil War so I Decided to Make a Village","fiction_id":"88557","link":"https:\/\/www.royalroad.com\/fiction\/88557\/my-siblings-are-about-to-start-a-civil-war-so","tags":["Reincarnation","Urban Fantasy","War and Military","Comedy","Male Lead","Fantasy","School Life","Strong Lead","High Fantasy","Ruling Class","Technologically Engineered"],"lable":"Original","following_count":2,"rating":4.0,"page_count":3,"view_count":48,"chapters_count":1,"last_update":1718455883,"description":"Lucas Arthurias was born as the 6th Prince of the Royal family, he tried to relinquish his succession rights and royal title, but instead, he got sent to a frontier village.  Why does he want to do it? Because those idiots will plunge the Kingdom into a full-blown civil war and he wants no part of it.\n.\n.\n.\nJust something I thought of for fun.","description_hash":-5869468618036803049},{"title":"Immortal Soul","fiction_id":"88556","link":"https:\/\/www.royalroad.com\/fiction\/88556\/immortal-soul","tags":["Reincarnation","Progression","Xianxia","Non-Human Lead","Tragedy","Action","Fantasy","Romance","Male Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":15,"view_count":43,"chapters_count":2,"last_update":1718472490,"description":"Stealing from 11-year-old young masters is both lucrative and morally right. I'm a landscaper by trade, one of the first in the Thunder Eagle sect. As an outer disciple, I also work for tips. That used to be enough until I got a girlfriend.Ok, it's not what you think. I'm not showering her with new Dragon Fang flying swords and all the beauty pills I can funnel down her throat. Her clan is in a bad situation, barely keeping it together, by the way she says it. She's also too prideful to take the stones herself so I drop off the money. It's gotten better, but even fleecing ten young masters a week isn't enough to keep the lights on. Fortunately, a tournament is coming up, and my demand has never increased.This is the story of how love killed me.","description_hash":6588207064467809606},{"title":"The Awakening of the Archmage","fiction_id":"88555","link":"https:\/\/www.royalroad.com\/fiction\/88555\/the-awakening-of-the-archmage","tags":["Progression","War and Military","Adventure","Fantasy","Mystery","Short Story","Magic"],"lable":"Original","following_count":3,"rating":3.0,"page_count":44,"view_count":305,"chapters_count":10,"last_update":1718553607,"description":"Synopsis:\nIn a world where magic is an integral part of life, a centuries-old conflict rages between the Kingdoms of Light and the Shadow Realms of Darkness. Amidst these tensions lives Tavian, a young man of humble origins, who becomes aware of his magical abilities only late in life.\nWhen Tavian makes an unexpected discovery during a ceremonial ritual at the Academy of Mages, his life is forever changed. He stumbles upon an ancient artifact that contains the essence of a legendary archmage – a power that had lain dormant for centuries. Suddenly, Tavian finds himself at the center of a conspiracy that threatens to upset the balance of power.\nWith his newfound power and the loyal friends he gains along the way, Tavian must not only decipher the secrets of the artifact but also learn to master his own abilities. For only then can he defeat the darkness that threatens to plunge the world into chaos and ruin.\nThus begins the journey of the young mage Tavian, in search of his destiny and the truth behind the legends of the past.\n----------------------------------------\nI used AI to help translate because i suck.\nAnyway this is my first time writing anything, hope it brings you some joy and ~please have mercy on me, take it easy on my heart~ lets see if anyone gets that\nCover is AI","description_hash":169566721949130563},{"title":"The City of Sin","fiction_id":"88554","link":"https:\/\/www.royalroad.com\/fiction\/88554\/the-city-of-sin","tags":["Urban Fantasy","Progression","Strategy","Multiple Lead Characters","Sci-fi","Action","Fantasy","Romance","Cyberpunk","Supernatural","Female Lead","Strong Lead","Genetically Engineered ","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":26,"chapters_count":1,"last_update":1718455856,"description":"Set in the year 2044, The City of Sin follows the story of a group of unlikely heroes as they unravel the mystery of a corporate conspiracy to control the government.\nNew Chapter Every Friday","description_hash":8865388899205169476},{"title":"Elemental Manipulator","fiction_id":"88553","link":"https:\/\/www.royalroad.com\/fiction\/88553\/elemental-manipulator","tags":["LitRPG","Urban Fantasy","Dungeon","Post Apocalyptic","War and Military","Adventure","Fantasy","Sci-fi","Contemporary","Martial Arts","Male Lead","Magic","Grimdark","Low Fantasy","High Fantasy","Mythos","First Contact","Hard Sci-fi","Progression","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":121,"chapters_count":3,"last_update":1718471618,"description":"He's just a bartender from New Orleans, and now the apocalypse is here.\nWhat will he do? How will he survive the Tutorial?\nIs his mindset strong enough to face devils, fae and all manner of beast?\nOr will he succumb to the System's antics?\nA Cultivation Journey from the perspective of a smart ass bartender. He will face waves of beasts, try to help mitigate human losses. Thrown into an integrated universe can he survive? Will the other races of Fae and Demon alike shatter humanity's claim on their new shared world? Only the journey will tell us. And with his low luck, it seems to be harrowing indeed.","description_hash":8636499749927014381},{"title":"Rise of a Planeswalker - My Wife is an Immortal Cultivator","fiction_id":"88552","link":"https:\/\/www.royalroad.com\/fiction\/88552\/rise-of-a-planeswalker-my-wife-is-an-immortal","tags":["LitRPG","Portal Fantasy \/ Isekai","Time Travel","Progression","Xianxia","Action","Adventure","Fantasy","Romance","Reincarnation","Martial Arts","Slice of Life","Male Lead","Strong Lead","High Fantasy","Mythos","Soft Sci-fi","Attractive Lead"],"lable":"Original","following_count":18,"rating":4.83,"page_count":21,"view_count":242,"chapters_count":2,"last_update":1718476335,"description":"Qin Yun remembered the days when he was just another scientist working on an inter-dimensional Matter Shift device until it blew in his face. In fact, he remembered all his lives following that incident.\nSome lives were spent as ordinary men just going through life, others as heroes seeking wealth and glory. Still, they all had one thing in common: his death. Indeed, he would always die in the end, which always gave him a headache. Was there a way to live forever?\nEven when he was reborn into worlds where immortals roamed the land, he always found a way to get himself killed. Enough was enough. This time, he would remain low-key and cultivate immortality.\nThere was only one problem. Qin Yun was supposed to marry an inner disciple of an immortal sect who had fallen from grace. In an incident, she had lost her beauty and cultivation. Can Qin Yun help her reach the peak again, all the while keeping a low profile?\n**********\nThis is a side project for now. I write it when I find the time and motivation, so don't expect constant updates. Its schedule will largely depend on the engagement I get from it. So, if you want more, you know what to do.\nAlso, be sure to check out my other series, Curse of the Crimson Moon.","description_hash":7977789523086724953},{"title":"Eyes of a hunter","fiction_id":"88551","link":"https:\/\/www.royalroad.com\/fiction\/88551\/eyes-of-a-hunter","tags":["Anti-Hero Lead","Male Lead","Tragedy","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":18,"chapters_count":1,"last_update":1718455820,"description":"\"They thought themselves as the strongest, that no creature can defeat them. I'll show them how mortal they are\"\n- Sam, The Bane of Demons","description_hash":-5175627767679839755},{"title":"On Cosmic Tides","fiction_id":"88550","link":"https:\/\/www.royalroad.com\/fiction\/88550\/on-cosmic-tides","tags":["LitRPG","Progression","Multiple Lead Characters","Slice of Life","Strong Lead","Action","Adventure","Fantasy","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":16,"rating":5.0,"page_count":106,"view_count":1023,"chapters_count":12,"last_update":1718627462,"description":"Laurel Stormblade, Master Vortex Cultivator of the Eternal Archive, veteran of a hundred battles, and pre-eminent warrior of northern Alrasia was on a routine mission for her sect when things went sideways. Trapped and betrayed, she went to fight her way out, only to find her attackers gone and the way clear. Returning to the surface, the oddities continued. The world has been warped into something unrecognizable. Ruins and a mana desert replaced the cheerful, bustling town she’d left only hours before. \nAlone and far from help, or anyone who knows what’s going on, Laurel is forced to trek through unfamiliar countryside to get back to the sect that has been her home for over a century. Join Laurel as she unravels the mystery of her imprisonment, discovers a world that is nothing like what she remembers, and nurtures the sect that’s given her everything. \nThis slice of life adventure crosses continents and oceans, dives into intrigue, and reckons with navigating a world where the ascendance of magic is far from guaranteed. With new friends, a passel of students, and a new perspective, Laurel will do whatever she must to ensure the Eternal Archive becomes entrenched as a beacon of power and knowledge on Decorra and the wider cosmos beyond.","description_hash":-5716551431585641729},{"title":"Kee's Chronicles :The Forgotten Odyssey","fiction_id":"88548","link":"https:\/\/www.royalroad.com\/fiction\/88548\/kees-chronicles-the-forgotten-odyssey","tags":["Portal Fantasy \/ Isekai","Time Loop","Ruling Class","Martial Arts","Male Lead","Action","Adventure","Fantasy","Romance","Reincarnation","Slice of Life","Strong Lead","Magic","High Fantasy","Genetically Engineered "],"lable":"Original","following_count":3,"rating":2.88,"page_count":25,"view_count":504,"chapters_count":10,"last_update":1718528787,"description":"I am the Beginning. Do you know what that is ? Let me tell you,\nThe beginning of the universe the very concept of beginning was formed, thousands of worlds were brought into existence, various beings were brought to life and left to evolve over trillion of millennia, however after the destruction of the first world the concept of the end came, it came and destroyed or rather ended the world out of existence itself while the beginning created more. The Beginning and The End two opposite powers or rather concepts that over thousands of centuries evolved crystallizing their concept into cores that were hearts and humanized. The Beginning Created the universe System after a truce formed with End once they both gained a heart they used their powers to help the evolution of countless civilizations. This Birthed the era of Gods where countless being attained the status of gods. The gods who also had conceptual powers also got administrative access to the system allowing them to form apostles and recruit people or believers strengthening their power and concepts of many gods.However no matter how many new gods were created or ascended, and no matter how strong they got or how hard they trained they were never a match for the creators. \nThat is who I am and this is my story.\nP.S.Authors Note-Its going to be a super long story so don't expect any thing related to the synopsis till the novel is like 40 % complete and i plan for at least 2-4 major arcs before even considering it.The starting 40 % is similar to an isekai the main plot will come after.I invite constructive criticism about my writing since this will be my first book but please do leave a reason for it when you comment\/review. Also an advance notice that update schedule is not fixed since i mainly make my own artwork and this is more like a weekend hobby.","description_hash":3527792242690643632},{"title":"Alvyrision ","fiction_id":"88547","link":"https:\/\/www.royalroad.com\/fiction\/88547\/alvyrision","tags":["Portal Fantasy \/ Isekai","Anti-Hero Lead","Secret Identity","Action","Fantasy","School Life","Supernatural","Magic","High Fantasy","Villainous Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":31,"view_count":295,"chapters_count":11,"last_update":1718592428,"description":"In the mystical land of Agryz, Arx Von Azarkey trains to master his self-created sword technique, Zelyuero. As a student at Yribdeinos Academy, he faces fierce rivals and prepares for a high-stakes tournament. Amidst intense battles and personal challenges, Arx's true potential and mysterious magic affinities remain hidden, driving him to rise above every obstacle.\n\nDisclaimer:\n\nThis story is a work of fiction, created purely from my imagination as a 15-year-old, expressing my fantasies. Any resemblance to real persons, living or dead, or actual events is purely coincidental. All characters, places, and events depicted in this story are fictional and are not intended to represent or reference any real-life individuals or occurrences.","description_hash":-4363402422787116046},{"title":"After not caring about fame, I suddenly became famous overnight.","fiction_id":"88546","link":"https:\/\/www.royalroad.com\/fiction\/88546\/after-not-caring-about-fame-i-suddenly-became","tags":["Urban Fantasy","Progression","Comedy","Female Lead","Contemporary","Romance","Short Story","Secret Identity"],"lable":"Original","following_count":3,"rating":0.0,"page_count":28,"view_count":196,"chapters_count":3,"last_update":1718527033,"description":"I became a hit in the entertainment industry by being a goon\nAfter swinging for the fences, I suddenly became an overnight sensation\nBecause of my timid and easily frightened body.\nMy agent signed me up for a haunted house adventure live reality show as a way to exercise my guts.\nFor this reason I brought a book bag full of glutinous rice and peach wood sticks, but also hung all over the body amulets.\nThe netizens are all kinds of mocking that I set up a soft and weak persona, and the national girlfriend Su Lingling even implied that I was green tea.\nHowever, after the live broadcast began.\n.......","description_hash":2906547969468040333},{"title":"TsCAlnTD","fiction_id":"88545","link":"https:\/\/www.royalroad.com\/fiction\/88545\/tscalntd","tags":["Progression","Psychological","Horror","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":18,"chapters_count":1,"last_update":1718632067,"description":"The child goes outside to meet her old, tall, friend who had been waiting for her all the time and explore the deep forest afar from her village. Within it, lies critters waiting for their help, such naivety.","description_hash":-2218653379341149547},{"title":"Phoenix Nirvana: The Path to Glory and Favor of the Demon Empress of the Bewildering Kingdom","fiction_id":"88544","link":"https:\/\/www.royalroad.com\/fiction\/88544\/phoenix-nirvana-the-path-to-glory-and-favor-of","tags":["Progression","Xianxia","Female Lead","Action","Adventure","Historical","Mystery","Wuxia","Mythos"],"lable":"Original","following_count":3,"rating":0.0,"page_count":48,"view_count":183,"chapters_count":3,"last_update":1718527991,"description":"An oil lamp withered.\nMu Lan's hair was uprooted, and the smell of blood scurried into his nose.\n\"Your Majesty, my concubine will not sleep well at night after reading this.\" Mu Zhiying feigned softness, her eyes filled with malice.\n\"Concubine, after I confine this demonic woman's soul here, and then deal with all the remaining evils around the demonic woman, no one will be able to plague Concubine.\" Li Shiyuan wrapped his arms around Mu Zhiying, and his words were extraordinarily cruel.\nMu Lan's body was tied to a stake in death, his remaining consciousness just watched the scene in front of him, his eyes gradually turning from pleading to indifference.\nIn the most corner of the Heavenly Prison, there was the body of a baby.\nThat was the royal son that Mu Lan had given birth to in October, and now because of Mu Zhi Hua's words, he had been made into a drug guide.\nShe has yet to hold her child with her own hands ......\nShe was the first daughter of Mu Wangfu, the current Empress of the Great Zhou Kingdom, but she was eventually reduced to a pawn, from the day she returned to her house, every step was a trap, and she mistakenly trusted people, eventually involving dozens of lives in Fengqing Palace, as well as her own flesh and blood.\nBefore her consciousness disappeared, Mu Lan clenched her teeth and said word by word: \"Mu Zhi Paintings, Li Shiyuan, I will make you pay for your blood debts, definitely ......\"","description_hash":-1533427364649506107},{"title":"Asteria: Seymour's Quest For Forbidden Magic","fiction_id":"88543","link":"https:\/\/www.royalroad.com\/fiction\/88543\/asteria-seymours-quest-for-forbidden-magic","tags":["Male Lead","Adventure","Fantasy","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":8,"view_count":41,"chapters_count":1,"last_update":1718442828,"description":"In the magical world of Asteria, where arcane wonders and ancient secrets abound, a young mage named Seymour sets out on a quest that will test his limits and reshape his destiny. Driven by an insatiable love for all forms of magic, Seymour dreams of mastering every spell and uncovering the deepest mysteries of the arcane arts. Yet, among his impressive array of abilities, he harbors a forbidden power—Dark Magic. Its use is banned and feared, and the penalty for wielding it is death.\nSeymour’s journey begins in his tranquil home village, where an ancient book ignites his curiosity and sets him on a path of discovery. From the bustling marketplaces of human cities to the mystical realms of demi-humans and the majestic domains of the Dragon Lords, Seymour’s travels introduce him to a world teeming with diverse cultures, powerful allies, and formidable foes.\nThroughout his adventures, Seymour faces numerous challenges that require him to think creatively and rely on his wits as much as his magical abilities. He forms bonds with a colorful cast of characters, each bringing their own strengths and stories to his quest. Together, they navigate treacherous landscapes, uncover hidden truths, and confront the dangers that lurk in the shadows.\nAs Seymour delves deeper into the mysteries of Asteria, he learns of the Great Lost War—a cataclysmic event that left indelible scars on the land and gave rise to the forbidding name of Dead Man Walking, a place of haunting memories and lingering dangers. The legacy of this war and the secrets it holds become crucial to Seymour’s quest, revealing a connection to his own forbidden magic.\nWith each step, Seymour inches closer to his ultimate goal of mastering all forms of magic while grappling with the perilous secret of his Dark Magic. His journey is one of self-discovery, resilience, and the relentless pursuit of knowledge. In a world where magic can both heal and destroy, Seymour must learn to balance his desire for power with the responsibilities it entails.\n\"Asteria: Seymour's Quest for Forbidden Magic\" is a spellbinding tale of adventure, friendship, and the enduring quest for understanding in a world where the boundaries between light and dark, known and unknown, are constantly shifting. Join Seymour as he embarks on an epic journey that will challenge his very essence and illuminate the true nature of magic in Asteria.","description_hash":-5253620464048005698},{"title":"The King's Library","fiction_id":"88542","link":"https:\/\/www.royalroad.com\/fiction\/88542\/the-kings-library","tags":["Time Loop","Male Lead","Sci-fi","Adventure","Fantasy","Mystery","Magic","High Fantasy","Time Travel"],"lable":"Original","following_count":5,"rating":4.25,"page_count":13,"view_count":125,"chapters_count":2,"last_update":1718622778,"description":"I'll start here. \nOrigio is a low level worker in the King's Library. The other workers and scholars of the library pay him no mind, call him \"Desert\" for his cloak and hood he wears while cleaning. \nBut few have ever known the library as he does. For seventeen years, he has toiled among the stacks, happy enough in his personal pursuit of knowledge and day to day drudgery. \nUntil a tap at the library window turns his life inside out and he finds himself forced to reveal a secret of the library he has never told a soul. \nWill update Mondays\/Wednesdays\/Fridays","description_hash":-7888379464706532077},{"title":"Tales of Ascension","fiction_id":"88541","link":"https:\/\/www.royalroad.com\/fiction\/88541\/tales-of-ascension","tags":["Ruling Class","Male Lead","Strong Lead","Drama","Action","Adventure","Fantasy","Magic","Strategy","High Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"In the multitude of worlds there are countless people on the path of Ascension, finding their purpose, and seeking the Truth. What stories will be told of their journey? Tales of a blessing bestowed, a fortune found, of loved ones lost? Every story is different, but there is one constant in every Tale, the ongoing battle against the forces of darkness, will they be a light to their world crushing the heads of the evil, and the wicked beneath their heel, or will the daemons continue spreading corruption, and bringing death to their world? May the Ancient of Days be their strength, and guiding light, to lead them into the place of their destiny.","description_hash":907862249665770935},{"title":"major label story.","fiction_id":"88540","link":"https:\/\/www.royalroad.com\/fiction\/88540\/major-label-story","tags":["Anti-Hero Lead","Comedy","Female Lead","Contemporary","Strong Lead","Drama","Gender Bender"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":34,"chapters_count":1,"last_update":1718442805,"description":"major label story. is a gripping contemporary drama that weaves the tumultuous lives of several characters through the lens of heartbreak, loss, ambition and pursuit within the music industry. Set against the vibrant backdrop of London's music scene, the story delves into the complex relationships and emotional struggles that intertwine the narratives of several characters.","description_hash":-304818591867659696},{"title":"Haru","fiction_id":"88539","link":"https:\/\/www.royalroad.com\/fiction\/88539\/haru","tags":["Portal Fantasy \/ Isekai","Male Lead","Sci-fi","Action","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":149,"view_count":224,"chapters_count":12,"last_update":1718632663,"description":"Haru Tadashima is sent on a mission across the Multiverse to stop an evil version of himself Hellbent on Conquering the ENTIRE Multiverse and have it under his Empire. Haru must unite the other Haru's and realize the full extent of his power to defeat his Parallel and the other powerful evil figure behind him!\nP.S. Main Story starts in Volume 1-Volume 0 is Prequel","description_hash":1772351324868366298},{"title":"In Her Condo (Memories) Room","fiction_id":"88538","link":"https:\/\/www.royalroad.com\/fiction\/88538\/in-her-condo-memories-room","tags":["Portal Fantasy \/ Isekai","Psychological","Non-Human Lead","Tragedy","Drama","Short Story","Female Lead"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":12,"view_count":27,"chapters_count":1,"last_update":1718442780,"description":"In this condominium amongst City of Angels, there was an one room where this lone woman resided. She was all alone, lost in her thoughts, lost in her past, lost in her fear... and lost in her trauma.\n\nP.S. This is my first time writing an oneshot in English, and this is my first prototype. Comments and criticisms are opened, thank you!\nP.S. Alright, this website is getting me a bit confused now lol.","description_hash":5642659229427326540},{"title":"Exorcism Exodos","fiction_id":"88537","link":"https:\/\/www.royalroad.com\/fiction\/88537\/exorcism-exodos","tags":["LitRPG","Urban Fantasy","Progression","Martial Arts","Male Lead","Adventure","Romance","Sci-fi","Contemporary","School Life","Supernatural","Technologically Engineered"],"lable":"Original","following_count":0,"rating":0.0,"page_count":41,"view_count":166,"chapters_count":4,"last_update":1718625918,"description":"An unprecedented event threw mankind into chaos. The sky opened, allowing energy to flow freely, and revealing new worlds and possibilities beyond the ripples of the Nexuses. But also, new threats, as numerous entities poured onto Earth, fighting for a foothold in the new land.\nThe exorcists, people who had made a living and name for themselves by purging rivers of evil spirits for centuries, found themselves forced to adapt and face new types of enemies as the strongest force on Earth. Armed with a diverse array of weapons meticulously crafted for combating supernatural threats, and adept at manipulating spiritual energy, they alone possess the ability to confront the creatures that render missiles and conventional weapons to harmless toys.\nUnshaken by the changes occurring in the world as his problem of finding the true way of living felt more important than all, Yan Rain, a twenty-year-old exorcist is determined to achieve absolute freedom. In his eyes, no human was truly free, and no one could fully enjoy life if their freedom was limited.\nWitnessing the emergence of a Nexus in Barcelona, Spain, Yan Rain battles the spirits that emerge, showcasing his abilities and setting the stage for the global threat of Nexuses.\n\nThemes:\nSacrifice: The Personal Costs of Achieving One's Goals\nBalance: The struggle to maintain harmony between different realms, between mind and heart.\nDestiny vs. Choice: The protagonist’s journey in defining his own path.\n\n Setting:\nA richly detailed world blending futuristic technology with ancient mysticism.\nThis plot combines action, mystery, and deep character development, creating an engaging and epic narrative for “Exorcist Exodos.”","description_hash":7544335711800210085},{"title":"Lost Soul’s Escapades Volume 1: Genesis","fiction_id":"88536","link":"https:\/\/www.royalroad.com\/fiction\/88536\/lost-souls-escapades-volume-1-genesis","tags":["Anti-Hero Lead","War and Military","Psychological","Male Lead","Strong Lead","Action","Drama","Fantasy","Supernatural","Magic","Strategy","Mythos","Genetically Engineered ","Soft Sci-fi"],"lable":"Original","following_count":2,"rating":4.75,"page_count":121,"view_count":347,"chapters_count":8,"last_update":1718622303,"description":"A story of a lost young man who wanders as an empty husk in search of something he lacks. His past became a faded memory after everything he has been through, causing him to lose attachments in everything and his courage to face life. He desperately crawled, using his obsession with magic as an excuse to live his desolate life.\nNow an adventurer travelling in the continent Plathéa, the young man traveled in hopes to answer the ocean of questions he bears alone, hoping that in doing so he will find the courage to face anything. He is fixated in attaining courage so that he can face life and not cower away anymore, which led him to remove what makes him human. The mundaneness of every day, solitude, and his flawed way of attaining courage tired his soul, making him crave death and find excitement in danger, corrupting his soul.\nEmpty, the young man decided to fight a war that was never his own. He fought without a reason to, making him break even faster. If he will triumph or succumb is up to him and how he will attain courage.","description_hash":-1272451212466395250},{"title":"Emperor Against Gods [Xianxia\/High Fantasy]","fiction_id":"88535","link":"https:\/\/www.royalroad.com\/fiction\/88535\/emperor-against-gods-xianxiahigh-fantasy","tags":["Reincarnation","Progression","Xianxia","Male Lead","Strong Lead","Action","Fantasy","Romance","Mystery","Martial Arts","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":11,"rating":2.75,"page_count":28,"view_count":378,"chapters_count":5,"last_update":1718560747,"description":"Alcan's ambitions led to him committing blasphemy against the higher race. He lost everything—his empire, people, and power—but one thing he didn't lose was his will.\nSentenced to eternal punishment, he detonated his being and escaped to the outside of the universe, The Chaos. A fate worse than death. Endless years of torture later, a new Universe accepted his presence.\nA Universe where gods are awake, immortals roam, and mortals can ascend. Alcan, using his experience and knowledge, will claw his way to the top once more.\n\"I know no ceiling, all I know is how high of the ground I am.\"\nPotential holds a special place in this new Universe, as it is both the curse that bounds one to weakness and the salvation that births power.\n\nWhat to expect : \nRuthless, Smart and Evil MC\nUnique Romance (Trust me on this one)\nDetailed Cultivation System\nGreat and Epic Fights\nInteresting Mysteries\n\nOne chapter every day\nRead up to 15 advance chapters on Patreon!\nPatreon - https:\/\/www.patreon.com\/EternalWritings\nDiscord Server - https:\/\/discord.gg\/3PpVajEjEE","description_hash":7395816574453763074},{"title":"Rise of the protector","fiction_id":"88534","link":"https:\/\/www.royalroad.com\/fiction\/88534\/rise-of-the-protector","tags":["Action","Adventure"],"lable":"Original","following_count":1,"rating":0.0,"page_count":1,"view_count":49,"chapters_count":1,"last_update":1718422357,"description":"A youth in a backwater village on the outskirts of Cloud Kingdom is found to have the rare darkness affinity in his class awakening. Learn as he grows and develops into a faithful protector and guard that rises to power with loyalty as his driving virtue.","description_hash":-1792652161628124860},{"title":"Crowns of Heritage ","fiction_id":"88533","link":"https:\/\/www.royalroad.com\/fiction\/88533\/crowns-of-heritage","tags":["War and Military","Comedy","Multiple Lead Characters","Secret Identity","Strong Lead","Action","Drama","Romance","Attractive Lead"],"lable":"Original","following_count":2,"rating":2.5,"page_count":254,"view_count":1061,"chapters_count":32,"last_update":1718621999,"description":"Sage and Rosemary, two best friends who are inseparable. After graduating school they lives are turned upside down by sudden disappearances, murders and learning their families secrets. While going through different circumstances they wonder who could be trusted. But what happens when they find out the one who is trying to harm them is someone who was supposed to love them.","description_hash":7629744425055400809},{"title":"The Divine Path || A Monster Evolution LitRPG","fiction_id":"88532","link":"https:\/\/www.royalroad.com\/fiction\/88532\/the-divine-path-a-monster-evolution-litrpg","tags":["LitRPG","Dungeon","Non-Human Lead","Action","Adventure","Fantasy","Mystery","Female Lead","Magic","High Fantasy","Progression"],"lable":"Original","following_count":68,"rating":4.88,"page_count":72,"view_count":1971,"chapters_count":10,"last_update":1718431234,"description":"[Proceed towards the Divine Summit.]\nNothing more than five cryptic words guide Khall after she hatches. All she knows is that she is a mud lizard and that she needs to fight and kill to survive and ascend. Evolutions and occupations are presented to her, but she knows nothing about what they are or how to acquire them. As her path unfolds before her, she must understand where the command to ascend comes from, and if she should, in fact, do as it says.\nThe Divine Path is a fast-paced, progress-focused, action-packed monster evolution novel with eventual light cultivation. Khall starts as a hatchling, and her intelligence reflects that. Once she experiences her first evolution (within the first ten chapters), she will become much smarter.","description_hash":2148576934942408659},{"title":"Ashen Cycle: The Inferno Tower","fiction_id":"88531","link":"https:\/\/www.royalroad.com\/fiction\/88531\/ashen-cycle-the-inferno-tower","tags":["Multiple Lead Characters","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":75,"view_count":260,"chapters_count":11,"last_update":1718403477,"description":"In the tranquil village of Zoidiv, the life of the young blacksmith Levan is upended when a mysterious Mancer named Renelle Qouvard arrives. She reveals that Levan is the Xilaskar, a prophesied savior destined to protect the world from chaos and destruction.\nAs they travel, Levan struggles to accept his newfound identity and the heavy burden it brings. Along the way, they gather the Yoldi, companions fated to aid the Xilaskar. They have to learn to set aside not only their cultural, and religious differences, but their moral and ethical ones as well, in order to fulfill their destinies.\nThe group's path is fraught with danger as they confront various threats, and monsters sent after them by Nagun Uzher. Even with Nagun Uzher's dark shadow growing ever larger and his underlings sewing chaos into the fabric of the world, their biggest obstacle is Renell and the Ashen Cycle, their mysteriousness and half truths fill everyone with unease and distrust, despite her claims of wanting to save the world. \nAmidst the turmoil, Levan and his allies grapple with the morality of their mission and the sacrifices required to achieve their goals. But they will need to learn to accept their roles in order save the world from impending destruction despite the immense challenges and moral dilemmas ahead.","description_hash":-1364117734631986458},{"title":"Heroes are made (Worm\/Megamind) ","fiction_id":"88530","link":"https:\/\/www.royalroad.com\/fiction\/88530\/heroes-are-made-wormmegamind","tags":["Comedy","Drama"],"lable":"Fan Fiction","following_count":1,"rating":5.0,"page_count":136,"view_count":586,"chapters_count":11,"last_update":1718555789,"description":"Flung into a world far different than his own, a certain blue-headed genius will learn how to navigate the hostile landscape that is Earth Bet. Together with his faithful companion Minion, they'll tackle any who dare stand in their way.\nWatch him struggle, watch him blunder, watch him grow.\nWatch him become what he never believed possible, a hero. Albeit, a hero with an orbital death laser.\n\n\nPre-Movie Megamind dropped into slightly pre-canon Worm. This is not a stomp or spite fic. Baseline knowledge of Worm assumed.\nCross-posted on AO3 and SB","description_hash":3430410889952666815},{"title":"Fate of Yggdrasil","fiction_id":"88529","link":"https:\/\/www.royalroad.com\/fiction\/88529\/fate-of-yggdrasil","tags":["Urban Fantasy","Progression","Anti-Hero Lead","Martial Arts","Multiple Lead Characters","Action","Drama","Fantasy","Contemporary","Male Lead","Magic","Mythos"],"lable":"Original","following_count":1,"rating":0.0,"page_count":20,"view_count":60,"chapters_count":1,"last_update":1718399388,"description":"Fate, average by most standards, enjoys his peaceful days of researching the supernatural alongside his club. This is all until his life nearly comes to an end when he has a run in with an unknown person, thus warping the world around him! All he can do is fight, and try to survive as he bears the entirety of humanity's fate in his hands.","description_hash":6381939208037737002},{"title":"Reincarnation Of The Morning Star ","fiction_id":"88528","link":"https:\/\/www.royalroad.com\/fiction\/88528\/reincarnation-of-the-morning-star","tags":["Reincarnation","Time Travel","Dungeon","Anti-Hero Lead","Martial Arts","Action","Adventure","Fantasy","Supernatural","Male Lead","Strong Lead","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":27,"view_count":120,"chapters_count":4,"last_update":1718612218,"description":"The Birth of a Star, The birth of a Disaster, the beginning of Carnage is the beginning of Peace\nArthur will Reign, \nArthur will Shine,\nArthur will destroy.","description_hash":-2084946376101362905},{"title":"The Ancient","fiction_id":"88527","link":"https:\/\/www.royalroad.com\/fiction\/88527\/the-ancient","tags":["LitRPG","Male Lead","Strong Lead","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":1,"view_count":45,"chapters_count":1,"last_update":1718396054,"description":"When Jhiah went for a stroll in the local forest, the last thing he expected to find was an Ancient. After accidentally killing the creature, Jhiah takes its place - and its power.","description_hash":-6156980533449641728},{"title":"Sim HUD Simkha","fiction_id":"88526","link":"https:\/\/www.royalroad.com\/fiction\/88526\/sim-hud-simkha","tags":["GameLit","Portal Fantasy \/ Isekai","Progression","Female Lead","Sci-fi","Romance","Contemporary","Slice of Life","School Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":40,"chapters_count":1,"last_update":1718395851,"description":"Simkha bit off more than she could chew at University. She couldn't make herself sit for her exams. She couldn't manage to date cute girls. She could barely force herself to dress like a functional human being most mornings. And she was completely unprepared to deal with the un-diagnosed personality disorders that she wasn’t even sure she had.\nIf Simkha wanted to choke down the rest of her education, then she needed to figure out why she couldn’t do the same things everybody else could. What was this feeling in her stomach? She had no way to know. Surely, she could fix her life if she could just find an objective way to measure her wants, needs, and abilities. \nThis story is a light sci-fi mental-health progression fantasy. Its genre elements kick off when Simkha dissociates so hard that she cracks the cosmos and falls out of the break. It will address questions like:\n- Why is my body angry at me?\n- Is time travel possible?\n- Why can't I concentrate when I study?\n- Is self-care easier with the help of alien super-technology?\n- Am I worthy of love?\n- What if our whole universe is Flatland?\n- Why was I misdiagnosed with schizophrenia as a child?\n- Can I ascend to a higher plane of existence?\n- Is it okay to be autistic?\n- Is it a good idea to let children play god without supervision?\n- Should I blame all my problems on my best friend?\n- No? Then what about kissing her? Should I kiss my best friend instead?\n\n————————————\n\nUpdates planned with two week intervals.","description_hash":15039329223946483},{"title":"Universe's End","fiction_id":"88525","link":"https:\/\/www.royalroad.com\/fiction\/88525\/universes-end","tags":["LitRPG","Progression","Post Apocalyptic","Strategy","Xianxia","Action","Adventure","Fantasy","Male Lead","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":4,"rating":0.0,"page_count":16,"view_count":58,"chapters_count":2,"last_update":1718394146,"description":"The year is 2038 when humanity discovers they are not alone in the universe. Contacted by a civilized universe spanning Trans-Galactic Union, humanity is ready to embark out upon the stars in a vast new world of possibilties.\nOr they would, had it not been for the small fact that the entirety of the universe is destroyed shortly after making contact with them, something which most people would refer to as a slight dilemma.\nRowan, or Rory for short, finds himself in the strange conundrum of not being dead post-deletion. In fact, he is in the lobby of his childhood doctor's office, having a pleasant conversation with an alien professor about why exactly they aren't dead.\nNot at least a little confused, things are only made more strange when Rory wakes up to find himself in an alien world, the only living thing aside from plant life for as far as he can see. As if that isn't odd enough, he soon discovers this new universe works by decidedly different rules.\nAlmost completely alone, Rory must survive, if only because there isn't much to do but survive. His only sometimes-company is an odd World Spirit that seems insistent on his continued survival and growth, a mutually beneficial symbiotic relationship that feels at least a little bit like a pyramid scheme.\n\nUniverse's End is a LitRPG that follows not that upcoming plucky hero as they strive to surpass the ancient forerunners or current legendary figures but instead follows the story of one of those very precursors as they build the foundations of the LitRPGs we are all familiar with, while also answering the question of why the world follows an almost video game-like logic.","description_hash":7325754473328751415},{"title":"Digimon Exodus: A New Frontier ","fiction_id":"88524","link":"https:\/\/www.royalroad.com\/fiction\/88524\/digimon-exodus-a-new-frontier","tags":["Adventure"],"lable":"Fan Fiction","following_count":1,"rating":4.0,"page_count":2,"view_count":30,"chapters_count":1,"last_update":1718393211,"description":"The loss of an old world. A new world that welcomes great adventures. The passage through a newly opened door that leads to a new world that allows the existence of an inexplicable bond. Two completely different species but together they form a whole. Large gaps to fill in the lost history told on the walls of a new border.","description_hash":3596160383379963101},{"title":"Touhou: Gensokyo's Records ","fiction_id":"88523","link":"https:\/\/www.royalroad.com\/fiction\/88523\/touhou-gensokyos-records","tags":["Progression","Psychological","Multiple Lead Characters","Strong Lead","Action","Adventure","Fantasy","Supernatural","Female Lead","Magic","High Fantasy"],"lable":"Fan Fiction","following_count":1,"rating":5.0,"page_count":5,"view_count":76,"chapters_count":2,"last_update":1718394749,"description":"Gensokyo, the land of illusions, has a very rich past.\nReimu Hakurei is part of it, and she went through a lot of interesting adventures during her job as the Shrine maiden of the Hakurei Shrine. \nI am here to recount them all, adding my own touch to them. \n\nThis fiction is a homage to ZUN and his beautiful franchise and I do not take any credits for his creations.\nHowever, do not assure that it will be 100% canon, as it's still my own work, and I want to be creative with it.\nThis is a novel that will contain (almost) the whole story of touhou as it is depicted in the games, with the difference that characters have tons of dialogues and characterization, and every fight is neatly described and unique.\nRead this if you're interested in touhou but you don't feel like playing the games.","description_hash":-7740602810585324383},{"title":"Life of a Chosen","fiction_id":"88522","link":"https:\/\/www.royalroad.com\/fiction\/88522\/life-of-a-chosen","tags":["Progression","Non-Human Lead","Strong Lead","Action","Adventure","Fantasy","Romance","Supernatural","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":44,"chapters_count":2,"last_update":1718467207,"description":"From a young age he realized he was different. His mind and body developed faster and differently from others. His talent was something never seen before. This was a blessing as well as a curse as he leaves friends behind and lives on while those he knows and loves leaves him.","description_hash":-903547780833193474},{"title":"Deviled Eggs","fiction_id":"88521","link":"https:\/\/www.royalroad.com\/fiction\/88521\/deviled-eggs","tags":["Progression","Non-Human Lead","Slice of Life","Tragedy","Action","Adventure","Fantasy","Supernatural","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":21,"chapters_count":1,"last_update":1718389962,"description":"A story about Logi a young mage Just trying to find out where he belongs. Join him as he explores the world of Giavale. Defending himself from power-obsessed cults and ferocious monsters.","description_hash":-2337200695165118305},{"title":"Earth's Last Guardians","fiction_id":"88520","link":"https:\/\/www.royalroad.com\/fiction\/88520\/earths-last-guardians","tags":["LitRPG","Progression","Super Heroes","Strategy","Comedy","Action","Romance","Sci-fi","Harem","Male Lead","GameLit","Genetically Engineered ","Soft Sci-fi"],"lable":"Original","following_count":64,"rating":5.0,"page_count":78,"view_count":1446,"chapters_count":9,"last_update":1718417927,"description":"Breaking out of alien confinement? That was the easy part.\nFor years, the Zorvax Star Empire has watched and waited, secretly plotting to overthrow the governments of Earth and bring humanity under their control. Ryan's escape just threw a wrench into those plans... especially since he didn't leave empty-handed.\nIn his possession are a pair of stolen Changers, unfathomably-advanced devices that can temporarily transform an ordinary individual into a superpowered engine of destruction.\nThere's just one slight problem: Ryan can't use them himself.\n\nUpdates M-W-F. If it's in the tags, it will be part of the story sooner or later. (Yes, that includes the \"Harem\" one.) Explicit entries are marked as such and it won't hurt your ability to follow the story (or my feelings) if you skip them.","description_hash":7672246209682073614},{"title":"Dragon's guard","fiction_id":"88519","link":"https:\/\/www.royalroad.com\/fiction\/88519\/dragons-guard","tags":["Action","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":18,"view_count":161,"chapters_count":4,"last_update":1718571144,"description":"A kingdom is becoming a backwater where nothing ever changes. What will it take to wake up?","description_hash":1029618447222357342},{"title":"The Archagent: In Another World ","fiction_id":"88518","link":"https:\/\/www.royalroad.com\/fiction\/88518\/the-archagent-in-another-world","tags":["Portal Fantasy \/ Isekai","Dungeon","Super Heroes","War and Military","Martial Arts","Action","Adventure","Fantasy","Sci-fi","Male Lead","Strong Lead","Magic","Low Fantasy","Genetically Engineered ","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":1,"rating":0.0,"page_count":15,"view_count":21,"chapters_count":1,"last_update":1718387403,"description":"In a futuristic America, Gabriel Jones has become the number one military asset for the country, winning countless wars and overcoming many impossible obstacles, betrayed by his kin, and transported to a world unimaginable. Can the greatest soldier and war hero Earth has ever known save and escape this new world, and return to serve his country, one more time? \n(Upload frequency: 1-3 chapters per week)","description_hash":-4230596173206074873},{"title":"The saga of Freyja (English)","fiction_id":"88517","link":"https:\/\/www.royalroad.com\/fiction\/88517\/the-saga-of-freyja-english","tags":["Progression","Slice of Life","Strong Lead","Action","Adventure","Fantasy","Mystery","Magic","Low Fantasy","High Fantasy","Mythos","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":8,"view_count":60,"chapters_count":2,"last_update":1718442735,"description":"\"A society where women are subservient to men.A test reserved only for men.99 men,1 woman\"\nFreyja, a young woman who has always lived locked up on the cliff-top that everyone avoids. For nineteen years, she has been subjected to the painful and monstrous experiments of Edmund, a mysterious and powerful sorcerer.  Through countless harrowing and bloody ordeals that will constantly push her limits, her bravery and perseverance will challenge customs and the place of women in society.","description_hash":-4764427510541618556},{"title":"Sensei Consultancy Services","fiction_id":"88516","link":"https:\/\/www.royalroad.com\/fiction\/88516\/sensei-consultancy-services","tags":["LitRPG","Urban Fantasy","Progression","War and Military","Multiple Lead Characters","Action","Adventure","Sci-fi","Mystery","Secret Identity","Genetically Engineered ","Technologically Engineered","Soft Sci-fi","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":38,"chapters_count":1,"last_update":1718387348,"description":"\"As the night kept howling, I wondered if Twilight would ever strike.......\"That is what Sensei whispered. Perhaps it was a simple musing? Perhaps it was a premonition for what was about to follow.***The enigmatic Sensei runs a famous consultancy service in Kazel City; the city of minds as they call it. Those who see Sensei in the daytime know him to be a famous consultant. The nightlife of Kazel city knows of his private eye-side, rumors of the supernatural not excluded!It is said that even extra-terrestrials require his services? Could it be true?!\nThings were going quite smoothly until a silent wind of fate brought with it the thorny seeds of discord.\nWhat happens when the past reaches out its icy fingers and embraces his present in an eternal slumber?","description_hash":5420239024827541723},{"title":"The New Dark Lord","fiction_id":"88515","link":"https:\/\/www.royalroad.com\/fiction\/88515\/the-new-dark-lord","tags":["Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","Psychological","Male Lead","Action","Adventure","Fantasy","Strong Lead","Magic","High Fantasy","Villainous Lead","Genetically Engineered "],"lable":"Original","following_count":5,"rating":4.0,"page_count":6,"view_count":101,"chapters_count":1,"last_update":1718387343,"description":"The Paladins summoned Silenos because they wanted the world saved, what he’s decided it needs is ruling. \nAfter a deal with a demon goes wrong, Master Silenos, esteemed Fleshcrafter of House Shaiagrazni, keeper of the Auburn Flame, Conductor of Arts most Ancient and Lord of Hara’lguanta is cast into a primitive world of magic and steel.\nThere are two problems that loom over him.\nOne, a sorry excuse for an ancient evil Dark Caster who seeks to pillage and destroy all that this world holds dear.\nSecondly, a populace that fails to recognise him as their superior in every conceivable way.\nSilenos will fix both of these issues by becoming the New Dark Lord.\nWhat to expect: An overpowered Villainous Necromancer with an unchecked ego teaching everyone the true meaning of evil one step at a time.\nProgression, Dark Comedy, Action, Highly competent Villain Mc.Schedule: Daily Releases.","description_hash":-6359414858613008373},{"title":"Sacrifice","fiction_id":"88514","link":"https:\/\/www.royalroad.com\/fiction\/88514\/sacrifice","tags":["Space Opera","Psychological","Sci-fi","Drama","Action","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":24,"view_count":125,"chapters_count":4,"last_update":1718560090,"description":"Struggling to deal with the aftermath of the destruction of TSS Destiny's Spear, Vice-Admiral Coeur, now just Manon Fletcher, retired, receives a visit from the Terrarch. This sets her down a dark path that she prays just might help her overcome her trauma.","description_hash":-5322569244338326121},{"title":"Lucy","fiction_id":"88513","link":"https:\/\/www.royalroad.com\/fiction\/88513\/lucy","tags":["Tragedy","Drama","Romance","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":14,"chapters_count":1,"last_update":1718387332,"description":"The love of my life is dead. \nGrief is never something to overcome, it is something to use as fuel. The fuel to my fury, the fuel to my revenge. I will find who killed her, who burned her to death,  and give her the peace she needs in death.\n\nIn this one-shot\/ short story, your unnamed protagonist is on a quest for revenge, but the killer is in a different world? To make it worse he's the hero meant to slay the demon race that plagues his own world. Will our villain have what it takes to defeat the legendary hero and accomplish his revenge? Find out next time on Judas's oneshots!","description_hash":-7518693695672708220},{"title":"The Dark Doyenne","fiction_id":"88512","link":"https:\/\/www.royalroad.com\/fiction\/88512\/the-dark-doyenne","tags":["Portal Fantasy \/ Isekai","Anti-Hero Lead","Grimdark","Non-Human Lead","Slice of Life","Action","Fantasy","Romance","Reincarnation","Gender Bender","Supernatural","Female Lead","Strong Lead","Magic","Attractive Lead"],"lable":"Original","following_count":5,"rating":0.0,"page_count":12,"view_count":88,"chapters_count":2,"last_update":1718394380,"description":"Humans are in desperate need of a trump card. They complete the Reincarnation Spell, hoping to summon mighty warriors from another world to defeat the demons. However, instead of heroes being summoned, the Reincarnation Spell was strong enough to release the seal that trapped the most powerful race in the demonic species—the Nenniaidae. They are unearthly beautiful women with seemingly bottomless amounts of mana. Exclusive to Nenniaidae, these demons possess both male and female sexual organs.\nHumanity has lucked out in two ways: only a single Nenniaidae was released, and our protagonist controls her body. A body that can be described as the typification of elegance, but with such destructive possibility, she can be dubbed the embodiment of destruction. The latter circumstance is what saves humanity from complete extinction. He, or now she, fights with the humans to take out the Demon Lord and his armies.","description_hash":7750018996263196001},{"title":"SCORCHING BLACK VULTURE","fiction_id":"88511","link":"https:\/\/www.royalroad.com\/fiction\/88511\/scorching-black-vulture","tags":["War and Military","Grimdark","Male Lead","Sci-fi","Drama","Action","Adventure","Cyberpunk","Supernatural","Genetically Engineered ","Technologically Engineered","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":120,"view_count":535,"chapters_count":21,"last_update":1718602408,"description":"The scorching virus outbreak plunged Galea's ecosystems into lunacies. No antidotes are effective in countering this tiny virus, as it also infected advanced technologies.\nAll organizations in Galea have to fight this virus back with every effort by creating the Authonoid, which stands for Authorized Android.\nThey aimed to combat the scorching virus while heavily immunizing them. Unfortunately, this virus was constantly developing each time.\nAnd to make matters worse, some elites were exploiting this virus by profiting from it to fulfill their political agendas.\nTsuyuki is the Minerva's Authonoid, and with his companions, has to fight against the continuous outbreak, political corruptions, and many unforeseen threats.\n\"Mankind is dying, disorders are kings, heaven copulates hell.\"\nContent Warning: This novel contain explicit contents of violences, gores, profanities, and slight sexualities.","description_hash":-5466181516485546321},{"title":"The Disappearance","fiction_id":"88510","link":"https:\/\/www.royalroad.com\/fiction\/88510\/the-disappearance","tags":["Comedy","Drama","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":44,"chapters_count":1,"last_update":1718387278,"description":"When Jeremy Harold's younger sister, Cassie, goes missing, and is supposedly dead, what can anyone really do in a situation like this? It happens every day... But, it is quite unusual for it to happen every day in the same area. Perhaps it is no mere coincidence...","description_hash":-5443325239958499771},{"title":"Timely Blunder","fiction_id":"88509","link":"https:\/\/www.royalroad.com\/fiction\/88509\/timely-blunder","tags":["Time Travel","Female Lead","Sci-fi","Slice of Life","Short Story","Soft Sci-fi"],"lable":"Original","following_count":1,"rating":5.0,"page_count":3,"view_count":41,"chapters_count":1,"last_update":1718387262,"description":"A woman enjoying the afternoon at the local fairgrounds has a chance encounter that will change her life","description_hash":-7063192236893968516},{"title":"Rise of a Dragon: A Celestial Dragonfire Tale","fiction_id":"88508","link":"https:\/\/www.royalroad.com\/fiction\/88508\/rise-of-a-dragon-a-celestial-dragonfire-tale","tags":["Space Opera","Ruling Class","Martial Arts","Sci-fi","Strong Lead","Action","Drama","Fantasy","Strategy","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":22,"chapters_count":1,"last_update":1718387258,"description":"At just 19, Edan Veros steps into the role of Lord of House Veros after his father's death in the Third Annexation War. Navigating political intrigue, newfound responsibilities, and personal struggles, Edan must prove himself worthy of his legacy and secure the future of his house.","description_hash":-4536643790326550935},{"title":"Demon warriors","fiction_id":"88507","link":"https:\/\/www.royalroad.com\/fiction\/88507\/demon-warriors","tags":["LitRPG","Urban Fantasy","Strategy","Strong Lead","Drama","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":8,"view_count":41,"chapters_count":2,"last_update":1718452425,"description":"After 100 years of their disappearance, the demons return to threaten humanity once again, leaving behind more destruction and chaos. In this dark time, a new team of demon slayers forms again to eliminate them and save humanity.\nIn this epic conflict, \"Kai,\" whose uncle died at the hands of one of these demons, joins a journey of revenge and freeing the world from the forces of evil.","description_hash":-8886898101765797969},{"title":"Successors of the Gods","fiction_id":"88506","link":"https:\/\/www.royalroad.com\/fiction\/88506\/successors-of-the-gods","tags":["Comedy","Action","Adventure","Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":57,"view_count":296,"chapters_count":14,"last_update":1718483749,"description":"Its one of my first novels. I can not be active in writing because of work and else i hope you understand that and thank you. The Story: After Zeus sealed all the gods, the powers of all the gods returned 2000 years later. Now Kenta and his friends have to solve the riddle of the god power and defeat evil.","description_hash":-3657502540858296957},{"title":"5. OCCULT [TALES FROM THE CROSSROADS vol. 1]","fiction_id":"88505","link":"https:\/\/www.royalroad.com\/fiction\/88505\/5-occult-tales-from-the-crossroads-vol-1","tags":["Historical","Horror","Short Story","Supernatural","Magic","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":17,"chapters_count":1,"last_update":1718384222,"description":"Tales from the Crossroads is a series of 17 micro-fiction horror stories set in the Primordial Crossroads Universe.\nOCCULT weaves a tale of a group gathering to perform eldritch practices that spell their own misfortune.","description_hash":-5447187390087799626},{"title":"In Search of the Gods","fiction_id":"88504","link":"https:\/\/www.royalroad.com\/fiction\/88504\/in-search-of-the-gods","tags":["Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":47,"chapters_count":1,"last_update":1718383737,"description":"Dofen, a prosperous metropolis in the south of the Empire, lies empty. The Empire, unsure who to blame, is on the verge of war. Strange cults have started popping up all over the land. The Academy has sealed itself from the rest of the world, and to top it all off the Hands of the Emperor have no idea why any of this has happened. Joining this secretive organisation, Elsebeth searches for an answer that might stop her homeland from being engulfed in war.","description_hash":6410518802057182481},{"title":"I M P E R I U M","fiction_id":"88503","link":"https:\/\/www.royalroad.com\/fiction\/88503\/i-m-p-e-r-i-u-m","tags":["Urban Fantasy","Psychological","Male Lead","Sci-fi","Horror","Short Story","Supernatural","First Contact"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":23,"view_count":56,"chapters_count":1,"last_update":1718368564,"description":"Inspired by the legendary analogue horror series by Darian Quilloy, I M P E R I U M follows teenagers Kai and Kate after they make a groundbreaking discovery in their small town. \nWhat they don't realize, however, is that some things are better left undiscovered... \n\nWE ARE NOTHING MORE THAN MEAT...\nSUBMIT...\nREJOICE...\nBEHOLD...\nI M P E R I U M \n\nCONTENT WARNING\nThe following short story contains scenes of graphic violence and strong language throughout. Reader discretion advised. \n\nFeel free to leave a comment! Your feedback is valuable to me, and helps me constantly improve as a writer! Thanks for reading! \nCover Art Credit: saranimator","description_hash":-3352909065802211216},{"title":"Dwagon, Flames & Fury","fiction_id":"88502","link":"https:\/\/www.royalroad.com\/fiction\/88502\/dwagon-flames-fury","tags":["Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":28,"view_count":89,"chapters_count":3,"last_update":1718456920,"description":"Our story follows Dwagon and his companions on their adventure to seek out and stop the summoning of an ancient evil. \n~This story takes place in my DnD campaign’s world of Daconis.~","description_hash":-4478125915662397101},{"title":"Valhalla - Houses of Heroes","fiction_id":"88501","link":"https:\/\/www.royalroad.com\/fiction\/88501\/valhalla-houses-of-heroes","tags":["Urban Fantasy","Progression","Male Lead","Action","Adventure","Fantasy","Supernatural","Low Fantasy","Mythos"],"lable":"Original","following_count":5,"rating":5.0,"page_count":48,"view_count":441,"chapters_count":11,"last_update":1718634840,"description":"[Your feats have been recognized by Valhalla…]\n[You’re hereby granted the title of Legend.]\nThose are the words that every child from the Houses of Heroes wishes to hear someday. The same goes for young Edward. A novice from the House of Alexander determined to build a legend that will last the test of time.\nCall upon your ancestors, or build your own legend, many paths can lead to Valhalla.\nEdward starts his legend as a young, but determined warrior. When he finds himself in a perilous situation, his performance and perseverance in the face of death are deemed worthy in the eyes of Valhalla, and set him on the path towards becoming a true Legend... someone who can change a fate of millions with one strike of his sword.\n\n\n\nI promise to deliver an orignal, engaging and well thought out story. If you're bored of the repeating copy and paste novels, then I welcome you in the halls of Valhalla...\nCurrently realeasing 1 chapter per 2 days.","description_hash":-2721599126580115089},{"title":"Tale about fish","fiction_id":"88500","link":"https:\/\/www.royalroad.com\/fiction\/88500\/tale-about-fish","tags":["Urban Fantasy","Post Apocalyptic","Psychological","Female Lead","Action","Adventure","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":17,"chapters_count":1,"last_update":1718366517,"description":"A post apocalyptic world. Cute girls with guns. Lots of mystery and action. It is after all a tale, and like every tale it has a beginning and an end. Like life, it has meaning as long as you give one to it. Yes.\nAnd, of course, it has , Fish.","description_hash":4963802848746536961},{"title":"David's Robot","fiction_id":"88499","link":"https:\/\/www.royalroad.com\/fiction\/88499\/davids-robot","tags":["Male Lead","Contemporary","Slice of Life","School Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":75,"chapters_count":4,"last_update":1718387820,"description":"It's a story about loosing childhood innocence and then working to regain it after you grow up. Follow David as he grows up with his toy tin robot and uses painting to regain his child-like wonder.\n\nCurrently working on writing chapters. Trying to get at least one a week. I welcome all constructive criticism to help me make this idea better.","description_hash":-4540984521711030720},{"title":"Invasive Creatures","fiction_id":"88498","link":"https:\/\/www.royalroad.com\/fiction\/88498\/invasive-creatures","tags":["Progression","Comedy","Male Lead","Fantasy","Short Story","Satire","Supernatural","First Contact"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":12,"chapters_count":1,"last_update":1718366444,"description":"A short story about a young man alone on an island, only wanting to mind his own business. Until that that is he gets some unwanted guests, or masters.","description_hash":-8940186975061381061},{"title":"ST","fiction_id":"88497","link":"https:\/\/www.royalroad.com\/fiction\/88497\/st","tags":["War and Military","Comedy","Non-Human Lead","Sci-fi","Adventure","Genetically Engineered ","Hard Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":2,"rating":0.0,"page_count":36,"view_count":131,"chapters_count":6,"last_update":1718625605,"description":"Join the very special forces of the 37th Platoon as they venture into deadly alien hulks in search of priceless technological treasures. Crawling with hostile lifeforms and rife with killing radiation, the derelict ships burn out advanced circuits and ordinary men in seconds.  With simple tools, dumb luck, and brute force, these tardigrade-augmented Marines can hack their way out of the most dangerous missions in the galaxy!","description_hash":-7392713717211851363},{"title":"Web of Spider: Betrayal’s Rebirth","fiction_id":"88496","link":"https:\/\/www.royalroad.com\/fiction\/88496\/web-of-spider-betrayals-rebirth","tags":["Time Loop","Multiple Lead Characters","Adventure","Fantasy","Romance","Mystery","Gender Bender","Female Lead","Magic","High Fantasy","Time Travel"],"lable":"Original","following_count":5,"rating":5.0,"page_count":50,"view_count":317,"chapters_count":10,"last_update":1718401190,"description":"Beneath the surface, dark currents stir as Black Raven sows chaos and conspiracy across the lands. In the shadows, the spider weaves a vast web of fate, awaiting the reborn avenger to walk the path foretold.\nIn the mystical realm of Aisha, noblewoman Alicia was betrayed and slain by her trusted ally, Leon. Reborn with memories of her past, she seeks vengeance in a world of magic and deceit. Unraveling Black Raven's intricate plots, Alicia must forge alliances and navigate forbidden love to reclaim her destiny. This is a tale of rebirth, revenge, and the struggle for power in a land where trust is scarce and shadows conceal all.","description_hash":-2410520569745460240},{"title":"So Evidently I'm The Over Weight Son of The Now Dead Sorcerer King","fiction_id":"88495","link":"https:\/\/www.royalroad.com\/fiction\/88495\/so-evidently-im-the-over-weight-son-of-the-now","tags":["Dungeon","Martial Arts","Comedy","Male Lead","Action","Adventure","Fantasy","Reader Interactive","Magic","Progression"],"lable":"Original","following_count":1,"rating":0.0,"page_count":30,"view_count":113,"chapters_count":3,"last_update":1718592744,"description":"Elias, a timid and overweight young man, is thrust into a tumultuous world of power and conflict following the sudden death of his father, KIng Yuriel of Vallamore..  Struggling with insecurities and anxiety, Elias feels ill-prepared to take on the responsibilities of ruling a nation torn apart by internal strife.\nGuided by his wise, All be it stone faced and strict mentor, Albert, Elias embarks on a journey of self-discovery and transformation. Through rigorous training and the unlocking magical abilities, Elias begins to shed his doubts and fears, emerging as a formidable force to be reckoned with.\nWith Friends at his back Elias Charges into a World Unknown, too End the conflict in the Kingdom that's become his birth right. \nBut as Elias grows stronger, so too do the forces arrayed against him. Betrayal and intrigue threaten to derail his quest for peace and stability. With the fate of his kingdom hanging in the balance, Elias must confront his inner demons and harness the full extent of his newfound powers to bring an end to the conflict and forge a brighter future for Vallamore.\n(This Story Can Also Be found On WebNovel)","description_hash":-7863716762689524347},{"title":"The King and Queen's Prerogative: The Harrows of Hatching.","fiction_id":"88494","link":"https:\/\/www.royalroad.com\/fiction\/88494\/the-king-and-queens-prerogative-the-harrows-of","tags":["LitRPG","Reincarnation","Time Loop","Progression","War and Military","Action","Fantasy","Psychological","Sci-fi","Martial Arts","Supernatural","Male Lead","Multiple Lead Characters","Magic","Grimdark","High Fantasy","Ruling Class","Time Travel","Genetically Engineered ","Technologically Engineered","First Contact","Hard Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":10,"view_count":37,"chapters_count":1,"last_update":1718351020,"description":"The story continues after the end of the Ascension Trials. The survivors have been gathered to a sky island belonging to one of The Council members. The Dragons are preparing for war and the next generation is about to hatch.\nThe Council is slowly being forced out of hiding and a strange group of men and women in black suits and masks seem to be searching for the Dragon King. The protagonists become whole and grow exponentially stronger, before they are trained assigned professions that complement their abilities and sent to one of the seven Hub worlds governed by the Dragon Council. \nKagiso and our protagonists board incredibly large ships and sail to the Land of Iron Mountains in order to strike back at the Gods and the traitors that have sided with them.","description_hash":3447785787635957138},{"title":"The Saiyan Pirate","fiction_id":"88493","link":"https:\/\/www.royalroad.com\/fiction\/88493\/the-saiyan-pirate","tags":["Reincarnation","War and Military","Comedy","Male Lead","Strong Lead","Action","Adventure","Romance"],"lable":"Fan Fiction","following_count":1,"rating":0.5,"page_count":33,"view_count":204,"chapters_count":5,"last_update":1718358240,"description":"Eto Shapan suddenly woke up in the body of Goku. He was excited to be alive in the world of his favourite anime. Things however were not as they seemed. This was a world of Pirates and great adventures on the high seas. This is the world of One Piece.\n[Disclaimer: I do not claim any sort of ownership to any character or plot or world regarding either the Dragon Ball franchise or the One Piece franchise. Any and all related copyrights belong to their respective owners. This is simply a fan fiction of one of the best and most popular anime franchises on the planet]","description_hash":6403510301475515744},{"title":"Little Leavanny in The Big City","fiction_id":"88492","link":"https:\/\/www.royalroad.com\/fiction\/88492\/little-leavanny-in-the-big-city","tags":["Reincarnation","Comedy","Psychological","Non-Human Lead","Slice of Life","Action","Fantasy","Female Lead","Secret Identity","Magic"],"lable":"Fan Fiction","following_count":22,"rating":4.17,"page_count":211,"view_count":2234,"chapters_count":21,"last_update":1718625606,"description":"I'd always felt like life's walls were angled at 87 degrees.\nThen I'd died. Then, I woke up as a bug pokemon. A Leavanny, to be precise. Everything went sideways from there.\nLife's walls were angled at 87 degrees. Still are. But they were, too.\n---\nAn awkward story about hope, progress, and learning.\nThis is an AU\/Leavanny Reincarnation with a bunch of custom worldbuilding mixed in.\nThis is a Xenofiction take on pokemon, and Leah's POV can be confusing!","description_hash":6370601376601475234},{"title":"Through Faith","fiction_id":"88491","link":"https:\/\/www.royalroad.com\/fiction\/88491\/through-faith","tags":["Dungeon","Strategy","Female Lead","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":16,"view_count":83,"chapters_count":3,"last_update":1718336845,"description":"Inheritor of the title of paladin and an artifact given by a lesser known god, Tannen embarks on a journey to her mother's homeland. By chance, She discovers an object that seems divine. At that moment her god appears before her, unlike all other moments her god is physically manifested.","description_hash":-4167191084393582263},{"title":"True War [Progression Fantasy | Portal Fantasy | Xianxia-inspired]","fiction_id":"88490","link":"https:\/\/www.royalroad.com\/fiction\/88490\/true-war-progression-fantasy-portal-fantasy-xianxia-inspired","tags":["Portal Fantasy \/ Isekai","Progression","Post Apocalyptic","Anti-Hero Lead","Xianxia","Action","Adventure","Fantasy","Horror","Martial Arts","Strong Lead","Multiple Lead Characters","Magic","Grimdark","Low Fantasy","High Fantasy"],"lable":"Original","following_count":6,"rating":5.0,"page_count":57,"view_count":367,"chapters_count":5,"last_update":1718572565,"description":"Countless years after the Cataclysm, the final era has come.\nIn this era, the supreme being—the True God who will rule over all the Three Realms will emerge.\nThe Sanctuary of All Things; remnants of the Old Gods; descendants of Deities; True Prodigies; reincarnated Deities themselves—all of them have their eyes set on the throne and will do what is necessary to get there, namely, . . . War.\n_\n\nFifty years ago, the world fell into disarray. Monstrosities emerged among living beings. Hordes of savage beasts bearing faint resemblances to previously known creatures appeared, each with a brutality to match their strength. Cities fell in instants. Three-quarters of humanity was wiped out.\nHowever, the beasts were not the only ones affected. From among the humans arose those referred to as Abnormals. They commanded abilities thought impossible, from the bizarre to the extraordinary.\nThe Legion, assembled by the World Government, fought hard and long - still do, even to this day - reclaiming lost territory and rejuvenating humanity.\nMeanwhile, uncontrollable and dangerous Abnormals are placed in Camps, where they fight bloody battles daily, yet face disdain and disgrace.\nAnd now, the World Government has summoned five thousand of the strongest Campers to Spire Island, home to the strongest forces of both humanity and beasts.\n\n_\n\nFor now, new chapters will be up every day at 16:14 Central Time. Afterward, it will settle on the steady schedule of Tuesday-Friday. Each chapter is at least 3000 words long, with an average of 3500+.","description_hash":-2105433356745081408},{"title":"Under the distant stars","fiction_id":"88489","link":"https:\/\/www.royalroad.com\/fiction\/88489\/under-the-distant-stars","tags":["Portal Fantasy \/ Isekai","Adventure","Fantasy","Mystery","Supernatural","Magic"],"lable":"Original","following_count":2,"rating":0.0,"page_count":13,"view_count":38,"chapters_count":1,"last_update":1718323866,"description":"The synopsis of this novel revolves around the two protagonists - Vera and Arken - their fantastic journey and growth story. Vera is a gifted witch whose goal is to obtain the legendary moongrass to cure the ancient illnesses of the people of her homeland. Arken is a young mage who has a deep pursuit of dreams and runes. He pursues higher levels of magical knowledge and explores the unknown magical world. In pursuit of their respective goals, their paths cross and they decide to travel together.\nAt the beginning of the novel, Vera and Arken finally found the Moongrass after experiencing a series of adventures and challenges. But the story does not end here, but a new beginning. Vera hopes to return home to heal her people, while Arken hopes to find more clues about dreams and runes from this journey. They decided to go to Vera's hometown together, but this road was not a smooth road, but full of unknowns and challenges.\nThe entire story describes how they face and overcome a series of challenges together, including traveling through dense forests, crossing dangerous mountains, communicating with dragons, and crossing vast deserts. In the process, they not only grow into more powerful magic users, but also deepen their understanding and trust of each other.\nIn the final chapter, when Vera and Arken were about to arrive at Vera's hometown, they discovered that it was facing an unprecedented threat. They must not only complete Vera's original mission - to use moonlight grass to cure the disease, but also work together to fight against this unknown powerful force to protect Vera's hometown and the people there.\nAt its core, this novel is about friendship, growing up, and the difficulty and value of pursuing goals. Through the journey of Vera and Alken, it is expressed that even in the face of unknowns and dangers, as long as they have faith and support each other, they can overcome difficulties and achieve their ultimate goals and dreams.","description_hash":-1485049731312870474},{"title":"Progression Testing","fiction_id":"88488","link":"https:\/\/www.royalroad.com\/fiction\/88488\/progression-testing","tags":["LitRPG","Progression","Male Lead","Action","Adventure","Fantasy"],"lable":"Original","following_count":1,"rating":3.5,"page_count":34,"view_count":293,"chapters_count":5,"last_update":1718474461,"description":"If you wanted to see somebody who had a quiet life, Kendall would likely be the top candidate. Reading  anything he could get his hand on, it wasn’t hard to tell he didn’t have anything else going on. He didn’t take advantage of courses that could potentially get him a good, well paying job. He didn’t ever try to develop relationships. At one point, all of this began to make him think that he should’ve done something more with what he had.\nWhen the monsters came, so did the Interface. A mysterious floating screen that displayed your stats, condition, skills, class, and rank.\nKendall was left with three things. A shotgun, knowledge, and the ability to use that knowledge.\nHe decided one thing before his journey began.\nThis was the one chance he got. He wouldn’t mess it up.","description_hash":-130974339012584755},{"title":"Strawhat Dudes","fiction_id":"88487","link":"https:\/\/www.royalroad.com\/fiction\/88487\/strawhat-dudes","tags":["War and Military","Martial Arts","Multiple Lead Characters","Fantasy","Supernatural","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":11,"view_count":57,"chapters_count":1,"last_update":1718314022,"description":"In the far reaches of a universe so similar yet so different to ours live four goofy misfits: An eccentric teenager with a death wish, a soldier with an existential crisis, a lovelorn martial artist, and a masked girl of mysterious origins. This story tells of how they met, the struggles they face, the friends they meet along the way, and their rise to the top.","description_hash":2559165357479495874},{"title":"Gathering Darkness","fiction_id":"88486","link":"https:\/\/www.royalroad.com\/fiction\/88486\/gathering-darkness","tags":["Multiple Lead Characters","Action","Adventure","Fantasy"],"lable":"Original","following_count":4,"rating":4.0,"page_count":63,"view_count":266,"chapters_count":7,"last_update":1718312795,"description":"In the heart of the nation of Stel, on the continent of Heren, darkness stirs as an encroaching goblin army threatens to engulf the land in chaos and despair. As the shadows of war stretch across the kingdom, three unlikely companions are drawn together by fate to stand against the rising tide of darkness.Emeric, once a powerful caster in the royal army of Stel, now finds himself disillusioned with the crown's inaction against the goblin threat. Haunted by his past failures and seeking redemption, he embarks on a quest to harness his magical abilities and protect the realm from destruction.Savi, a cleric whose faith was forged in the flames of tragedy, joins the fight after witnessing the slaughter of her loved ones at the hands of goblins. With her unwavering devotion and divine powers, she seeks to bring hope to those who have lost everything and to banish the darkness that threatens to consume the land.Keyon, a skilled woodsman raised amidst the untamed wilderness of Stel, has long been locked in a personal vendetta against the goblin horde. Trained from a young age in the art of survival and combat, he roams the forests, striking fear into the hearts of his enemies and defending his homeland with unmatched ferocity.As the goblin army marches ever closer to the heart of Stel, Emeric, Savi, and Keyon must set aside their differences and unite against a common enemy. Together, they will face perilous journeys, ancient mysteries, and fierce battles as they race to uncover the secrets of the goblin threat and save their kingdom from destruction. But in the shadows, darker forces are at play, and the fate of Stel hangs in the balance.","description_hash":6316507177201943616},{"title":"6. WYRD [TALES FROM THE CROSSROADS vol. 1]","fiction_id":"88485","link":"https:\/\/www.royalroad.com\/fiction\/88485\/6-wyrd-tales-from-the-crossroads-vol-1","tags":["Male Lead","Strong Lead","Adventure","Horror","Mystery","Short Story","Supernatural","Magic","Low Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":26,"chapters_count":1,"last_update":1718310639,"description":"Tales from the Crossroads is a series of 17 micro-fiction horror stories set in the Primordial Crossroads Universe.\nWYRD is about a wizard who rivals Merlin and his quest to uncover the truth beyond the veil and his very own fate.","description_hash":-6767503494154036472},{"title":"A Fox in a Bear Trap","fiction_id":"88483","link":"https:\/\/www.royalroad.com\/fiction\/88483\/a-fox-in-a-bear-trap","tags":["Space Opera","War and Military","Multiple Lead Characters","Sci-fi","Action","Adventure","Short Story","Male Lead","Female Lead","Strategy"],"lable":"Original","following_count":1,"rating":5.0,"page_count":36,"view_count":124,"chapters_count":3,"last_update":1718315452,"description":"At the edge of human space, the occupants of an unfinished space habitat find themselves in a fight for their lives.  With less than fifty security officers, Captain Mori must defend the construction crews against a determined pirate assault.  Reinforcements are on the way, but the Vulpine are brutal, cunning, and ruthless viewing the humans as little more than prey.  Outnumbered and outgunned, Mori will need to rely on clever tactics and unorthodox methods if her forces are to survive.","description_hash":987677574006483874},{"title":"The Waters That Hated","fiction_id":"88482","link":"https:\/\/www.royalroad.com\/fiction\/88482\/the-waters-that-hated","tags":["Grimdark","Female Lead","Horror","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":131,"view_count":344,"chapters_count":10,"last_update":1718316927,"description":"An old Korean woman tries to tell her daughter about her past and what destroyed their hometown.","description_hash":-8741404428610142666},{"title":"The Price of Love and Freedom ","fiction_id":"88481","link":"https:\/\/www.royalroad.com\/fiction\/88481\/the-price-of-love-and-freedom","tags":["Villainous Lead","Grimdark","Psychological","Male Lead","Action","Historical","Horror"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":58,"chapters_count":2,"last_update":1718389228,"description":"New York, 1987. Alfred Jerrod Smith, 17 years old, born into a high class family, and hates it. He hates how everyone in his family and all his high class friends base whether a person is worth anything by status and money. Then he met Melanie Powell, 18 years old, a lower-middle class girl he met at a gas station while avoiding his family, and she changed his life. He loved his life, and loved Melanie, she became his everything. But then tragedy struck when one of his relatives kills Melanie to teach him a lesson about how the hierarchy system of humanity works. Driven by rage, malice, and pure hatred for his whole family, he sets out to completely obliterate the class system and make his family feel his pain multiplied by tenfold.","description_hash":4262698443165206205},{"title":"Flowers Withering Away","fiction_id":"88480","link":"https:\/\/www.royalroad.com\/fiction\/88480\/flowers-withering-away","tags":["Psychological","Tragedy","Drama","Romance"],"lable":"Original","following_count":1,"rating":0.0,"page_count":8,"view_count":75,"chapters_count":3,"last_update":1718419220,"description":"In a quiet town in France, 29-year-old aspiring painter Julius Laurent experiences tremendous loss with the passing of Lily Barbier, the woman he loved most. Faced with grief and the need to find himself, Julius struggles to find any inspiration in the world to continue painting. Will Julius Laurent ever pick up a brush again?\nPlease leave any feedback, It would be greatly appreciated. I am extremely knew to writing so I want to be able to obtain as much feedback as possible to work on it. As a side note, this story originally started as a visual novel I was working on back in 2017 but dropped it due to personal limitations at the time :)","description_hash":1200523534273245909},{"title":"Steven Universe: Broken Peridot","fiction_id":"88479","link":"https:\/\/www.royalroad.com\/fiction\/88479\/steven-universe-broken-peridot","tags":["Reincarnation","Urban Fantasy","Non-Human Lead","Sci-fi","Slice of Life","Adventure","Fantasy","Gender Bender"],"lable":"Fan Fiction","following_count":14,"rating":5.0,"page_count":15,"view_count":455,"chapters_count":4,"last_update":1718485263,"description":"When he opened his eyes, he found himself in a desolate, abandoned, and cold world. After exhausting all available resources, he finally discovered a way to escape, but at a tremendous cost. He had lost his ability to speak, hear, and move properly. His unusual behavior led to several misunderstandings among the residents of Beach City. He couldn't understand why and how things had gone so wrong. ----- This story is a slice of life, so the pace is slow.NOTE: Serialization starts in August 2024 (or more). The author is very cautious so he is accumulating chapters. The prologue can also be changed to better fit the plot.","description_hash":4405181761007119520},{"title":"Level One God","fiction_id":"88478","link":"https:\/\/www.royalroad.com\/fiction\/88478\/level-one-god","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Drama","Action","Adventure","Fantasy","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":117,"rating":4.57,"page_count":106,"view_count":3542,"chapters_count":12,"last_update":1718628048,"description":"Brynn wakes up to discover he's now a god in a world full of magic, infested dungeons, and sprawling kingdoms—but there's a catch... He's back at level one, Wood Rank.\n\n\n\n\n\n\nBrynn is the first person ever to activate the previously hidden power of \"Prestige Mode.\" He'll be able to equip two class corestones instead of one, among a host of other incredible benefits. His new powers come at a cost: the process erased all his memories and almost completely reset his progress.With nothing from his old life but an unidentified helmet that looks like a portal to the stars and an empty Alchemist's Kit, he finds himself in a dangerous new world full of terrifying creatures, fantasy races, treacherous dungeons, and enemies around every corner. He'll have to navigate a complex magic and class system to reclaim his forgotten power and survive. Every level counts, and the stakes couldn't be higher. Brynn's journey from level one to godhood begins now. \n\n\n\n\nWhat to Expect:\n- An MC who picked the most punishing possible prestige path because it has the greatest potential power. He'll start at the bottom and slowly progress his way back over what I hope to be a long series of books. - A fun and complex class system. If you like unique classes, interesting powers, and exciting magical abilities... You'll probably like it! - Loot... Sweet, sweet loot.- A series that will be very long. Book 1 is already finished, and I'll release a burst of chapters to start with 1 chapter per day for a couple weeks. After that, I'll settle into something I can maintain long term, like 3-5 chapters per week. \n\nIf people are enjoying the story, I may be able to keep up a faster pace. We'll just see how it goes! This is my first time trying a web-series style of publishing. I've set up a Patreon and Discord. Right now, you can jump up to three weeks ahead. While I'm still doing a chapter per day, that'll mean getting ~20+ chapters ahead. Once I've slowed down my publishing pace from launching here, the Patreon tiers will be more like two, four, and six weeks and hopefully still get roughly that same number of chapters. But like I said, I'm learning Patreon, Discord, and Royal Road as I go. Please cut me a little slack and let me know if I'm ever missing something!Artist for Cover Illustration - Sebastian Szmyd","description_hash":-4625377094611730312},{"title":"Sunrise Ascent","fiction_id":"88477","link":"https:\/\/www.royalroad.com\/fiction\/88477\/sunrise-ascent","tags":["Progression","Male Lead","Action","Adventure","Fantasy","Mystery","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":53,"view_count":143,"chapters_count":4,"last_update":1718571887,"description":"Light and dark, magicians and alchemists, pirates in the seas, knights at their great gates of iron. Tribes in peace, kingdoms at war. Steep mountains soaring above the clouds, forests miles deep under the sea. In this vast world and its boundless horizons, it is adventurers who risk their lives for the pleasures of its exploration. At the heart of this world is a small island in which the sparks of a great journey flicker into existence. \nAfter a galleon ship crashes on the island's rocky shores, a seasoned adventurer of the high seas, Tommy, finds himself in the care of a couple and their child, Adrian. The fateful encounter sparks a bond between the family and the adventurer, igniting a journey across the world as one sun sets and the other one arises.","description_hash":-876518481069033543},{"title":"Native Blood [Vol. 01]: Harvest Night","fiction_id":"88476","link":"https:\/\/www.royalroad.com\/fiction\/88476\/native-blood-vol-01-harvest-night","tags":["Space Opera","Multiple Lead Characters","Sci-fi","Drama","Fantasy","Horror","Supernatural","Male Lead","Female Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":86,"view_count":147,"chapters_count":5,"last_update":1718577405,"description":"Elias Pendergast, leader of a sovereign company of hunters on an alien planet, discovers dangerous clues of an attack on the eve of a holy native holiday, the same night his teenage brother Adam disappears to attend an illegal party.\n\nHarvest Night is the latest full rewrite of the book originally titled Native Blood: Cursed Planet. The plot's the same but the story's been rewritten to reflect the author's evolution, with the intent of creating a finished release.This is an in-progress draft so please excuse any errors. Text may be revised or updated at any time for style or corrections.Story is RATED R. For mature readers only. Discretion is advised.","description_hash":5033782082171223346},{"title":"Parzival: The First Circle","fiction_id":"88475","link":"https:\/\/www.royalroad.com\/fiction\/88475\/parzival-the-first-circle","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","War and Military","Secret Identity","Fantasy","Strong Lead","Magic","GameLit"],"lable":"Original","following_count":1,"rating":0.0,"page_count":3,"view_count":46,"chapters_count":1,"last_update":1718309554,"description":"Parzival was on his way to his friend Jakob’s place, ready for a night of getting high and watching cartoons. But in an instant, his world shifted. Without warning, he was transported to a frigid, alpine-like wilderness with no clue how or why. As he struggled to make sense of his new surroundings, a glowing message appeared before him:\n\"Welcome to the First Circle, Quadrant 1083478537.\"\nThrown into this mysterious world, Parzival quickly finds himself face-to-face with a powerful foe. But amidst the chaos and danger, a stroke of luck offers him a chance to become a mage.\nWill Parzival master the arcane arts and reach the center of the Circle, or will he succumb to the icy grasp of this ruthless new world? His journey begins now.\n\nDisclaimer:\nPlease note that I am utilizing a Language Learning Model (LLM) to assist me in writing this story, as I am neither a native English speaker nor an experienced author. This tale has been developing in the back of my mind for a few months now, and I’ve come to the realization that, aside from writing scientific papers, my skills in crafting engaging text are rather limited. With the help of the LLM, I hope to bring my ideas to life and share an exciting adventure with you.","description_hash":-3090353656504777493},{"title":"You're taking me where?","fiction_id":"88474","link":"https:\/\/www.royalroad.com\/fiction\/88474\/youre-taking-me-where","tags":["Portal Fantasy \/ Isekai","Comedy","Short Story","Satire"],"lable":"Original","following_count":1,"rating":0.0,"page_count":3,"view_count":44,"chapters_count":1,"last_update":1718309538,"description":"James was tired. \nHe has been working the overnight shifts all week and is thoroughly depressed. Not knowing what to do with his life, he continues to work a monotonous job that leaves him feeling empty, until one night where James welcomes a demon to his 7\/11 store. \nQuick One-shot story, let me know what you guys think!","description_hash":3459345022556924152},{"title":"Return of the Onion Knight","fiction_id":"88473","link":"https:\/\/www.royalroad.com\/fiction\/88473\/return-of-the-onion-knight","tags":["LitRPG","Urban Fantasy","Dungeon","Post Apocalyptic","Strategy","Action","Adventure","Fantasy","Sci-fi","Male Lead","GameLit","Progression"],"lable":"Original","following_count":2,"rating":0.0,"page_count":18,"view_count":550,"chapters_count":8,"last_update":1718587803,"description":"NEW EPISODES pretty often until I catch up.The only way to survive in a world of monsters and DUNGEONS is to be the best. Or at least damned near it.And Jinyoung was so close... but then he ran into the BLACK SHRINE. The QUEST that transported him out of our world and put him through hell before dropping him back.\nAnd worst off all, he's been saddled with a new JOB CLASS. And it looks to be a shit one at that.","description_hash":1962522698765707188},{"title":"Soulbind - The Black Dragon","fiction_id":"88472","link":"https:\/\/www.royalroad.com\/fiction\/88472\/soulbind-the-black-dragon","tags":["Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","Female Lead","Magic","High Fantasy"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":23,"view_count":56,"chapters_count":2,"last_update":1718313452,"description":"A forgotten ancient power that has been hidden for centuries has began to shake the world. Soul binders, people capable of turning a monsters power into their own, have started to arise and soon what the world thought to be myths are going to reveal themselves to be real than they could possibly imagine. \nA veteran hunter Ryo Shoku has been tasked with protecting and escorting a young girl who can supposedly save the world, Astra Safira, from unknown enemies and with minimal knowledge. As they travel across the world he soon discovers that there might be more to this girl than he'd been told.","description_hash":2036860850596440393},{"title":"In A Boring Place","fiction_id":"88471","link":"https:\/\/www.royalroad.com\/fiction\/88471\/in-a-boring-place","tags":["LitRPG","Dungeon","Anti-Hero Lead","Grimdark","Male Lead","Action","Adventure","Fantasy","Mystery","Magic","High Fantasy","Villainous Lead","Progression"],"lable":"Original","following_count":0,"rating":0.0,"page_count":32,"view_count":168,"chapters_count":5,"last_update":1718484236,"description":"In a remote village ensconced by snow and shadows, young Astria lives an ostensibly serene life. Yet, beneath the tranquil veneer lies a world shrouded in illusion, where nothing is as it seems. The village’s annual festival looms, promising joy and camaraderie, but harbors sinister undertones. \n\nAstria's ordinary existence begins to unravel, the unsettling glimpses of true nature of his surroundings ignited a gnawing doubt within him. Is the life he knows merely a façade? What truths lurk beneath the illusory veil that blankets the world?\n\n“Read it because you might like it.”\n-Mishuuu","description_hash":-8600821413181559105},{"title":"Beneath the Surface","fiction_id":"88470","link":"https:\/\/www.royalroad.com\/fiction\/88470\/beneath-the-surface","tags":["Urban Fantasy","Progression","Multiple Lead Characters","Action","Adventure","School Life","Male Lead"],"lable":"Original","following_count":3,"rating":4.17,"page_count":49,"view_count":255,"chapters_count":6,"last_update":1718605504,"description":"Decades ago, a man-made catastrophe led to the coming of a new era, evolving humans to be able to use mana. However, humans weren't the only ones who were blessed.\nYonu Hachinan, our main character, has recently moved to the city in hopes of a better quality of life and improved job prospects. Heeding his parents' advice, he chose to attend the Elite Mana Academy. This marks his first steps into uncovering the horrors behind the curtains of this country and this world, alongside his friends.\n\nUpload Days: Thursday and Friday\n\n\nAuthor's Note: \nHi, I am really just here to share this imaginative world that I had been constantly thinking about. Years gone past where I slowly but surely built up this world detail by detail. I know I'm not the best, at perhaps character development or world building, or even at English at all. Nevertheless, I would like to share this world to the people who read this. If nobody reads this, so be it, but if it can even reach someone and entertain them for that little bit, I am satisfied. If you can afford the time to write reviews, it would be very much appreciated as I too, hope to improve as a story teller. Thank You.","description_hash":981363070888927325},{"title":"What lies underneath","fiction_id":"88469","link":"https:\/\/www.royalroad.com\/fiction\/88469\/what-lies-underneath","tags":["Psychological","Tragedy","Drama","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":14,"chapters_count":1,"last_update":1718309504,"description":"Poetry, I think. Just some inner monologue. A secondary project. Nothing to crazy. This app has too much fantasy, so I'm adding something else. I'm not the best writer but I'm trying to add variety to the app.","description_hash":-1982253218348709438},{"title":"Demonic Evolution of a metal slime","fiction_id":"88468","link":"https:\/\/www.royalroad.com\/fiction\/88468\/demonic-evolution-of-a-metal-slime","tags":["LitRPG","Reincarnation","Dungeon","Anti-Hero Lead","Non-Human Lead","Action","Adventure","Drama","Fantasy","Slice of Life","Supernatural","Male Lead","GameLit","High Fantasy","Progression","Attractive Lead"],"lable":"Original","following_count":6,"rating":0.0,"page_count":5,"view_count":152,"chapters_count":2,"last_update":1718601068,"description":"On the day the protagonist was banished from the slime colony, he regained memories of when he was a human. Along with those memories, he also acquired a unique skill, and quickly underwent evolution, only to discover a shocking truth.\n\"Could it be that I'm one of those experience point monsters...?\"\nThe protagonist's species was a bonus monster with an extraordinary amount of experience points. Though disheartened, he soon noticed his exceptional defensive capabilities.\n\"With this defense, I can safely defeat opponents of the same level...!\"\nWith a defense that could nullify most attacks and the unparalleled growth speed provided by his unique skill, the protagonist ascended the ecological pyramid at an unprecedented pace.\nThis is the story of a magical beast, seemingly born to be hunted, repeatedly evolving to reach the pinnacle of power.","description_hash":-6769895092911840},{"title":"The Ends","fiction_id":"88467","link":"https:\/\/www.royalroad.com\/fiction\/88467\/the-ends","tags":["Post Apocalyptic","Anti-Hero Lead","War and Military","Drama","Action","Fantasy","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":27,"view_count":61,"chapters_count":3,"last_update":1718369856,"description":"North Korea led the way in the development of AI-driven military technologies, their greatest achievement was the nuclear missile head, that was fully AI controlled, It was an invention terrifyingly beautiful. \nThe beautiful died on July 11, 2019. \n The scars from World War III's short but devastating fires still remain, and the remains of humanity fight to survive amidst the rubble.  \nTwenty thousand people found refuge when the UN established a Radiation Free Zone (RFZ) along the border between South Africa and Lesotho in the midst of this mayhem. However, outside its borders, Africa saw the emergence of new states formed from the ruins of Western military facilities, and others on their own. \nWhile the Middle East was left in the hands of divided Arab and Muslim states living in harmony, as for the rest of Asia, the East Asian Alliance (EAA) ruled over, and founded colonies in East Africa. \nIn this setting, movement in Mozambique in 2046 upends the RFZ's peaceful life and leads to a decisive meeting between the RFZ's elite soldiers and the powerful forces of the EAA. The sixth and tenth squads, under the command of Bahir, set out on a treacherous mission that will test their mettle.","description_hash":9182610589577480945},{"title":"Ghost Of Glasgow (Immortal Stonekeeper Case File #2)","fiction_id":"88466","link":"https:\/\/www.royalroad.com\/fiction\/88466\/ghost-of-glasgow-immortal-stonekeeper-case-file","tags":["Urban Fantasy","Male Lead","Romance","Mystery","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":11,"view_count":52,"chapters_count":2,"last_update":1718328383,"description":"Jonathan Warner is back. This time, he is a Paranormal Investigator under the jurusdiction of the Paranormal Bureau, working peacefully alongside his lover and partner, Anya Sechina.\nHowever, the two of them are thrust back into danger when Jonathan's close ones die one by one after being marked by an eight-hundred-year-old branding.\nWho is behind this series of murders? What does the branding mean? And will they solve the case in time, or will Jonathan lose everything in his life once more?","description_hash":5699560262805983276},{"title":"The Path of the Villain (LitRPG)","fiction_id":"88465","link":"https:\/\/www.royalroad.com\/fiction\/88465\/the-path-of-the-villain-litrpg","tags":["LitRPG","Reincarnation","Anti-Hero Lead","Harem","Adventure","Fantasy","Supernatural","Villainous Lead"],"lable":"Original","following_count":9,"rating":0.0,"page_count":156,"view_count":2085,"chapters_count":23,"last_update":1718449406,"description":"Victor, an ordinary office worker, stumbled upon an adventure-style MMORPG game. After an all-nighter of playing the game, Victor unfortunately died, only to find himself transported into the game world, becoming the famous villain character.\nAt the start, Victor boldly confessed his love to the noble duke's daughter, but to his surprise, the duke himself wanted to eliminate him. This was just the beginning, as Victor gradually realized that everyone around him, without exception, coveted his life, including the cold and aloof Goddess of War boss, the high and mighty heiress of a powerful family, and even random strangers on the street.\nIn the face of this destined tragic end, there were countless incoming players eagerly waiting to reap the rewards of his accumulated experience. Unwilling to passively accept his fate, Victor ultimately chose an path that few would dare to tread - he decided to devote himself to an evil deity, in the hopes of surviving this treacherous journey as a villain.\nWill Victor, through his pious worship of the dark god, be able to overcome the forces aligning against him and ultimately take control of his own destiny? Can an ordinary person rise up to become a truly formidable villain? This will be an exciting journey of survival.","description_hash":-3209776424783082307},{"title":"The Order of the Shadows","fiction_id":"88464","link":"https:\/\/www.royalroad.com\/fiction\/88464\/the-order-of-the-shadows","tags":["Anti-Hero Lead","Comedy","Male Lead","Action","Adventure","Fantasy","Supernatural","Low Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":21,"chapters_count":1,"last_update":1718309449,"description":"What are you really afraid of? The supernatural, the occult and all of the beasties of the dark that come to get you once night falls? Or the man who would cut a bloody path through all of that for nothing but his own vengeance? To angels and demons, ghosts and spectres, werewolves and vampires and zombies, his message is clear. I'M COMING FOR YOU!","description_hash":-8834730244491954148},{"title":"The 3 types of evil (an isekai story) ","fiction_id":"88463","link":"https:\/\/www.royalroad.com\/fiction\/88463\/the-3-types-of-evil-an-isekai-story","tags":["Reincarnation","Dungeon","War and Military","Martial Arts","Psychological","Action","Adventure","Fantasy","Male Lead","Strong Lead","Magic","Strategy","Ruling Class"],"lable":"Original","following_count":5,"rating":4.83,"page_count":29,"view_count":213,"chapters_count":6,"last_update":1718459325,"description":"Firstly, an evil that portrays itself as good.\nSecondly, an evil that portrays itself as bad.  \nAnd lastly, an evil that wants to change. The last one is tricky, because whenever we need one side of the coin, the other side appears instead. This was the life of Alan. He was a man who sought change more than anyone else, but his nature simply wouldn’t let him.  \nEven after death, his desire to change never faded. Perhaps because of this desire, he was given a second chance. Waking up in an unfamiliar body, he meets a silver-haired boy named Liam. For the experienced Alan, it doesn't take long to realize the boy's true nature – the second type of evil.  \nWith Liam as his companion, will Alan ever be able to change?  \nFollow Alan on his journey of transformation in an unfamiliar world of sword and magic.","description_hash":-6769090548354349354},{"title":"Exploring the Multiverse - Solo leveling","fiction_id":"88462","link":"https:\/\/www.royalroad.com\/fiction\/88462\/exploring-the-multiverse-solo-leveling","tags":["Dungeon","Post Apocalyptic","Anti-Hero Lead","Martial Arts","Male Lead","Action","Adventure","Fantasy","Strong Lead","Attractive Lead"],"lable":"Fan Fiction","following_count":5,"rating":0.0,"page_count":90,"view_count":585,"chapters_count":22,"last_update":1718346926,"description":"Join Kade Mercer as he travels through anime and fiction worlds one after another with the help of his abilities and a system————-\nFirst world: Solo Leveling\n--------------------------------------------DISCLAIMER!!!\nI don’t own anything apart from my OC characters\nHe will travel to different animes but his main world will be Solo leveling, meaning he will have the ability to go back to Solo leveling world anytime he wants when he travel to a different animes.\nThe System will not appear until much later and it won’t be relevant to his powers at all as it is just there to provide a way to travel to other anime worlds, nothing less nothing more.\nAlso be aware that I'm only doing the mainstream animes\/Manwha\/Manhua\/Novels\/Games as my knowledge beyond mainstream ones is non-existent","description_hash":3046452103037803721},{"title":"Awakening: Book 1 of the Awakening Series","fiction_id":"88461","link":"https:\/\/www.royalroad.com\/fiction\/88461\/awakening-book-1-of-the-awakening-series","tags":["Action","Adventure","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":115,"chapters_count":3,"last_update":1718339123,"description":"16-year-old Atticus had spent the last 8 years as a mind in an AI system, contributing to its processing power and personality. He had been promised a better life in a virtual world but had been lied to and had been exploited by Neuron Technologies. Now after 8 years in the system, his pod has malfunctioned and he has been freed to find a changed world.","description_hash":1964314300368298343},{"title":"Mind Prison [A haunting Science Fiction Short Story]","fiction_id":"88460","link":"https:\/\/www.royalroad.com\/fiction\/88460\/mind-prison-a-haunting-science-fiction-short-story","tags":["Virtual Reality","Time Loop","Anti-Hero Lead","Strategy","Grimdark","Horror","Psychological","Sci-fi","Short Story","Male Lead","Hard Sci-fi","Soft Sci-fi","Dystopia"],"lable":"Original","following_count":2,"rating":5.0,"page_count":9,"view_count":302,"chapters_count":3,"last_update":1718489145,"description":"Nobody talks much about the mind prison. \"It will break you\" is all they say.","description_hash":-8707795414211242862},{"title":"Sky Without Cloud","fiction_id":"88459","link":"https:\/\/www.royalroad.com\/fiction\/88459\/sky-without-cloud","tags":["Progression","Male Lead","Sci-fi","Action","Adventure","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":50,"chapters_count":2,"last_update":1718522160,"description":"In the year 2099, Earth is a bleak and polluted wasteland due to rampant illegal mining, war, and industrialization. The air is thick with smog, the soil cracked and lifeless, and the once vibrant landscapes are now barren and bleak.","description_hash":-4337517113994021822},{"title":"Sword and stone: The 3 gods curse","fiction_id":"88458","link":"https:\/\/www.royalroad.com\/fiction\/88458\/sword-and-stone-the-3-gods-curse","tags":["Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":45,"chapters_count":2,"last_update":1718598006,"description":"Triad is a young raised by waring factions is cursed by the 3 gods that rule his world and turned into a monster.","description_hash":1648963695565445311},{"title":"Adachi's Unwanted Harem","fiction_id":"88457","link":"https:\/\/www.royalroad.com\/fiction\/88457\/adachis-unwanted-harem","tags":["Comedy","Male Lead","Slice of Life","Harem","Drama","Romance","Satire"],"lable":"Original","following_count":1,"rating":0.0,"page_count":23,"view_count":329,"chapters_count":6,"last_update":1718596633,"description":"Adachi's life takes a wild turn when he's kidnapped by someone who looks exactly like him.\n This doppelganger has a crazy request: \"Live my life and take care of my girlfriends!\" \nWhat follows is a hilarious, tension-filled adventure as Adachi navigates this bizarre new life, blending comedy and a touch of romance...","description_hash":6170334770414559044},{"title":"The Herald of Ash","fiction_id":"88455","link":"https:\/\/www.royalroad.com\/fiction\/88455\/the-herald-of-ash","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Male Lead","Strong Lead","Action","Adventure","Fantasy","Tragedy","Reincarnation","Supernatural","Magic","GameLit","Low Fantasy","High Fantasy","Progression"],"lable":"Original","following_count":1,"rating":0.0,"page_count":44,"view_count":206,"chapters_count":4,"last_update":1718423306,"description":"The story follows Malakai, a young adventurer who finds himself imbued with strange powers after an encounter with a phoenix. He joins the Iron Bulls guild and befriends a group of seasoned adventurers.\nAs Malakai learns to control his growing abilities, the guild becomes embroiled in a conspiracy involving rogue adventurers and a rival guild. Despite their efforts to expose the truth, the Iron Bulls are discredited and forced into hiding.\nAfter intense trials and tragic losses, Malakai and his remaining allies finally uncover evidence that implicates the opposing guild in facilitating the rogue adventurer attacks. However, their victory is upended by a powerful new threat unleashed by the vengeful guild leader.","description_hash":107440724461541566},{"title":"The Fates' Dark Whisper","fiction_id":"88454","link":"https:\/\/www.royalroad.com\/fiction\/88454\/the-fates-dark-whisper","tags":["Female Lead","Strong Lead","Drama","Fantasy","Romance","Mystery","High Fantasy","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":6,"view_count":35,"chapters_count":1,"last_update":1718307091,"description":"In the isolated depths of the forest known as The Fates, a young sorceress struggles to survive, collecting firewood and foraging for food to endure the harsh winters. Haunted by eerie whispers and the chilling howls of wolves, her solitary existence is upended when she discovers a wounded beast-like man with silver hair, drenched in blood, amidst a scene of carnage.","description_hash":2195317826742460592},{"title":"Nexus","fiction_id":"88453","link":"https:\/\/www.royalroad.com\/fiction\/88453\/nexus","tags":["Virtual Reality","Urban Fantasy","Sci-fi","Slice of Life","First Contact","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":114,"view_count":791,"chapters_count":41,"last_update":1718306810,"description":"A young man has a lucky break and finds a bracelet with a sentient AI who offers him access to the Nexus .\nWhat will Alex do ?\n\nThis is my first time writing something and English is not my native language , don't expect to much of this story and please be kind... i kinda wish to finish this story .\nDon't expect regular updates !","description_hash":-726355894232602903},{"title":"My Big Goblin Space Program [LitRPG][Non-human][Isekai]","fiction_id":"88452","link":"https:\/\/www.royalroad.com\/fiction\/88452\/my-big-goblin-space-program-litrpgnon-humanisekai","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Ruling Class","Comedy","Adventure","Fantasy","Sci-fi","Non-Human Lead","Strategy"],"lable":"Original","following_count":43,"rating":4.92,"page_count":58,"view_count":1991,"chapters_count":11,"last_update":1718571662,"description":"All Chris ever wanted to be was an astronaut. Strong, smart, and born in Ohio, even losing both his legs in an accident didn't slow him down for long. In fact, he was about to be the first person without legs to walk on the moon. But when the rocket on his first moon mission explodes during launch? Well, that's harder to walk off than a double amputation. Or, at least, it should be.\nChris finds himself waking up in a new body with a mysterious message floating in front of his face: That he's been granted a new life as a goblin king, with the ability to command others of his kind. Goblins are the weakest creatures in his new world, always stuck at level 1 and incapable even of communication beyond squawks and physical assault. but their numbers are legion and their loyalty to their new monarch is absolute. And this new world? Well, it's got a moon, too. A big one, with forests and seas. And Chris sees no reason why reincarnation should delay his plans for long. From stone age to space flight, it's time to speed-run the entirety of human civilization - goblin-style.\nArmed with an expanding army of fanatical followers and a dubious, self-propagating 'Goblin Tech Tree', he'll stop at nothing to jump-start the Apollo program on his new world. But he was brought here for a reason, and not everyone is content to leave the new king to his own devices. Hunters, predators, and even humans consider goblins to be pests at best, if not a source of sustenance or dubious medicinal practices. Chris will have to keep his tribe alive long enough to grow if he hopes to complete his derailed moon mission and solve the mystery of his new life in this new world.\nWhat to expect:\nA goblin main character - Unable to level up, but also unable to die unless he's the last goblin in his kingdom, his tribe is both his strength and his health pool.\nExploration, action, and problem solving\nEmpire building - Starting from rock bottom with a few rowdy goblins, the only place to go is up.","description_hash":-7646835222584826573},{"title":"Clinker","fiction_id":"88451","link":"https:\/\/www.royalroad.com\/fiction\/88451\/clinker","tags":["Post Apocalyptic","Grimdark","Non-Human Lead","Sci-fi","Strong Lead","Action","Adventure","Cyberpunk","Female Lead","Genetically Engineered ","Technologically Engineered","Soft Sci-fi","Dystopia","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":20,"view_count":44,"chapters_count":1,"last_update":1718299454,"description":"With the world covered in regenerating asphalt, only isolated outposts have survived the parking lot apocolypse. This story follows Larox Desjardins, gunner and navigator of resource extraction airship Clinker-21.--------------*Updates Every Friday for June and July 2024*","description_hash":220662368077134894},{"title":"The Manifestation Of Regret","fiction_id":"88450","link":"https:\/\/www.royalroad.com\/fiction\/88450\/the-manifestation-of-regret","tags":["Reincarnation","Urban Fantasy","Progression","Comedy","Female Lead","Action","Adventure","Fantasy","Cyberpunk","Strong Lead","Magic","High Fantasy","Technologically Engineered","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":4,"rating":0.0,"page_count":30,"view_count":158,"chapters_count":4,"last_update":1718553606,"description":"In the dynamic world of Aruya, where magic and machinery collide, Tokei awakens with no memory of her past. Thrust into a whirlwind of danger and discovery by a chance encounter, she must navigate a treacherous path filled with relentless adversaries, powerful secrets, and unexpected allies. Join Tokei on an action-packed journey as she fights to uncover her true identity and unlock the mysteries of a world teetering on the brink of chaos.","description_hash":4342404770754272248},{"title":"Clockwork Reaper, Book 1 of the Regna Secundus Insurrection","fiction_id":"88449","link":"https:\/\/www.royalroad.com\/fiction\/88449\/clockwork-reaper-book-1-of-the-regna-secundus","tags":["Steampunk","Adventure","Fantasy","Horror","Supernatural","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":33,"chapters_count":1,"last_update":1718299154,"description":"Disaster befalls Niamhime Geist as a bomb destroys her inventor father's mansion. Trapped in the steam-powered wheeled-chair her estranged yet genius father designed, she was born unable to walk. Overcome by the smoke and flames of the assassin’s blast, young Nia believes she is dead only to awaken in horror six months later with artificial arms and legs made of a strange metallic alloy! As Nia escapes from the artificer who dragged her from the ruins of her home, she discovers that the limbs can be manipulated by thoughts alone! Desperate to flee from a society obsessed with perfection that would judge her a monster, she wanders the nation alone; or so she believes. Death seems to follow her metallic footsteps. Whispers haunt her on the tail of the wind. Madness is stoked from within. While corpses pile up in the empire of Sorcière, the wealthy and the destitute share the same tale of a creature of chaos known as the Clockwork Reaper. Lady Geist becomes hunted by nobles, air pirates, and worst of all, the notorious self-righteous Magistrates. Only Nia can confront the nightmare that stalks the souls in Regna Secundus. A bitter harvest is at hand in the first book of the Regna Secundus Insurrection series.\nCopyright © 2013 by Daniel Hellmund\nAll rights reserved. No part of this book may be used or reproduced in any manner whatsoever without written permission, except in the case of brief quotations embodied in critical articles or reviews. Published 2013","description_hash":-7502301517854166289},{"title":"Chronicles of the Reborn Scholar","fiction_id":"88448","link":"https:\/\/www.royalroad.com\/fiction\/88448\/chronicles-of-the-reborn-scholar","tags":["Portal Fantasy \/ Isekai","Time Travel","Slice of Life","Action","Adventure","Fantasy","Mystery","Reincarnation","School Life","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":3,"view_count":102,"chapters_count":2,"last_update":1718428982,"description":"A once-renowned scholar and strategist from Earth, Kazuki, finds himself reincarnated in a world where magic and mythical creatures are commonplace. In his past life, Kazuki was a brilliant but reclusive academic, whose theories and discoveries were posthumously dismissed and forgotten due to political intrigues.","description_hash":7288032591169449260},{"title":"Cheat Skill Of The Forgotten Blood Sect","fiction_id":"88447","link":"https:\/\/www.royalroad.com\/fiction\/88447\/cheat-skill-of-the-forgotten-blood-sect","tags":["LitRPG","Reincarnation","Progression","Anti-Hero Lead","Grimdark","Action","Adventure","Fantasy","Romance","Supernatural","Male Lead","Strong Lead","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":10,"rating":4.29,"page_count":44,"view_count":279,"chapters_count":6,"last_update":1718301965,"description":"After his parents were killed by his own sect, and his puppies were taken back to hell, Joon grows with a cheat skill he gained after being consumed by a  dark power, a cheat skill called “Assassin of Gluttony.”\nIn this world full of powerful sect groups, mythic beings, gods, demons, and demonic qi, Joon’s dark and fatal journey is just beginning as he must do what he needs to get done, all so he can feel the feeling of happiness one last time. \nHe yearns for revenge, and his feeling of happiness back.\n[You have unlocked the Cheat Skill, “Assassin of Gluttony”, would you like proceed?]","description_hash":416097727538880731},{"title":"SuperSoldier (SI-OC\/MCU)","fiction_id":"88446","link":"https:\/\/www.royalroad.com\/fiction\/88446\/supersoldier-si-ocmcu","tags":["Progression","Anti-Hero Lead","Super Heroes","War and Military","Male Lead","Action","Adventure","Drama","Sci-fi","Harem","Slice of Life","Supernatural","Strong Lead"],"lable":"Fan Fiction","following_count":7,"rating":5.0,"page_count":125,"view_count":730,"chapters_count":10,"last_update":1718589884,"description":"What should a man do when he is forced to replace America’s greatest Hero? Give the best damn show of his life and become the greatest Super Soldier the world has ever seen or die trying.\nJohn was just an ordinary guy who ended up making a deal with a not-so-ordinary Guy. Now stranded in 1943, he must take on the biggest role he could have ever dreamed of, while making sure the world stays intact in the end... oh well, at least there are beautiful women. \n(SI-OC in MCU AU) Marvel AU - Marvel Cinematic Universe AU - Crossover - The boys","description_hash":512176407560195607},{"title":"I Waited Too Long To Kill My Best Friend And Now It's Too Late","fiction_id":"88445","link":"https:\/\/www.royalroad.com\/fiction\/88445\/i-waited-too-long-to-kill-my-best-friend-and-now","tags":["Comedy","Male Lead","Action","Adventure","Fantasy"],"lable":"Original","following_count":5,"rating":5.0,"page_count":19,"view_count":213,"chapters_count":3,"last_update":1718554696,"description":"Your typical MMO gamer's life is thrown into chaos when an extremely dangerous, ancient, and adorable monster is dropped off at his doorstep.\nThis creature is a sovereign, thought to be native to the underworlds, sovereigns develop extremely quickly with power and aggression growing exponentially as mature. Young sovereigns bond to a person, that person becomes the receiver of their growing aggression, with the caveat that they receive the sovereigns heart and power at the moment it dies.","description_hash":9018109607152723131},{"title":"Like Watching Paint Dry","fiction_id":"88444","link":"https:\/\/www.royalroad.com\/fiction\/88444\/like-watching-paint-dry","tags":["LitRPG","Non-Human Lead","Fantasy","Short Story","Satire"],"lable":"Original","following_count":0,"rating":0.0,"page_count":22,"view_count":48,"chapters_count":1,"last_update":1718298864,"description":"This book is literally about paint drying.\nIf that sounds like fun to you, then read ahead!\nYou have been warned...","description_hash":3181914461812715224},{"title":"Light Up The Sky","fiction_id":"88443","link":"https:\/\/www.royalroad.com\/fiction\/88443\/light-up-the-sky","tags":["Time Travel","Post Apocalyptic","Female Lead","Drama","Action","Fantasy","Romance","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":28,"chapters_count":1,"last_update":1718298843,"description":"We were on the verge of something huge. This event could be downright catastrophic to our existence as we knew it. The consistent buzzing in my eardrums and crackling of nerves throughout my body felt like a warning. It felt like a premonition. It felt like a smoke signal or a tornado warning. But what was coming?","description_hash":7122727605008963223},{"title":"Unofficial Legends of the North","fiction_id":"88442","link":"https:\/\/www.royalroad.com\/fiction\/88442\/unofficial-legends-of-the-north","tags":["Non-Human Lead","Adventure","Fantasy","Short Story","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":25,"chapters_count":1,"last_update":1718298832,"description":"A compilation of fictional short stories similar to myths about the Yukon North. (No stories written in this are official stories from any cultural background, all are fiction created in the mind of the author)","description_hash":6365520574542757721},{"title":"Liferaft","fiction_id":"88441","link":"https:\/\/www.royalroad.com\/fiction\/88441\/liferaft","tags":["Post Apocalyptic","Ruling Class","Psychological","Male Lead","Sci-fi","Adventure","Drama","Hard Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":23,"chapters_count":1,"last_update":1718298827,"description":"200 years after the death of the planet Earth, Jimmy West works in the lower strata of the liferaft, Saratoga--the last of twelve county sized, self-sustaining biospheres that escaped the Earth's destruction the day a meteor punched a hole through the Earth's mantle and jettisoned chunks of molten core and continent adrift through space. West, as he's called by other grease monkeys like him, is the victim of an accident that pits his life against standard limitations rationed for crew retrieval should the worst happen--a crew member is flung from the Saratoga and set adrift. Now, West must stay calm and use a dwindling number of resources to reconnect with the Saratoga or a die a cold death alone in space.","description_hash":142404040241730950},{"title":"shhhhhh secrets","fiction_id":"88440","link":"https:\/\/www.royalroad.com\/fiction\/88440\/shhhhhh-secrets","tags":["Mystery"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":0,"view_count":21,"chapters_count":1,"last_update":1718298823,"description":"You found this! Nice! if you didn't come here without already understanding what's going on this won't make sense. If you do know here's the thing you were looking for. its short but Its got about the same amount of info that the other mysteries do. Its really cool to me that you, whoever you are, bothered to try and figure these out. Thank you!","description_hash":7868093462517363749},{"title":"7 Minutes (Short Story)","fiction_id":"88439","link":"https:\/\/www.royalroad.com\/fiction\/88439\/7-minutes-short-story","tags":["Psychological","Male Lead","Tragedy","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":19,"chapters_count":1,"last_update":1718298796,"description":"How would you imagine two socially anxious people meeting each other for the first time? Not so much conversation right? Well thats exactly how these two meet up but as minutes went by... it became more than just conversation...","description_hash":-2941738582769349202},{"title":"Stay Away","fiction_id":"88438","link":"https:\/\/www.royalroad.com\/fiction\/88438\/stay-away","tags":["Non-Human Lead","Sci-fi","Short Story","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":36,"chapters_count":1,"last_update":1718298773,"description":"A short story that follows an alien, Ziquecha, through one of his days as a guard of a quarantine zone.","description_hash":-430977335177681903},{"title":"No Potential","fiction_id":"88437","link":"https:\/\/www.royalroad.com\/fiction\/88437\/no-potential","tags":["GameLit","Portal Fantasy \/ Isekai","Progression","Strategy","Male Lead","Action","Adventure","Fantasy","Horror","Magic"],"lable":"Original","following_count":2,"rating":0.0,"page_count":18,"view_count":171,"chapters_count":3,"last_update":1718467164,"description":"System, tutorial, ranks, potential, it all sounds great to Samuel Garth, a young man in college, but the reality is much, much worse than he imagined. Death is expected for him and his colleagues. The system has deemed that he has no potential for growth, and so he must endure hellish conditions just to survive the easiest challenges the tutorial has.(Inspired by Hell Difficulty Tutorial, it's very good go read it)","description_hash":-9201655079926481777},{"title":"Sword Witch Book One","fiction_id":"88436","link":"https:\/\/www.royalroad.com\/fiction\/88436\/sword-witch-book-one","tags":["Reincarnation","Urban Fantasy","Super Heroes","Martial Arts","Multiple Lead Characters","Action","Adventure","Drama","Fantasy","School Life","Supernatural","Female Lead","Strong Lead","Secret Identity","Magic"],"lable":"Original","following_count":4,"rating":0.0,"page_count":23,"view_count":101,"chapters_count":2,"last_update":1718532002,"description":"Nariko Kelly awakens into a life that is not her own, with a face she barely recognizes, as a member of a family she has never met, and her last fleeting memories an indistinct dream of condemnation. Lost in a world that expects her to be someone she is not, things turn even worse when a sword-wielding demon appears and demands she fight him! And then a magical girl attacks?! What madness has this new life hurled her into?!\nTransform, Sword Witch, and carve a path to the truth!\nUpdates every Sunday!","description_hash":1734946477522339651},{"title":"How to Profit From a Fantasy World","fiction_id":"88435","link":"https:\/\/www.royalroad.com\/fiction\/88435\/how-to-profit-from-a-fantasy-world","tags":["Progression","Comedy","Male Lead","Action","Adventure","Fantasy","Supernatural","Magic"],"lable":"Original","following_count":5,"rating":3.0,"page_count":89,"view_count":553,"chapters_count":12,"last_update":1718389064,"description":"Waking up naked before a giant was not something Erik Park expected to happen to him. Nor was getting revived in a new world. But hey, now he's got a chance to do all the things he's read about in books, right?\nExcept... with a less-than-normal companion, the most restrictive abilities, and never being able to predict what happens next, Erik finds himself less worried about ever defeating the Demon King and more concerned about getting rich.\n*Pokes fun at many tropes in stories; just a series for me to let loose. Perfect if you're looking for something to pass the time without thinking too much about it.**Uploads once a week, occasionally may upload several chapters at a time.**Available on Scribblehub: https:\/\/www.scribblehub.com\/series\/1116608\/how-to-profit-from-a-fantasy-world\/ *","description_hash":-5903297269481334705},{"title":"Akiregom: Flame Of The Lost","fiction_id":"88434","link":"https:\/\/www.royalroad.com\/fiction\/88434\/akiregom-flame-of-the-lost","tags":["LitRPG","Martial Arts","Multiple Lead Characters","Strong Lead","Action","Adventure","Fantasy","Male Lead","GameLit","High Fantasy"],"lable":"Original","following_count":14,"rating":5.0,"page_count":23,"view_count":205,"chapters_count":2,"last_update":1718408356,"description":"Raised by dragons and unknowing of  his heritage, Queltsom Worldguest finds himself imprisoned in an unfamiliar small town, away from anyone he has ever known. Although he is blind, he is in no way helpless.  Tought many things by the dragons who cared for him, he will have to use his knowledge and experience to face the challenges coming his way. He also needs to know who in the blasted Blight he really is.Ken Rio Valdris, formerly known as Arthur Green, was isekaied from Earth into a magical world they call the Omnis of the Emerald moon. That was 6 months ago. Things have turned quiet and uneventful, but they are about to be thrust into chaos once again. This world does not treat those who stagnate in their cultivation well, and Ken will have to grow stronger in order to survive. He also hasn't forgotten the score he has to settle with a nightmarish enemy.Those two will have to work together and form a team if they want to thrive in the Omnis and the Cosmos beyond.***info***  This is a rewrite of my old work Karitsu: The Last Sovereign, hopefully better written and formatted. After long periods of me stuck manually formatting the novel with html code that RR processes and renders, I have been helpfully advised to use Microsoft Word, which is accessible enough to screen readers to actually allow me to select and format the selections accurately. The novel is a litrpg custom cultivation epic fantasy. I would love it if you guys rated, commented and reviewed it, helping me be a better writer.\nPosting schedule: my regular will be once per week, unless I manage to squeeze some chaps early. I'll try to write faster than I publish, so hopefully I'll get a backlog that allows me to speed the schedule up. Bear with me and apologies.\nThanks for reading Akiregom: Flame Of The Lost.","description_hash":-427451599994913763},{"title":"Deep Desert Dungeon","fiction_id":"88433","link":"https:\/\/www.royalroad.com\/fiction\/88433\/deep-desert-dungeon","tags":["Dungeon","Multiple Lead Characters","Action","Fantasy","Mystery","Non-Human Lead","Magic","High Fantasy"],"lable":"Original","following_count":18,"rating":5.0,"page_count":36,"view_count":535,"chapters_count":4,"last_update":1718618265,"description":"'I will survive.'\nThis is the mantra of a dungeon that, unfortunately, had been placed in the middle of nowhere, inside a giant desert.\nWhile had had struggled in the harshness of the desert to survive, he was content with being alone with only the occasional intuder.\nHowever, after waking up from a period of dormancy, he realized that he was about to get intruders.\nMany intruders.\nTime for war! Joy.","description_hash":1433737329142728250},{"title":"Arcane Cataclysm","fiction_id":"88432","link":"https:\/\/www.royalroad.com\/fiction\/88432\/arcane-cataclysm","tags":["Urban Fantasy","Progression","Post Apocalyptic","Grimdark","Male Lead","Action","Adventure"],"lable":"Original","following_count":4,"rating":5.0,"page_count":19,"view_count":92,"chapters_count":2,"last_update":1718629252,"description":"Awakening to the devastation wrought by an unfathomable event, Ethan Brooks finds himself thrust into a world where humanity is teetering on the brink of extinction. Amidst the ashes of civilization, survival becomes Ethan's sole imperative, his every breath a battle against the encroaching darkness.\nFrom the crumbling remnants of his once-familiar school and hometown to the vast, desolate wilderness stretching beyond, Ethan is a lone figure navigating a landscape ravaged by forces beyond comprehension. Each step forward is a struggle, every heartbeat echoing the desperate rhythm of a world torn asunder.\nIn this harsh and unforgiving reality, Ethan is compelled to shed his humanity, to confront challenges that dwarf his own existence. Against impossible odds, he must forge ahead, drawing upon reserves of courage and resourcefulness he never knew he possessed.\n\nNotes:\nI am also sharing this on the r\/HFY subreddit on Reddit.\nLink: Arcane Cataclysm","description_hash":-808683522513979412},{"title":"Dungeons and Dragons Adventures","fiction_id":"88674","link":"https:\/\/www.royalroad.com\/fiction\/88674\/dungeons-and-dragons-adventures","tags":["Dungeon","Anti-Hero Lead","Grimdark","Multiple Lead Characters","Action","Adventure","Fantasy","Short Story","Low Fantasy"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":20,"view_count":0,"chapters_count":1,"last_update":1718636342,"description":"Follow Edward, Edalyn, and Edison, a Fighter, Cleric, and Magic-User trio, as they go on many adventures throughout the land of Greyhawk (often biting off more than they can chew).\nA planned collection of self-contained short stories loosely based on the settings of Advanced Dungeons and Dragons modules.","description_hash":600500213371777572},{"title":"The Woven Legacy","fiction_id":"88673","link":"https:\/\/www.royalroad.com\/fiction\/88673\/the-woven-legacy","tags":["Reincarnation","Time Travel","Secret Identity","Fantasy","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":8,"chapters_count":1,"last_update":1718634291,"description":"In the Mistry family, magic awakens at sixteen, manifesting in unique ways. Off Mistry, yearning for his own magic, feels like a disappointment compared to his fire-starting, shadow-dancing siblings. However, on his sixteenth birthday, a faint thrumming awakens within him, revealing a new kind of magic - empathy.\nOff can sense and manipulate the emotions of others. As he explores his power, he helps a wilting rose bloom with positive emotions and learns to navigate the overwhelming currents of feeling in crowded spaces. With guidance from his wise grandmother, Off starts to control the flow of emotions, becoming a filter for the chaos around him.\nThis newfound power sets Off on a unique path within the Mistry family. Uncharted territory for the Mistrys, Off's empathy holds immense potential, and he is determined to learn its limits and possibilities.","description_hash":5143900488153968598},{"title":"A Wizard's Journey into Darkness","fiction_id":"88672","link":"https:\/\/www.royalroad.com\/fiction\/88672\/a-wizards-journey-into-darkness","tags":["Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","War and Military","Multiple Lead Characters","Action","Adventure","Fantasy","Supernatural","Male Lead","Female Lead","Non-Human Lead","Magic","Mythos"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":6,"view_count":7,"chapters_count":1,"last_update":1718634287,"description":"The tale of the wizard Asmin as he plunges the depths of the astral plane, in search of scholarly knowledge of the worlds beyond men. What he found was not what he expected, instead of returning to Etterdam as a great explorer. He found himself transformed into a demon and bound to a vengeful wizard eager to use his demonic powers on her enemies. Damned to the Abyss, Asmin must use all his wits and skills to keep his head less heaven and hell strike him down. \nA progression fantasy fan fiction based on the events and setting of J. L. Langland’s Demons of Astlan. \nDemon's of Astlan Wikia","description_hash":4866218678900759454},{"title":"Gathered From the Meadow","fiction_id":"88671","link":"https:\/\/www.royalroad.com\/fiction\/88671\/gathered-from-the-meadow","tags":["Multiple Lead Characters","Contemporary","Drama","Romance","Female Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":7,"chapters_count":1,"last_update":1718634263,"description":"A collection of short stories taking place in and around the small seaside town of Violet Meadows, many coming from other stories in the series. The thoughts, emotions and experiences that could not be contained in their original stories can be found here.\nUpdates infrequently.","description_hash":26705735110405628},{"title":"Unstable : DORMANT","fiction_id":"88670","link":"https:\/\/www.royalroad.com\/fiction\/88670\/unstable-dormant","tags":["Female Lead","Sci-fi","Tragedy","Supernatural","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":12,"chapters_count":1,"last_update":1718629020,"description":"Once upon a time, there was a big planet. Full of life. But soon it decayed. The animals went extinct. Nature disappeared. The only surviving species was the Norians. By genetically modifying their dna and developping technologies good enough to artificially create plants, recycle the air, recycle food, they were able to survive. \nBut they modified their dna too much. And you can't mess with the laws of nature. They weren't able to reproduce anymore. The babies would die at birth. No exception. To solve that problem, the Unity project was launched. Leaded by Alayna Idliome, they were trying to merge AI and robotics to a norian baby intra utero. Unfortunately the project failed and became illegal.\nUntil one night, when Alayna's daughters: Enma and Aeri, stole her mother's car, crashed into a house and burned down. To save her daughters in extremis, she had to do the one thing that the government forbade her to do...","description_hash":683079729897411382},{"title":"Life Mage [LitRPG\/Slice of Life\/Healer Mage]","fiction_id":"88669","link":"https:\/\/www.royalroad.com\/fiction\/88669\/life-mage-litrpgslice-of-lifehealer-mage","tags":["LitRPG","Dungeon","Martial Arts","Female Lead","Slice of Life","Action","Adventure","Drama","Fantasy","Magic","High Fantasy","Progression"],"lable":"Original","following_count":5,"rating":0.0,"page_count":41,"view_count":163,"chapters_count":3,"last_update":1718631049,"description":"Aeryth always dreamed of becoming a mage. Her wish came true. She was granted the power of life. \nThen, the tragedy struck. A rogue army of Death Knights descended upon their village. Aeryth lost everything except for her life. A traveling healer saved her. \nNow, she must adapt to her new life in Lesterforge—a city that challenges her common sense at every step—as she learns about her magic power and stands on her own feet.\nAeryth is prepared to do everything in her power to awaken the magic she has, and she might not even need to look far—just at the 'run of the mill' library she is supposed to work in. \nThe story starts with a tragedy, but most of the story will have a lighter tone. \nWhat to expect: \n- Slice of Life\/Drama. - Character Focused Narrative  - Weak to Strong. - Slow burn progression. - And, hopefully, an interesting story.","description_hash":-2029437552126552140},{"title":"Borrowed Time","fiction_id":"88668","link":"https:\/\/www.royalroad.com\/fiction\/88668\/borrowed-time","tags":["Male Lead","Action","Adventure","Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":15,"view_count":82,"chapters_count":2,"last_update":1718624532,"description":"\"I feel like I'm on borrowed time,\" I whispered, my eyes tracing the names etched into the stone. My allies, my friends, rested here because of the path I'd chosen.\n\nThe earlier chapters will be slow and action from the main character will start a bit late. I want to dive into the world's issues and be more in-depth about it. The novel will receive frequent updates (probably 5 chapters a week) until it reaches a point where I'm satisfied with it and slow down the uploads.","description_hash":1014766627683054278},{"title":"Seeker, NPC","fiction_id":"88667","link":"https:\/\/www.royalroad.com\/fiction\/88667\/seeker-npc","tags":["Virtual Reality","Reincarnation","Dungeon","Multiple Lead Characters","Sci-fi","Adventure","Fantasy","LitRPG","Reader Interactive","Supernatural","Magic","High Fantasy","Soft Sci-fi","Progression","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":47,"chapters_count":1,"last_update":1718613152,"description":"Discovering a reality overlay can't be good if others are killing to keep it secret.\nIn the world of Genesis, feudal empires rule the world, and nobles are above the law.\nOn the western edge of the known world, in the shadow of the Ironcrest Mountains, lies Lapidara, a remote village where life flows as predictably as the seasons. The blacksmith's apprentice discovers an ancient crystal skeleton wearing an alms purse embroidered with a set of strange symbols, untouched by time and decay. And that one small event begins the avalanche of events unlocking the secrets of a bygone era, a reality never imagined, and a magical legacy tied to the stars themselves.\n\"Where ancient secrets and virtual realities collide, a hero's legacy is born. This is an amazing story, and is officially my favorite LitRPG of all time.\" - Tim M.\nSchedule: 1+ chapter(s) a week.Avg chapter length: 2500 words\nTags and content warnings mainly give me the freedom to go where I need to go if I need to go there. But really, this stuff would be rated PG-13 if it were a Hollywood movie.\nThis is being released as an audiobook podcast on Spotify (and many other podcaster sites), early access at ReamStories.com\/Seeker, eventually as eBooks and audiobooks, and, of course, here on RoyalRoad.","description_hash":5065373594090331994},{"title":"The Heavenly Demon's Journey to the Magic World","fiction_id":"88666","link":"https:\/\/www.royalroad.com\/fiction\/88666\/the-heavenly-demons-journey-to-the-magic-world","tags":["Portal Fantasy \/ Isekai","Dungeon","Post Apocalyptic","Anti-Hero Lead","War and Military","Action","Adventure","Fantasy","Romance","Reincarnation","Martial Arts","School Life","Male Lead","Magic","Strategy","Xianxia","High Fantasy","Ruling Class","Dystopia","Progression","Attractive Lead"],"lable":"Original","following_count":5,"rating":0.5,"page_count":16,"view_count":192,"chapters_count":5,"last_update":1718612116,"description":"The Heavenly Demon died at the hands of his comrades due to his opposition of the Ascension to Immortality.\nThe people whom he trusted the most betrayed him and pierced their swords into his different parts of his body. His heart, body, soul, different organs and even legs and arms. \nFeeling the eerie death's door hanging around him. Before he died, he wished subconsciously to the Heavenly Spirit for a second chance...\nAnd he woke up, he finds himself into the World of Magic and Swordmanship.\nCan he survive this peculiar world?\nCan he adapt in this strange world?\nAnd can he reached the peak and take revenge on the people who betrayed him?","description_hash":4402662689188250059},{"title":"Unbegotten","fiction_id":"88665","link":"https:\/\/www.royalroad.com\/fiction\/88665\/unbegotten","tags":["Portal Fantasy \/ Isekai","Urban Fantasy","Progression","War and Military","Grimdark","Adventure","Fantasy","Horror","Tragedy","Reincarnation","Supernatural","Male Lead","Multiple Lead Characters","Magic","Strategy","Low Fantasy","High Fantasy","Steampunk","Mythos","Ruling Class","Dystopia"],"lable":"Original","following_count":1,"rating":0.0,"page_count":21,"view_count":124,"chapters_count":4,"last_update":1718608661,"description":"Amidst churning gears and the billowing steam, who among the Extractors can resist the madness?Amidst the rat race and the calls for bloodshed, who among the mortals has the grit to resist corruption?They are themselves deities but none dare refer to themselves as gods.\nI opened my eyes to a world teeming with wonders. Some argue it’s science, just not yet understood. Most simply call it mysteries.\nFirearms thundered, cannons roared and battleships prowled the seas. The age Hydro begins. Meanwhile, invasion engines thrummed in the shadow world. Potions, divinations, curses, sealed artifacts, smith mastered artifacts, national treasures and the smell of freedom and equality.\nThus unfolds the saga of He who has come to be known as: Ungeboren.","description_hash":-4506126023093444273},{"title":"a madman adrift in a flock of sheep (attempt one)","fiction_id":"88664","link":"https:\/\/www.royalroad.com\/fiction\/88664\/a-madman-adrift-in-a-flock-of-sheep-attempt-one","tags":["Progression","Villainous Lead","Ruling Class","Psychological","Non-Human Lead","Action","Adventure","Fantasy","Supernatural","Secret Identity","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":6,"view_count":65,"chapters_count":2,"last_update":1718605351,"description":"disclaimer 1: i have not actually written this properly just like my friend, quality is not quarantined its just a bit of fun since a friend of mine seemed to enjoy doing this.\ndisclaimer 2: as the main character of this is an ex mafia member there will be some graphic descriptions, gore, blood, misery etc.\ndisclaimer 3: I'm a whimsical creature and therefore do not be so sure i wont just drop this and gap it randomly.\nattempt one will be based off of the concept of a transmigrated mafia member in a magic world, i saw this very poorly executed once and will be trying my best to implement it in a better way(taking inspiration for the idea and the idea only), as my name implies I'm calling the execution terrible when my execution is going to be much the same.\nstart point: childhood\nsystems: mages and warriors who engrave runes into their skin to be able to control an etheric energy to either enhance themselves or control parts of the world\nplan: starts off at childhood where mc gets education( the bulk of the world building will happen for the early game here.) then we move on to growing power which will happen after mc has graduated, after personal character growth is growing his faction and territory(a head cannot be without its body) and after that is a lot of not so pg. things I'm not sure i can put in here so read and find out,\nchapters will be out every Friday, quantity per week will be from 0-5 chapters(i will see how things go)","description_hash":-5977764884506980298},{"title":"VASUNDHARA REALM - 2","fiction_id":"88663","link":"https:\/\/www.royalroad.com\/fiction\/88663\/vasundhara-realm-2","tags":["LitRPG","Reincarnation","Anti-Hero Lead","Xianxia","Multiple Lead Characters","Action","Drama","Fantasy","Romance","School Life","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":26,"view_count":23,"chapters_count":2,"last_update":1718631049,"description":"Thirteen years ago, Sanand, the mighty king of Shambhala, was betrayed by his loved ones. On the brink of death, he sacrificed his soul to his ancestors, vowing revenge. \nNow, in the form of an enigmatic teenager named Shiyan, he embarks on a journey to become the strongest soul warrior. \nAs Shiyan trains, fragments of his past life return, unveiling his identity as Sanand. Fueled by the memories of betrayal, he sets out on a relentless quest for vengeance. But soon he finds deep within his soul lies a dormant and formidable power, a force capable of consuming gods. This imprisoned entity lingers on the edge of becoming either Shiyan's greatest power or his most terrifying enemy.\nHaunted by his past and the ominous power within, Shiyan faces a perilous path. Will he master the darkness inside and fulfill his vengeful oath, or will he be devoured by the very evil he seeks to unleash? In a world where trust is shattered and power tempts the soul, Shiyan must confront the ultimate test of his strength and resolve.","description_hash":8743474189585624910},{"title":"Rise of the Superstar","fiction_id":"88662","link":"https:\/\/www.royalroad.com\/fiction\/88662\/rise-of-the-superstar","tags":["LitRPG","Urban Fantasy","Progression","Anti-Hero Lead","Comedy","Drama","Romance","Contemporary","Slice of Life","School Life","Male Lead","Multiple Lead Characters","Secret Identity","Low Fantasy","Soft Sci-fi","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":30,"chapters_count":1,"last_update":1718601059,"description":"Orphaned at a young age, Song Minwoo found solace and a new home with a kind-hearted guardian. Years later, driven by ambition, Min-woo sets out to carve his path to success. Just as he begins to achieve his dreams, an unexpected system awakens within him, presenting both extraordinary abilities and unforeseen challenges. \nWill Min-woo master this newfound power and overcome the obstacles it brings? Can he fulfill his deepest wishes? This is the gripping tale of Song Minwoo's relentless journey to the top.","description_hash":332958768261302069},{"title":"Penance: Prison Of The Gods","fiction_id":"88661","link":"https:\/\/www.royalroad.com\/fiction\/88661\/penance-prison-of-the-gods","tags":["LitRPG","Dungeon","Multiple Lead Characters","Action","Adventure","Fantasy","Romance","Male Lead","Female Lead","High Fantasy"],"lable":"Original","following_count":6,"rating":5.0,"page_count":63,"view_count":279,"chapters_count":9,"last_update":1718634791,"description":"Penance is a prison for gods whose power must be kept in check—a halfway point between heaven and hell for those who failed to find salvation at death.\nAs Rod makes his way through this dungeon, he slowly recovers his memories that were fractured at death. But as he dives deeper and deeper into the dungeon, he’ll get involved in the machinations of the gods and learn that some secrets should have stayed dead. After all, the Good don’t need repentance.  \n— Penance: Prison of the Gods.\n           A Rogue-Lite Lit-rpg adventure.This is a LITRPG with stat windows and lots of loot. It is also a romance story at its core, though it will take a couple of books to get there. I will update twice daily after launch day, starting on June 17th, and then once daily, starting July 2nd.\n\nArt by Aradekudraws","description_hash":9214914598741647318},{"title":"Wasteland Conqueror","fiction_id":"88660","link":"https:\/\/www.royalroad.com\/fiction\/88660\/wasteland-conqueror","tags":["LitRPG","Reincarnation","Progression","Post Apocalyptic","Space Opera","Action","Adventure","Fantasy","Sci-fi","Harem","Supernatural","Male Lead","Strong Lead","Magic","Strategy","Xianxia"],"lable":"Original","following_count":4,"rating":0.0,"page_count":100,"view_count":415,"chapters_count":12,"last_update":1718625647,"description":"Dom, a man in his mid-twenties, suddenly gets reincarnated into the harsh post-apocalyptic world of his favorite game series, Wastelander. With his previous life ended and his new one just beginning he needed a new goal to strive for, and so with an ambitious heart, he decided to pursue the monstrous goal of conquering the wasteland in its entirety that has been left scarred by atomic fire for some two centuries.\nOn his journey through this new world, he’ll come face to face with all sorts of dangers ranging anywhere from mutants wanting to tear any human they come across to shreds for a quick meal to bandit clans that love to rape, pillage, and sell their victims into slavery.\nDespite those prevalent threats seeming dangerous enough to deter most from even attempting to set foot outside the confines of whatever safe haven they have, they're not even the worst of what he’ll come across in the pursuit of his goals. Dom’s quest will have him go toe to toe with the many powers that exist across the wasteland and their armies in his quest to one day conquer it. Will Dom achieve his dreams in this life or will he succumb to the many dangers that exist within the wasteland and beyond?","description_hash":8870159512211331821},{"title":"Legacies Of Legends: Einstein's Saga ","fiction_id":"88659","link":"https:\/\/www.royalroad.com\/fiction\/88659\/legacies-of-legends-einsteins-saga","tags":["LitRPG","Post Apocalyptic","Sci-fi","Action","Fantasy","Supernatural","Magic","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":171,"view_count":382,"chapters_count":25,"last_update":1718603602,"description":"In a world whereby the Cataclysmic Descent began a thousand years ago. This follows the journey of a young boy by the name Einstein.\nVarious mysteries sermed to surround Einstein. His parents sudden dissapearance 5 years ago, or is it the mysterious trial ground left behind by them. Or the various high level artifacts inherited by him.\nYet Einstein wasn't able to make use of anyone of them.\nWhy??\nSimple...simply because he's a trash. Unable to awaken his mana spark unlike other Awakeners or mana cultivators. Despite possessing immense wealth, Einstein was destined to stay at the bottom of the food chain.\nYet this changed on one fateful day.\nThe day he completed the trial left behind by his parents, everything changed.\nNot only did he gain the unknown potion, he also fused with the mysterious and enigmatic being of the virtual world.\nUpon awakening, Einstein found out that not only had he became an awakener or cultivator...but he had become a supreme cultivator.\nNow empowered with an unknown talent that most could only dream of having, and with the aid of the enigmatic being later reavealed to be the Bio-Nanotech system.\nEinstein embarks on the path to grow stronger and uncover the hidden secrets behind the sudden dissapearance of his mom and dad.","description_hash":4907919543301949761},{"title":"Rewrite: A Writer's Frustration","fiction_id":"88658","link":"https:\/\/www.royalroad.com\/fiction\/88658\/rewrite-a-writers-frustration","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Post Apocalyptic","Anti-Hero Lead","Action","Adventure","Comedy","Fantasy","Cyberpunk","Reincarnation","Martial Arts","Reader Interactive","Supernatural","Male Lead","Strong Lead","Magic","Xianxia","High Fantasy","Mythos","Ruling Class","Genetically Engineered ","First Contact","Dystopia","Progression","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":30,"chapters_count":1,"last_update":1718598888,"description":"Jason an average writer, finally got his big chance to create his own book and become famous. Using his fancy Pen name he's been thinking about for years. But now the entire world has been combined with his novel on the whims of the system to spice up the new universe he's going to release like nothing the previous multiverses have seen. Will Jason be able to keep drinking his coco, while he fights growing dangers. As reaches for higher heights seeing the world he had the influence in creating.","description_hash":4830771515304912762},{"title":"The patched up magic","fiction_id":"88657","link":"https:\/\/www.royalroad.com\/fiction\/88657\/the-patched-up-magic","tags":["War and Military","Non-Human Lead","Adventure","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":27,"chapters_count":1,"last_update":1718597738,"description":"This is a world like many others.\nWith a planet called Earth A place where wonderful and terrible things happen on a daily basis But we are not following the usual protagonist. The teenage boys, girls or theys Whom usually take the spotlight, We won't be following no homosapien Or even Felines of some discretion will be following what most people would think as junk.\nBecause for now The only tethers To Normality is The will to survive,The hope of a better tomorrow And Not falling apart.\n===============================\nHello I I would like to know what I could improve because this is my first fiction here.","description_hash":-5070744215543343280},{"title":"In Love With a Japanese Girl","fiction_id":"88656","link":"https:\/\/www.royalroad.com\/fiction\/88656\/in-love-with-a-japanese-girl","tags":["Comedy","Male Lead","Drama","Romance","School Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":12,"chapters_count":1,"last_update":1718597734,"description":"Fifteen-year-old Alex Martienez's life is turned upside down when he moves from a tough neighborhood in the United States to the bustling metropolis of Tokyo, Japan. Leaving behind everything he's ever known, Alex is thrust into a world of unfamiliar customs, a new language, and the challenges of adapting to a different culture. On his first day at his new high school, Alex feels like a fish out of water until he meets Yui Nakamura, a friendly and approachable classmate who speaks English. Yui takes Alex under her wing, helping him navigate the intricacies of Japanese culture, school life, and everyday routines. As their friendship blossoms, Alex starts to feel more at home in this foreign land. However, things get complicated when Reina Takahashi, a new transfer student, arrives and shows interest in Alex. Caught in a web of cultural misunderstandings, personal growth, and budding romance, Alex must find a way to balance his feelings for Yui while dealing with Reina's unexpected revelations and his own identity struggles. As Alex and Yui's bond deepens through shared experiences, school festivals, and heartfelt confessions, they must confront external pressures, personal insecurities, and the complexities of their growing relationship. With graduation approaching, they face the ultimate test of their love and commitment.","description_hash":7703594314528984074},{"title":"the fallen empire","fiction_id":"88655","link":"https:\/\/www.royalroad.com\/fiction\/88655\/the-fallen-empire","tags":["Anti-Hero Lead","War and Military","Male Lead","Tragedy","Action","Romance","Mystery","Magic","Strategy","Ruling Class","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":41,"chapters_count":2,"last_update":1718634984,"description":"the great azeldian empire who lead humanity through dark times is about to fall.in the everden grand ducky a boy was born ill and weak  , las von everden he got kicked out and became a viscount in the north will he rise or fall will he save the old empire or not this is the story of the man given the name shield of the people in another dark era","description_hash":-5288682927233131271},{"title":"Curse' Fairytale","fiction_id":"88431","link":"https:\/\/www.royalroad.com\/fiction\/88431\/curse-fairytale","tags":["Anti-Hero Lead","Ruling Class","Multiple Lead Characters","Secret Identity","Action","Adventure","Fantasy","Historical","School Life","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":34,"chapters_count":2,"last_update":1718374521,"description":"Myce was inlove with Fairytale even though he knew it may hurt him once realism strike him. Yet, he doesnt care about that, cause' all this time, he knew—he was already curse.","description_hash":-4676006155791827377},{"title":"Wildest Dreams","fiction_id":"88430","link":"https:\/\/www.royalroad.com\/fiction\/88430\/wildest-dreams","tags":["Reincarnation","Urban Fantasy","Psychological","Secret Identity","Horror"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":12,"chapters_count":1,"last_update":1718279947,"description":"Isabella valencia was a girl who was always fascinated by the mysteries of history. She only took her fascination to another level when she shifted int an old house in the outskirts.","description_hash":-6820792949843403381},{"title":"Bite","fiction_id":"88429","link":"https:\/\/www.royalroad.com\/fiction\/88429\/bite","tags":["Urban Fantasy","Action","Adventure","Fantasy","Romance","Magic","Low Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":50,"view_count":412,"chapters_count":13,"last_update":1718609074,"description":"Arkania, a hectic world where everyone rushes through their lives and activities. Very vibrant during the days and during the night. Cyrus find himself constantly lying to everyone he loves, and coward in front of adversity. Until the day he learns he is marked by the Bureau. Running for his life, he stumbles on a lady that will forever change his reality, throwing it on a new track when he enters a villa.  The howling of those mysterious people within in the nights. Those individuals with abilities that defy common reasons. Those people called the Bites. Cyrus must survive this new way of leaving while finding an imaginary artefact called the primordial canine. Unfortunately, his inner demons catch him back Paralyzed by fear, his life takes a drastic turn when his loved ones are caught into the chaos threatened by mortal danger. The karmic Monster are catching up tearing the city on their way. Will he be able to survive his new life, find the primordial canine, vanquish the karmic monster and save his loved ones? eager to find out? let’s go for a crazy tour in Arkania.","description_hash":5207925751563361608},{"title":"Scattered Destiny -White-","fiction_id":"88428","link":"https:\/\/www.royalroad.com\/fiction\/88428\/scattered-destiny--white","tags":["Strategy","Multiple Lead Characters","Drama","Action","Fantasy","Mystery","School Life","Male Lead","Magic","Mythos","First Contact"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":24,"chapters_count":1,"last_update":1718279937,"description":"Leo, the newest addition to Class E, brings with him a sense of curiosity and determination that sets him apart from his classmates. As he navigates the unfamiliar territory of his new environment, Leo's presence disrupts the status quo, stirring dormant emotions and hidden truths that have long been buried beneath the surface. With a fresh perspective and an unwavering resolve, Leo seeks to forge connections and unravel the mysteries that shroud Class E, determined to uncover the truth and bring light to the shadows that lurk within. Despite facing skepticism and resistance from his peers, Leo's earnestness and compassion shine through, leaving an indelible mark on those around him as he embarks on a journey of self-discovery and redemption.","description_hash":-8404286952614119072},{"title":"Sleepy Scribbles","fiction_id":"88427","link":"https:\/\/www.royalroad.com\/fiction\/88427\/sleepy-scribbles","tags":["Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":15,"chapters_count":1,"last_update":1718279933,"description":"Supposedly Scribbles is the written equivalent to doodling, and I have a hankering to doodle with words from time to time, so I thought I'd put them here instead of keeping them in my head to be forgotten.  Especially if they're simple or dead end ramblings I make because i'm too tired or sleepy to weave actual stories further.","description_hash":-6646557138359004682},{"title":"A Tale of two Hearts ","fiction_id":"88426","link":"https:\/\/www.royalroad.com\/fiction\/88426\/a-tale-of-two-hearts","tags":["Female Lead","Drama","Romance","Male Lead","Magic"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":2,"view_count":18,"chapters_count":1,"last_update":1718279920,"description":"A Tale of Two Hearts\nIn the bustling city of Veridian, two lives ran parallel yet worlds apart. In the heart of the city, where skyscrapers kissed the heavens and wealth flowed like a river","description_hash":2069514151904130514},{"title":"FRACTURED SAMSARA: 4320 DAWNS OF DECAY","fiction_id":"88425","link":"https:\/\/www.royalroad.com\/fiction\/88425\/fractured-samsara-4320-dawns-of-decay","tags":["Reincarnation","Comedy","Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":26,"view_count":128,"chapters_count":4,"last_update":1718439976,"description":"In the twilight of Divinity, where shadows lengthen and the world teeters on the precipice of oblivion, two brothers stand poised at the crux of fate. Argos, with eyes that shimmer like celestial beacons, is the last echo of the world's protectors, his essence a flickering ember of hope in a dying age. His brother, Irakes, bears the chilling weight of a different legacy.Will Argos rekindle the fading embers of Divinity within Irakes, or will the darkness extinguish the last flicker of hope? In this epic saga of good versus evil, the final chapter of a timeless war unfolds, with the fate of the world hinging on the redemption of a corrupted soul and the unwavering courage of a reincarnated protector.","description_hash":10154097944410184},{"title":"Lixarts Academy: First Year","fiction_id":"88424","link":"https:\/\/www.royalroad.com\/fiction\/88424\/lixarts-academy-first-year","tags":["Multiple Lead Characters","Slice of Life","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":147,"view_count":426,"chapters_count":16,"last_update":1718581848,"description":"In the world of Daclon, where magic thrives and fantastical beings roam. Magic is everywhere... In your home, at your school, job, it's quite literally everywhere. What happens when you don't have any magic at all? Join Dominick in his harrowing adventure as his school life jump starts with action and tragedy. He has no bounds as his spirit prevails. What he lacks in power, he has in heart. As Dominick forges ahead, he forms an unlikely bond with a group of fellow misfits, each grappling with their own insecurities and shortcomings. Together, they form a tight-knit circle of support in the face of adversity. As they go forward, they will find things that will change their lives, things that'll never make the world seem like it once was. They must find a way to overcome the obstacles of life, love, loss, tragedy, and so much more.","description_hash":-9159179400652675970},{"title":"Maybe My Soulmate! (GL)","fiction_id":"88423","link":"https:\/\/www.royalroad.com\/fiction\/88423\/maybe-my-soulmate-gl","tags":["Portal Fantasy \/ Isekai","Xianxia","Female Lead","Strong Lead","Action","Adventure","Fantasy","Romance","Reincarnation","Martial Arts"],"lable":"Original","following_count":7,"rating":5.0,"page_count":23,"view_count":278,"chapters_count":5,"last_update":1718552274,"description":"This will be a slow update at first ( 1 - 3 chapters a week )and after a few weeks the number of chapters will go up depending of the view counts and reader's interest.\n\nThis is a gl novel in a xianxia cultivation novel. \nNo misunderstandings , extremely fast paced romance, No other love interests.\n\nThis is the story of our two protagonists Mo Yuxin (MC) and Su Yubing(FL) who are bound by a \nBond so strong that it transcends reality itself. They are each other's one and only soulmate, their love knows no bound. \nThis is story of their journey to cultivating immortality in a world that is unfair to women , in a world that is wholly dominated by men, where strength is all that matters. Without strength , you don't even get a chance to live peacefully. \nOur mc Mo Yuxin gets a legendary inheritance from a primordial god who is also one of the oldest gods to live till date and the only one in all of multiverse. This god and her already deceased soulmate decided to leave thei inheritance to their only descendant to whom the god's soulmate left a piece of their soul.\nWatch as how their journey brings about unprecedented changes to the whole world and the multiverse and their sweet and steamy love which will make your tooth ache from sweetness.","description_hash":-2370567739767831057},{"title":"Corrupt Cosmic Ranger","fiction_id":"88422","link":"https:\/\/www.royalroad.com\/fiction\/88422\/corrupt-cosmic-ranger","tags":["Villainous Lead","Psychological","Non-Human Lead","Sci-fi","Strong Lead","Action","Adventure","Cyberpunk","Male Lead","Hard Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":1,"rating":0.0,"page_count":2,"view_count":44,"chapters_count":1,"last_update":1718279771,"description":"In the small town of Maplewood, a powerful storm raged, causing the trees to bend and the skies to turn a sickly green. Curious and sharp-minded Max Carter ventured into the forest after seeing a mysterious white glow the night before. He discovered a pair of high-tech glasses among the wreckage of what appeared to be a crashed meteor. The glasses, with their alien symbols and intricate designs, seemed to possess a supernatural quality. When Max put them on, he experienced a surge of energy and heard a voice in his mind. The glasses activated a genetic synchronization, causing Max's vision to blur and his head to ache. However, he managed to retain the glasses and witnessed visions from distant stars, accompanied by a hunger for control and dominance. The glasses informed Max that he now had access to various alien forms and a mission to eradicate threats to the balance of the universe. Filled with determination and a newfound power, Max embraced his new abilities. He realized that the glasses were not just a tool, but a weapon. Despite the enormity of the task, Max was exhilarated by the power he possessed. Wearing the glasses, Max set out on a mission to cleanse the universe of all beings that posed a danger. He understood that he would become known not as a mere boy from Maplewood, but as a harbinger of a new era. As he walked away from the crash site, Max's mind was filled with plans and possibilities. With the Xenotech Interface, he believed he could conquer any threats the vast universe might hold.","description_hash":-799400560972884938}]