[{"title":"Of Fae and Ash","fiction_id":"87311","link":"https:\/\/www.royalroad.com\/fiction\/87311\/of-fae-and-ash","tags":["Strategy","Male Lead","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":40,"view_count":357,"chapters_count":7,"last_update":1718359203,"description":"Haunted by strange dreams and visions, Faelan sets out on a journey through the lustrous realm of Tertra with a single daunting mission: to kill an unkillable king.\nAs he navigates this world of visible and hidden turmoil, Faelan must confront his identity and ideals, as he gradually begins to unravel the tapestry of truth and lies woven around him..","description_hash":3290872217592736336},{"title":"Front Sight","fiction_id":"87310","link":"https:\/\/www.royalroad.com\/fiction\/87310\/front-sight","tags":["War and Military","Male Lead","Tragedy","Drama","Historical","Romance","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":36,"view_count":124,"chapters_count":2,"last_update":1717866015,"description":"Nixon Cannard, a 23-year-old army staff sergeant, thought he had his life all figured out. Stationed in Germany, he finds himself reunited with his old friend and comrade, SSG Nathan Brier, after being separated for three long years. Their bond, forged through grueling training and shared experiences, is unbreakable. But as they reconnect and rekindle their friendship, a night of drinking leads to a moment that changes everything.\n\n\n\nFront Sight is a gripping tale of love, loss, and self-discovery set against the backdrop of military life. It explores the depths of human emotion, the trials of coming to terms with one's identity, and the enduring power of love amidst the chaos of war. Join Nixon on his journey as he navigates the complexities of his heart, battles personal demons, and strives to find peace in the memory of his first love.\nFront Sight is based off of the author's long time stories and characters, and is a tale that was years in the making.","description_hash":-6137798916837897328},{"title":"Seekers of the Truth in a False World: The Mystery of Memories from Another Worldand Science","fiction_id":"87309","link":"https:\/\/www.royalroad.com\/fiction\/87309\/seekers-of-the-truth-in-a-false-world-the-mystery","tags":["Portal Fantasy \/ Isekai","Sci-fi","Adventure","Fantasy","Mystery","High Fantasy","Mythos","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":34,"chapters_count":1,"last_update":1716839024,"description":"Koizumi\nCurrently, I am serializing ``The False World and Those Who Chase the Truth: Mysteries of Memory Science in Another World''. This work depicts an adventure in which the protagonists travel between the real world and another world, pursuing the truth while solving mysteries at the intersection of science and philosophy.\nI started writing on December 2, 2023. I decided to compile the content that I have been writing on my homepage and other sites into a novel and leave behind a proof of my life. Some of the characters I had in mind, most of the story, and the final scene were already decided in detail, and I wrote about 15,000 words in a week, including the parts that haven't been made public.\nThe impetus for writing this work stems from the question ``What is reality?'' that I felt in my daily life. While incorporating interesting themes from modern science such as quantum mechanics, biological evolution, and artificial intelligence, we have created a way for readers to enjoy the book.\nThe characters in the story are inspired by various people I have met and experiences I have had. I would be happy if the difficulties and conflicts they face will give readers an opportunity to think about their own lives and worldviews.\nIt's my first time writing a novel, so I'm finding it difficult, but I appreciate your help.","description_hash":-617684356161160792},{"title":"prologue","fiction_id":"87308","link":"https:\/\/www.royalroad.com\/fiction\/87308\/prologue","tags":["Portal Fantasy \/ Isekai","Sci-fi","Adventure","Fantasy","Mystery","Magic","Mythos","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":27,"chapters_count":1,"last_update":1716839013,"description":"In an uncertain world where truth and falsehood intertwine, light and darkness form a vague boundary.\nThe silence of the city as night falls. The stars quietly illuminate the darkness of the sky, and their light softens the hustle and bustle of the city. Very few people know the other side of this world. Many people are caught up in their daily lives and only live on the surface of what they can see. On the other hand, in the illuminated cafes and parks of the city at night, people can be seen finding the small joys in life and taking a breather.\nHowever, behind this peaceful appearance, there were those who were pursuing the truth. One of them is Satoshi Koizumi, a physicist who is passionate about the mysteries of the universe. He first became interested in science when he was young, when his mother asked him to choose his favorite book. He picked up a book that unraveled the mysteries of the universe and a book that unraveled the mysteries of the human body. These books captured his heart and opened the door to the unknown.\nOne day, just as he was leaving the laboratory, a strange person appeared in front of him and spoke incomprehensible words. This encounter becomes an opportunity to create a new mystery in the story. That person was a person who would greatly change Koizumi's destiny.\nHis journey to find the truth begins with a seemingly ordinary conversation with his childhood friend and psychiatrist Masato Matsuda, but it soon leads the story to a deep mystery. This mysterious event forges bonds with new friends, and their expertise becomes the key to unraveling the story's mysteries.\nThe curtain rises on “The False World and Those Who Chase the Truth: Memories of Another World and the Mysteries of Science.” In the story, various developments await, such as battles between advanced AIs and life in another world.\nOn this journey, Koizumi meets biologist Misa Hoshi's friends, Li Wenqiang Li Wenqiang, an authority on quantum mechanics, and astrophysicist Chuama Amano's friends. Their combined expertise takes the story to a new level.\nWhen they finally found out the truth, it was far beyond their imagination. The weight of the unknown truth and the choices they make after that point their lives in a new direction.\nThey are faced with the crossroads of whether to reveal the truth to the world or remain silent. Their decisions had the potential to affect not only their own fate, but the future of all humanity. How they act after learning the truth - their choices form the final theme of this story.\nThis is a story of people torn between truth and falsehood. The ultimate question posed by this story is how the results of their quest will change their perceptions and ours.","description_hash":5764570152654197776},{"title":"Dungeon Master Dungeon Core","fiction_id":"87306","link":"https:\/\/www.royalroad.com\/fiction\/87306\/dungeon-master-dungeon-core","tags":["Portal Fantasy \/ Isekai","Dungeon","Anti-Hero Lead","Multiple Lead Characters","Fantasy","Reincarnation","Male Lead","Non-Human Lead","Magic","High Fantasy","Progression"],"lable":"Original","following_count":13,"rating":4.5,"page_count":28,"view_count":855,"chapters_count":4,"last_update":1718008928,"description":"When a DM gets isekai’d mid session, he find himself reincarnated as a dungeon core. \n~<>~ What to expect:\n• Bad writing\n• Mildly creative ideas\n• Tons of stereotypes\nNot only is this the first thing I’ve ever written, but I’m also not putting much effort into it. I’m just writing for fun, and to practice for when I decide to actually write something worth writing. I will probably come along and redo chapters as I gain experience, but for now it’s pretty bad. Feel free to give feedback, I’ll need it \nupdated every Friday at 1:00 PM EST","description_hash":-4445649804763753000},{"title":"#1 Wild princess","fiction_id":"87305","link":"https:\/\/www.royalroad.com\/fiction\/87305\/1-wild-princess","tags":["Xianxia","Female Lead","Slice of Life","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":30,"view_count":341,"chapters_count":5,"last_update":1717675159,"description":"Простая история принцессы, которая сбежала от встречи со своим женихом.","description_hash":-4555780682824393084},{"title":"Miicoro","fiction_id":"87304","link":"https:\/\/www.royalroad.com\/fiction\/87304\/miicoro","tags":["Super Heroes","War and Military","Comedy","Action","Adventure","Mystery","Supernatural"],"lable":"Original","following_count":1,"rating":0.0,"page_count":0,"view_count":40,"chapters_count":1,"last_update":1716838950,"description":"A World full Of Anomalies where human tries to survive.","description_hash":-4903452098264001986},{"title":"Time Travelers from the Umbrella House","fiction_id":"87303","link":"https:\/\/www.royalroad.com\/fiction\/87303\/time-travelers-from-the-umbrella-house","tags":["Time Loop","Super Heroes","Male Lead","Sci-fi","Adventure","Romance","Mystery","Time Travel","Genetically Engineered ","Technologically Engineered","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":1,"rating":0.0,"page_count":452,"view_count":3108,"chapters_count":72,"last_update":1718586004,"description":"A genius scientist with an extraordinary memory, driven by endless longing and love for his deceased sister, has dedicated himself to cutting-edge technological research, vowing to break the boundaries of life and death and reanimate his deceased loved ones. With his amazing memory, he has integrated an interdisciplinary body of knowledge in a short period of time and successfully developed an unprecedented time machine. This ingenious and complex device is an exquisite fusion of many cutting-edge scientific principles such as quantum entanglement, string theory, and hyperspace dynamics. With nervous anticipation, he activated the time machine and embarked on a century-long journey against the flow of time. However, the journey through space and time is not an easy one. When he sees the past with his own eyes, he is shocked to discover the truth of a dusty history. The author has cleverly hidden the ultimate answer to the question of life, death, family and historical destiny in a well-designed Easter egg. This Easter egg is like a hidden door, only those readers who have a good understanding of the details of the story can find clues between the lines and unlock the door, revealing the final choice of the scientists and the true direction of history. Let's take a journey of salvation through time and space together!","description_hash":727454030723676753},{"title":"Fable Of Fantasy: \"Susurros del Bosque Encantado\" [Español\/Spanish]","fiction_id":"87302","link":"https:\/\/www.royalroad.com\/fiction\/87302\/fable-of-fantasy-susurros-del-bosque-encantado","tags":["Portal Fantasy \/ Isekai","Dungeon","Anti-Hero Lead","Female Lead","Action","Adventure","Fantasy","Mystery","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":16,"view_count":30,"chapters_count":1,"last_update":1716838920,"description":"En un mundo donde los cuentos de hadas son más que historias, cuatro héroes inesperados deben unirse para salvar el reino mágico. Roja, una ladrona astuta; Alicia, una princesa hechicera; Thomas, un herrero con un corazón de acero; y Pinocho, un arquero de madera con el don de discernir la verdad. Unidos por el destino y guiados por el misterioso mago Merlín, deberán enfrentarse a los Korudi, hongos oscuros que amenazan con corromper su realidad. ¿Podrá este grupo de inusuales héroes superar sus diferencias y salvar el mundo mágico antes de que sea demasiado tarde? Únete a ellos en una aventura llena de magia, misterio y peligro en \"Fable of Fantasy: Susurros del Bosque Encantado\".","description_hash":-7525208617712737061},{"title":"An Inciting Isekai [Victorian Cultivation LitRPG]","fiction_id":"87301","link":"https:\/\/www.royalroad.com\/fiction\/87301\/an-inciting-isekai-victorian-cultivation-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Male Lead","Strong Lead","Action","Adventure","Fantasy","Mystery","High Fantasy","Progression"],"lable":"Original","following_count":1503,"rating":4.47,"page_count":183,"view_count":83244,"chapters_count":25,"last_update":1718389006,"description":"In a world where Ingredients are power, Levi will collect them all.\nIsekai’d, Levi awakens in a mysterious Victorian town, finding himself in a weak child's body amidst deep darkness, ravenous monsters, and a murderous plot of devil worshippers who wish to summon mythical beasts from the graveyard of the gods.\nThankfully, he possesses the rare talent of an Arch-Magus. Armed with deadly magical words, and traps, he's ready to [Incite] riots, gain classes, and level up to survive all that threaten his precious new life.\n\n\n\nWhat to expect: - A unique power system that revolves around absorbing different Ingredients that each hold their own paths\/classes. Gain 3 tiers to obtain the final [Job].\n- Earned progression that is rewarding with plenty of worldbuilding sprinkled in between. The MC is strong and only becomes stronger as the story progresses.\n- Unique world. Every week, the Krag opens up--an entrance to the Graveyard of the Gods. Relics, power, and Ingredients all wait to be plundered, protected by terrifying monsters. - Academy arc halfway through the first book that plays an important part in the story.\n\nReleases Mon-Fri","description_hash":4976773924435706409},{"title":"The Fairy of Knight-Fall","fiction_id":"87300","link":"https:\/\/www.royalroad.com\/fiction\/87300\/the-fairy-of-knight-fall","tags":["LitRPG","Reincarnation","Female Lead","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":33,"chapters_count":1,"last_update":1716838899,"description":"The world has ended. All life has ceased, and the surface has burned. At least, until Chess wakes up in a field of flowers and grass. How has the world returned to life, and where did all this magic come from? It's still Earth, but so different. And to make matters worse, Chess is no longer human.","description_hash":7661871655020711250},{"title":"A Word and a Gift: A Message from the Author of the Drågoon Mémoirs","fiction_id":"87299","link":"https:\/\/www.royalroad.com\/fiction\/87299\/a-word-and-a-gift-a-message-from-the-author-of","tags":["Martial Arts","Steampunk","Male Lead","Sci-fi","Strong Lead","Action","Fantasy","Short Story","Cyberpunk","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":26,"view_count":152,"chapters_count":2,"last_update":1716866840,"description":"A word of thanks from S. H. Robinson, an update of the current state of affairs of the second book in the Drågoon Mémoirs, and a small token of appreciation...","description_hash":8062207964725270028},{"title":"Untitled World; The Ship of Theseus ","fiction_id":"87298","link":"https:\/\/www.royalroad.com\/fiction\/87298\/untitled-world-the-ship-of-theseus","tags":["Strategy","Multiple Lead Characters","Sci-fi","Drama","Action","Fantasy","Low Fantasy","Mythos","Genetically Engineered ","Soft Sci-fi","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":26,"chapters_count":1,"last_update":1716838855,"description":"Humanity has been teetering on the edge of doom for decades, with each new disaster pushing it closer to a tipping point. With the threat of an absolute apocalypse on the horizon, humanity realizes the existence of a higher apex predator—immortals, the so-called Gods from fading legends and folktales who have fed on the worship and corruption of mankind.\n\nWhen the redemption of man seems unachievable, Eurydifice, an underground organization obsessed with restoring world order, seeks the patronage of these entities to produce a new subspecies—\nthe hybrids.\n\nIn a world fought with unnaturals and a stringent system of absolute justice, the truth is not what it seems to be.","description_hash":-2682912700129724787},{"title":"Chasing Death's Shadow","fiction_id":"87297","link":"https:\/\/www.royalroad.com\/fiction\/87297\/chasing-deaths-shadow","tags":["Grimdark","Psychological","Horror","Short Story","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":24,"view_count":36,"chapters_count":1,"last_update":1716838850,"description":"In a harrowing tale of survival and psychological torment, Moriz and his lab partner Moros find themselves trapped in a nightmarish labyrinth where time and reality are twisted beyond comprehension. Mere hours turn into what feels like months, and Moros is found in a state that defies all reason, leaving Moriz desperate for answers. As Moriz navigates the maze's horrors, he discovers cryptic clues and faces sinister entities that challenge his sanity. Following the guidance of a mysterious boy, Moriz's journey leads him to confront a chilling truth buried deep within his own psyche. With every step, he inches closer to unraveling the labyrinth's dark secrets and his own inner demons, culminating in a battle for his very soul.","description_hash":8506770588930679262},{"title":"Apoalypic ","fiction_id":"87296","link":"https:\/\/www.royalroad.com\/fiction\/87296\/apoalypic","tags":["Post Apocalyptic","Female Lead","Sci-fi","Adventure","Horror","Hard Sci-fi"],"lable":"Fan Fiction","following_count":0,"rating":0.5,"page_count":16,"view_count":36,"chapters_count":1,"last_update":1716838543,"description":"It's a \"The Walking Dead\" story. Mainly based in the Walking dead game universe. The novel follows The story of an ex soldier named Emma, who lost her baby brother to the apocalypse, because of her anger and negligence and now, she's trying to find a way to forgive herself and redeem herself. It uses the type of zombies used in the walking dead, that is \"walkers\". That's all I've copied. So I don't know if this will be called a fanfiction or not","description_hash":243174311220371310},{"title":"After the Tower","fiction_id":"87295","link":"https:\/\/www.royalroad.com\/fiction\/87295\/after-the-tower","tags":["LitRPG","Progression","Post Apocalyptic","Male Lead","Action","Adventure","Fantasy","Magic","GameLit"],"lable":"Original","following_count":12,"rating":4.88,"page_count":160,"view_count":1627,"chapters_count":15,"last_update":1718391604,"description":"Eighty years after humanity defeated the supernatural Tower, the world is still covered in the endless magical Jungle, a place where monsters roam and even the very trees will devour you whole. Josh is a reclaimer and a scavenger, someone who helps cut back the Jungle and find what artifacts of the Old World he can.\n But one day, Josh discovers humanity's worst nightmare. An impossibly powerful monster, more than strong enough to wipe out the last City in the world, rests nearby. Thanks to Josh, now it knows that there are riches to be had, and it prepares to escape its prison and burn its way to its prize. He has less than a year before it escapes. No one believes him, he and his friends have been branded criminals and forced to flee. In less than a year, they have to grow strong enough to force people to see the threat and fight.\n Josh has only one advantage: Before he found the impossible monster, he found an impossible treasure. An artifact to give someone a new class, something beyond the eight base classes inherited from the heroes who saved the world. This class is the reason they have no allies, the reason paranoid government officials and greedy criminals are chasing them down. With this new class, he might be able to turn everything around, to finally save the world for good.\n It is a [Crafter] class.","description_hash":1259277204597846027},{"title":"FRAY (Martial Arts \/ Progression Fantasy)","fiction_id":"87294","link":"https:\/\/www.royalroad.com\/fiction\/87294\/fray-martial-arts-progression-fantasy","tags":["GameLit","Urban Fantasy","Progression","Martial Arts","Multiple Lead Characters","Action","Romance","Sci-fi","Tragedy","Male Lead","Female Lead","Strong Lead","Secret Identity","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":13,"rating":4.5,"page_count":73,"view_count":810,"chapters_count":11,"last_update":1718630017,"description":"Survive the gladiocracy: a futuristic society where the strongest warriors rule as celebrity kings and tyrants. To those at the top goes prestige, power, and absolute rule. And runaway fighter Tay Mons knows all too well what happens to those who stand in their way.\nTay used to be the daughter of the greatest hero her world had ever known. But for the past three years, she’s been the Section’s most-wanted ghost instead: the last loose end of a bloody coup at the apex of the gladiocracy. Hunted by agents of the new Champion, she survives as a nameless street fighter in the shadows of her world, dodging the mercenaries and killers sent to track her down. Every night she dreams of finally taking revenge on the men who took everything from her. Yet it’s not until a brush with the prodigy assassin Feint that Tay realizes her chance has finally come, and in the most unlikely shape possible.\nBecause Feint isn’t just any hired killer. She’s the definition of the enemy- but she’s also Tay’s last shot at revenge.\n\nFRAY is the third story in the FRAY series, set twenty years after Showmaker. New chapters are posted every Monday and Saturday.\n\nReaders can expect:\n• Regression Fantasy• Female Protagonist• LGBT+ Romance• Dynamic combat• Themes discussing trauma, lost love, and family.• Slower, more character-focused pace.","description_hash":-5496301593136872464},{"title":"barely attached by fate","fiction_id":"87293","link":"https:\/\/www.royalroad.com\/fiction\/87293\/barely-attached-by-fate","tags":["Urban Fantasy","Steampunk","Multiple Lead Characters","Secret Identity","Strong Lead","Drama","Romance","Mystery","Tragedy","Female Lead","Low Fantasy","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":23,"view_count":107,"chapters_count":3,"last_update":1716834634,"description":"'Ruth Danan is a simple girl who lives her life to the fullest, loving the company of her friends and bringing sunshine to everyone around her.' That's what Dylan thought about the cheerful girl In his class. Everyone liked her, and she liked Everyone. While for Dylan, being liked by someone or even talking his heart out to someone was impossible to even think o\n Dylan's father was the leader of the Bravata gang So naturally, Everyone at school avoided him, as if he was invisible. He felt alone.But his sorrow soon turned into anger after seeing cheerful Ruth. To him, her jollyness seemed annoying,  irritating; so he started to bully her out of spite. And somehow it made him feel better. He bullied her everyday,  every chance he got.\n after a few months Dylan's father dies in an accident, leaving him with his entire empire and all his asses in the underworld. He works with the underworld, and no one dares to do what is against him, as he has gained a fearsome reputation for his ruthlessness and cunning in the criminal underworld. Dylan's newfound power and influence allow him to expand his empire even further, solidifying his position as a formidable force to be reckoned with. But in the underworld, life isn't a bed of roses; enemies are everywhere. Constant threats surround him.\nYears later, they meet again But,Things take a turn when Dustin Orgestsev, his fiercest nemesis, recruits Ruth and trains her as an assassin with the goal of killing Dylan. Something he had planned for years, ever since his father died.Ruth has transformed into an assassin with a goal to destroy her bully's life by impersonating his secretary and seducing him to bed while providing all critical information to her boss. \nHowever, hatred transforms it into a magnetic attraction, which feels bad in many ways, but when the ice melts at specific temperatures, they crave each other. Given what they have both been through, they must determine which road to choose. Ruth imagines herself falling strongly for her enemy, which will cost her life.she needs to make a decision. Quick\n\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\nhello i am the author of this novel i have written it on webnovel aswell.\nhttps:\/\/www.webnovel.com\/book\/barely-attached-by-fate_26842372906669505\nhttps:\/\/www.webnovel.com\/profile\/4324328047\ni have also written this on royal road.com","description_hash":-6799236259204090772},{"title":"Demon Listener","fiction_id":"87292","link":"https:\/\/www.royalroad.com\/fiction\/87292\/demon-listener","tags":["GameLit","Urban Fantasy","Dungeon","Anti-Hero Lead","Psychological","Action","Fantasy","Romance","Female Lead","Strong Lead","Magic","Mythos","Progression","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":55,"view_count":725,"chapters_count":9,"last_update":1718594100,"description":"Meet the anomaly, an extremely introspective protagonist raised, shaped and forged by the mysterious teachings of her overly secretive mother.\nIn a world where strength reigns supreme, she is able to stand out among her peers despite possessing only a single spell and having no divine weapon.\nHowever, in her apparently simple journey to prove her worth and follow in her mother's elusive footsteps, her life will receive a drastic twist upon meeting her very first death.\nThis event will abruptly change the vision of the already anomalous world around her, forcing her to confront a truth and reality no living being would ever dare to approach, unraveling something deep and unknown within her and creating immense confusion inside her mind as she discovers new emotions.\nFear, or...?\n\nA 'What to expect' might be appreciated:- Slow to fast progression.- Magic.- Quite the action, but some slice of life as well to add more to the story.- A confused main protagonist about love. Girls love.- Probably three chapters a week.","description_hash":506848312614642943},{"title":"Shadow Falls","fiction_id":"87291","link":"https:\/\/www.royalroad.com\/fiction\/87291\/shadow-falls","tags":["Urban Fantasy","Non-Human Lead","Strong Lead","Fantasy","Mystery","Supernatural","Male Lead","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":50,"view_count":339,"chapters_count":8,"last_update":1718229002,"description":"Jam Slate, a tough-as-clay sheriff in the monster-filled town of Shadow Falls, is on the hunt. A pair of serial killers magically vanished after the arrest, and a mysterious symbol leads Jam to a shady saloon. There, a cryptic mage offers clues, but then...both the mage and Jam's deputy disappear into thin air. With danger lurking in every corner, Jam must navigate a world of magic and mayhem to find his missing companions, unravel the secrets of the symbol, and keep Shadow Falls safe. Don't miss this pulse-pounding urban fantasy mystery!","description_hash":3271264893337256644},{"title":"Trains, Trucks, Transparency. ","fiction_id":"87290","link":"https:\/\/www.royalroad.com\/fiction\/87290\/trains-trucks-transparency","tags":["Psychological","Secret Identity","Tragedy","Drama","Mystery","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":50,"chapters_count":1,"last_update":1716830667,"description":"Good Heavens, there's a body on this train!","description_hash":-7634320095224037757},{"title":"The thing about YOU","fiction_id":"87289","link":"https:\/\/www.royalroad.com\/fiction\/87289\/the-thing-about-you","tags":["Virtual Reality","Portal Fantasy \/ Isekai","Time Loop","Urban Fantasy","Dungeon","Action","Drama","Romance","Satire","LitRPG","Cyberpunk","Reincarnation","Martial Arts","Sports","Gender Bender","Harem","Reader Interactive","Slice of Life","School Life","Supernatural","Male Lead","Female Lead","Strong Lead","Multiple Lead Characters","Non-Human Lead","Secret Identity","Magic","Anti-Hero Lead","Strategy","Grimdark","Wuxia","Xianxia","GameLit","Low Fantasy","High Fantasy","Space Opera","Super Heroes","Steampunk","Mythos","Post Apocalyptic","War and Military","Villainous Lead","Ruling Class","Time Travel","Genetically Engineered ","Technologically Engineered","First Contact","Hard Sci-fi","Soft Sci-fi","Dystopia","Progression","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":46,"chapters_count":1,"last_update":1716830663,"description":"A relatable,TRUE, experience of finding and surviving a toxic love. I write this anonymously in hopes it reaches everybody who has experienced something similar. Who can relate and heal with every word.. knowing that truly, deep down you was never alone… that in a cycle so negative and deadly there will always be positivity and light.","description_hash":7051785072891232425},{"title":"Spacing out","fiction_id":"87288","link":"https:\/\/www.royalroad.com\/fiction\/87288\/spacing-out","tags":["Anti-Hero Lead","Space Opera","Psychological","Male Lead","Sci-fi","Action"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":33,"chapters_count":1,"last_update":1716830632,"description":"Caspian, he will do anything he can to be able to learn the truth about the universe. He is a factory worker on the 2nd moon of the Cosmos Galaxy. Go through the journey into how he becomes the King of the Galaxy and possibly more...","description_hash":6817113905421087537},{"title":"Diaries of the Living Dead (english version)","fiction_id":"87287","link":"https:\/\/www.royalroad.com\/fiction\/87287\/diaries-of-the-living-dead-english-version","tags":["Post Apocalyptic","Tragedy","Drama","Action","Horror"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":27,"chapters_count":1,"last_update":1716830458,"description":"The quiet town of Green Pine turns into an apocalyptic nightmare on New Year's Eve 2010 when a mysterious zombie infection takes over the streets. Carlos, a soldier whose job has distanced him from his family, desperately fights to rescue them amidst the chaos. Facing hordes of the undead and his own fears, Carlos will do anything to protect his daughter Mathilda while seeking a safe haven in a world where the line between life and death is thin and perilous.\nDetail: I am not a fluent English speaker, so sometimes I use AIs to help with translating content. If something doesn't make sense or sounds strange, please let me know asap!","description_hash":-7258839938771276543},{"title":"Linked - Book 1 of P2W (Play 2 Wage)","fiction_id":"87286","link":"https:\/\/www.royalroad.com\/fiction\/87286\/linked-book-1-of-p2w-play-2-wage","tags":["GameLit","Strategy","Grimdark","Male Lead","Sci-fi","Adventure","Satire","Cyberpunk","Slice of Life","Soft Sci-fi","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":10,"rating":4.9,"page_count":219,"view_count":2856,"chapters_count":23,"last_update":1718397725,"description":"Three years ago, aliens made first contact, sort of. More accurately, they sent us a galactic internet connection and invited us to play the galaxy's biggest pay-to-win MMO, complete with irresistible and addictive rewards. Follow Nicholas Spenser, an ex-con turned professional rock breaker. After securing a contract to work for a lone Ambassador that settled on the digital version of his homeworld, he has somehow managed to carve out a living better than most in his struggling Faction, when a fugitive AI starts whispering exploits in his ear and pushing him to rebel against the system the Coreworlds have created.\nWhat to expect:\n-Dual settings of real life as well as VRMMORPG with real stakes\n-Slice of life and lots of world-building\n-Minimal stats, detailed items\n-Large cast of characters\n-Occasional intense combat, more frequent high-stakes conversations\n-A mostly competent MC\n-Descriptions, lots of descriptions\n-An AI companion with questionable morals\n-Single perspective\n-Slow burn and a fair amount of introspection\n-Eventual crafting and politics, hence the strategy tag\n-lots of references (annotated in my master-copy, possible access via patreon tier eventually?)\n(after an initial sprint of posting, I will post 2-3, 2-4000 word chapters per week, Monday and Friday, and possibly Wednesday)","description_hash":-4798913150344762780},{"title":"Meet me down the pit 『 Isekai 』","fiction_id":"87285","link":"https:\/\/www.royalroad.com\/fiction\/87285\/meet-me-down-the-pit-isekai","tags":["Portal Fantasy \/ Isekai","Dungeon","Comedy","Female Lead","Slice of Life","Action","Adventure","Fantasy","Strong Lead","Magic","High Fantasy","Progression","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":163,"view_count":854,"chapters_count":21,"last_update":1718554683,"description":"An isekai story that starts serious and gets sillier over time.\nFrom a peaceful sleep to a sudden chaos, a group of bus passengers is transported to another world. Orcs hunt them down to no end until a deity helps them out and gives Duanna, our heroine, an opportunity to escape. Carrying her sister, Enhe, she dashes away from danger. Unfortunately, a humongous pit stops their tracks. With no other choice, they have to get down with the help of a guide named Lavrenti, who possesses the ability to conjure his imagination. This same person will help them go back up to the surface. But it won’t be easy: danger lurks from every direction, whether it be the orcs or nature itself.\n\nWill they all be able to survive? Why is the heroine so weird? Is there a way for them to go back to their world? Follow our silly protagonist as she slowly goes back up to civilization and discovers this unfamiliar planet.\n\nWhat to expect:\n\nDon’t expect too much from Dua–\n\nThe narrator gets punched out of existence and our marvelous main character replaces them.\n\n- Expect an impressively talented and powerful MC.\n- Expect my magnanimity to blow your mind. (You’ll never believe chapter n°[censored]!)\n- Expect weird(?) worldbuilding with familiar words.\n- Expect original powers, I guess (we can make anything we imagine, isn’t that cool?!).\n- Except- Expect an adventure all around the world.\n- Expect hilarity with our crazy group of friends.\n- Expect changes in perspective: I’m not gonna narrate my whole life, I have grass to touch.\n- Expect the unexpected. *uncontrollable laugh that slowly echoes away*\n\nChapters will be updated daily for like 30 chapters or so. Also crossposted on Scribblehub.\nAnyways, I hope you enjoy your time reading this :)","description_hash":-971014408771718361},{"title":"Summoned to Another World, but as the Final Boss","fiction_id":"87284","link":"https:\/\/www.royalroad.com\/fiction\/87284\/summoned-to-another-world-but-as-the-final-boss","tags":["Portal Fantasy \/ Isekai","Villainous Lead","Non-Human Lead","Action","Adventure","Fantasy","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":17,"rating":3.83,"page_count":141,"view_count":1655,"chapters_count":10,"last_update":1718571662,"description":"Casual gamer Kizuna Tomomori suddenly awakens in an unknown place with several strange looking individuals surrounding him. However his confusion is short lived, as he realises that he had been transported into the world of an Otome game called 'Battle for Hope & Love' - which in itself doesn't really get his gears moving.\nHowever, he then realises some awful news - he's neen transported to this world and has taken on the role of not the protagonist, but instead, the villain of the game - the Demon King of Sins, who by the end of the game, suffers a devastating and brutal death at the hands of the protagonist.\nDetermined to avoid his death and armed with knowledge of the entire games story from his past life - he sets out on just one quest;To prevent his own demise.\n(2 NEW CHAPTER EVERY MONDAY)Cover ; Google Image\/AI Generated","description_hash":3735999017937444358},{"title":"MY EASY LIFE IN ANOTHER WORLD","fiction_id":"87283","link":"https:\/\/www.royalroad.com\/fiction\/87283\/my-easy-life-in-another-world","tags":["Portal Fantasy \/ Isekai","War and Military","Male Lead","Sci-fi","Slice of Life","Action","Adventure","Fantasy","Reincarnation","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":7,"view_count":35,"chapters_count":1,"last_update":1716815117,"description":"Leo Wager, a World War II veteran, finds himself reborn in a fantastical world filled with mythical creatures. Utilizing his survival skills, he navigates this new environment, forming an unexpected bond with a wounded Chimera. As he embraces his new identity as Kai, he prepares for the adventures and tranquility this fresh start promises.","description_hash":-6570099805527415773},{"title":"Friday Night Firefight: A Cyberpunk Isekai","fiction_id":"87282","link":"https:\/\/www.royalroad.com\/fiction\/87282\/friday-night-firefight-a-cyberpunk-isekai","tags":["Portal Fantasy \/ Isekai","Action","Adventure","Cyberpunk"],"lable":"Fan Fiction","following_count":58,"rating":4.86,"page_count":180,"view_count":4651,"chapters_count":17,"last_update":1718630164,"description":"A normal guy is isekai'd into his favorite game, only to realize that life's not all that great when you're in a city filled with cyberpsychos, sociopathic gangsters, corrupt cops, bloodthirsty megacorporations and US Cracks fans.","description_hash":960511068135894282},{"title":"A Bit Goofy - A Xianxia Story","fiction_id":"87281","link":"https:\/\/www.royalroad.com\/fiction\/87281\/a-bit-goofy-a-xianxia-story","tags":["Xianxia","Comedy","Multiple Lead Characters","Action","Adventure","Martial Arts","Male Lead","Magic"],"lable":"Original","following_count":13,"rating":5.0,"page_count":75,"view_count":487,"chapters_count":4,"last_update":1718629251,"description":"The world had changed so fast for Zi Nuan. Before the great chasm ripped apart the land allowing demons to flood into the world, before the treachery within her sect forced her to the Stellar Empire's very edges to seek the only hope she could clear her name, before it all...\nShe'd been Bronze Cleaver, general, young mistress of the Golden Step sect. The road once laid out before her, her life as a cultivator intricate as the paint on fine porcelain dashed to the winds.\nThe demons were back, the Empire was under threat, and not even the ancestors were willing to give her aid.\nShe planned to start anew, selling her particular set of skills to the highest bidder if only to get where she was headed. Little more than a common mortal mercenary.\nAgain, the heavens blew even those tenuous plans apart as the fabric of Reality coughed and sputtered, a strange figure slipped through into the corporeal world.\nSomeone just a little bit... silly.\nSpoony had no real idea where on Earth he was. While he was a toon of science he couldn't exactly explain the new body, this new place, and these strange people. After all, how could no one know where Anytoon, USA was? And what's with all this 'Courting death'? How did anyone die in this place if the Grim Reaper was stuck in Court all the time?\nWas that why these people were always going on and on about Immortality?\nWas that the point? \n\nUpdates every Monday.\n(NOTE: COVER IMAGE IS AI GENERATED AND MODIFED BY ME. IT IS ONLY A PLACEHOLDER!! I HAVE NOT NOR WILL I CLAIM OWNERSHIP OF THIS IMAGE, NOR DOES IT BELONG TO A COPYRIGHT HOLDER. I only use AI to conceptualize my characters AND NEVER TO REPLACE ARTISTS AND CLAIM WORK THAT ISN'T MINE.)","description_hash":3535635471804646693},{"title":"MOON TAVERN: A Fantasy Adventure and Xianxia Style LITRPG","fiction_id":"87280","link":"https:\/\/www.royalroad.com\/fiction\/87280\/moon-tavern-a-fantasy-adventure-and-xianxia-style","tags":["LitRPG","Reincarnation","Dungeon","Super Heroes","Ruling Class","Action","Adventure","Fantasy","Mystery","Martial Arts","Slice of Life","Supernatural","Female Lead","Strong Lead","Multiple Lead Characters","Magic","Wuxia","Xianxia","High Fantasy","Mythos","Progression"],"lable":"Original","following_count":2,"rating":0.0,"page_count":62,"view_count":829,"chapters_count":10,"last_update":1718610822,"description":"Moon Tavern employ a collection of talented warriors and magical specialists to help the people of the Jade Empire. No problem big or small will stop them from solving criminal cases, impossible requests, and strange mysteries! Follow their adventures in the great martial world!","description_hash":1068224995545882424},{"title":"Cycles of the Ancients [Progression]","fiction_id":"87279","link":"https:\/\/www.royalroad.com\/fiction\/87279\/cycles-of-the-ancients-progression","tags":["Reincarnation","Progression","Post Apocalyptic","Ruling Class","Female Lead","Action","Adventure","Drama","Fantasy","Magic","Strategy","Dystopia"],"lable":"Original","following_count":7,"rating":5.0,"page_count":134,"view_count":828,"chapters_count":18,"last_update":1718291763,"description":"The Ancients: Ten immortal beings destined to rule, war and fall, only to live again.\nBlack is one of them, awakening on an old, shattered world to a friend who dies to save her. But death is not the end. He’s out there, somewhere, and she’s going to find him. If she can survive before she forgets.\nBut others hunt them both. Others who want to control their power for an edge in the endless war. Who manipulate reality itself, and succumb to the self-inflicted curses of their kind. \nBetween them lie the remnants of hundreds of civilisations reaching down to the planet’s core. For the Ancients have forgotten where they started, and dark revelations await them all.","description_hash":-193972384882938914},{"title":"Extra Case Files: Marvel","fiction_id":"87278","link":"https:\/\/www.royalroad.com\/fiction\/87278\/extra-case-files-marvel","tags":["Reincarnation","Male Lead","Action","Adventure","Supernatural","Magic","Attractive Lead"],"lable":"Fan Fiction","following_count":2,"rating":0.0,"page_count":133,"view_count":386,"chapters_count":4,"last_update":1718131277,"description":"Hadrian thought that life would be different this time.\nPeaceful, and relaxing. No lives to take, no wars to fight.\nIt would be a bit boring, but at least he can breathe easy and enjoy life more this time.\nThen, as if Fate heard him, chaos slowly ensued, barreling in the form of super soldiers, enhanced humans with X symbols over their yellow-themed clothes, nazi-like terrorists obsessed with conquering the world, a doctor who can turn into a giant angry avocado, and an alien invasion led by a mischievous god as a strawberry on top.\nAt least his retainers are there for the ride…\nHe can only blame Zelretch for all this shite.\n \n(MC is OC) (MC is OP)\n(MC was originally from FF15, then reincarnated in Fate\/Extra, then into Marvel, with MCU as the world setting.)\n(This is a FF15\/Fate-Extra\/MCU crossover.)","description_hash":-7721282584167568966},{"title":"Sip; just so of a cup of Milk with a small taint of coffee.","fiction_id":"87277","link":"https:\/\/www.royalroad.com\/fiction\/87277\/sip-just-so-of-a-cup-of-milk-with-a-small-taint","tags":["Urban Fantasy","Psychological","Secret Identity","Tragedy","Fantasy","Supernatural","Low Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":28,"view_count":59,"chapters_count":2,"last_update":1716838423,"description":"It is up to us to think about what dying entails, but, certainly, is what we are seeing the right painting to ask ourselves? Doubt corrodes our minds and perhaps we are not even seeing the right part to glimpse with a black pupil tint.","description_hash":2354005748517344166},{"title":"Made to Be","fiction_id":"87276","link":"https:\/\/www.royalroad.com\/fiction\/87276\/made-to-be","tags":["Multiple Lead Characters","Contemporary","Short Story","Male Lead","Female Lead","Magic"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":10,"view_count":31,"chapters_count":1,"last_update":1716788233,"description":"With her husband suffering from cancer, Hailey Patrick found a peculiar \"transformation store\" for the two to never separate. [Commissioned Work]","description_hash":-9105987768238897373},{"title":"Kakuzu: Intertwined Threads","fiction_id":"87275","link":"https:\/\/www.royalroad.com\/fiction\/87275\/kakuzu-intertwined-threads","tags":["Reincarnation","Anti-Hero Lead","Male Lead","Action","Adventure","Fantasy","Magic","Genetically Engineered "],"lable":"Fan Fiction","following_count":7,"rating":5.0,"page_count":23,"view_count":387,"chapters_count":4,"last_update":1717340134,"description":"As Kakuzu's second heart is destroyed during his final battle, a weakened link becomes a pathway for a distant soul to take over.","description_hash":8531873877583957386},{"title":"Alkebulane","fiction_id":"87273","link":"https:\/\/www.royalroad.com\/fiction\/87273\/alkebulane","tags":["Action","Adventure","Fantasy","Supernatural"],"lable":"Original","following_count":1,"rating":0.0,"page_count":13,"view_count":151,"chapters_count":3,"last_update":1717482451,"description":"Alkebulane is a story exploring the intricacies' of Alkebulane and all its supernatural races and their infighting amongst themselves.","description_hash":4933547057059415566},{"title":"The Shadow and the Lion","fiction_id":"87272","link":"https:\/\/www.royalroad.com\/fiction\/87272\/the-shadow-and-the-lion","tags":["Portal Fantasy \/ Isekai","Sci-fi","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":12,"view_count":116,"chapters_count":3,"last_update":1718109967,"description":"The preparations had been long and difficult, but the battle itself seemed oddly short. After all their efforts, a group of people had won some freedom from tyranny, yet in the process a hero to their cause had seemingly lost their life.\nSeemingly.\nNow that person finds themselves in a very different place, working for very different people. Their methods, however, stay identical. No matter where or when, there's always room for a problem-solver hidden in the shadows.","description_hash":1187115025826596307},{"title":"Hell's Matchmaking System","fiction_id":"87271","link":"https:\/\/www.royalroad.com\/fiction\/87271\/hells-matchmaking-system","tags":["Psychological","Male Lead","Strong Lead","Action","Horror","Mystery","Supernatural","Low Fantasy","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":28,"chapters_count":1,"last_update":1716785884,"description":"It was the year 2158. Super humans roamed the earth as they replaced the common celebrities, these super humans were known as players. A century ago an app infested all phones, this app didn't have a name but the icon of the app was just a black gate with a red background. Most at that time thought it was just a virus that affected all phones, but they were proven dead wrong. The app changed the direction of man kind as it provided a way for power and unlimited life span. It was all at the click of a button, but of course everything doesn't come without a price.","description_hash":-8682212807989509990},{"title":"The Successor","fiction_id":"87270","link":"https:\/\/www.royalroad.com\/fiction\/87270\/the-successor","tags":["Female Lead","Drama","Action","Fantasy","Romance","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":25,"chapters_count":1,"last_update":1716785849,"description":"Borders are sealed and armies stand at the ready.\nHallies’ Heiress, Andrea, faces an impossible choice. The fate of her people hangs in the balance, threatened by ancient magic as the other Heirs stay silent. The newly crowned king, Steven, grapples with his duty to the throne and the depths of his love for Andrea. Both realising sacrifices must be made, alliances forged, and secrets unveiled as both their kingdoms balances on the brink of war.","description_hash":-1917055640090772672},{"title":"Master Bather","fiction_id":"87269","link":"https:\/\/www.royalroad.com\/fiction\/87269\/master-bather","tags":["Grimdark","Fantasy","Horror","Short Story","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":31,"chapters_count":1,"last_update":1716785844,"description":"Now I must introduce you to a new threat in our world called, \"Sentorium\". He is known by many names. But the prominent name he lives by is, \"Master Bather\". Not much is known of his origin. But, the one thing he craves the most, apart from sadistically killing people is to feed on their fear and chaos. \nSimilar to \"The Veiled Eye\", this entity is extremely dangerous. The origins of his story is unknown. So, without further ado, please allow me to introduce you to, \"Master Bather\".\nAs always, I cannot promise if this will be scary or at any capacity, any good. But, what I can promise is that it will be short and entertaining, \nI hope you enjoy.","description_hash":5951389410406442558},{"title":"Omens of Death","fiction_id":"87268","link":"https:\/\/www.royalroad.com\/fiction\/87268\/omens-of-death","tags":["Virtual Reality","Time Travel","Post Apocalyptic","Anti-Hero Lead","Psychological","Horror","Mystery","Short Story","Cyberpunk","Supernatural","Male Lead","Female Lead","Multiple Lead Characters","Mythos","Villainous Lead","Genetically Engineered ","Technologically Engineered","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":22,"view_count":46,"chapters_count":1,"last_update":1716785838,"description":"When we think of horror, we immediately think of supernatural and paranormal phenomena and creatures such as ghosts, demons, vampires, werewolves, zombies, undead and other creatures of the night, and we also think of feelings of loneliness, aloofness, dread, nihilism, fear of darkness and the unknown.\n\nBut sometimes, the scariest stories don’t even include any fantastical or science fiction concepts at all; in some cases, the most bone-chilling and disturbing tales are from the events that happen around us, in the real world. To induce the feeling of panic and raw emotion within the human soul by reminding us how our lives are fragile and easy to ruin forever.\n\nThis is a collection of horror short stories, some connected, some stand-alones, but each one with its own unique blend of dread and terror.","description_hash":3992220349610445989},{"title":"MHA: Redemption Reverie","fiction_id":"87266","link":"https:\/\/www.royalroad.com\/fiction\/87266\/mha-redemption-reverie","tags":["Reincarnation","Progression","Super Heroes","Psychological","Male Lead","Action","Adventure","Harem","Attractive Lead"],"lable":"Fan Fiction","following_count":14,"rating":0.0,"page_count":84,"view_count":1729,"chapters_count":13,"last_update":1717953301,"description":"After a tragic death, a man awakens in the body of a boy in the world of manga he read recently. Faced with a looming war, he must navigate this new life and decide how to use his second chance. What choices will he make in a world on the brink of chaos?","description_hash":7895962948363864723},{"title":"Daybreak: The Library Of Revelation","fiction_id":"87265","link":"https:\/\/www.royalroad.com\/fiction\/87265\/daybreak-the-library-of-revelation","tags":["Urban Fantasy","Strategy","Comedy","Multiple Lead Characters","Action","Fantasy","Romance","School Life","Supernatural","Male Lead","Female Lead","Magic","Low Fantasy"],"lable":"Original","following_count":2,"rating":2.5,"page_count":26,"view_count":207,"chapters_count":4,"last_update":1717750802,"description":"\"Magic is magic because we don't understand it. And I, will erase magic.\"\nIn an alternate version of modern Earth, Hugo, a teenage inventor, spends his days trying to uncover his mother's enigmatic legacy. His world turns upside down when he stumbles upon the existence of magic. Caught between battles of secret organizations lurking in the shadows, encountering magical experiments, and facing off against super humans, Hugo struggles to maintain his life as a high school student. And so, the line between his daily life and the supernatural begins to blur.","description_hash":-6086077563449555614},{"title":"Jean the Cursed Champion [Medieval Fantasy] ","fiction_id":"87264","link":"https:\/\/www.royalroad.com\/fiction\/87264\/jean-the-cursed-champion-medieval-fantasy","tags":["LitRPG","Reincarnation","Dungeon","Female Lead","Strong Lead","Action","Adventure","Fantasy","Low Fantasy","Progression"],"lable":"Original","following_count":30,"rating":4.8,"page_count":64,"view_count":761,"chapters_count":7,"last_update":1718472039,"description":"How far can the desire for revenge of someone who has been betrayed go?\nJean is a cleric adventurer. A novice who joins a dungeon expedition organized by veterans to gain experience. A simple task thanks to the support of Gabriel's group. However, the situation takes a turn for the worse.\nGabriel discovers a hidden area in the dungeon. A chamber in which there are several relics. When Jean accidentally touches one of the relics, she absorbs its power. Gabriel's attitude changes radically, and he attempts to kill her by throwing her into the void.\nMiraculously, the fall doesn’t kill her, but when she wakes up in the depths of the dungeon, she has lost her memory. She remembers nothing of the last few months. She doesn't remember how she came from Earth or the short time she lived in this new world being the healer of a group of novice adventurers.\nHer memories will gradually resurface through a series of flashbacks that will shed light on her past, but also reveal Gabriel's betrayal. Her desire for revenge will drive her to survive and also discover that the expedition hid much more than it seemed.\nJoin Jean as she breaks her limits to find her way out of the dungeon and achieve her revenge.\nEnglish isn’t my native language. Please, go easy on me. Any feedback is more than welcome, of course.\nWhat to expect:◦ Weak to Strong MC.◦ Long series with fast progression.◦ Fantasy medieval world.◦ Publication rate: As long as my writing process doesn't improve, six to eight per month.◦ Around 2100 words per chapter or 15000 words per month.","description_hash":3217230429364227298},{"title":"How I Got Recruited to a Time Traveling Corporation in Order to Save the World","fiction_id":"87263","link":"https:\/\/www.royalroad.com\/fiction\/87263\/how-i-got-recruited-to-a-time-traveling-corporation","tags":["LitRPG","Time Travel","Martial Arts","Sci-fi","Action","Fantasy","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":17,"view_count":103,"chapters_count":2,"last_update":1717029789,"description":"In a world where the ordinary and the extraordinary collide, Jack, an average man, finds himself caught in a life-altering mugging. When death's cold embrace claims him, he awakens in a strange and unfamiliar world—reborn as a child named Tomas. In this new existence, Jack uncovers a hidden gift—the ability to wield magic. As he navigates the medieval village of Elmswood, he learns to harness his powers, becoming a force to be reckoned with. But when ominous figures from the Core of Magic Conservation arrive, claiming to need his abilities for study, Jack is thrust into a world of advanced technology and unimaginable possibilities. What will become of Jack as he embarks on a journey through time, magic, and technology?","description_hash":-1154989856623337486},{"title":"The Convergence","fiction_id":"87262","link":"https:\/\/www.royalroad.com\/fiction\/87262\/the-convergence","tags":["Progression","Female Lead","Sci-fi","Action","Adventure","Fantasy","Supernatural","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":99,"view_count":263,"chapters_count":6,"last_update":1718536101,"description":"After calamity and anarchy has stricken reality, those most desperate in this new age vie for any power to gain an edge over the world itself. Some try to construct long-lasting civilizations, hoping their legacy precedes their inevitable downfall. Others seek great powers to ravage and conquer, hoping to eliminate all threats before them, not knowing of the knife already on their back.\nBut others seek paradise, a land where both civilization and power coexist unafflicted by the calamity that has befallen the world of Elysium. All answers lie within the ancient land of Farreum, home of the Grafted God and the last and only surviving kingdom from The Annihilating Eclipse Event. \nA knight unbound and their eastern companions, a group of fallen heroes and lunatics, and pawns of royalty. Could they grasp the truth with their own hands? Or fall into endless slumber in the wake of the Everlasting Dream.","description_hash":4974418016727745217},{"title":"Random reveries: a collection of poems, thoughts, and short stories","fiction_id":"87260","link":"https:\/\/www.royalroad.com\/fiction\/87260\/random-reveries-a-collection-of-poems-thoughts","tags":["Multiple Lead Characters","Slice of Life","Fantasy","Short Story","Reader Interactive","Low Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":64,"chapters_count":2,"last_update":1716804042,"description":"\"Random Reveries: A Collection of Poems, Thoughts, and Short Stories\" is a book that dives into the deep and varied emotions we all feel. In it, I find poems, thoughts, and short stories that capture brief, intense moments of happiness, sadness, deep thought, and light-heartedness. Each piece opens up small, often missed moments of daily life, making me stop and think about the beauty and complexity of our lives. The writing is beautiful and touching, taking me on a journey through memories, dreams, and self-reflection.","description_hash":4762902525559207786},{"title":"Elaine's Gamble","fiction_id":"87259","link":"https:\/\/www.royalroad.com\/fiction\/87259\/elaines-gamble","tags":["Ruling Class","Female Lead","Drama","Historical","Romance","Strategy","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":27,"view_count":236,"chapters_count":5,"last_update":1717002032,"description":"Elaine, overshadowed by her siblings in the family’s winery empire, seizes an opportunity to marry into power by offering herself in place of her sister. Marrying Alistair Kingsley, she uncovers his hidden legacy as the heir to a vast estate, including the prestigious Galerie du Temps. Now, as she finds herself in between a high-stakes game of intrigue and politics, Elaine Carter awaits the fruit of her ultimate gamble.","description_hash":-3741942202786909744},{"title":"Project Angels","fiction_id":"87258","link":"https:\/\/www.royalroad.com\/fiction\/87258\/project-angels","tags":["War and Military","Male Lead","Sci-fi","Action","Strategy","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":42,"chapters_count":1,"last_update":1716778442,"description":"The story of Daniel 'Salt' Swarzkopf, a US Navy pilot, who fights against a dark force, a rogue nation.","description_hash":-1740213917112004819},{"title":"Still Green","fiction_id":"87792","link":"https:\/\/www.royalroad.com\/fiction\/87792\/still-green","tags":["Comedy","Non-Human Lead","Slice of Life","Drama","Fantasy","Short Story","School Life","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":21,"rating":5.0,"page_count":17,"view_count":255,"chapters_count":2,"last_update":1717787044,"description":"Magazine Contest June 2024 Entry!\nLorretta was once a competent swordswoman and mercenary. Her adventures couldn't be found in any great tales of heroism or dragons, but she was well known in her youth. She was no goblin for upstart adventurers to hunt. No, she was the goblin they aspired to be. At least, in the southeastern farmlands. Nevertheless, she never achieved national notoriety, and her career ended quietly. She met a kind man and had a daughter. They retired young with the money she made as a mercenary and had a simple life raising chickens and their little Lorraine.The years passed her by, and by the time she realized she had retired too young, it was too late. She was old. Her daughter had a family of her own. In her old age, her struggles changed from the worries of a mercenary to those of a grandmother. Her grandson Lance was shy and slow to share his worries. She was at her wits end trying to connect with him when something strange happened. A salad full of cursed mushrooms returned her to the days of her youth. She was given a second chance at life, as well as a new opportunity to find out what's been bothering her grandson. All she had to do was enroll in his academy as a trainee swordswoman.\n\nCharacter art by Mike Ko, Background art by Laztion","description_hash":-3732927960386556950},{"title":"Aleria: At Quest's End","fiction_id":"87791","link":"https:\/\/www.royalroad.com\/fiction\/87791\/aleria-at-quests-end","tags":["Anti-Hero Lead","Female Lead","Secret Identity","Action","Adventure","Fantasy","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":136,"view_count":343,"chapters_count":8,"last_update":1718215205,"description":"Most tales sing of great battles against overwhelming forces. Legendary heroes slaying demons and dark lords. But what happens after the war is won? What becomes of those heroes once their swords are laid down?\nFor Aleria, peace should have meant solace. Yet when an old comrade summons her to the town of Last Gate to take over the local clinic, she cannot refuse. Hoping to find a place to call home after the horrors of war, Aleria accepts - a chance to put her formidable magics to noble use.\nBut darkness still lurks in the shadowed corners of the land. And when foul creatures threaten her new home and its people, Aleria must face the call to battle again. Can she save Last Gate without surrendering to the monster within? Or will The Emerald Witch be reborn, as a nightmare serving the greater good once more?","description_hash":-3014408033287829599},{"title":"Divine Villainy","fiction_id":"87790","link":"https:\/\/www.royalroad.com\/fiction\/87790\/divine-villainy","tags":["Xianxia","Male Lead","Action","Fantasy"],"lable":"Original","following_count":12,"rating":3.5,"page_count":226,"view_count":2317,"chapters_count":43,"last_update":1718634746,"description":"Gael tried to live right, but he lost his life to his own father. The heavens gave him a new chance and he was reborn as Zane in a world of cultivation and fantasy! But... the heavens took away his reason to live.\n\"No... I won't be controlled and manipulated anymore...\"\n\"The world will be washed with its own blood,\" he swore.\nA wicked and vengeful villain was born. Planets vanished, lives were taken... A hero raised his sacred sword to combat the evil, bringing tears and smiles of hope.\nBut the universe understood that one should not play with others' destinies. Every drop of life was devoured and cruelly used... The sacred sword finally cracked...\nThe villain prevailed!\nBut... Now he's utterly alone...\nAfter wiping out all lives in the entire universe, Gael noticed something... he... was alone!\nAnd alone he stayed for tens of thousands of years until suddenly... the truth of the universe was revealed to him!\n\nCan a villain start over? Can a villain love and live right? Can a villain become an adored and sacred figure?\nThis book is a personal journey of a man who fell into darkness and hatred. But his destiny had something strange in store for him... something round and fat? One thing is certain: he will never give up, even if he has to start over countless times.\nThe book is a mix of cultivation, system, and inter-universe travel. All blended with lots of action, adventure, and a touch of comedy to spice things up. Hope you enjoy it","description_hash":-7600652394590802830},{"title":"Son of the Sun","fiction_id":"87789","link":"https:\/\/www.royalroad.com\/fiction\/87789\/son-of-the-sun","tags":["Anti-Hero Lead","Strategy","Harem","Secret Identity","Strong Lead","Action","Adventure","Fantasy","Romance","Low Fantasy","High Fantasy","Mythos","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":33,"chapters_count":1,"last_update":1717503127,"description":"An amnesiac wakes up in a ditch. Watch him try to piece his life back together while facing old and new challenges.\nPS: This story is set in a fantastical world but probably a bit generic.","description_hash":5615693293335615386},{"title":"The Magic Sniper","fiction_id":"87788","link":"https:\/\/www.royalroad.com\/fiction\/87788\/the-magic-sniper","tags":["Portal Fantasy \/ Isekai","Strategy","Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":12,"view_count":127,"chapters_count":2,"last_update":1717826089,"description":"Gavin Mercer, a seasoned special ops sniper, thought that his career and life had come to an end when he was shot in action while carrying out a ground mission.\nTo his surprise, his story didn't end there. Thanks to the whims of a bored archmage, Gavin found himself in an entirely different world - a realm where magic and knights reign supreme. Given a second chance, he must now rely on his exceptional aim, eyesight, and quick decision-making to survive.\nBut in a world without modern weapons, a bow and arrow just doesn't have the same power as a heavy-duty sniper rifle.\nUnless you're really good at magic.","description_hash":3610931918422040596},{"title":"Gobbomisic Grandmas","fiction_id":"87786","link":"https:\/\/www.royalroad.com\/fiction\/87786\/gobbomisic-grandmas","tags":["Strategy","Psychological","Female Lead","Tragedy","Action","Adventure","Supernatural","Magic","High Fantasy","Genetically Engineered "],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":29,"chapters_count":1,"last_update":1717503081,"description":"Gobbomisic Grandmas: A grandma who lost everything most precious to her now returns to her old life of goblin massacre.\nMeet Mabeth Marie, a retired veteran, once apart of a special Corp that defends the land against mythical creatures and especially...goblins.\nOnce she had massacred these little green freaks into near extinction, Mabeth retired and created a family of her own, even becoming a grandma. She had found people to love and things were perfect. \nWell...not for long. In just one day where she least expected it, her family that she invested her love into...was slaughtered by goblins. \nFilled with rage and despair at her loss and regret not fully exterminate them, the now vengeful Mabeth vows to annihilate the goblins. \nHow will Mabeth's new journey turn out?","description_hash":5137057781802725810},{"title":"The Grand(ma) Assignments","fiction_id":"87785","link":"https:\/\/www.royalroad.com\/fiction\/87785\/the-grandma-assignments","tags":["Comedy","Non-Human Lead","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":3,"rating":4.75,"page_count":34,"view_count":194,"chapters_count":4,"last_update":1718607620,"description":"When a mage and a dragon promise unlimited water for a goblin nation, what could possibly be the cost?\nIt's simple, fulfill the wishes of ten grandmas!\nBut it's not so easy. Each grandma's wish is more difficult then the last. And what about those shadows that're following our heroes around?\nJoin a band of five goblins as they navigate the dangers preventing ten grandmas from getting their wishes. Watch as they grow from a band of bumbling baffoons into a well-oiled machine (or as close as a goblin band can get).","description_hash":-8947980215224391646},{"title":"Grandma of the seven Goblins ","fiction_id":"87784","link":"https:\/\/www.royalroad.com\/fiction\/87784\/grandma-of-the-seven-goblins","tags":["Comedy","Female Lead","Slice of Life","Fantasy","Short Story","Magic","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":47,"chapters_count":1,"last_update":1717503072,"description":"Elara, an old lady who had hair as white as snow, eyes as black as obsidian and nails painted in crimson was abandoned by her children as they left one by one to the City. \nOne day she receives a letter from an old friend whom she hadn't talk to for decades. The letter stating her friend's death and the inheritance she left behind for her, in the small cottage located in Whispering Woods where they used to play in as kids.\n\n\nWarning: the author only posts when he feel like it.","description_hash":662152840495251878},{"title":"Bounty Cats (Reboot)","fiction_id":"87783","link":"https:\/\/www.royalroad.com\/fiction\/87783\/bounty-cats-reboot","tags":["Comedy","Multiple Lead Characters","Sci-fi","Action","Satire","Cyberpunk","Female Lead","Genetically Engineered ","Technologically Engineered","Soft Sci-fi","Dystopia","Attractive Lead"],"lable":"Original","following_count":20,"rating":3.0,"page_count":85,"view_count":525,"chapters_count":10,"last_update":1718395457,"description":"In the neon-soaked streets of Moreau City, where genetic splicing is as common as candy, Rei and Luna, the sensational cat hybrid K-pop duo, captivates audiences with their electrifying performances and irresistible charm. The twins live their dream until a crushing debt threatens to derail their career. Desperate to save their future, they turn to an unlikely solution: bounty hunting.\n\nArmed with sharp claws, quick reflexes, and a flair for the dramatic, Rei and Luna plunge into the gritty underworld of Moreau City. By day, they dazzle their fans with catchy tunes and synchronized dances; by night, they hunt down the city's most dangerous criminals. Their double life is a chaotic blend of glitter and grime, but they stay one step ahead, turning their street smarts and showbiz skills into a formidable arsenal.\nBalancing their K-pop idol personas with the high-stakes bounty hunting world, the twins must navigate treacherous alliances and unexpected betrayals. \n\"Bounty Cats\" is a rollercoaster ride of biopunk and cyberpunk comedy thriller, blending high-energy action with a vibrant, futuristic setting. Follow Rei and Luna as they juggle fame, fortune, and a deadly game of cat-and-mouse in a city where anything is possible and nothing is as it seems.\n\nAuthor's Note: \"In this reboot of the original Bounty Cats, which I have authored, the main characters and villains have been reimagined with unique ambitions. Drawing inspiration from the rise of K-pop, I've transformed the cat girls into K-pop bounty hunters, adding an amusing twist despite my casual interest in the genre. The lore has been updated, with several new characters introduced to bolster the protagonists. While some content may be sensitive, there will be no instances of rape or explicit sexual content. Each story arc will unfold over ten chapters, each containing 1,000 to 2,000 words, released daily except on weekends. In case of a missed day, the next chapter will be published the following day. The book's cover is created using A.I. in Tensorart. Enjoy.\"","description_hash":-4619597579710908489},{"title":"Flames of Bedlam [Shapeshifting Dragon Sci-Fantasy] ","fiction_id":"87782","link":"https:\/\/www.royalroad.com\/fiction\/87782\/flames-of-bedlam-shapeshifting-dragon-sci-fantasy","tags":["Anti-Hero Lead","Male Lead","Sci-fi","Drama","Adventure","Fantasy","Magic","High Fantasy","First Contact","Soft Sci-fi","Dystopia"],"lable":"Original","following_count":9,"rating":3.5,"page_count":34,"view_count":951,"chapters_count":14,"last_update":1718564027,"description":"He was born into a world that taught him the rage of war, subjugation and suffering. Driven by misery and grief, he embraced the Flames of Bedlam and recreated himself as the First Dragon.\nThe world hailed him as Bahamut, the Dragon King. They trembled under the vengeance of the monster they created…\n…But as water calms the flame, another Dragon appears, determined to turn a bestial tyrant into a true king.\nA STORY FROM THE TIME BEFORE…","description_hash":3952495738891708505},{"title":"Echoes in Time","fiction_id":"87781","link":"https:\/\/www.royalroad.com\/fiction\/87781\/echoes-in-time","tags":["Time Travel","Sci-fi","Fantasy","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":32,"chapters_count":1,"last_update":1717502178,"description":"Abi, born under taboo-like circumstances in a small Ibo village, is the daughter of a mother who claims she fell in love with  an \"alien\", a being she refers to as 'onye obia.' Vilified and ostracized by the village, Abi's mother is saved by a compassionate local priest, only to give birth to a child the villagers believe is a demon. However, one nun sees the child differently and takes Abi to England to raise her. This is her story, a tale that spans through time and space.","description_hash":9090615400896401712},{"title":"My Detective Partner","fiction_id":"87780","link":"https:\/\/www.royalroad.com\/fiction\/87780\/my-detective-partner","tags":["Strategy","Psychological","Multiple Lead Characters","Slice of Life","Drama","Romance","Mystery","Male Lead","Female Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":44,"chapters_count":2,"last_update":1717750802,"description":"Maestra, a mysterious young woman who solved cases by using the most rational way of thinking. In any game of logic her wit is unmatched which earn her the name Maestra, she refused to give away her real name because of her troubled past. Her tendency to live in her own world of logic has isolated her from most people. For her, any kind of method is permitted during investigation if it can produce the best result.\nMartin Mason, an intern who just has been promoted to detective assistant. He is a cheerful man who value the safety of others above all else. His attitude has earned him an expert skill in communicating with any person which makes him valuable in gathering clues, though Maestra mostly used him as errand boy. In his free time, he becomes a volunteer teacher at the local library.\nIn the world of crime solving, logic and emotion amounted to nothing as the mind of criminal has twisted the world into a series of vile conspiracies. As they made one step toward the shadow of the unknown, the line between truth and lie become more blurred.\nI'm writing the story in Wattpad under the same title. My author name there is Dafa Zain","description_hash":-9134015928322301806},{"title":"The Luna Of Malibu","fiction_id":"87779","link":"https:\/\/www.royalroad.com\/fiction\/87779\/the-luna-of-malibu","tags":["Psychological","Female Lead","Strong Lead","Fantasy","Romance","Supernatural","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":12,"view_count":67,"chapters_count":2,"last_update":1717666364,"description":"The alpha is in search of love after a heartbreak, even though he thinks he was in love before but when he met the charming lady from Los Angeles his mind awakens and could not imagine a life without her. As time goes he got his Luna, then the compromise she has to make as her family do not fancy the Alpha. A personality the Alpha refused to accept, he is covetous. he find himself in love with someone else. The unexpected happened and chaos sets in, so that the Luna had to make a decision.","description_hash":8532982163167144917},{"title":"Cigarette: Heads And Tails Chapter","fiction_id":"87778","link":"https:\/\/www.royalroad.com\/fiction\/87778\/cigarette-heads-and-tails-chapter","tags":["Multiple Lead Characters","Action","Adventure","Fantasy","Short Story","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":33,"chapters_count":1,"last_update":1717502033,"description":"After being exiled from the Fire Kingdom, two young Elementals arrive at the Earth Kingdom's flamboyant capital. Known as \"The City That Moves,\" they get a taste of life that's outside of their secluded origins.","description_hash":-148249830400745534},{"title":"The Goblin and Grandma Detective Agency","fiction_id":"87777","link":"https:\/\/www.royalroad.com\/fiction\/87777\/the-goblin-and-grandma-detective-agency","tags":["Grimdark","Slice of Life","Fantasy","Horror","Mystery","Short Story","Low Fantasy"],"lable":"Original","following_count":6,"rating":5.0,"page_count":85,"view_count":555,"chapters_count":13,"last_update":1718478005,"description":"In the quaint, rain-soaked town of Willowbrook, an unlikely duo forms a detective agency like no other. Grib, a clever goblin with a knack for problem-solving and a mischievous sense of humor, teams up with Grandma Maggie, a witty and resourceful retired librarian, to tackle the town's most baffling mysteries.\nThe story kicks off on a stormy night, with Grandma Maggie seeking Grib's help to uncover the truth behind a series of strange symbols appearing around Willowbrook. Despite dismissive attitudes from the local police, who view these occurrences as mere pranks, Maggie and Grib sense something far more sinister at play—an ancient curse tied to the town's dark legends.\nAs they delve deeper into the mystery, their investigation takes them through the shadowy streets and hidden corners of Willowbrook. They uncover clues in old records and cryptic symbols, encountering both red herrings and dangerous adversaries. Their unique skills and perspectives—Grib's sharp eyes and magical gadgets, and Maggie's vast knowledge and intuition—prove invaluable as they piece together the puzzle.\nWith its blend of gritty, 1950s noir atmosphere, whimsical fantasy elements, and heartwarming themes of friendship and community, \"The Goblin and the Grandma Detective Agency\" offers readers a delightful and engaging mystery adventure.","description_hash":-2479202920618993889},{"title":"Reaper - What it Takes","fiction_id":"87776","link":"https:\/\/www.royalroad.com\/fiction\/87776\/reaper-what-it-takes","tags":["Grimdark","Male Lead","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":18,"view_count":32,"chapters_count":1,"last_update":1717502014,"description":"In a world that has given up on life, those who take it have become commonplace. Coined simply as Reapers for their dealings in death, our protagonist has found himself at the ire of many of the folks that once depended on them for their lives. Now simple alchemists and travelers, these Reapers still find their old ways being called upon.","description_hash":-3110573522019124791},{"title":"Records of a king","fiction_id":"87774","link":"https:\/\/www.royalroad.com\/fiction\/87774\/records-of-a-king","tags":["Anti-Hero Lead","Martial Arts","Action","Adventure","Fantasy","Mystery","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":23,"view_count":208,"chapters_count":7,"last_update":1717633587,"description":"A kings wants a world , world wants a king .\nThis is a story about GAZAL as he take the crown for\nHimself.","description_hash":-6070432575253810196},{"title":"Grandma Got a Goblin","fiction_id":"87773","link":"https:\/\/www.royalroad.com\/fiction\/87773\/grandma-got-a-goblin","tags":["Comedy","Female Lead","Fantasy","Low Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":29,"view_count":234,"chapters_count":4,"last_update":1718550954,"description":"Submitted for the Royal Road Community Magazine Contest\nThere's no love like a grandma's love. After her house is broken into, Antoinette's son suggests that she get a dog for protection. She takes a quick trip to the Furever Homes shelter just on the other end of town and finds a unique guard dog. Sure he has dripping pustules, a guttural rasp, and strangely long humanoid fingers, and looks nothing like any dog that she's ever seen, but Gumby is the perfect companion. He's well mannered, fiercely protective, and no one dares to approach Antoinette when she's got Gumby with her. In return, she gives him all the love and affection that only a grandma can.","description_hash":1210049096148990628},{"title":"Goblins and Grandmas. The Great Cook off.","fiction_id":"87772","link":"https:\/\/www.royalroad.com\/fiction\/87772\/goblins-and-grandmas-the-great-cook-off","tags":["Comedy","Slice of Life","Strong Lead","Action","Fantasy","Short Story","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":3,"view_count":30,"chapters_count":1,"last_update":1717501988,"description":"In this story we follow grandmas that are great warriors as they fight and cook off against gooblin grannies. These grannys can put heros to shame and still make it back to home with time to make a fresh batch of cookies for the grandkids. Now let the story begin.","description_hash":5352128610534441288},{"title":"My Tower Defense Battle ","fiction_id":"87771","link":"https:\/\/www.royalroad.com\/fiction\/87771\/my-tower-defense-battle","tags":["Action","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":27,"chapters_count":1,"last_update":1717501984,"description":"the have to make it to round 69.420\n\nexpect \ndaily uploads","description_hash":8692277810962913628},{"title":"Teacher of Mana","fiction_id":"87235","link":"https:\/\/www.royalroad.com\/fiction\/87235\/teacher-of-mana","tags":["Dungeon","Female Lead","Fantasy","School Life","Progression"],"lable":"Original","following_count":11,"rating":0.0,"page_count":54,"view_count":674,"chapters_count":7,"last_update":1717020172,"description":"Eve was in a room of 12 young adults, and had her teaching assistant by her side. It was the start of a new term, and excitement was in the air. \nThat was until the system revealed itself, and deemed earth ready for the new multiverse. The excitement quickly turned to horror when thrown into a tower - the Tower of Nurture specifically.\n100 floors needed to be cleared, and then they could be returned to earth. An arduous task, but a task that needs to be completed. \nWith the introduction of magic and innate talents, Eve slowly finds her footing and establishes herself as a powerful ma- teacher. She establishes herself as a powerful teacher.","description_hash":-7173751522431249517},{"title":"Burning Revenge","fiction_id":"87233","link":"https:\/\/www.royalroad.com\/fiction\/87233\/burning-revenge","tags":["Progression","Male Lead","Action","Adventure","Fantasy","Supernatural","High Fantasy","Mythos","First Contact"],"lable":"Original","following_count":4,"rating":0.0,"page_count":52,"view_count":1142,"chapters_count":30,"last_update":1718557205,"description":"After an asteroid changes the history of the world forever, around 150 years have passed.\nKawao begins his day without knowing that everything upon his return will change forever.","description_hash":-2597104907429650745},{"title":"Journey to The Center of Time","fiction_id":"87232","link":"https:\/\/www.royalroad.com\/fiction\/87232\/journey-to-the-center-of-time","tags":["Progression","Comedy","Strong Lead","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":1,"rating":4.0,"page_count":9,"view_count":79,"chapters_count":1,"last_update":1716712786,"description":"A few million years ago, in a civilization of a different species in the Homo genus, Mai and Rotor journey to the center of time to kill God.","description_hash":-5522194842491785145},{"title":"Techno Mage: Rebirth","fiction_id":"87231","link":"https:\/\/www.royalroad.com\/fiction\/87231\/techno-mage-rebirth","tags":["GameLit","Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","Male Lead","Adventure","Fantasy","Romance","Sci-fi","Genetically Engineered ","Technologically Engineered","Artificial Intelligence"],"lable":"Original","following_count":11,"rating":4.0,"page_count":9,"view_count":426,"chapters_count":3,"last_update":1716835906,"description":"Richard was just another cog in the machine after engineering school... But one day changed all that.","description_hash":7997627198429499414},{"title":"The Circuit Heart","fiction_id":"87230","link":"https:\/\/www.royalroad.com\/fiction\/87230\/the-circuit-heart","tags":["Post Apocalyptic","Female Lead","Sci-fi","Adventure","Cyberpunk","Technologically Engineered","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":1,"rating":0.0,"page_count":5,"view_count":148,"chapters_count":3,"last_update":1716714627,"description":"In a cyberpunk world, humans have abandoned Earth to seek a better life elsewhere, leaving robots to rule the city. Elixa, the only human left, is a curious young girl navigating this mechanical world.\nElixa lived with her robot caretaker until he was forcefully taken away for disassembly. Determined to save him, Elixa embarks on a journey to the city center. Along the way, she encounters friendly and hostile robots, uncovering secrets about the world and her own origins. \"Circuit Heart\" is a story of bravery, discovery, and the quest for identity in a world where humans have become a distant memory.","description_hash":6777458633752932261},{"title":"Chronicles of the Nameless Arachnid","fiction_id":"87229","link":"https:\/\/www.royalroad.com\/fiction\/87229\/chronicles-of-the-nameless-arachnid","tags":["LitRPG","Reincarnation","Dungeon","Psychological","Non-Human Lead","Adventure","Fantasy","Mystery"],"lable":"Fan Fiction","following_count":3,"rating":0.0,"page_count":25,"view_count":508,"chapters_count":4,"last_update":1718289513,"description":"\"Chronicles of the Nameless Arachnid\" follows Sebas, a diligent delivery man thrust into an otherworldly existence when a blinding light transports him to an underground chamber, where he undergoes a startling metamorphosis into an arachnid. Struggling to reconcile his former identity with his new form, Sebas embarks on a perilous journey of self-discovery within the depths of the mysterious realm. As he navigates through labyrinthine tunnels and encounters bizarre creatures, Sebas is driven by an insatiable curiosity to unravel the secrets of his transformation and the enigmatic chamber that has become his new reality.\nIn a quest filled with danger and uncertainty, Sebas confronts psychological challenges of identity crisis and existential questioning, all while facing formidable adversaries and forging unlikely alliances. As mysteries unfold and prophecies are revealed, Sebas must confront the darkness within himself and the world around him, ultimately embracing his newfound powers and destiny. \"Chronicles of the Nameless Arachnid\" is a gripping tale of fantasy and adventure, weaving together themes of self-discovery, redemption, and sacrifice in a richly imagined world where nothing is as it seems, and every step leads closer to the truth.","description_hash":177123921469944390},{"title":"Aoling Hunter","fiction_id":"87228","link":"https:\/\/www.royalroad.com\/fiction\/87228\/aoling-hunter","tags":["Super Heroes","Martial Arts","Male Lead","Secret Identity","Strong Lead","Action","Adventure","Fantasy","Supernatural","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":52,"view_count":459,"chapters_count":9,"last_update":1716882918,"description":"The Aoling Maze divides the world into two sides: the outer side is the Abyssal Purgatory, and the inner side is the Holy Light Pure Land. Through nightmares and creatures, the Aoling Maze establishes connections. As long as you respond to this call, you will gain the power of the maze, be drawn to it, and even go mad because of it. The Aoling Maze has led to the birth of a force known as the Aoling Hunters. They are experts of the maze, assisting the Holy Light, hunting in the abyss, and exploring the mysteries of the maze.","description_hash":2570739292327154628},{"title":"Biomorph","fiction_id":"87227","link":"https:\/\/www.royalroad.com\/fiction\/87227\/biomorph","tags":["Anti-Hero Lead","Super Heroes","Male Lead","Action","Cyberpunk"],"lable":"Original","following_count":9,"rating":0.0,"page_count":42,"view_count":682,"chapters_count":6,"last_update":1718528021,"description":"It's either thrive as a villain or be a Lab Rat for the corporations\nNate has lived the life of a slum rat growing up in District 12 in New Halcyon when an accident caused by two supers fighting causes him to Trigger. He is thrust into a society he has little knowledge or understanding of, with a power that could turn him into a test subject for the Mega-Corporations that control New Halcyon.\n\nThis novel was inspired by Super Minion and A Bio-Weapon's Rhapsody","description_hash":5999932626779742325},{"title":"Xenofauna","fiction_id":"87226","link":"https:\/\/www.royalroad.com\/fiction\/87226\/xenofauna","tags":["War and Military","Male Lead","Sci-fi","Action","Fantasy","Short Story","Magic","High Fantasy","First Contact","Soft Sci-fi"],"lable":"Original","following_count":1,"rating":4.0,"page_count":4,"view_count":84,"chapters_count":1,"last_update":1716707693,"description":"A magi-tech civilization is colonising an alien planet. A field research team encounters an individual of a local dragon-like predator species.\n\nMy satchel was almost full, and my mind inattentive, when I heard rustling from the forest. The sight made me freeze. There was a creature, 10 meters away, it's body as big as a draft horse, it's back on my eye level, yet it's posture was feline, that of a predator. It had two wings, currently folded against it's back, and was covered in scales, with a long slender neck, it's reptilian head raised and with three pairs of fin-like frills, longer than wider, extending from the back of the head in a star shape. It's body had a dark violet colour, with contrasting dark orange patterns and accents, while it's slitted eyes were light blue. And looking right at me.\n\nIt's a quick read with a fight scene in it, give it a go.","description_hash":-8743619751046718202},{"title":"Realms of War: Power's Conquest [Multi-Planar & Cultivation Novel]","fiction_id":"87225","link":"https:\/\/www.royalroad.com\/fiction\/87225\/realms-of-war-powers-conquest-multi-planar-cultivation","tags":["Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","War and Military","Xianxia","Action","Adventure","Fantasy","Historical","Martial Arts","Reader Interactive","Supernatural","Strong Lead","Magic","Strategy","Wuxia","High Fantasy","Mythos","Villainous Lead","Ruling Class","Dystopia","Attractive Lead"],"lable":"Original","following_count":11,"rating":0.0,"page_count":187,"view_count":2802,"chapters_count":33,"last_update":1718622004,"description":"In the vast and tumultuous Myirad Planes, where endless wars rage and groundbreaking discoveries are made every moment, power is the ultimate pursuit. This is a world teeming with diverse races, each vying for supremacy.\nEnter Zain, a young and ambitious boy who embarks on a perilous journey to become a legendary Conqueror. As he navigates through this chaotic realms, Zain forges powerful alliances and formidable enemies. He battles across different planes, manages vast territories, and faces challenges that test his strength and resolve.\n\nJoin Zain on this epic adventure, filled with thrilling battles, intricate politics, and the quest for ultimate power. His story is one of courage, friendship, and the relentless pursuit of greatness in a world where only the strongest survive.\n\nChapter Release Time: EST 8:00 ,  BST 13:00\n(Currently 30 Chapters scheduled for release)\nDaily updates","description_hash":1395098498455837816},{"title":"Azure Blade","fiction_id":"87224","link":"https:\/\/www.royalroad.com\/fiction\/87224\/azure-blade","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Ruling Class","Psychological","Action","Adventure","Fantasy","Slice of Life","Supernatural","Male Lead","Female Lead","Strong Lead","Multiple Lead Characters","Magic","Strategy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":22,"view_count":61,"chapters_count":1,"last_update":1716701778,"description":"A whole class of students were suddenly brought to a magical world... to work as slaves? In these rotten floating islands building up a crumbling nation, how will they ever hope to find their way back in one piece? Better yet, how will Izan even hope to survive without the support of his fellow world-hoppers?\nBy making a large-scale, powerful adventurer's organization, of course!\n[AN: 05\/26\/24 - Lots of things are subject to change, mostly with the plot. This synopsis is more or less temporary.]","description_hash":-5765697006603205286},{"title":"Horrible People","fiction_id":"87223","link":"https:\/\/www.royalroad.com\/fiction\/87223\/horrible-people","tags":["Psychological","Multiple Lead Characters","Contemporary","Slice of Life","Drama","Romance","Female Lead","First Contact","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":22,"view_count":153,"chapters_count":4,"last_update":1718082063,"description":"Everyone who's anyone knows who Olive Dooley is. They know her producer mother, who secured her roles. They know the director who discovered her at five years old and starred her in his films, calling her his muse\nThey know her signature style is pink and white, hair never dyed, manicured tips, and heels even when it's inconvenient.\nThey don't know what goes on behind the scenes, how she aches to escape the skin she's in, or who she becomes in the moonlight.\nOlive Dooley knows what the world wants of her, and she delivers...but what happens when she can't be that person anymore? What happens when the Olive Dooley everyone knows and loves stops behaving like Hollywood's Perfect Child Star?\nSoon, the world will know who exactly Olive Dooley is to the director.\nContent specifics: This is a story about horrible, yet beautiful people, whose issues do not revolve around poverty—but do involve money (bribery). There are hints of dissociative identity disorder—respectfully, for this is authored by someone with DID after all. Uncomfortable forms of prejudice will be challenged in this story.","description_hash":-6387392986087513825},{"title":"World Walker","fiction_id":"87222","link":"https:\/\/www.royalroad.com\/fiction\/87222\/world-walker","tags":["Portal Fantasy \/ Isekai","War and Military","Action","Romance","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":14,"view_count":110,"chapters_count":2,"last_update":1717589268,"description":"n the aftermath of his grandparents' tragic demise, sixteen-year-old Ethan rummages through the attic of their ancestral home, searching for items to sell. Amidst the dusty relics of the past, he stumbles upon a mysterious cube, its surface etched with enigmatic symbols that seem to pulse with an otherworldly energy. Intrigued, Ethan reaches out to touch it, unaware of the profound consequences that await.\nAs his fingertip grazes the ancient artifact, a hidden needle springs forth, piercing his skin and drawing a small droplet of blood. In a mesmerizing display of light and shadow, the cube begins to glow, its surface liquefying and melding with Ethan's flesh. A searing pain courses through his veins as the strange substance forms a tattoo on his wrist—a cryptic design comprised of a circle within a square, surrounded by a language unknown to him.he cube, infused with a mysterious energy, imbues him with the ability to traverse the boundaries of reality and journey to different worlds.\nTo all my readers, please bear with the slow development in this novel as English is not my first language. If you spot any errors, I welcome your feedback, and I hope you still find enjoyment in the story.The story will focus on adventure, the worlds and the lore of the worlds, there will be action too but the story will still remain slow passed. if its not your cup of tea then please find other novels, (there are many good one)","description_hash":3215475039772424705},{"title":"FINDING MY MISSING PIECES","fiction_id":"87221","link":"https:\/\/www.royalroad.com\/fiction\/87221\/finding-my-missing-pieces","tags":["Female Lead","Adventure","Fantasy","Historical","Magic"],"lable":"Original","following_count":2,"rating":0.0,"page_count":4,"view_count":70,"chapters_count":1,"last_update":1716693038,"description":"Read to find out. its about a girl trying to get her emotions back and meet new people along the way.","description_hash":-8779662433166303849},{"title":"How High Can She Bloom?","fiction_id":"87220","link":"https:\/\/www.royalroad.com\/fiction\/87220\/how-high-can-she-bloom","tags":["Female Lead","Drama","Action","Adventure","Fantasy","Low Fantasy"],"lable":"Fan Fiction","following_count":1,"rating":5.0,"page_count":17,"view_count":150,"chapters_count":2,"last_update":1717183684,"description":"Alina Maxon is just an ordinary girl, and the odds of her making it and becoming the Contest Queen of Eirelia are very low, especially when you consider the current Contest Queen, whom they call the Flower of Eirelia. She isn't rich and her Pokemon isn't a typical contest Pokemon. She's from the small Clover Town rather than a big city. Along with all of this, her closest friends participate in the gym circuit and the contest circuit is a brutal, harsh place with cold opponents. Oh, and she has stage fright. \n\n\nAll Pokemon belong to the author of Pokemon but the characters are mine. Cover art made with Canva.","description_hash":3590903581874055923},{"title":"An Islands of Wolves","fiction_id":"87219","link":"https:\/\/www.royalroad.com\/fiction\/87219\/an-islands-of-wolves","tags":["Non-Human Lead","Fantasy","Romance"],"lable":"Fan Fiction","following_count":1,"rating":3.5,"page_count":69,"view_count":1854,"chapters_count":42,"last_update":1718137861,"description":"This story is all about the Cursed wolves in the Islands of Reigate. The New Alpha Keith of Islands of Reigate and his luna Roewnne is all set to break this curse and bring happiness to their Islands.","description_hash":2243670328663024593},{"title":"Corruption of Reality","fiction_id":"87218","link":"https:\/\/www.royalroad.com\/fiction\/87218\/corruption-of-reality","tags":["Dungeon","Comedy","Multiple Lead Characters","Adventure","Fantasy","Horror","Supernatural","High Fantasy"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":126,"view_count":829,"chapters_count":21,"last_update":1717113008,"description":"For reasons unknown, a force occurs all across the multiverse, when evil spreads. It turns the most greatest heroes of all time into the most vilest villains through transformation and mind control. While others who did not face this fate were instead enslaved, doing physical labor instead of turning evil and working alongside with the villains who turned them. What will the many survivors do, and how will they survive this is up to the decisions of the survivors, as 15 different characters find a way to avoid becoming killed, slaves, or worse, corrupted an on the side of the villains the heroes once opposed. As many characters from different worlds join, including Mario, Pikachu, Link and Homer Simpson travel across the multiverse trying to survive this series of events.","description_hash":-4354652176879658863},{"title":"Ezra","fiction_id":"87217","link":"https:\/\/www.royalroad.com\/fiction\/87217\/ezra","tags":["Reincarnation","Progression","Male Lead","Action","Adventure","Fantasy","Romance","Magic","High Fantasy"],"lable":"Original","following_count":6,"rating":5.0,"page_count":21,"view_count":314,"chapters_count":4,"last_update":1718303368,"description":"The Era of Nobility was a dark and tumultuous time where mortals formed rigid hierarchies. Power was concentrated in the hands of the noble class. It was an age of war and bloodshed, where the enslavement of people became commonplace and many civilizations collapsed under the strain of war and tyranny. Generation after generation, their greed and corruption continued until a group of explorers returned from the Void-Crypt.\nThe Void-Crypt was not new to the world; there were all kinds of legends about it. But universally, everyone feared it. Nobody knew where this fear came from, as if it was instinctual. Void Gates, scattered across the land, served as mysterious and feared portals to this enigmatic realm. Though these gates had always been present, their origins and the nature of the Void-Crypt remained cloaked in mystery.\nMany adventurers, driven by curiosity or desperation, had ventured through these gates, yet none returned, heightening the fear surrounding them. Though fewer attempted the journey over time, some still dared, and eventually, a few did return.\nThese explorers came back bearing powerful relics and mysterious abilities, sparking a rush of adventurers eager to seek similar fortunes. Despite the high mortality rate, the allure of power and treasure proved irresistible.\nThose who survived the journey back brought with them not just relics, but also the arcane knowledge of the Void-Crypt, reigniting civilization's thirst for exploration and conquest. Empowered by their discoveries, these adventurers began to challenge the existing order. Their newfound abilities and relics emboldened them to rebel against the entrenched nobility, marking the prelude to the end of the Era of Nobility.\nA few decades passed, ushering in the new age of the void-explorers. It was during this time that a lone soul entered the realm, from a foreign world.","description_hash":-6154670133078080253},{"title":"Librarian of Ages","fiction_id":"87216","link":"https:\/\/www.royalroad.com\/fiction\/87216\/librarian-of-ages","tags":["LitRPG","Psychological","Female Lead","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Sophia was an unassuming orphan from a town going through hard times; kicked out of her orphanage as food grew more expensive, she found out in short order that her job at the local library wasn't as secure as she'd assumed. Now finding herself between a rock and a hard place, standing on the streets of a declining town with suddenly no idea what path her life would take, she now must ask herself a question. What is it that she wants? \nDrastic actions have drastic results. Add in a single minded focus born from a lack of distractions and a mild fascination that draws her in deeper as she embraces it, the questions she seeks to answer grow ever more.\nWhat to expect:\n- Primarily non-combat MC, but still weak to strong storyline\n- Curiosity driven MC\n- No Romance\n(more may be added later)","description_hash":-5139851133751781439},{"title":"The Veiled Eye","fiction_id":"87215","link":"https:\/\/www.royalroad.com\/fiction\/87215\/the-veiled-eye","tags":["Grimdark","Psychological","Fantasy","Horror","Short Story","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":60,"chapters_count":1,"last_update":1716681149,"description":"Horror stories. They are quite fascinating, aren't they? \nSome talk about ghosts, then there are some that talk about demons, monsters and well, people who go about saying, \"Hello\", through a slashing gesture. Well, what can this story offer? \nDepends on what you think. Regardless, I can't promise that it will scare you, but what I can promise is that it will always be short, simple and hopefully entertaining. \nThese stories will be just a collection of the entities that roam in my made up world. It has no direct link to our \"real world\" (*cough* Matrix *cough*!!) Pardon me.\nWell, here's one of the first of my creations. So, please....... tell me how long you took to read them and enjoy :)","description_hash":-8125276345369369972},{"title":"Legacy of a Scholar","fiction_id":"87214","link":"https:\/\/www.royalroad.com\/fiction\/87214\/legacy-of-a-scholar","tags":["Portal Fantasy \/ Isekai","Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":28,"view_count":254,"chapters_count":5,"last_update":1716724191,"description":"Broadly speaking, a boy trying to make the world a better place, starting with his village. The only problem is how he keeps messing up.","description_hash":415659970629983014},{"title":"Adventurer Master: Pale World","fiction_id":"87213","link":"https:\/\/www.royalroad.com\/fiction\/87213\/adventurer-master-pale-world","tags":["LitRPG","Dungeon","Anti-Hero Lead","Strategy","Harem","Adventure","Fantasy","Horror","Mystery","Magic","GameLit","Mythos","Dystopia"],"lable":"Original","following_count":1,"rating":5.0,"page_count":6,"view_count":111,"chapters_count":3,"last_update":1716868136,"description":"In the Pale World, everything is completely covered in Pale Gray Mist.\nWhere the Gods and Goddesses can descend into the world.\nAs the time of the Apocalypse draws near, a man who bears the greatest Fate and Sin will appear.\nIs it a Prophecy? Is it an Answer? Can the world Hope once again?","description_hash":1982587184422035876},{"title":"The Fall of Wolfsbane - A Coming-of- Age High Fantasy (Ravenglass Legends, Book 1)","fiction_id":"87212","link":"https:\/\/www.royalroad.com\/fiction\/87212\/the-fall-of-wolfsbane-a-coming-of--age-high-fantasy","tags":["Ruling Class","Martial Arts","Multiple Lead Characters","Strong Lead","Action","Adventure","Fantasy","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":113,"view_count":732,"chapters_count":14,"last_update":1718445603,"description":"In a world torn by conquest and betrayal, a young warrior must navigate a dangerous path between his warrior heritage and a powerful Empire.\nRagnar Wolfsbane, once chieftain-in-waiting of Meerand, is taken hostage after his father's execution and his sister's abduction.\nThrust into palace intrigues, Ragnar must prove his worth to the Empire that destroyed his homeland while unravelling mysteries of ancient magic.\nBut vengeance has a cost, and Ragnar soon faces a choice that will shape the fate of nations.\nAn epic tale of loyalty, loss, and destiny unfolds as Ragnar struggles to reclaim his birthright and protect those he holds dear.","description_hash":-6921224597384685527},{"title":"COWBOY CASANOVA","fiction_id":"87211","link":"https:\/\/www.royalroad.com\/fiction\/87211\/cowboy-casanova","tags":["Female Lead","Contemporary","Slice of Life","Strong Lead","Drama","Action","Romance","Sports","Male Lead"],"lable":"Original","following_count":1,"rating":0.5,"page_count":444,"view_count":2625,"chapters_count":76,"last_update":1718557340,"description":"Saddle up for a wild ride of love and redemption as Ryder, a rugged rodeo star with a scandalous past, meets his match in Isobel, a beautiful woman with a heart of gold. But as their whirlwind romance takes off, Ryder's Casanova ways are put to the test. Can Isobel tame the bull rider's wild heart, or will his demons send their love crashing to the ground? Get ready to be bucked off your seat with this sizzling romance that will leave you breathless and begging for more!","description_hash":1806887855230783564},{"title":"THE CURTAIN OF DECEPTION","fiction_id":"87210","link":"https:\/\/www.royalroad.com\/fiction\/87210\/the-curtain-of-deception","tags":["Grimdark","Female Lead","Contemporary","Drama","Romance","Mystery","Supernatural","Low Fantasy","Mythos"],"lable":"Original","following_count":1,"rating":0.5,"page_count":209,"view_count":1067,"chapters_count":31,"last_update":1718403496,"description":"In the sleepy town of Magnolia Midland, a legendary theater has been shrouded in mystery for decades. The once-grand Marlowe Playhouse, with its ornate chandeliers and velvet curtains, has been abandoned for years, its secrets locked behind a veil of dust and darkness.But when a team of seasoned ghost hunters is called to investigate the supposedly haunted theater, they're met with more than just creaking floorboards and flickering lights. As they delve deeper into the heart of the Marlowe Playhouse, they begin to unravel a tangled web of deceit and illusion.Is it the ghostly apparitions that seem to appear at every turn? Or are they merely clever tricks by those who seek to distract from their own sinister motives? As the team navigates the treacherous world of amateur dramatics and small-town politics, it becomes clear that nothing is as it seems.Who's acting out their part? Who's playing along? And who's paying for this deadly game?Join us on a thrilling journey into the world of \"The Curtain of Deception\", where reality blurs with fiction and nothing is certain except one thing: in Ravenswood, no one can be trusted.","description_hash":3007603504794299579},{"title":"Night's path ","fiction_id":"87209","link":"https:\/\/www.royalroad.com\/fiction\/87209\/nights-path","tags":["Urban Fantasy","Fantasy","Romance","Mystery","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":70,"view_count":230,"chapters_count":5,"last_update":1716767093,"description":"An orphan named Ry Wallace Harmony, on the night of a full moon 3 weeks after his 18th birthday, has a shocking revelation about himself. On top of him struggling to be an independent young adult, and the troubles of balancing work, school, and a possible love life; He is hit with the notion that he is not human but something else entirely. While attending a small community college he meets Lyla Luna Nightwing, a girl who at first sight hated him without reason. But the feeling is mutual. At the same time they couldn’t be apart from one another. The story follow the growing love life of two people who hate each other but can’t be apart from one another. As they get closer they find out things about each other that even their closest friends didn’t know about them. Ry and Lyla will journey around the world in search of answers about his parents, the reason he was abandoned and he will struggle to keep his love and his life. Follow Ry and Lyla as they uncover the truth of his parents and their origins. Come follow their exciting relationship in my first novel.","description_hash":8107693478813462900},{"title":"Silver Peaks (Pokemon)","fiction_id":"87208","link":"https:\/\/www.royalroad.com\/fiction\/87208\/silver-peaks-pokemon","tags":["Anti-Hero Lead","Grimdark","Action","Adventure","Fantasy","Magic","Low Fantasy","High Fantasy"],"lable":"Fan Fiction","following_count":7,"rating":0.0,"page_count":64,"view_count":857,"chapters_count":8,"last_update":1717975489,"description":"An alternate universe set in the Kanto & Johto Region of the Pokemon World.\nThe relationship between the two regions have always been somewhat tense. The older generation grumble about the war that ended with their parents, and the Indigo League toil to keep the peace.\nBut what does that matter to an orphan like Morgan? The only thing on his mind is how to earn enough success in Pokemon battles so that he can retire as a rich man. Or so he tells himself as he goes through the start of his journey.\n\nIt is non-canon to the game, anime, or manga, but I did take some element from it. It is set around the time when Samuel Oak is in his early twenties.\nThe story is about an OC's journey trying to complete his Gym Challenges, but instead waylaid with random side missions.","description_hash":8348547041139475088},{"title":"Legend Of Hellwalker","fiction_id":"87207","link":"https:\/\/www.royalroad.com\/fiction\/87207\/legend-of-hellwalker","tags":["LitRPG","Progression","Martial Arts","Male Lead","Action","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":7,"rating":0.0,"page_count":86,"view_count":1928,"chapters_count":21,"last_update":1718074804,"description":"Henry Hellwalker, a humble soldier of the Severin Empire, is a happy man who enjoys life with his family. However, one day, after a higher demon attacks his house, he loses all that was dear to him. From that day on, he swore to slay all demons, and awakened a new power.\n[The Granter of Systems has granted you a system. The Demon Slayer System has been initiated.]\n[If you like this record, consider supporting it via patreon.com\/RecordsOfTheCore, early access to chapters and other privileges will be provided. Community discord link with Patreon only channel: https:\/\/discord.gg\/jTWnxEf5Yb]","description_hash":604438530779411794},{"title":"THE BLACK ROSE MURDERS","fiction_id":"87206","link":"https:\/\/www.royalroad.com\/fiction\/87206\/the-black-rose-murders","tags":["Strategy","Grimdark","Psychological","Multiple Lead Characters","Drama","Historical","Horror"],"lable":"Original","following_count":2,"rating":2.25,"page_count":180,"view_count":749,"chapters_count":21,"last_update":1718405219,"description":"In the shadow-drenched alleys of a London not found on any map, a predator walks—a creature of the night whose thirst is never slaked. They call him \"The Rose Killer,\" a name whispered in fear by those who find his calling card, a single black rose, lying beside the lifeless victims of his insatiable hunger.\nIn this gothic historical thriller, the ordinary world of Robert and Ellen Bernard is turned inside out as they take in a lodger whose enigmatic presence brings a chilling change to their mundane existence.\nEvery creak of the floorboards, every rustle of the curtains, every flicker of candlelight teases the senses, drawing you closer to the heart of a mystery that gnaws at the soul.","description_hash":-4101101649272203789},{"title":"TWISTED MINDS","fiction_id":"87205","link":"https:\/\/www.royalroad.com\/fiction\/87205\/twisted-minds","tags":["Strategy","Psychological","Multiple Lead Characters","Contemporary","Slice of Life","Drama","Horror","Male Lead","Female Lead"],"lable":"Original","following_count":1,"rating":0.5,"page_count":157,"view_count":886,"chapters_count":26,"last_update":1718406399,"description":"From the outside, Hunter's life appears to be a masterpiece. He's the golden boy, with a fortune that rivals royalty and a smile that can charm the stars. But behind the gleaming facade, Hunter's world is crumbling.\nAs he navigates the treacherous waters, he's forced to confront the one person who knows him best - his childhood friend and long-time crush, Juliette. The girl who has always been there for him, through thick and thin.\nBut just as Hunter thinks he's finally found a way to make amends and win Juliette back, tragedy strikes. A devastating event shatters their lives forever, leaving them both reeling in its wake.","description_hash":1561519813773935758},{"title":"PONIES AND HORSES","fiction_id":"87204","link":"https:\/\/www.royalroad.com\/fiction\/87204\/ponies-and-horses","tags":["Multiple Lead Characters","Contemporary","Drama","Action","Romance","School Life","Female Lead"],"lable":"Original","following_count":1,"rating":0.5,"page_count":95,"view_count":747,"chapters_count":19,"last_update":1718403821,"description":"Get ready to gallop into the world of Stargate Equestrian University, where passion, friendship, and romance come together in a thrilling ride!\nJoin Cellie on an unforgettable adventure filled with:New friendships that will make your heart soar,Ponies that will capture your heart,Romance that will leave you breathless.\nSaddle up and ride along with Cellie as she takes on the challenges of university life, self-discovery, and first love. The starting gate is open - are you ready to take the reins?","description_hash":-5392101727836801605},{"title":"Calisteo - Stadt der Geister [German]","fiction_id":"87203","link":"https:\/\/www.royalroad.com\/fiction\/87203\/calisteo-stadt-der-geister-german","tags":["Multiple Lead Characters","Strong Lead","Action","Adventure","Fantasy","Romance","School Life","Supernatural","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":160,"view_count":965,"chapters_count":26,"last_update":1718571540,"description":"Umgeben von Meer und Wüste steht in einem Fleck von Grün die Stadt Calisteo, ein Zufluchtsort für etwaige Reisende und die Nachkommen der Überlebenden der alten Welt. Der fragile Frieden der Stadt wird jedoch durch eine Vorhersehung bedroht, welche das Ankommen eines Herrschers ankündigt, welcher die Stadt einen soll. Ein Machtwechsel, den einer von den drei jungen Herrscher, Raffael Beltran, nicht einfach hinnehmen kann. \nEtienne, gebunden an einen Djinn, ist auf der Suche nach den Steinen von Expulsio. Nichts kommt ihr ungelegener, als auch noch Teil der Probleme dieser Stadt zu werden. Und Raffael, fest überzeugt, dass sie Teil der Vorhersehung ist, hat sie in alles hineingezogen.\nIst Etienne es aber wirklich?","description_hash":6714210569504374009},{"title":"Guild At the End","fiction_id":"87202","link":"https:\/\/www.royalroad.com\/fiction\/87202\/guild-at-the-end","tags":["LitRPG","Dungeon","Comedy","Multiple Lead Characters","Drama","Action","Adventure","Magic"],"lable":"Original","following_count":1,"rating":4.0,"page_count":5,"view_count":65,"chapters_count":1,"last_update":1716674427,"description":"Unwilling to watch the world destroy itself, or just forced to change it because no one else will. four young women set off on an adventure to rise up the rank for the power to change a rotten world, even if its by force.","description_hash":1140005339455755386},{"title":"The Thing that Thunder Spoke Of","fiction_id":"87201","link":"https:\/\/www.royalroad.com\/fiction\/87201\/the-thing-that-thunder-spoke-of","tags":["Fantasy","Horror","Short Story","Supernatural","Magic","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":39,"chapters_count":1,"last_update":1716674418,"description":"On a treacherous mountain, under a treacherous moon, small-town minuteman Al'Serica finds himself woefully alone while hunting the infernal beast that slaughtered his people. Yet as the chill sinks in, as the mists become thicker, and the feeling of eyes upon his chitin grows stronger, will Al'Serica return home or victorious or will the hunter become the hunted?","description_hash":1672397840976105117},{"title":"Western Gunslinger Cultivation: The Sheriff's Disciple","fiction_id":"87200","link":"https:\/\/www.royalroad.com\/fiction\/87200\/western-gunslinger-cultivation-the-sheriffs-disciple","tags":["Xianxia","Action","Adventure","Fantasy"],"lable":"Original","following_count":2,"rating":4.5,"page_count":1,"view_count":49,"chapters_count":1,"last_update":1716674409,"description":"Dust swirled in the midday sun as Billy \"The Quill\" Harker trudged down the lonely dirt road leading to the town of Cactus Ridge. His pistol, a gleaming Colt Peacemaker, felt heavy at his side, not just from its weight, but from the responsibility it represented. Billy wasn't much of a shot—he'd always been more comfortable with a pen than a gun—but that was about to change.\n\nSheriff Jed \"Ironjaw\" Thompson leaned against the hitching post outside the saloon, a toothpick rolling between his teeth. His eyes, as sharp as the spurs on his boots, followed Billy's hesitant approach. Jed was a legend, known for taking down entire gangs single-handedly and chewing nails for his daily intake of iron, or so the stories went. To Billy, he was a living nightmare wrapped in a duster.\n\n\"Yer late,\" Jed growled, his voice like gravel crunching underfoot. He didn't look up from the horse he was grooming, but Billy knew those eyes missed nothing.\n\n\"Sorry, Sheriff,\" Billy stammered, trying to hide the tremor in his voice. \"Got held up by the Tucker boys.\"\n\nJed snorted. \"They still sore 'bout that poker game? Told ya, if you're gonna gamble, ya better be ready to draw.\"\n\nBilly swallowed hard. He had a lot to learn, and he knew it. That's why he was here—to be trained by the toughest son of a gun in the West.\n\n\"Let's get somethin' straight, kid,\" Jed said, finally turning to face him. \"This ain't about learnin' to shoot. It's about cultivatin' yer spirit. Out here, a man's soul is his true weapon. Guns are just a tool.\"\n\nBilly nodded, not entirely sure what that meant, but eager to find out. He'd heard tales of outlaws who could dodge bullets, gunfighters who could summon the very essence of the desert to fight by their side. If anyone could teach him, it was Jed.\n\n\"First lesson,\" Jed said, tossing a tin can into the air and drawing his pistol in one smooth motion. The can exploded mid-flight, shards raining down like confetti. \"Ya gotta learn to trust yerself. Fear'll kill ya faster than any bullet.\"\n\nBilly took a deep breath and drew his own gun, hands shaking. He fired, missing the tin can completely.\n\nJed sighed, shaking his head. \"We got a long way to go, kid. But we'll get there. Now, holster that iron and follow me. We got bandits to hunt, and they ain't gonna wait for ya to find yer courage.\"\n\nAs Billy followed Jed out of town, he couldn't help but feel a spark of something new—a flicker of determination. The road ahead was long and perilous, but if he could survive Sheriff Ironjaw's training, he might just become the legend he was meant to be.","description_hash":-3121756088621145238},{"title":"The Immortal Kitten","fiction_id":"87199","link":"https:\/\/www.royalroad.com\/fiction\/87199\/the-immortal-kitten","tags":["Reincarnation","Female Lead","Strong Lead","Action","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":4.0,"page_count":5,"view_count":91,"chapters_count":1,"last_update":1716673987,"description":"Lila Was walking along one day, when she noticed a truck was on the path to run over an elderly woman, Lila decides to save the elderly woman but gets herself killed in the process. Her reward for her heroic actions?\nShe gets reincarnated in a Fantasy world as a Kitten that never ages, and has Infinite Mana?\nJoin Lila as she Discovers this whole new world as the Worlds most adorable and strongest Kitten","description_hash":3618088790783652912},{"title":"Reincarnation: Road to rebuild a lost home","fiction_id":"87198","link":"https:\/\/www.royalroad.com\/fiction\/87198\/reincarnation-road-to-rebuild-a-lost-home","tags":["Reincarnation","Non-Human Lead","Harem","Action","Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":13,"view_count":272,"chapters_count":3,"last_update":1716675245,"description":"In his final year of high school, Francis Robinson seized his last opportunity to confess his feelings to the girl he had admired for three years, however, his courage led him to an unexpected revelation: she was already involved with the rich kid school bully.\n\nDevastated by this revelation, Francis' emotions overwhelmed him. Leading to a fatal accident as he crossed the street in a daze, but instead of an afterlife, Francis finds himself awakening in a mysterious room.\n\nWhile just looking forward he sees a middle-aged man with glasses as having a lit Cigar in one hand and the other busy writing down inside a book like many other books kept in a large pile on the counter.","description_hash":8272123509753456794},{"title":"Paradox's Adventures","fiction_id":"87197","link":"https:\/\/www.royalroad.com\/fiction\/87197\/paradoxs-adventures","tags":["Time Travel","Super Heroes","Male Lead","Harem","Strong Lead","Action","Adventure","Fantasy","Gender Bender","Supernatural","Magic"],"lable":"Fan Fiction","following_count":2,"rating":4.0,"page_count":150,"view_count":721,"chapters_count":17,"last_update":1718601780,"description":"This is the story of Paradox and their Adventure through the Omniverse, and how they became the strongest in the Universe with the Help of their Trusty Omni-Watch.\n(This is my very first story I hope you enjoy the first chapter and pls tell me what you think and if you want more I will release the other chapter that I have)\nPs. i also put Profanity and Sexual content just in case since I don't know if I will add those two","description_hash":4081080260483142873},{"title":"The Omega Princess: Her Choice","fiction_id":"87196","link":"https:\/\/www.royalroad.com\/fiction\/87196\/the-omega-princess-her-choice","tags":["Female Lead","Historical","Romance"],"lable":"Original","following_count":4,"rating":4.69,"page_count":101,"view_count":1500,"chapters_count":7,"last_update":1718477052,"description":"In the kingdom of Lumina, where societal norms are defined by the roles of alpha, beta, and omega, Princess Rebecca finds herself at the heart of a month-long festival to choose her future partner that will shape her future. \nThe revelation of Rebecca's omega status casts a shadow over the royal discussions, making her once-trusted advisors full of skepticism and hesitation about her future rule. Whispers of doubt weave through the corridors, challenging Rebecca's authority and reshaping the dynamics of her rule.\nAmidst the political intricacies, a captivating, slow-burn romance begins to unfold. A confident omega from the neighboring kingdom of Gaelle enters Rebecca's life with a bold declaration, defying societal norms by participating in the archery tournament. The tension rises as this individual's impressive skills draw admiration and resentment from the crowd and fellow competitors alike.\nAs Rebecca navigates the challenges of courtly politics, her heart finds happiness in unexpected places. The genuine connection between Rebecca and this enigmatic figure blossoms, each interaction carrying an undercurrent of something more. Their love, however, faces unexpected threats, as others seem determined to tear them apart.\nThe festival becomes a battleground of emotions, where love, duty, and societal expectations collide, and Princess Rebecca must make choices that will shape not only her but the fate of the entire kingdom.\nWill Rebecca follow her heart's desire, defying the expectations of tradition and duty? Or will she succumb to the pressures of her role, closing off her heart to follow her parents' wishes?\n\nRelease schedule: Every other week on Friday at 5pm pst","description_hash":-3722361540309700304},{"title":"Chronicles of the Unseen Overlord A Normal Life in a World of Magic","fiction_id":"87195","link":"https:\/\/www.royalroad.com\/fiction\/87195\/chronicles-of-the-unseen-overlord-a-normal-life","tags":["Dungeon","Male Lead","Adventure","Fantasy","Magic"],"lable":"Original","following_count":3,"rating":0.0,"page_count":39,"view_count":461,"chapters_count":9,"last_update":1717671809,"description":"Leon is young silver haired boy who works as a carpenter's apprentice living a quiet life in the peaceful village of Windale. Unbeknownst to him, he holds a hidden power that could change the world.\nWhen bandits attack his village, Leon accidentally unleashes a mysterious force, revealing his incredible abilities. This event attracts the attention of dark forces who want to control him and guardians who vow to protect him.\nCaught in a struggle between good and evil, Leon embarks on a journey to discover his true origins and the extent of his powers. Alongside his friends, he must decide whether to embrace his destiny as a powerful figure in Eldoria or fight to keep his simple, peaceful life.\n\"Chronicles of the Unseen Overlord: A Normal Life in a World of Magic\" is an adventure about self-discovery, hidden strength, and the choice between a quiet life and a heroic destiny. It’s a tale of magic, mystery, and the power within.","description_hash":192336732792450560},{"title":"Blurbs from a Raving Fool","fiction_id":"87194","link":"https:\/\/www.royalroad.com\/fiction\/87194\/blurbs-from-a-raving-fool","tags":["Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":34,"chapters_count":1,"last_update":1716669696,"description":"I'm the fool and these are my blurbs little things I write when the spice is right.","description_hash":-5327654219099411897},{"title":"Exile: The Child of Light","fiction_id":"87193","link":"https:\/\/www.royalroad.com\/fiction\/87193\/exile-the-child-of-light","tags":["Male Lead","Strong Lead","Action","Adventure","Fantasy","Romance","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":35,"view_count":501,"chapters_count":12,"last_update":1718604462,"description":"Political turmoil brews as Hazel Drina, the prophesied Child of Light, gathers a rebellion against oppressive rule. Logan Floyd, a disillusioned former noble and the most feared warrior of the land of Kaps, seeks peace but is drawn into the brutal war by matters of circumstance. As alliances shift and the revolutionaries make their last stand, Logan must decide whether to flee from his fate or fight for a new order. This gripping tale of rebellion, love, and sacrifice will leave readers on the edge of their seats, eager for the next chapter in the Exile series.","description_hash":7496456577935298834},{"title":"Masks of Deceit","fiction_id":"87192","link":"https:\/\/www.royalroad.com\/fiction\/87192\/masks-of-deceit","tags":["Anti-Hero Lead","Psychological","Female Lead","Contemporary","Romance","Mystery","Male Lead","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":6,"view_count":30,"chapters_count":1,"last_update":1716665661,"description":"\"You're mine, Ayesha,\" he murmured, his voice low with longing, his fingers tightening around her waist. \"No one else can have you.\"\n\"And you're mine, Ashwin,\" she replied, her words a whispered threat against his ear, her nails digging into his flesh. \"But remember, if you betray me, I'll destroy you.\"\nTheir relationship begins in a shroud of deceit, each wearing masks that conceal their true selves. Ashwin Nair, a man haunted by twisted desires and harbouring a dark, murderous past, becomes entranced by a captivating woman whose allure and confidence mask her true intentions. Unbeknownst to him, she was an undercover cop on a mission to bring Ashwin down, but that's not the end, her real identity is still a mystery. In the heart of a bustling city like Mumbai, teeming with secrets and lies, the carefully constructed facades begin to crack. What will happen when one discovers the other's darkest secret? Will their love survive the revelation that both have been desperately trying to hide?","description_hash":3705797198290350252},{"title":"The Elemental Order: A collection of Short Stories. ","fiction_id":"87191","link":"https:\/\/www.royalroad.com\/fiction\/87191\/the-elemental-order-a-collection-of-short-stories","tags":["Multiple Lead Characters","Action","Fantasy","Short Story","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":269,"view_count":240,"chapters_count":6,"last_update":1716665618,"description":"Chaos reigns as war looms. Only the Elemental Order stands against the rising darkness.\nThe Elemental Order has always stood for neutrality. Striving to maintain the balance at all costs, but as soon as one war ends, another begins and the fragile peace unravels.\nTomean, Fillas and Cortain, novice agents of the Order are thrust into the chaos, striving to keep an unraveling peace. Despite dividing backgrounds, these battlemages forge an unbreakable bond. Together they face unrelenting trials - monstrous creatures, sinister foes, and worse yet - that test their mettle and magical gifts to the limit.\nAs an age of wonders nears oblivion, the three battlemages wage a desperate campaign to save the Elemental Order and the realms beyond from annihilation. A fragile world spins toward darkness, awaiting heroes bold enough to right the balance.\nThis is the first collection of stories following the budding Battlemages Tomean, Fillas and Cortain. Follow along as this first collection introduces their humble beginnings and early adventures and contains six stories full of magic and mayhem.","description_hash":-1674241770666490990},{"title":"Sorcerer","fiction_id":"87190","link":"https:\/\/www.royalroad.com\/fiction\/87190\/sorcerer","tags":["Urban Fantasy","Anti-Hero Lead","Contemporary","Secret Identity","Strong Lead","Drama","Fantasy","Mystery","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":2,"view_count":38,"chapters_count":1,"last_update":1716664451,"description":"Jordan is an experienced sorcerer, but thunder is rumbling in the distance...\n\nWaiting for him... is a tribulation he may not be able to cross...\n\nHe has faced ghosts, demons, and beasts...\n\nBut he sensed his death... This may be the end...","description_hash":-5554985021543846993},{"title":"For Those That Never Came To Be","fiction_id":"87189","link":"https:\/\/www.royalroad.com\/fiction\/87189\/for-those-that-never-came-to-be","tags":["Dungeon","Martial Arts","Multiple Lead Characters","Fantasy","Low Fantasy","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":10,"view_count":58,"chapters_count":1,"last_update":1716663926,"description":"Stories of TTRPG characters I made that were \"DOA\". Aka, I applied to games with them only to not have the accepted, becoming stories that never came to be. So I wrote this story to pour all of the ideas I had for those characters in some way.\nEnjoy!\n(Not Beta'd)","description_hash":-3940391326755677017},{"title":"Sovereign of the Sword","fiction_id":"87188","link":"https:\/\/www.royalroad.com\/fiction\/87188\/sovereign-of-the-sword","tags":["Virtual Reality","Portal Fantasy \/ Isekai","Martial Arts","Male Lead","Action","Adventure","Fantasy","Mystery","Supernatural","Mythos"],"lable":"Original","following_count":1,"rating":0.0,"page_count":14,"view_count":165,"chapters_count":4,"last_update":1716770403,"description":"Forced to flee due to false accusations of patricide, young Fang Han unexpectedly awakens an ancient swordsmanship heritage on the brink of life and death. With a mission of vengeance, he trains his mortal body to master the highest swordsmanship, forging an indomitable sword soul and an unbreakable sword heart. Gu Han vows to defeat all formidable foes across the myriad worlds, each sword strike capable of collapsing the Nine Hells and ending the cycles of the Great Dao. He aims to reach the pinnacle of swordsmanship and become the invincible Sword Sovereign.","description_hash":-5879716644256454841},{"title":"The Paradox of Power","fiction_id":"87187","link":"https:\/\/www.royalroad.com\/fiction\/87187\/the-paradox-of-power","tags":["GameLit","Progression","Strategy","Comedy","Strong Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":5.0,"page_count":26,"view_count":565,"chapters_count":11,"last_update":1717344903,"description":"In another life, Ornus Fraxinus and Valentiana Thunbergia were heroes of legend thanks to their magic-elevating spell research. Today, they teach at their local magician's guild, training the next generation of spellcasters, but when a raid-gone-wrong destroys their village and sends them on the run, they are forced to seek refuge for the people of Alnear.","description_hash":1209443115594014992},{"title":"Throes of Chaos","fiction_id":"87186","link":"https:\/\/www.royalroad.com\/fiction\/87186\/throes-of-chaos","tags":["Male Lead","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":91,"chapters_count":2,"last_update":1716704082,"description":"A young man is accepted to one of the first prestigious magic academies of his world. The power of magic is new to mortals in this world, and full of mysteries and danger.","description_hash":-8010864811660939138},{"title":"The Galactic Chronicle","fiction_id":"87185","link":"https:\/\/www.royalroad.com\/fiction\/87185\/the-galactic-chronicle","tags":["War and Military","Sci-fi","Fantasy","Strategy","First Contact"],"lable":"Original","following_count":2,"rating":0.0,"page_count":2,"view_count":65,"chapters_count":1,"last_update":1716662799,"description":"The Galactic Chronicle: The Battle for Orion's Gate\" is an epic space opera that follows the journey of humanity and the Valyrians as they navigate the vast expanse of the galaxy, facing both external threats and internal struggles","description_hash":-8136874747464582479},{"title":"The Hagh Naan Bandit","fiction_id":"87184","link":"https:\/\/www.royalroad.com\/fiction\/87184\/the-hagh-naan-bandit","tags":["Female Lead","Tragedy","Drama","Action","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":18,"view_count":114,"chapters_count":2,"last_update":1716836049,"description":"After facing an overwhelming defeat and a tragedy Talora, Jerricho, Raith, and Berrick must find a way to turn the odds in their favour.","description_hash":7809710511030603152},{"title":"Once Upon a Time in Old An Lar","fiction_id":"87183","link":"https:\/\/www.royalroad.com\/fiction\/87183\/once-upon-a-time-in-old-an-lar","tags":["Multiple Lead Characters","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":303,"view_count":713,"chapters_count":25,"last_update":1718631416,"description":"Somewhere in the multiverse, there is a Fae realm where the realm was split into dark and light areas by the Primordial being who created it after a horrible magical war almost destroyed everything. Peace lies lightly across the land and there are forays into the lands of Light by the forces of darkness, but neither side has the ability to do large scale war across the Boundary the Primordial created.\nRecently, people doing research on magical transportation have begun disappearing. Greed and power struggles threaten to unleash ancient power that could waken and wipe out the foundation of the current civilization. And someone is trying to smuggle a critical device to the Shadowlands that could give them just the key to attack the Light and win, or destroy everything.\nSo why does a former school teacher surrounded by a flock of pixies seem to be connected to so many involved with the chaos about to unfold?","description_hash":-595752966556280843},{"title":"Reincarnated as a Villain in a Doki Doki Love Story","fiction_id":"87182","link":"https:\/\/www.royalroad.com\/fiction\/87182\/reincarnated-as-a-villain-in-a-doki-doki-love","tags":["Portal Fantasy \/ Isekai","Anti-Hero Lead","Ruling Class","Comedy","Male Lead","Drama","Reincarnation","Villainous Lead"],"lable":"Original","following_count":9,"rating":0.0,"page_count":47,"view_count":1088,"chapters_count":8,"last_update":1718320815,"description":"Reincarnated as a Villain in a Doki Doki Preteen Love Story, Maxwell decides to fully embrace his evil role. After all, why not? He is a powerful lord. Destined to die? He’ll just eliminate the problem before it arises. Distressed and tragic female lead? Who cares?\nBLUF:\nThis story explores my attempt to write male characters and misunderstanding situations. The main character, Maxwell, decides to be evil because he just wants to live his life because he's finally the 1%ers he always cursed. In the end however, his modern views kind of makes him not, there are just two sides to every coin","description_hash":-6862685623209874353},{"title":"Naruto - My World Domination System","fiction_id":"87181","link":"https:\/\/www.royalroad.com\/fiction\/87181\/naruto-my-world-domination-system","tags":["LitRPG","Anti-Hero Lead","Martial Arts","Grimdark","Male Lead","Action","Adventure","Fantasy","Mystery","Magic","GameLit","High Fantasy","Attractive Lead"],"lable":"Fan Fiction","following_count":10,"rating":0.0,"page_count":60,"view_count":1872,"chapters_count":17,"last_update":1717762305,"description":"In the heart of Konoha, on the day of the ninja academy graduation, a mysterious person finds himself thrust into the body of none other than Sasuke Uchiha. But unlike most transmigrations, this individual isn't surprised. However, this newcomer has an advantage: the World Domination System, a mysterious system that promises unparalleled power and control.\nThe transmigrated person embraces his new identity, ready to seize the opportunity to dominate the shinobi world. As he navigates into his new ninja life, he quickly realizes the potential at their fingertips. The World Domination System provides quests, each one a stepping stone towards their ultimate goal: to conquer the Shinobi World. But achieving such a feat won't be easy. The shinobi world is much more dangerous than he recalled...","description_hash":3339427963427282990},{"title":"A Dagger Through Dimensions","fiction_id":"87180","link":"https:\/\/www.royalroad.com\/fiction\/87180\/a-dagger-through-dimensions","tags":["Portal Fantasy \/ Isekai","Time Travel","Anti-Hero Lead","Male Lead","Harem","Action","Fantasy","Historical","Mystery","Reincarnation","Mythos"],"lable":"Original","following_count":4,"rating":0.0,"page_count":126,"view_count":1099,"chapters_count":19,"last_update":1718635928,"description":"Everything started the day after a woman and her thugs used me as a punching bag in a dark alley. If you’re thinking that I woke in some medieval-like fantasy world after they got through, you can’t be further from the truth. There are no castles, dungeons, dragons, or magic swords here. The first few minutes I held out hope that this place would have status bars showing HP\/MP, etc. just like a lot of tropes. I mean who wouldn't love some amazing power or magic? Problem is there's no system or cultivation here.\nBut I have a dusty office with an invisible secretary. Oh, and I found out my name by looking at the one stenciled on the office door.\nThe name Dagger should give you a clue.\nYeah, that woman sent me into a place where I’m a private detective. It's what they called a shamus back in 1940. The thing is this place isn't on the map and I can't leave. Well, not without a huge loss of blood. Trust me, I've tried.\nAt the end of the day, I’m just an ordinary guy stuck in the past that doesn’t totally match the history books. I can get beat up or killed by any of the gangsters, backstabbing people, or crooked cops I meet. Hell, I can't even tell if the people are NPCs. After all, they seem to have lives like any person you might meet. Then again, how many times to you see dead movie stars wandering around on the streets?\nIt's another dimension that runs like an old movie, leaving me with no choice but to find a way to escape. While I don’t miss my college classes that much, this place certainly puts a damper on my career hopes. That's because Lane Dagger has a lot of people trying to kill him.","description_hash":-2557011848610738446},{"title":"Born In Ash","fiction_id":"87179","link":"https:\/\/www.royalroad.com\/fiction\/87179\/born-in-ash","tags":["Progression","Anti-Hero Lead","Strategy","Psychological","Male Lead","Drama","Romance","Contemporary"],"lable":"Original","following_count":0,"rating":0.0,"page_count":22,"view_count":122,"chapters_count":4,"last_update":1718132505,"description":"Narrowly escaping death after being betrayed by his gang and those closest to him, Francisco lost everything he once held dear. Plunged into the cold waters of despair, he saw no reason to continue. Yet, after fleeing south, he gradually learns to live, love, and trust again. But can this newfound peace endure?","description_hash":-958596529512789376},{"title":"Royal Hearts, Magic Veins","fiction_id":"87178","link":"https:\/\/www.royalroad.com\/fiction\/87178\/royal-hearts-magic-veins","tags":["Progression","Anti-Hero Lead","Ruling Class","Multiple Lead Characters","Secret Identity","Action","Adventure","Fantasy","Romance","Supernatural","Male Lead","Female Lead","Strong Lead","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":26,"chapters_count":1,"last_update":1716659580,"description":"Tensions are growing in the kingdom of Zaryial, and a civil war is on the horizon.\nAfter the sudden death of his wife, a tyrannical king has dedicated his rule to wiping out all forms of magic, for not only does it threaten his people, but it threatens his power. The Great Purge was a sudden, vicious attack on all ‘monsters’ throughout the nation, wiping out thousands in a single day. From lycanthropes to witches, these people were suddenly stripped of their rights, if they were lucky enough to avoid the slaughter.\nTwelve years since The Great Purge, the crown has begun to face retaliation. Those who had escaped are now fighting for a better future, and yet it is an ongoing uphill battle. As the prophecy of a dying woman foretold, the future of the kingdom would rest on the shoulders of an unlikely group, for the power of this four is capable of rivaling the strength of a nation.\nA prince, an elf, a changeling, and a creature bred for war must forsake the legacies of which they had been left, and lead Zaryial into a future where all can live together in harmony.","description_hash":6012958506591995471},{"title":"Folktales and Fables: A Collection of Short Side Stories","fiction_id":"87177","link":"https:\/\/www.royalroad.com\/fiction\/87177\/folktales-and-fables-a-collection-of-short-side","tags":["Anti-Hero Lead","War and Military","Psychological","Multiple Lead Characters","Slice of Life","Drama","Fantasy","Short Story","Male Lead","Female Lead","Strong Lead","Magic","High Fantasy","Ruling Class"],"lable":"Fan Fiction","following_count":3,"rating":0.0,"page_count":33,"view_count":164,"chapters_count":4,"last_update":1716846364,"description":"A collection of short side stories for The Spirit Tale of Fire Lord Ozai. It is recommended to read at least the first few chapters of the main story to understand the premise, but the setting can more-or-less be summed up as a pre-series Avatar the Last Airbender AU with more spirit meddling if you prefer to go in blind.\nFirst one-shot: An eleven-year-old Princess Azula encounters Agni in the palace halls. Zuko is there, too.\nAlso available on AO3!\n\n~ Based on the first three seasons of the original ATLA cartoon (with the occasional tidbit taken from Korra, the comics, and\/or the books).\n~ Canon may (rarely) be tweaked for worldbuilding purposes.\n~ Explorations of characters and POV that -- for whatever reason -- don't fit within the main story's narrative.\n~ Unsubtle spirit intervention. (Or, if you will: Agni stole the script, La brought the red pen, and Tui has the best seat in the house but the other chairs are being filled quickly.)\n\n~ The main story is rated M for Mature. (While not as graphic as it could be, it is not intended for children.) The side stories tend to bounce between T for Teen and M for Mature, depending on the themes present in each short.\n~ The Sensitive Content warning includes: general war themes, the Fire Nation's royal family, and ATLA spirits. (This list may be incomplete.)\n~ Help me improve my writing skills! Earn +1 Rep for every good faith suggestion! Even declined suggestions can still earn you rep! (Limit of +5 Rep per comment.)\n~ Updates at the pace of my capricious muse.","description_hash":4159351563276067498},{"title":"Beyond The Weathered Veil","fiction_id":"87176","link":"https:\/\/www.royalroad.com\/fiction\/87176\/beyond-the-weathered-veil","tags":["War and Military","Multiple Lead Characters","Fantasy","Male Lead","Female Lead","Strategy","High Fantasy"],"lable":"Original","following_count":6,"rating":5.0,"page_count":210,"view_count":845,"chapters_count":14,"last_update":1718101537,"description":"A world shrouded in time's veil. Secrets slumber beneath the towering mountains and restless tides. Whispers of a forgotten past stir, a symphony long silenced. Legends speak of a crown, a symbol of unity or perhaps division. As lines blur and forgotten conflicts rise, those with emerald, sapphire, and ruby alike may draw swords again.","description_hash":4779011097177691037},{"title":"Colorfull Crystal","fiction_id":"87175","link":"https:\/\/www.royalroad.com\/fiction\/87175\/colorfull-crystal","tags":["Slice of Life","Action","Fantasy","Romance","Short Story","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":42,"chapters_count":1,"last_update":1716638886,"description":"A boy sent on a secret mission on a campus where illegal experiments are suspected","description_hash":-2610469626993944829},{"title":"The Storage Locker","fiction_id":"87174","link":"https:\/\/www.royalroad.com\/fiction\/87174\/the-storage-locker","tags":["Drama","Adventure","Fantasy","Low Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":11,"view_count":157,"chapters_count":2,"last_update":1717857678,"description":"WRITING PROMPT: A distant relative has left the contents of their storage unit to you in their will.  You can't recall ever meeting this relative. What is in the storage unit?  What does it suggest about the now deceased relative?  Why do you think they left it to you?","description_hash":2822539621889592283},{"title":"Elements And Life","fiction_id":"87172","link":"https:\/\/www.royalroad.com\/fiction\/87172\/elements-and-life","tags":["Progression","Multiple Lead Characters","Strong Lead","Action","Adventure","Fantasy","Mystery","Supernatural","Male Lead","Female Lead","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":2,"rating":4.0,"page_count":79,"view_count":336,"chapters_count":8,"last_update":1716663624,"description":"At first, there existed nothing; it was a void of complete emptyness. Then suddenly something formed, or rather someone. And there he was, standing amidst utter darkness, with no light to even reflect in his dead-still eyes. So dark, the man wondered if he'd actually gone blind. *CLAP* A bright flash of light filled everywhere, with just a tiny dark orb in front of that man. The orb's color was that of the blackest of blacks. It wasn't black because of emptiness, rather it was too dense with every single particle of reality itself. That orb made a whistling sound, like it had a consciousness, a soul. \"You want to live?\", The man whose silence could make anyone feel uneasy, finally spoke. And in reply the orb again made a different creaky sound, which otherwise meaningless, somehow sound as if it agreed. \"Then your wish I shall grant\", said the man placing his hand in front of the orb. And another bright flash, but this time with a shattering sound. The hollow, the feeling of emptiness, all was gone, a universe was formed. The dense orb that was black all this time was glowing, dimming with life. It was the very source of everything that was being created. At last, it stopped, as if its work was done, as if it were a kid waiting for their father's order. The man looked at a nearby planet, his gaze was gentle, his voice softened. \"Of all the worlds out there, I choose this one\" The man said and upon this that orb fired a bright white ray and distributed its energy all over that planet. Only a small portion of that orb remained, as a tiny violet marble. \"DIVIDE\" Said the man to the little marble which was left. And upon his words that marble split into four parts, and from each part emerged a person; Three boys and one girl. \"This world my children, is a place for you to live, to grow, a place for you to call home.\" The man continued, \"The other beings that I've given life to might be inferior to you, but always remember they are me precious children, just as you four are\". The four Gods nodded in agreement. The man smiled. \"Agni, Astra, Chakra, Kaal; Protect this world, as it is truly adored by me. This world, my precious creation, my dear EARTH.\"","description_hash":6140756107007364216},{"title":"Amyntor","fiction_id":"87168","link":"https:\/\/www.royalroad.com\/fiction\/87168\/amyntor","tags":["Super Heroes","Martial Arts","Male Lead","Secret Identity","Action","Adventure","Fantasy","School Life","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":42,"chapters_count":1,"last_update":1716611385,"description":"When Dhruv discovers a mysterious black stone, his life takes a dramatic turn as he is transported to a mystical realm. With the stone's guidance, he embarks on a journey of self-discovery, facing mythical creatures and unlocking hidden powers. Dhruv must confront ancient forces to save both worlds from impending doom.","description_hash":-7761390660658992800},{"title":"You're alright, Larusso","fiction_id":"87166","link":"https:\/\/www.royalroad.com\/fiction\/87166\/youre-alright-larusso","tags":["Slice of Life","Romance","Short Story","First Contact","Soft Sci-fi"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":60,"view_count":698,"chapters_count":17,"last_update":1716956162,"description":"Daniel is new to California and is starting his new job at a school called West Valley High. He meets the other teachers and one catches his eye, what's his name? Johnny Lawrence. Turns out that he's the biggest piece of shit that Daniel's ever encountered. But not?\n\n-----------------------\n\nJohnny is enjoying his life as one of the best teachers in West Valley High, when a new guy comes in, Daniel Larusso, who is so annoying and it's so obvious that Ali (the girl he's had a crush on for years) is interested in him. Johnny decides to become friends with him to get close to Ali. That's a great idea, right?\n\n-----------------------\n\nWhat happens when Daniel and Johnny spend time alone with each other, find out secrets and hidden feelings that escalate to something more?","description_hash":1595168222537758519},{"title":"The world below","fiction_id":"87163","link":"https:\/\/www.royalroad.com\/fiction\/87163\/the-world-below","tags":["Male Lead","Action","Adventure","Fantasy","Mystery","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":61,"view_count":273,"chapters_count":7,"last_update":1717875603,"description":"You follow Ulne, that have heard stories about people with magic in a mountain sins he was a kid, and now that he is an adult, he choose to go to the mountain and see if the stories is true.","description_hash":6435862575702654563},{"title":"Starting From Zero ","fiction_id":"87162","link":"https:\/\/www.royalroad.com\/fiction\/87162\/starting-from-zero","tags":["Martial Arts","Action","Adventure","Fantasy","Satire","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":69,"view_count":137,"chapters_count":3,"last_update":1718560590,"description":"Akira Aikawa is an average middle schooler, expect his life is much worse than anyone else. Even trying his best in his everyday life, getting good grades, even becoming the ace athletic of his school. But trying his best isn't enough because it doesn't seem to earn him the recognition he yearned from the society. After all what he has experienced, he was ready to give up on life which he was looking forward to. It all changes after, he lost his way to his world and find himself on an another land. Now, he is starting from zero.","description_hash":-8916774036364511846},{"title":"The Truth Of The Case","fiction_id":"87161","link":"https:\/\/www.royalroad.com\/fiction\/87161\/the-truth-of-the-case","tags":["Contemporary","Adventure","Horror","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":16,"view_count":135,"chapters_count":4,"last_update":1716615953,"description":"Behind many big unsolved cases there is an unknown truth, such as \"baby casserole porridge\", \"dog head man\", \"human whip wine\"... There are many undisclosed secrets behind these cases. There is no such thing as the worst, only the worse, so don't enter if you're afraid.","description_hash":7335922488810030856},{"title":"I CAN GIVE TALENTS","fiction_id":"87160","link":"https:\/\/www.royalroad.com\/fiction\/87160\/i-can-give-talents","tags":["Xianxia","Comedy","Male Lead","Harem","Adventure","Romance"],"lable":"Original","following_count":17,"rating":4.12,"page_count":187,"view_count":5901,"chapters_count":32,"last_update":1718607620,"description":"A cultivator with normal aptitude finally found a treasure that could change his life but to his disappointment, he could not directly benefit from it.","description_hash":-587952153871296666},{"title":"Trifecta: Shadows of Destiny","fiction_id":"87159","link":"https:\/\/www.royalroad.com\/fiction\/87159\/trifecta-shadows-of-destiny","tags":["Villainous Lead","Psychological","Multiple Lead Characters","Secret Identity","Drama","Action","Adventure","Reader Interactive"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":41,"chapters_count":1,"last_update":1716610006,"description":"Trifecta: Shadows of Destiny tells the intertwined stories of three unlikely individuals on their quests for justice, vengeance, and self-identity. Vincent, a heartless killer seeking meaning through violence. Anisa, a brave woman battling corruption to avenge her father’s murder. And Dimas, a gang leader determined to discover the cause of his mother’s suffering and the truth about his father. As they navigate their personal battles, they confront the dark forces that rule Kartasura and realize their fates are more connected than they ever imagined. Through betrayal, confrontation, and eventual unity, they discover new purposes and bring hope to a city plagued by darkness.","description_hash":4425817349594328988},{"title":"Junkyard Bird","fiction_id":"87157","link":"https:\/\/www.royalroad.com\/fiction\/87157\/junkyard-bird","tags":["Sci-fi","Action","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":86,"chapters_count":2,"last_update":1716639052,"description":"In 2030, the world was mostly filled by people with supernatural powers, called Grace. In Nautilopolis, a slum town in Northern Europe, Frederick lived as a slave laborer, working every day for a couple of meals for himself and his sick mother while enduring abuses from the foreman that broke his hand and left several grave wounds. Frederick brought the food to his home so he could eat his last dinner with his mother. His mother healed his wound with her Grace, which was her last energy while Frederick was sleeping, and then conveyed her last word for Frederick to get out of town. Frederick was then determined to find a way to escape Nautilopolis.","description_hash":-8633048529734005712},{"title":"Unlisted dreams","fiction_id":"87153","link":"https:\/\/www.royalroad.com\/fiction\/87153\/unlisted-dreams","tags":["Adventure","Fantasy","Horror","Mystery","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":17,"view_count":170,"chapters_count":4,"last_update":1716626765,"description":"Horror writing of somone dreams that he tells to the local strang island guy to devour it","description_hash":6064819003471272810},{"title":"Avarice cultivation: The path to immortality ","fiction_id":"87152","link":"https:\/\/www.royalroad.com\/fiction\/87152\/avarice-cultivation-the-path-to-immortality","tags":["Time Travel","Anti-Hero Lead","Martial Arts","Multiple Lead Characters","Secret Identity","Action","Adventure","Fantasy","Mystery","Supernatural","Male Lead","Magic","High Fantasy","Mythos"],"lable":"Fan Fiction","following_count":2,"rating":5.0,"page_count":0,"view_count":47,"chapters_count":1,"last_update":1716609928,"description":"In a world full of danger, There's a man travelling in an abandoned village, he's name is Xiao Lufeng, a 20 year's old average looking guy with long black hair as smooth as silk but wearing a ragged cloths filled with holes,","description_hash":-206835643333108907},{"title":"Enticing time","fiction_id":"87151","link":"https:\/\/www.royalroad.com\/fiction\/87151\/enticing-time","tags":["Time Travel","Male Lead","Tragedy","Fantasy","Horror","Romance","Attractive Lead"],"lable":"Original","following_count":1,"rating":3.0,"page_count":6,"view_count":94,"chapters_count":2,"last_update":1717245278,"description":"A boy ends up being smuggled into the main story. With parasites invading his body, time is bound to run out for him. In the midst of his desire to find cure, he ends up stumbling upon a tryant who's desperate to kill him.","description_hash":631843384963097598},{"title":"Ascension","fiction_id":"87150","link":"https:\/\/www.royalroad.com\/fiction\/87150\/ascension","tags":["Post Apocalyptic","Space Opera","Female Lead","Sci-fi","Strong Lead","High Fantasy","First Contact","Hard Sci-fi","Dystopia"],"lable":"Original","following_count":1,"rating":0.0,"page_count":26,"view_count":193,"chapters_count":4,"last_update":1717971560,"description":"Rue's dreams are more than just vivid - they're hauntingly real. She finds herself in a space academy, surrounded by brooding, hot men and a clock that's ticking down. She knows there's more to her dreams than meets the eye, and she's determined to uncover the truth before time runs out. With each passing dream, Rue becomes more certain that her family's disappearance is connected to the academy, and the secrets it's hiding.\n\nBut when she wakes up in darkness, her true journey begins. Everything she thought she knew is turned upside down as she uncovers lies, secrets, and a government conspiracy. Rue transforms from the girl next door to a tough warrior as she navigates the dangerous world around her. Along the way, she makes the best friends she'll ever have, and falls for a mysterious man who seems to hate her guts.\n\nRue's time at the academy unveils unbelievable truths and more twists and turns than she ever imagined. Will she be able to cope with the shocking revelations, or will she crumble under the weight of the dystopian rules and epic space battles? This is a story of adventure, romance, and intrigue, with a heroine who's as complex and compelling as the world she inhabits.\n\nWith an epic story of space, romance, and dystopian rules, Rue's journey is full of twists and turns that will leave you on the edge of your seat. Get ready for a heart-pumping adventure that will take you on a wild ride through the stars.","description_hash":-4591228611573667704},{"title":"Invasive Engineer","fiction_id":"87149","link":"https:\/\/www.royalroad.com\/fiction\/87149\/invasive-engineer","tags":["Reincarnation","War and Military","Strong Lead","Action","Adventure","Fantasy","Magic","High Fantasy","Ruling Class"],"lable":"Original","following_count":2,"rating":0.0,"page_count":6,"view_count":58,"chapters_count":1,"last_update":1716607575,"description":"What do you call it when an animal is brought to a new habitat, and there are no natural predators? An invasive species. \nRaymond is reborn as Aeolis, a child. As an mechanical engineer who took aerospace classes in his free time, he quickly integrates magic into some truly amazing vehicles.","description_hash":2050322843567312925},{"title":"Resurgence of the Creator","fiction_id":"87148","link":"https:\/\/www.royalroad.com\/fiction\/87148\/resurgence-of-the-creator","tags":["Reincarnation","Progression","Strategy","Grimdark","Psychological","Action","Adventure","Fantasy","Male Lead","Strong Lead","Multiple Lead Characters","Magic","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":8,"rating":4.0,"page_count":108,"view_count":903,"chapters_count":16,"last_update":1717693205,"description":"Verin, the omnipotent god of all creation, has existed for countless eons, weaving and unraveling the very fabric of the multiverse. He has birthed and witnessed the rise and fall of trillions of universes, each a masterpiece in its own right. Yet, immortality has bred a profound weariness in him. The thrill of creation has dulled, and the spark of discovery has faded into a monotonous eternity.\nIn his final bid to escape the crushing ennui of omnipotence, Verin devises a radical plan.\nAmong his myriad creations, Verin has preserved twelve extraordinary beings, each a paragon of perfection and beauty, drawn from the finest qualities of their respective universes. These \"Twelve Preserved\" stand as living monuments to his boundless power and creative genius.\nAnd now, they must kill him.","description_hash":730218258165192483},{"title":"A Robotic Overmind for a Dungeon","fiction_id":"87147","link":"https:\/\/www.royalroad.com\/fiction\/87147\/a-robotic-overmind-for-a-dungeon","tags":["Dungeon","Sci-fi","Action","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":21,"rating":4.0,"page_count":53,"view_count":1475,"chapters_count":10,"last_update":1718575233,"description":"A average underpaid factory worker some time in the future is killed in a standard workplace accident. Apparently that is enough for him to be eligible to be Isekai'd off to a strange new world filled with robots and for some reason he, in his non existent form, is now able to command his little band of drones as he figures out what to do now.","description_hash":3460006732710814314},{"title":"Record of Ashes War","fiction_id":"87146","link":"https:\/\/www.royalroad.com\/fiction\/87146\/record-of-ashes-war","tags":["War and Military","Grimdark","Multiple Lead Characters","Tragedy","Action","Fantasy","Romance","Male Lead","Female Lead","Magic","Strategy","High Fantasy"],"lable":"Original","following_count":16,"rating":5.0,"page_count":281,"view_count":2700,"chapters_count":23,"last_update":1718573582,"description":"Sar'tara is a huntress of a forest watched over by her mother, the Forest Deity. Living in an isolated tribe of only women, the only life she's ever known is competition against rival tribes —competition to win her mother's favor, as well as the rights and powers of the deity's chosen defenders.\nUnknown to Sar'tara, a warlord living in the \"outside\" world has long hated her mother. A warlord known only as 'The Lord Sun'. A man who parades himself as the herald of justice and is dead set on burning the forest down…\nDuke Kalin of the Xenarian Kingdom watches over his nation's borders. He has always left alone the mysterious and deadly forest that lies at the edge of his jurisdiction. But when the warlord encroaches on his land he's forced to act, leaving Xenaria's borders unwatched and open to invasion from another opportunistic neighboring nation…\nTwo people, ignorant of each other's existence, will meet to kick start an epic!\n \nThis is a second world military fantasy epic, a little different from the usual litrpg or progression fantasy on this website. Still, I hope people give me a chance.\nWhat to expect:\n-Slow burn plot and characterization heavy.\n-Big battles following lots of build-up chapters.\n-Chapter length will vary between 2k and 4k words. Sometimes a little more or less.\n-Release schedule - Twice a week (Monday & Thursday) following the initial month where releases will be daily. This will be a long series. Hope readers will stick with me!\n-Lots of violence.\n-Artwork sometimes!\nGenres include: [Original] [Fantasy] [Female lead (to begin with)] [Action] [War and Military] [Strategy] [Adventure] [Romance] [Drama]\nNote: This story will slowly transition to being more male lead oriented farther down the line\nCover art by @yaminokuni on twitter\nThis serial will also be available on Novels.gg, Webnovel, and scribblehub","description_hash":7579821449314837651},{"title":"The Fourth","fiction_id":"87145","link":"https:\/\/www.royalroad.com\/fiction\/87145\/the-fourth","tags":["Male Lead","Sci-fi","Secret Identity","Horror","Mystery","Short Story","First Contact","Hard Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":25,"view_count":216,"chapters_count":1,"last_update":1716591672,"description":"After a successful mission to the moon, a NASA shuttle returns to Earth, But there's a problem, the ship launched with three people on board. It came back with four. Those in charge scramble to make sense of what's happening, and to find out who is real, and who is not.","description_hash":6873827968570892885},{"title":"Daemonpunk\/\/Renascence","fiction_id":"87144","link":"https:\/\/www.royalroad.com\/fiction\/87144\/daemonpunkrenascence","tags":["Reincarnation","Time Loop","Urban Fantasy","Progression","Post Apocalyptic","Action","Horror","Psychological","Tragedy","Cyberpunk","Supernatural","Male Lead","Strong Lead","Non-Human Lead","Magic","Anti-Hero Lead","Grimdark","Mythos","Villainous Lead","Time Travel","Genetically Engineered ","Technologically Engineered","Dystopia"],"lable":"Original","following_count":4,"rating":5.0,"page_count":161,"view_count":1365,"chapters_count":25,"last_update":1716735774,"description":"Pandaemonium—the face of the earth is a wasteland of salt and sulfur, mercury and metastasized reality, called the Desolation; nothing grows and the sun is gluttonous. There is no night but instead meridian-noons and mourning-dusks; the former scours flesh from bone and turns bone to ash in the flash-vaporization of its apocalyptic zenith and the latter denatures the proteins of the skin until it is sloughs-off like the shed of a serpent and irradiates blood to its boiling point.\nIn between the shadow of this valley of death, only the Eight Principalities persist, mankind hidden away from the Desolation in these arks of techno-and-daemonological make. Most call them the Eight Cities; edifices of the corpse-world staked by the imperial banner of the Eighth Archon of Exaltation Abraxas. Though overtly ruled by the archons, most day-to-day operations are overseen by the Legions—daemons incorporated and passed down in politico-power struggles; zaibatsus of the New World.\nIn the Sixth City of Neo Babylon, Levi “Killjoy” Basker—just another merc among the masses without a voice—is grafted to a daemon he did not want. Strangely, that makes him both honest and a liar, concurrently. Follow his journey from dog to g-d as he braves the violence and depravity of a world long since dead but still kicking; from the mutagenic and soul-warping powers of daemonolatry to the weeping sorcery of goetia that wracks suicidal guilt upon even the toughest of souls, Levi will need every tool—no matter how despicable—at his disposal to challenge the millenia-long status quo.\nEven then it will kill him nine-hundred-and-twelve times over.\nThe king is dead.\/\/Long live the king.","description_hash":-5059624933669130756},{"title":"The Black","fiction_id":"87143","link":"https:\/\/www.royalroad.com\/fiction\/87143\/the-black","tags":["Space Opera","War and Military","Multiple Lead Characters","Sci-fi","Action","Romance","First Contact","Attractive Lead"],"lable":"Original","following_count":43,"rating":4.44,"page_count":441,"view_count":8652,"chapters_count":35,"last_update":1718339102,"description":"Lt James Mackenzie is a pioneer test pilot, setting off on an endeavor to test Humanities first faster than light engine. LIttle does he know that He is about to change the face of Humanity forever.","description_hash":-305526436345643130},{"title":"THE WORLD Is As Complex As It Can Be","fiction_id":"87142","link":"https:\/\/www.royalroad.com\/fiction\/87142\/the-world-is-as-complex-as-it-can-be","tags":["Anti-Hero Lead","Strategy","Grimdark","Multiple Lead Characters","Strong Lead","Action","Adventure","Romance","Male Lead","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":81,"view_count":639,"chapters_count":14,"last_update":1718470803,"description":"In a world not as complex as Jared thought it would be turns out to be really complex. Read and imagine his journey on how he can understand and pacify the world where hypocrites make their own laws and try to make their lessers bow to them while they ignore their own laws.","description_hash":-2354147824670894258},{"title":"Rise of the Blood Mage","fiction_id":"87141","link":"https:\/\/www.royalroad.com\/fiction\/87141\/rise-of-the-blood-mage","tags":["LitRPG","Progression","Male Lead","Action","Adventure","Fantasy","Mystery","Magic","GameLit","High Fantasy","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":4,"view_count":96,"chapters_count":1,"last_update":1716579302,"description":"In a world where magic is real and deeply embedded in society, Nathan, a young man from modern Earth suffering from cancer, finds himself mysteriously transported into the body of Killian Bloodgrave, the youngest member of the powerful and ruthless Bloodgrave family. \n\nHowever, learning magic was no simple task, especially with the Bloodgrave family's unique Blood Manipulation techniques.\n But Nathan had steeled his resolve. \"I've already wasted one life confined to a sickbed. I refuse to let this chance slip away the same way.\" \nJust then, he heard a ding. [ Congratulations! You have inherited the Blood Mage System ]","description_hash":220936392797840798},{"title":"Stella and the Sorcerer","fiction_id":"87140","link":"https:\/\/www.royalroad.com\/fiction\/87140\/stella-and-the-sorcerer","tags":["Grimdark","Fantasy","Horror","Satire","Supernatural","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":24,"view_count":118,"chapters_count":2,"last_update":1717772421,"description":"Stella infiltrates a death cult in order to assassinate their leader: an evil sorcerer who killed her father in one of his weekly displays of pyrotechnic rage. But can she succeed before her insane surroundings rub off on her?\n\n*I added the Horror tag because it deals heavily with death and evil. The bad guys get up to some extremely evil stuff, intended to disturb and disgust (not dirty, but very dark). However, it doesn't get into super-specific descriptions which I heretofore considered the hallmark of the Horror genre (that would have been too nauseating for me to write).\n\n12 chapters total; editing in progress. The schedule is public, and it will speed up once the editing is done.","description_hash":8285676602933467707},{"title":"The First Christmas","fiction_id":"87139","link":"https:\/\/www.royalroad.com\/fiction\/87139\/the-first-christmas","tags":["Multiple Lead Characters","Romance"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":88,"view_count":207,"chapters_count":6,"last_update":1718586571,"description":"It is the first Christmas season after the frozen summer. The Arendelle family invites guests to spend the holidays with them.","description_hash":9001921271463529658},{"title":"Tome of Vorrakath","fiction_id":"87138","link":"https:\/\/www.royalroad.com\/fiction\/87138\/tome-of-vorrakath","tags":["Progression","Multiple Lead Characters","Action","Adventure","Fantasy","Mystery","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":5.0,"page_count":24,"view_count":324,"chapters_count":5,"last_update":1716950034,"description":"Wesley “Negus” Thorne, a young noble from the bustling city of Baelon, finds his life forever altered when he stumbles upon an ancient tome of mysterious origins. He must discover the secrets of the tome’s power to aid the investigation into his family’s murder, and survive the political intrigues surrounding him.","description_hash":2897232469704886299},{"title":"What Can Be Born of Snow ","fiction_id":"87137","link":"https:\/\/www.royalroad.com\/fiction\/87137\/what-can-be-born-of-snow","tags":["Male Lead","Slice of Life","Secret Identity","Romance","Short Story","Low Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":15,"view_count":33,"chapters_count":1,"last_update":1716579216,"description":"A short story of a simple turnip farmer from a distant kingdom who lives a humbled life in the far off countryside. He happens upon a new face in his daily routines, causing an unexpected mental conflict he was not prepared for.\nReaders can expect a low fantasy slice of life story involving many allusions towards mental health struggles and how others cope with disruptions in their routine lives.","description_hash":7086711418837166110},{"title":"REDO: With A [Difficulty Slider] (LitRPG, Regressor, System Apocalypse)","fiction_id":"87136","link":"https:\/\/www.royalroad.com\/fiction\/87136\/redo-with-a-difficulty-slider-litrpg-regressor","tags":["LitRPG","Reincarnation","Time Travel","Progression","Post Apocalyptic","Action","Adventure","Drama","Fantasy","Supernatural","Male Lead","Strong Lead","Magic","Anti-Hero Lead","GameLit","High Fantasy"],"lable":"Original","following_count":22,"rating":5.0,"page_count":54,"view_count":1225,"chapters_count":7,"last_update":1716770568,"description":"After eight years of increasingly hellish challenges, humanity fails to survive System Integration. The last of Earth's heroes—Mason among them—succumb to the impossible apocalypse. But instead of death bringing peace, Mason opens his eyes eight years in the past, once again freshly summoned to the Tutorial Village.\nArmed with knowledge of the future, the determination and skillset to climb to far greater heights, and a strange new ability—a [Difficulty Slider]—can Mason rewrite the tragedies that befell him, his loved ones, and Earth?\nOr was this apocalypse never meant to be survived?\n***\nWhat To Expect:- Regressor, competent MC with a focus on progression.- Characters and story over repetitive or pointless action scenes- Interesting customizable skill-building system - A [Difficulty Slider] mechanic unique to the MC- Nontypical weapon (chains)- No murderhoboing, no harem, no 1-dimensional characters- Town-Building elements, eventually","description_hash":-3411905035768510783},{"title":"Over My Cold Read Body","fiction_id":"87135","link":"https:\/\/www.royalroad.com\/fiction\/87135\/over-my-cold-read-body","tags":["Female Lead","Horror","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":31,"view_count":133,"chapters_count":4,"last_update":1718371225,"description":"Professional fake medium Cam, who spends her days educating people on how to see through fraud, tries to convince a home invader that she has real psychic powers in a desperate bid to stay alive.","description_hash":-3049142620889383842},{"title":"Gluttonous Ring","fiction_id":"87134","link":"https:\/\/www.royalroad.com\/fiction\/87134\/gluttonous-ring","tags":["Action","Adventure","Fantasy","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":3,"rating":0.0,"page_count":25,"view_count":646,"chapters_count":16,"last_update":1717854447,"description":"In a realm where mortals borrow powers from gods, and worships them; they receive rings that are conduits to godly powers.\n\n\n\nOur protagonist, Bell, follows a different route. In a tragic event, he receives a ring, not from a god, but from Belzeebub!\n\n\n\nWith his mysterious powers of devouring and releasing the powers of others, he aims to become the Grand Warden - protector of the realm, and seek retribution for the death of his orphanage family.\n\n\n\nFollow Bell, an orphan mage, as he ventures through the world of magic, meet new friends, rivals, and fight against the evil, by using the power of one?!","description_hash":-5766239654581245996},{"title":"God's Crest","fiction_id":"87133","link":"https:\/\/www.royalroad.com\/fiction\/87133\/gods-crest","tags":["Reincarnation","Anti-Hero Lead","Ruling Class","Male Lead","Strong Lead","Action","Adventure","Drama","Fantasy","School Life","Magic","High Fantasy"],"lable":"Original","following_count":4,"rating":3.5,"page_count":112,"view_count":1245,"chapters_count":14,"last_update":1718514049,"description":"Ato Aywrath - a name feared all the way from the heavens to hell. A man so obsessed with becoming the absolute strongest in terms of both sorcery and sword that saying he's power incarnate wouldn't be much of a stretch. There's only one thing holding him back from becoming a true deity - his crest. He was born to the Mage crest, instead of the preferable Sword-Spell crest.\nRealising the limits that his crest provides him, he decides to forfeit his life in hopes of reaching new heights of power, by casting a reincarnation spell. He awakes 500 years later, reborn as Kane Limitia - a boy with the Sword-Spell crest.\nHowever, he discovers something - the people of this era seem to believe that the Sword-Spell crest is the weakest of the three crests for whatever reason. Realising that there must be more to this than he originally believed, Kane embarks on a journey to achieve 3 goals; restore the position of the Sword-Spell crest, punish whoever spread the idea of it's weakness, and become the absolute unrivaled strongest.\n\nWhat to expect:\n- Updates at least every Friday, Saturday and Sunday\n- Slow-burn romance and revenge (not with the same characters)\n- Non-pervy MC\n- MC vs the entire kingdom type of story\n- MC isn't completely flawless","description_hash":-722404336640545545},{"title":"The Guildmaster","fiction_id":"87132","link":"https:\/\/www.royalroad.com\/fiction\/87132\/the-guildmaster","tags":["Portal Fantasy \/ Isekai","Dungeon","Strategy","Comedy","Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":2.0,"page_count":45,"view_count":399,"chapters_count":7,"last_update":1718251278,"description":"Issac Rupeltz is half American and half-Filipino man that lives his life as a designer of dungeon and dragons map and locations, due to a traffic accident he died that day, and later on, he finds himself that he was on the middle of nowhere, the grassland with bountiful soils and trees, when the dragon suddenly flies mid-air, he later now knows that he was on the magical world.","description_hash":8004137431997151271},{"title":"Anluz- A fantasy story ","fiction_id":"87131","link":"https:\/\/www.royalroad.com\/fiction\/87131\/anluz--a-fantasy-story","tags":["Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":22,"view_count":180,"chapters_count":6,"last_update":1716841612,"description":"Anluz is your typical fantasy world with magic, companionship, and a doomsday cult worshiping an owl god. Join the wood elf Finvir Duskmire as he travels the world, saves some people, creates his own guild, and tries to find an ancient artifact before a cult.\nCrossposted on Wattpad and Ao3\nAnluz is a project me and my friends work on together. It's a fantasy story with elements heavily inspired by dishonored, the Elder Scrolls series, and bits and pieces of Greedfall. I tried to blend fantasy with realism. All Rights go to Bethesda for making the Elder Scrolls and Dishonored series and made by spiders for making Greedfall. The only things I own are Anluz and its lore.","description_hash":5178863269231917042},{"title":"Knights of Hallows","fiction_id":"87130","link":"https:\/\/www.royalroad.com\/fiction\/87130\/knights-of-hallows","tags":["Urban Fantasy","Anti-Hero Lead","Martial Arts","Multiple Lead Characters","Slice of Life","Action","Adventure","Fantasy","Tragedy","Supernatural","Male Lead","Strong Lead","Magic","Low Fantasy"],"lable":"Original","following_count":2,"rating":4.75,"page_count":37,"view_count":454,"chapters_count":7,"last_update":1718168462,"description":"Sai Shido lived a typical life as an average office worker in a world where supernatural beings remained hidden from humans. However, everything changed when he found himself in a horrid situation that altered his life forever. This transformative change was both a blessing and a curse, thrusting him into a new world of the supernatural and responsibilities. Now, he must embark on a new journey as an exorcist, navigating the challenges of his newfound abilities.","description_hash":-4355407444553132793},{"title":"10. TEMPORAL [TALES FROM THE CROSSROADS vol. 1]","fiction_id":"87129","link":"https:\/\/www.royalroad.com\/fiction\/87129\/10-temporal-tales-from-the-crossroads-vol-1","tags":["Time Loop","Male Lead","Historical","Horror","Mystery","Short Story","Supernatural","Magic","Low Fantasy","Mythos","Time Travel"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":33,"chapters_count":1,"last_update":1716578211,"description":"Tales from the Crossroads is a series of 17 micro-fiction horror stories set in the Primordial Crossroads Universe.\nTEMPORAL shows a man who follows what he believes to be his destiny only to stumble upon horrors beyond time and space.","description_hash":7775312183134886564},{"title":"Lion Of The Night ","fiction_id":"87128","link":"https:\/\/www.royalroad.com\/fiction\/87128\/lion-of-the-night","tags":["Male Lead","Tragedy","Fantasy","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":26,"view_count":57,"chapters_count":3,"last_update":1717779601,"description":"Akin, a young boy haunted by lion nightmares and other anomalies, finds his world upended when his teacher and football teammate's deaths are related to his nightmares. Determined to uncover the truth, Akin must navigate a town steeped in secrets. As he seeks answers, a menacing force from his past threatens his life and the lives of his loved ones. Can Akin unravel the mystery before it consumes them all? This gripping tale explores courage, loyalty, and the indomitable human spirit in the face of darkness. Prepare to be captivated by a journey of self-discovery, peril, and the enduring power of hope.","description_hash":8358428844094099133},{"title":"Summoned to be a Lord ","fiction_id":"87127","link":"https:\/\/www.royalroad.com\/fiction\/87127\/summoned-to-be-a-lord","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","War and Military","Action","Adventure","Fantasy","Martial Arts","Slice of Life","Male Lead","Magic","Strategy","GameLit","High Fantasy","Ruling Class","Dystopia"],"lable":"Original","following_count":18,"rating":4.5,"page_count":75,"view_count":2038,"chapters_count":14,"last_update":1718099593,"description":"Meet Josh, who barely managed to graduate from high school and failed to get into any reputable college. Now he's a Lord in the magical kingdom of Pertis? As if that wasn't enough he got the lowest mana rating out of all one hundred summoned 'scholars'. With a few thousand serfs and citizens under his rule, he has to figure it out. And better he does it quickly.\n\n\n\nUpdate schedule for the first month a chapter per day + bonus chapters \nafter that M-F 5ch\/week\n7PM GMT+1\nAs I always loved kingdom-building stories together with progression fantasy stories, this is my try to blend the two together into one.\nThis is my first attempt at writing something more than 100 words for a school assignment. Feedback is very much appreciated.","description_hash":6934115951498370862},{"title":"BEYOND ~ The Way You Think","fiction_id":"87126","link":"https:\/\/www.royalroad.com\/fiction\/87126\/beyond-the-way-you-think","tags":["Virtual Reality","Portal Fantasy \/ Isekai","Urban Fantasy","Progression","Villainous Lead","Action","Psychological","Romance","Sci-fi","LitRPG","School Life","Supernatural","Female Lead","Strong Lead","Secret Identity","Magic","Strategy","High Fantasy","Space Opera","Ruling Class","First Contact","Hard Sci-fi","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":27,"chapters_count":1,"last_update":1716566387,"description":"About the Author:-Hello everyone,I am Pooja Vinod Mane. I am 20 years old. Its my first time writing a story which for sure I hope will explore you to a mystic yet realistic journey of a girl that will form a new bond with you all.I have basically tried to make a story based on fiction and morals out of my imagination and my understandings upon the human life. You may come across many things I am interested in, in the story. It will be in a series of chapters being released. I look forward for a good response from my readers and I will make sure that you all will enjoy reading it.\nAbout the Story:-Hi guys,Aurora here. My name itself traces me, as Aurora describes gorgeous chronicles of lights in the sky, similarly I have an adventurous chronicles of breakthroughs in my life. The closest but the far apart ones, my mom and dad calls me Aura. To tell about me I am pretty 18 years old and mostly had a solitary life. I am a person who is being pampered by her parents Money and attitude are two things I never compromise on and may be so I look heinous to all. But in fact, there is a totally opposite side of me which I never like to disclose to anyone.My rich parents had sent the only daughter of theirs to abroad for education. After my 12th, probably this year I will return to my home country for my long awaited vacation.","description_hash":9019528690575593253},{"title":"Their Side Of Things","fiction_id":"87125","link":"https:\/\/www.royalroad.com\/fiction\/87125\/their-side-of-things","tags":["Portal Fantasy \/ Isekai","War and Military","Sci-fi","Action","Adventure","Fantasy","Magic","Low Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":17,"view_count":35,"chapters_count":1,"last_update":1716561568,"description":"The pride of an Elf in Iera has always been the catalyst of conflict on the continent. As their Empire dominates the mountains and forests, the Human-dominated islands of Witaenal remain untamed. Centuries of warfare have engulfed these murky isles, yet no great kingdom has managed to subjugate them entirely. \nA new campaign by the Ieran Empire aims to break this cycle. Yet the local kingdoms, clans and tribes have been gifted an ally. One providing weapons unmatched by their blades and sorcery, slaughtering up to many in an instant. However empowering they are, the balance of power on the isles, perhaps even beyond the continent of Iera, will be forever changed.","description_hash":4356142993278193926},{"title":"Dimensional Summoner","fiction_id":"87124","link":"https:\/\/www.royalroad.com\/fiction\/87124\/dimensional-summoner","tags":["Post Apocalyptic","Action","Adventure","Fantasy","Mystery","High Fantasy","Artificial Intelligence"],"lable":"Original","following_count":3,"rating":4.5,"page_count":9,"view_count":212,"chapters_count":5,"last_update":1717004331,"description":"In a world where strength reigns supreme, one young protagonist stands out not for their power, but for their intellect. Meet our protagonist, a seemingly ordinary individual with an extraordinary mind, navigating a world where magic and might collide. In a twist of fate, they discover the ability to summon creatures from alternate dimensions, unleashing a wave of possibilities previously unseen. With this newfound power, our protagonist embarks on a journey filled with danger, intrigue, and discovery. Alongside their summoned allies, they must navigate political intrigue, face formidable foes, and uncover the secrets of their own past. Will intelligence and strategy be enough to overcome the challenges ahead, or will the shadows of the alternate dimensions prove too dark to conquer? Join our protagonist on an epic adventure where brains outshine brawn, and where the true power lies not in muscles, but in the mastery of the mind.","description_hash":176379556665117071},{"title":"HEART OF A DEMON","fiction_id":"87123","link":"https:\/\/www.royalroad.com\/fiction\/87123\/heart-of-a-demon","tags":["Urban Fantasy","Anti-Hero Lead","Female Lead","Strong Lead","Adventure","Fantasy","Romance","Mystery","Supernatural","Male Lead","High Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":27,"chapters_count":1,"last_update":1716559841,"description":"\"In a world where darkness and light collide, their destinies intertwined in a deadly dance of fate,darkness lurked within the hearts of beings. Alexia Meyer struggles to battle her inner demons and a past threatening to devour her very soul. When all seems lost, she seeks solace in Demos Gravestone, only to uncover he's at the core of her past agonies.\n\"I would have ended you long ago if I knew the truth,\" Alexia's voice dripped with venom as betrayal lingered in the air. Demos, calm and collected, presented a gleaming dagger, inviting a chilling confrontation. With resolve glinting in her eyes, Alexia lunged towards him, aiming for his heart. To her shock, Demos stood unscathed, his eerie words echoing, \"I HAVE NO HEART\"\nJoin Alexia as she embarks on a treacherous quest for retribution,power and a silver of love amidst the shadows. Can Demos shackled by his own descent into darkness as a demon guide Alexia to wards the redemption she craves? or will his malevolent presence ensnare her further into the abyss of darkness?.\nWith each page turned,immerse yourself in a tale woven with secrets, enmity turned into passion, friends turned into enemies and the eternal struggle between light and shadows. Dare to delve into the heart of a demon, where destinies interwined and the price of true salvation awaits.","description_hash":-9094887490806449031},{"title":"Absolute Execution","fiction_id":"87122","link":"https:\/\/www.royalroad.com\/fiction\/87122\/absolute-execution","tags":["Progression","Martial Arts","Male Lead","Tragedy","Drama","Action","Adventure"],"lable":"Original","following_count":1,"rating":4.21,"page_count":57,"view_count":916,"chapters_count":10,"last_update":1718255124,"description":"To be violated and then murdered is an end that no one should endure. Tragically, Damon’s sister suffered this horrific fate. Now, Damon is determined to exact a vengeance so severe that the cultist devils responsible will face an even grimmer fate.\nCover Art: Zhade IllustrationsEvery other piece of art: lyren_art\nThanks so much to these two for contributing to this story!","description_hash":8340545185764023523},{"title":"Antinomy","fiction_id":"87119","link":"https:\/\/www.royalroad.com\/fiction\/87119\/antinomy","tags":["Time Loop","Female Lead","Sci-fi","Secret Identity","Action","Adventure","Mystery","Time Travel","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":10,"rating":4.81,"page_count":110,"view_count":2248,"chapters_count":25,"last_update":1718626565,"description":"Jahdra has one thing on her mind: getting her ship home safely. But everything changes when she receives a mysterious signal from an uncharted corner of the galaxy. With a few suspicious passengers in tow and no crew of her own, Jahdra must make some difficult decisions that could put her—and her ship—at risk.\nAntimony is a fast-paced sci-fi adventure that will keep you guessing every step of the way. The direct first-person narrative immerses you in a near-future spacescape full of action, suspense, and the occasional romance. Hop in the captain's chair and fasten your seatbelt—it's going to be a bumpy ride.","description_hash":-2133290030104680451},{"title":"Reborn as the Most Powerful Tetris Piece?!","fiction_id":"87118","link":"https:\/\/www.royalroad.com\/fiction\/87118\/reborn-as-the-most-powerful-tetris-piece","tags":["GameLit","Comedy","Strong Lead","Short Story"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":1,"view_count":80,"chapters_count":1,"last_update":1716558378,"description":"A short, humorous story about a man reborn as a Tetris piece. Just meant for a quick chuckle. Slightly dark sense of humor, I suppose.","description_hash":-5288507723314071443},{"title":"*What if we combine both *cultivation and hunters","fiction_id":"87117","link":"https:\/\/www.royalroad.com\/fiction\/87117\/what-if-we-combine-both-cultivation-and-hunters","tags":["Dungeon","Martial Arts","Drama","Action","Fantasy","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":1,"view_count":76,"chapters_count":2,"last_update":1716607887,"description":"Our mc named jin who was 15 year old and was like other kid who likes to watch anime and read novels and manhwa but his life drastically changed read the story to know what happened","description_hash":-3815586229433847574},{"title":"Terrarestrians Book Two: Chasing Legends","fiction_id":"87116","link":"https:\/\/www.royalroad.com\/fiction\/87116\/terrarestrians-book-two-chasing-legends","tags":["Multiple Lead Characters","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":131,"view_count":745,"chapters_count":20,"last_update":1718314291,"description":"This is the second book of the Terrarestrians series! If you have not read the first one, check out \"Terrarestrians Book One: The Prophecy\"! \nThe group of adventurers who have been caught in the prophecy are determined to save the world--by finding the Lost Tribes, or the Legends (tribes of Terrarestria who have disappeared, but are rumored to still exist). \nBut, despite how easy it sounds, there are many obstacles in the way of the human and dragon group, from mythical ghosts to thugs and pirates. How can they convince the Legends to be on their side? What if the tribes turned against them? Where are they all hiding? \nJoin the protagonists of this book as they try to unravel the mysteries of their adventure into the deep history of Terrarestria.","description_hash":7322026233454764767},{"title":"Is it fun achieving the Tao if you don't bring your chicken and dogs along to ascend!?","fiction_id":"87115","link":"https:\/\/www.royalroad.com\/fiction\/87115\/is-it-fun-achieving-the-tao-if-you-dont-bring","tags":["Xianxia","Male Lead","Strong Lead","Fantasy","Short Story","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":36,"chapters_count":1,"last_update":1716558179,"description":"A child is born perfect, the whole world rejoices.","description_hash":7860220979349037101},{"title":"The Healer's Heir","fiction_id":"87114","link":"https:\/\/www.royalroad.com\/fiction\/87114\/the-healers-heir","tags":["Progression","Ruling Class","Male Lead","Drama","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":30,"view_count":221,"chapters_count":3,"last_update":1718144920,"description":"Idris, Court Necromancer of House Naga, made a deal with the Fairy Queen in his hour of need: destroy the Spirit Glass or lose his soul. After destroying the dagger during the Second Battle of Braemar, finding the rest seems nearly impossible. The only clue he has is a mysterious figure called The Remaker and the knowledge that other necromancers were once involved.\nFrustrated and isolated, Idris travels with his attendant, Lila, and his half-fae student, Willard, into the darkest parts of the kingdom searching for answers. But after discovering the secret behind his family's absence, finding the Spirit Glass becomes less important than finding The Remaker's tower. Abandoning his friends, Idris must make the hardest decision he has ever made. What is more important - duty or family?\nIn this sequel to The Queen's Necromancer, follow Idris and his friends on a dangerous journey into the truth and the mystery of the Dead-Walker armour.","description_hash":7967450249231070984},{"title":" Symphony of Souls ( A Short Story )","fiction_id":"87113","link":"https:\/\/www.royalroad.com\/fiction\/87113\/symphony-of-souls-a-short-story","tags":["Virtual Reality","Portal Fantasy \/ Isekai","Progression","Female Lead","Strong Lead","Adventure","Fantasy","Mystery","Short Story","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":100,"chapters_count":4,"last_update":1718380803,"description":"In a world where music manifests as magic, a young amnesiac bard named Anya awakens trapped within a virtual reality game called Symphony of Souls. With only her musical talent and the cryptic guidance of a mysterious mentor, Anya must fight to survive in this perilous world.\nSymphony of Souls is a sprawling VR game where melodies sculpt the landscape and fearsome creatures are vanquished with powerful harmonies. Anya's quest for survival and self-discovery takes her through treacherous dungeons, vibrant cities ruled by musical prodigies, and encounters with other players with their own motivations.\nThe mystery of Anya's past and the true purpose of Symphony of Souls unfolds amidst the challenges of the game. Anya struggles to remember her past life while grappling with the fear of being trapped forever. The power of music, both for creation and destruction, explores themes of self-discovery, identity, and the human spirit.\nAnya's journey is not just about survival. As she grows stronger, composing and performing original music that shapes the game world itself, she becomes a beacon of hope. The lines between virtual reality and Anya's past life begin to blur, raising questions about the true nature of reality. Will Anya escape the game and reclaim her memories? Or will she find a new purpose within the symphony of her soul?","description_hash":-4021051145270907394},{"title":"A Pen","fiction_id":"87112","link":"https:\/\/www.royalroad.com\/fiction\/87112\/a-pen","tags":["Female Lead","Tragedy","Romance","Mystery","Short Story","Supernatural"],"lable":"Original","following_count":0,"rating":3.0,"page_count":15,"view_count":227,"chapters_count":4,"last_update":1716569278,"description":"Ghosts and murder mysteries were not exactly Linda's plan for her summer vacation. But well.. fate has its own way right?","description_hash":3755931206449288767},{"title":"When They're Gone","fiction_id":"87111","link":"https:\/\/www.royalroad.com\/fiction\/87111\/when-theyre-gone","tags":["Post Apocalyptic","Grimdark","Psychological","Male Lead","Slice of Life","Action","Horror","Tragedy","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":24,"chapters_count":1,"last_update":1716558073,"description":"In a world ravaged by a virus that turns adults into aggressive, cannibalistic creatures, only children under 19 are immune due to a vaccine. To protect the young, facilities like Kidcare have been established to house them until the virus runs its course, where the staff consists entirely of sentient robots. Henry Foster, a five-year-old boy, is one such child. Having been left behind by his ill dad, he must face this new world plagued with new threats like teenagers and homework without his family by his side. His time there only gets worse when a power surge disrupts the robots, as well as throwing every other aspect of life into disarray. Will Henry survive and reunite with his parents, or will Kidcare consume him?","description_hash":3456647596851209145},{"title":"Blended Enemies A Lycan’s Marriage to a Vampire","fiction_id":"87110","link":"https:\/\/www.royalroad.com\/fiction\/87110\/blended-enemies-a-lycans-marriage-to-a-vampire","tags":["Female Lead","Fantasy","Romance","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":75,"view_count":328,"chapters_count":9,"last_update":1717198916,"description":"Loretta is princess of Agarta, country of minx lycans, who hasn’t yet found her purpose. When her life takes a massive leap into a world of vampires, since she’s required to marry one, she is led down an uncertain path as the hated outsider. The prince plays a part in the mischief that molds their relationship into a whirlwind of emotions, to a point they may never find common ground, unless, perhaps if they admit their feelings. Then again, that only causes them to argue. If it were up to Lor, she’d never marry her monstrous enemy, a vampire prince. Vampires are minx’s sworn enemies, but peace becomes a must between the two parties, as something far sinister threatens both kingdoms.","description_hash":3109279557960506223},{"title":"Euphemistically Yours","fiction_id":"87109","link":"https:\/\/www.royalroad.com\/fiction\/87109\/euphemistically-yours","tags":["Male Lead","Slice of Life","Drama","Fantasy","Historical","Magic","Low Fantasy"],"lable":"Original","following_count":5,"rating":0.0,"page_count":55,"view_count":460,"chapters_count":8,"last_update":1718636420,"description":"While travelling on an errand, a free squire becomes the protector of a lost child from a foreign country. He knows his liege lord will be interested since the girl demonstrates the rare gift of magical talent. Despite his apprehension plus vast culture and language barriers, he manages to start the journey back home. That's when his troubles begin.Chapters will drop twice a week (Mondays and Fridays)\nWhat to expect:Slow burn? NO burn!Focus on character interactionsSlice of life with restricted violenceLow Fantasy - only humans, weak magicIntent to portray a believable historical setting(yes, this will clash with modern expectations)Happiness, Hilarity, Hijinks, and HumorDoom, Despair, Distress, and Danger?What not to expect:Numbers or numbers going upWeak-to-strong tropesOverpowered fantasiesJuvenile wish fulfillmentModern-style romancesMonsters or strawman villainsNotes:Yes, the contemporary concept of foul language is an anachronism.However, it's such a staple of fantasy literature, I decided to go with it. In fact, to some extent, that's one of the major conceits of my setting.Setting Language Notes:The native language of the characters in the setting is not English.Instead, the primary language is tonal with soft consonants and vowels.However, since the text is in English, jokes and puns will be in English.Cross-language puns are still assumed to work using cognate ideas.(if you think that's absurd, go watch a foreign-language comedy movie)","description_hash":7580556236348334761},{"title":"The Cataclysm Code","fiction_id":"87108","link":"https:\/\/www.royalroad.com\/fiction\/87108\/the-cataclysm-code","tags":["Post Apocalyptic","Super Heroes","War and Military","Female Lead","Sci-fi","Action","Tragedy","Short Story","Slice of Life","School Life","Supernatural","Male Lead","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":1,"view_count":138,"chapters_count":2,"last_update":1716553365,"description":"The world is not a place for humans to live anymore. Humans are powerless in the new world. Some creatures are the rulers of the Shattered Earth. Jack and his friends must unleash their hidden supernatural abilities to protect and survive. \nThe protectors are a few, but the enemies are a plethora. Jack is the chosen one and turns the extraordinary from the ordinary. Earth's future is now in the hands of these friends, who must put their lives into securing the lives of other people and their loved ones who have sacrificed themselves to the Devil.","description_hash":6687048673368822745},{"title":"Feel Better","fiction_id":"87107","link":"https:\/\/www.royalroad.com\/fiction\/87107\/feel-better","tags":["Psychological","Female Lead","Contemporary","Drama","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":48,"chapters_count":1,"last_update":1716549441,"description":"A short story about Cassie, an anthropomorphic calico cat who is unsure of everything in life, including their relationship. [Commissioned Work]","description_hash":5987574815592347577},{"title":"Infernal Progression System","fiction_id":"87106","link":"https:\/\/www.royalroad.com\/fiction\/87106\/infernal-progression-system","tags":["Portal Fantasy \/ Isekai","Time Travel","Dungeon","Anti-Hero Lead","Space Opera","Action","Adventure","Fantasy","Romance","Supernatural","Male Lead","Strong Lead","Magic","Strategy","Grimdark","Low Fantasy","High Fantasy","Dystopia","Progression","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":4,"view_count":20,"chapters_count":1,"last_update":1716548433,"description":"Are Gods really the good ones? Do they really provide justice?\nThese questions ranged in Rafael's mind as he was wandering through the scorching lands of hell. Tired of getting tortured by the heinous methods of Hell. He had given up. The very being he used to worship had betrayed him. As his soul was about to crumble, he had accepted his fate, until.\n[Accept\/Decline]","description_hash":1502934632689806988},{"title":"Eldritch Requiem","fiction_id":"87105","link":"https:\/\/www.royalroad.com\/fiction\/87105\/eldritch-requiem","tags":["LitRPG","Portal Fantasy \/ Isekai","Anti-Hero Lead","Action","Adventure","Fantasy","Reincarnation","Magic","High Fantasy"],"lable":"Original","following_count":35,"rating":4.44,"page_count":142,"view_count":5112,"chapters_count":26,"last_update":1718622005,"description":"Getting summoned to another world is quite the experience, especially when a cosmic entities tentacle destroys your body and forces you to repair your soul with the scraps that drift between realities.\nReborn with a body that wasn't meant for him, in a world that has heroes of its own, Luce will start a life that the patchwork of his twisted soul will be proud of.\n\n(Quick content warning, the MC's spells are primarily necrotic in nature, though walking corpses will take a while to show up.)\n\n[Credit to @lueluvsart for the cover]","description_hash":2774389681564691857},{"title":"Game Of Mortals [Xianxia\/GameLit]","fiction_id":"87104","link":"https:\/\/www.royalroad.com\/fiction\/87104\/game-of-mortals-xianxiagamelit","tags":["GameLit","Progression","Xianxia","Male Lead","Action","Adventure","Fantasy"],"lable":"Original","following_count":16,"rating":5.0,"page_count":90,"view_count":2969,"chapters_count":13,"last_update":1717215591,"description":"Everyone on Earth has been swept away to the World of Cultivation!\nBut whatever caused this has not left them hopeless, it has given them a [Panel]! A game-like system to help them along their journey, leaving them with the words:\n[Discover new techniques, upgrade your talents, become stronger, live forever!]\nDropped into this world, Karlo Berrio decides that his path will be different than others.\n\"On Earth, there was no chance to become someone great, but here, anything is possible!\"\n\nMini\/Permanent Hiatus","description_hash":-6217425290211486145},{"title":"The Seven Stars of Caesuria - A Multiversal Fantasy Adventure","fiction_id":"87103","link":"https:\/\/www.royalroad.com\/fiction\/87103\/the-seven-stars-of-caesuria-a-multiversal-fantasy","tags":["Progression","Grimdark","Multiple Lead Characters","Sci-fi","Adventure","Fantasy","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Seven strangers stand under unknown skies. The lives they led before the fading sounds of a distant song. How will they deal with a new world, new challenges, and rapid changes that none of them saw coming. Read to find out","description_hash":6610324429459144631},{"title":"Ghostly guns","fiction_id":"87101","link":"https:\/\/www.royalroad.com\/fiction\/87101\/ghostly-guns","tags":["Male Lead","Action","Adventure","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":77,"chapters_count":2,"last_update":1716757105,"description":"Monsters invaded the human world though dungeons killing thousands the only thing able to kill them are ghost possessed guns. They imbue the bullets with special traits that belong to the ghost. There is a team dedicated to taking down the monsters their name the ghostly firing squad.Our main character is dale smith a regular cashier he is rather average he's 5 foot 7 inches with red hair he is fairly muscular he walks home and watches ghostly firing squad videos on his laptop he owns an old revolver from 1907 that he carries with him. He gets attacked by monsters on the way to work and gets slashed in his stomach he fires his gun not expecting it to do anything but it kills the monster dead on the spot. The other monsters surround him but then the ghostly firing squad shows up and takes out the rest of the monster. Dale gets rushed to the hospital and is fired from his job when he gets out of the hospital he can't get another job because he doesn't have a good enough education so he decides to join the ghostly firing squad.","description_hash":7265633797244025806},{"title":"Billionaire's Secret Babe","fiction_id":"87389","link":"https:\/\/www.royalroad.com\/fiction\/87389\/billionaires-secret-babe","tags":["GameLit","Contemporary","Tragedy","Horror","Short Story","School Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":79,"chapters_count":2,"last_update":1717080914,"description":"Irresistibly, the enticing man had a one-night stand with the lady, who never revealed her true identity. It was such an enticing night with her. He endlessly sought her; however, the lady had left the BAR till Xavier had crossed with her again in the company. \nXavier had congenial heart with gays, however he hated and discriminated Ella's behavior. Ella was hurt by his words and facial expression. Unexpectedly, there was a night of knowing Ella's true identity; transgender, Ella's kids were part of his history.  He liked the baby twins of Ella and wanting to be continue what they have been started. \nWill Xavier explore his feelings with the transgender?","description_hash":-4574494057899705911},{"title":"Seventh Tales in Wonderland ","fiction_id":"87388","link":"https:\/\/www.royalroad.com\/fiction\/87388\/seventh-tales-in-wonderland","tags":["Urban Fantasy","Adventure","Fantasy","Historical","Mystery","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":88,"view_count":313,"chapters_count":8,"last_update":1717069103,"description":"Due to the failure of love and not achieving his dreams. It took a thousand days of seeking his dream, despite the thorns on the way. However, his plan was unfruitful. \nKim Ravida, a super handsome man, felt disappointed due to the expectations of his family, since he already became a licensed civil engineer. Wherever he applied for a job, he got rejected by his employer. He compared himself to the other people, who had lower IQ than him. Had a more successful life than him. \nLife seemed unfair to him. That would  make him change his world. That night, a Jet plane covered with wings landed on the top of the mountain. He rode the Jet plane without knowing the destination. What the people usually thought, the Jet Plane would turn his body into ash till become a dead. What Kim thought, a wonderful dream may happen to him.","description_hash":-7460135266319631248},{"title":"The Most Unlikely Dragon Slayer","fiction_id":"87387","link":"https:\/\/www.royalroad.com\/fiction\/87387\/the-most-unlikely-dragon-slayer","tags":["Comedy","Multiple Lead Characters","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":5.0,"page_count":12,"view_count":129,"chapters_count":2,"last_update":1717162057,"description":"Westmoria is isolated from the world, a place with no war. Wyldewood is basically nowhere, but a friendly and welcoming nowhere. Aethon Faehr is nobody; a logger that wiles his nights away at the local inn.\nFinding himself suddenly in possession of a powerful magic that he never wanted in the first place he, his durg adopted brother, a rebellious ahn princess, and a washed up old halfkin wizard must find their way to the top of treacherous Mount Thorn while being pursued by a fearsome fire drake and a ruthless panther-like grimalkin warrior.","description_hash":-415723844864326737},{"title":"Demon Hunt","fiction_id":"87384","link":"https:\/\/www.royalroad.com\/fiction\/87384\/demon-hunt","tags":["Male Lead","Secret Identity","Horror","Mystery","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":18,"view_count":177,"chapters_count":5,"last_update":1718478005,"description":"After a series of incredibly unfortunate events, including losing his job, his girlfriend cheating on him, and then to top it all off, being sacrificed in a botched satanic ritual, Kyle finds himself being hunted down by a plethora of people and organizations. Will he ever find a sense of peace or comfort within his circumstances? Or is he doomed to run from everything until he’s eventually caught?","description_hash":-594119640793636422},{"title":"The Unintentional Church Grim of Blytham","fiction_id":"87383","link":"https:\/\/www.royalroad.com\/fiction\/87383\/the-unintentional-church-grim-of-blytham","tags":["Multiple Lead Characters","Adventure","Short Story","Supernatural","Non-Human Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":21,"view_count":41,"chapters_count":1,"last_update":1716955669,"description":"According to legend the first dead in a graveyard becomes a Church Grim. When a rat dies in a newly created graveyard can she handle her new responsibilities of guarding and guiding the spirits within? [Commissioned Work]","description_hash":-3406162994598143554},{"title":"The Mirrored Worlds Part 1 -The Roles We Play","fiction_id":"87382","link":"https:\/\/www.royalroad.com\/fiction\/87382\/the-mirrored-worlds-part-1--the-roles-we-play","tags":["LitRPG","Progression","Post Apocalyptic","Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","Magic","High Fantasy","First Contact"],"lable":"Original","following_count":0,"rating":0.0,"page_count":25,"view_count":91,"chapters_count":2,"last_update":1717028301,"description":"Seven worlds, each one a warped reflection, filled with monsters and magic. As an ever expanding Multiverse overtakes earth, these Mirrored Worlds are joined together into a massive patchwork. Michael is thrust into the chaos of a world changed irreversibly and has to survive, beating the demons both within and without. Does he have what it takes to keep his friends safe or will they fall victim to the new world order?","description_hash":4248165776020603562},{"title":"The Obscured World","fiction_id":"87381","link":"https:\/\/www.royalroad.com\/fiction\/87381\/the-obscured-world","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Action","Adventure","Fantasy","GameLit","High Fantasy","Progression"],"lable":"Original","following_count":0,"rating":0.0,"page_count":36,"view_count":353,"chapters_count":6,"last_update":1717615158,"description":"In the dim and forgotten corners of human memory, where whispers are heard of a realm far beyond our understanding, a place where the very fabric of existence is woven with threads of magic and chaos. It is said that long before our world took shape, a great void gave birth to the essence of time itself, marking the beginning of an age of wonders and terrors. From this void emerged a chaotic force, a primordial swirl that danced and clashed, giving rise to life in its myriad forms. Among these early beings was Gaea, a titan of creation, whose touch sparked the birth of light and darkness, knowledge and mystery.\nAs eons passed, Gaea's hand shaped not only the elements of fire, earth, water, and air, but also the vibrant and tumultuous beings that would inhabit this fledgling world. Yet, chaos reigned supreme, birthing monstrous entities that roamed unchecked, their very existence a testament to the wild, untamed energies from which they sprang. In this era of discord, death emerged as a necessary balance, a force to temper the unchecked proliferation of life.\nLegends tell of Gaea's twin, Gaia, who in a moment of cosmic divergence, chose to sleep, allowing the forces of creation to mold Earth into a cradle for burgeoning life. While Gaia dreamt, Gaea grew restless, her gaze turning towards the lifeforms of Earth. With a mixture of envy and curiosity, Gaea began to steal these creatures, transporting them to her own realm, a land she named Terra. There, she embarked on a grand experiment, modifying these lifeforms into beings of myth and legend.\nIn the twilight between dreams and reality, pathways were forged between Earth and Terra, allowing beings to traverse the thin veil that separated the worlds. Dragons soared across the skies of Terra, while the first humans, beastmen, orcs, and other fantastical races began to populate this new world. Among them, human gods emerged, beings of immense power who commanded the respect and fear of all who dwelt there. It was a time of great heroes and unspeakable evils, where the boundaries between mortal and the divine were fluid and ever-changing.\nBut as with all great epochs, a cataclysm loomed on the horizon. Gaea's grand experiment reached a critical point, and the once vibrant Terra began to fracture. Wars erupted, madness spread, and the very essence of power itself became a double-edged sword. In a desperate bid to preserve the world she had shaped, Gaea enacted a sealing spell, entombing races, locking away gods, and splitting the very land itself. Terra Zular, as it came to be known, entered a long, dark slumber, hidden from the eyes of both men and gods.\nYet, nothing stays buried forever. Whispers speak of seals breaking, ancient gods stirring, and the forgotten world awakening once more. Those who claim to know of such things suggest that the line between myth and reality is thinner than we might believe. Perhaps the teller of these tales is not just a mere storyteller but a keeper of secrets, a bridge between our world and the obscured realm of Terra Zular. And as the shadows lengthen and the old powers stir, we are reminded that the boundaries of our world are not as fixed as they seem, and the legends of old may yet come to life.","description_hash":1071073647980531510},{"title":"Blossom","fiction_id":"87380","link":"https:\/\/www.royalroad.com\/fiction\/87380\/blossom","tags":["Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":32,"view_count":180,"chapters_count":4,"last_update":1718371863,"description":"The era of the Undulaar has ended, leaving the Five Kingdoms united under the Unela banner. In the Ilfrin Archipelago, Felor, a young outcast, dreams of escaping the Isle, and leaving behind his life as a Kalthorin. The Tournament of the Isles—his ticket out—is just around the corner, but only one thing stands in his way to an oppression-free life in the Unelan schools: an Eshara. Despite a decree of equality, Felor finds himself denied the right to bear the wooden sword promised to everyone in the Five Kingdoms. On a childish whim, he creates a sword out of the common wood of a Kiiritan tree. Seeing this, Felor’s Highblood friend, Cyraena, offers him a chance at what he desires the most. Navigating newfound laws, traditions, and his own complicated friendship with Cyraena, Felor must decide if challenging society for his dreams are worth the cost he must pay.","description_hash":-7839908013816332857},{"title":"The Life Seeker","fiction_id":"87379","link":"https:\/\/www.royalroad.com\/fiction\/87379\/the-life-seeker","tags":["GameLit","Portal Fantasy \/ Isekai","Progression","Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":8,"rating":5.0,"page_count":78,"view_count":732,"chapters_count":9,"last_update":1717376897,"description":"Imagine waking up with only one choice: survival. \nLuc, an ordinary man trapped in a monotonous routine, suddenly finds himself in an unfamiliar forest, in a world filled with magic, monsters, and mysteries. Alone and without any knowledge of this new world, Luc must learn to survive in a strange place where he knows no one and understands nothing. \nUnbeknownst to him, his presence in this world is no accident. Luc is entwined in a mysterious destiny, one that draws him into events far beyond his control. Will he find his way back home, or uncover a new purpose in this unfamiliar world?      \n\nWhat to expect:- In-depth world building - Realistic main and side character- Weak to strong MC (slow but constant growth)- Slow-burn pacing- Occasional slice of life     \n\nSchedule: 1 chapter a day until chapter 14, after that three chapters released weekly on Tuesday, Thursday, and Sunday","description_hash":3528516533572047654},{"title":"Trashy novel: The marriage contract ","fiction_id":"87378","link":"https:\/\/www.royalroad.com\/fiction\/87378\/trashy-novel-the-marriage-contract","tags":["Martial Arts","Comedy","Tragedy","Action","Adventure"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":26,"chapters_count":1,"last_update":1716937437,"description":"I don't know how to write synopsis so...\nHow are you doing..??","description_hash":1059162841245775349},{"title":"Duke of the sea ","fiction_id":"87376","link":"https:\/\/www.royalroad.com\/fiction\/87376\/duke-of-the-sea","tags":["Comedy","Female Lead","Harem","Strong Lead","Action","Adventure","Romance","Male Lead","Magic","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":24,"view_count":437,"chapters_count":10,"last_update":1716986959,"description":"\"Duke of the Sea\" is a gripping tale set in a world of kingdoms, empires, and magic, where the most feared man on the seas is also its most powerful protector. The story opens with a tumultuous storm, revealing a massive ship resembling a mansion battling the raging waters. On board is the enigmatic Duke of the Sea, a man feared by many and rumored to be merciless.\nDespite his fearsome reputation, the Duke is actually a kind-hearted individual who rules the seas with justice and compassion. He commands the respect of ten nations and is even feared by the emperor of the most powerful empire. Little do they know, the Duke harbors a secret—he is a demigod realm swordmaster, one of the most powerful beings in existence.\nThe Duke's main residence is on a large island in the treacherous seas, where he and his people control the monsters that roam the waters, preventing invasions and protecting the realm. His followers, once enemies, are now like family, loyal and devoted to him.\nAs the story unfolds, the Duke's true nature is gradually revealed, showcasing his struggles, triumphs, and the sacrifices he makes to protect his people and maintain peace in the realm. With its rich world-building, complex characters, and epic adventures, \"Duke of the Sea\" is a thrilling fantasy novel that will captivate readers from beginning to end","description_hash":-7629981245745299358},{"title":"Take Love To Court ","fiction_id":"87375","link":"https:\/\/www.royalroad.com\/fiction\/87375\/take-love-to-court","tags":["Multiple Lead Characters","Adventure","Fantasy","Romance","Short Story","Supernatural","Magic","Low Fantasy","Mythos","Technologically Engineered"],"lable":"Original","following_count":1,"rating":0.0,"page_count":3,"view_count":16,"chapters_count":1,"last_update":1716937145,"description":"This is a story of what lengths mortals would go to for justice and it is proof that there are some laws even gods can't break.","description_hash":-1921570582384598465},{"title":"The Isekai of Alexandra Bloodthorn Willows Daughter","fiction_id":"87374","link":"https:\/\/www.royalroad.com\/fiction\/87374\/the-isekai-of-alexandra-bloodthorn-willows-daughter","tags":["GameLit","Portal Fantasy \/ Isekai","Progression","Xianxia","Non-Human Lead","Action","Adventure","Fantasy","Gender Bender","Slice of Life","Female Lead","Magic","Wuxia","Attractive Lead"],"lable":"Original","following_count":14,"rating":5.0,"page_count":95,"view_count":2152,"chapters_count":15,"last_update":1718041395,"description":"A Isekai story of a guy that get´s stuck in a Fantasy world in the body of a female.\nIt was his own fault.\nVery low powered individual and no fast rise to power. Just come in and explore the world with him\/her.\nNo blue boxes.\nP.S.: the coverart is Ai generated.","description_hash":-3546776805385152795},{"title":"The Blue Swordsman ","fiction_id":"87373","link":"https:\/\/www.royalroad.com\/fiction\/87373\/the-blue-swordsman","tags":["Male Lead","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":2,"rating":3.0,"page_count":14,"view_count":412,"chapters_count":12,"last_update":1717264432,"description":"A man called Azraq just start a journey for his past redemption. He will gonna meet some new friend, partner, and people that will make him know what's the meaning of his life. And there also some foe that become his obstacle in his journey. \nI hope you guys enjoy my first fiction. Please give your rating and opinion about this story.","description_hash":4786786062727503386},{"title":"Sheperd Of Souls","fiction_id":"87372","link":"https:\/\/www.royalroad.com\/fiction\/87372\/sheperd-of-souls","tags":["Reincarnation","Time Travel","Ruling Class","Male Lead","Secret Identity","Action","Adventure","Fantasy","Mystery","Supernatural","Strong Lead","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":44,"chapters_count":1,"last_update":1716937069,"description":"Is death truly the end? How did reality come to be, and what secrets are there hidden throughout reality. Follow Alec on his journey towards godhood and unlocking the secrets behind that shard that seems to be fused with his soul.","description_hash":-3938089816046294424},{"title":"Conte of Moonutus","fiction_id":"87371","link":"https:\/\/www.royalroad.com\/fiction\/87371\/conte-of-moonutus","tags":["Male Lead","Tragedy","Action","Adventure","Fantasy","Magic","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":18,"view_count":146,"chapters_count":3,"last_update":1717433864,"description":"This is my first time trying to write a story.\nMy plan is to write a dark fantasy narrative that revolves around the adventures of Lowell Fox in a world plagued by death, betrayal, and corruption.","description_hash":-6207595095532068758},{"title":"Granny Reincarnates as the Villain","fiction_id":"87370","link":"https:\/\/www.royalroad.com\/fiction\/87370\/granny-reincarnates-as-the-villain","tags":["Portal Fantasy \/ Isekai","Villainous Lead","Ruling Class","Comedy","Secret Identity","Drama","Fantasy","Reincarnation","Gender Bender","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":5.0,"page_count":10,"view_count":163,"chapters_count":2,"last_update":1717968996,"description":"Granny Dot lived a simple and peaceful life before dying of old age, surrounded by family and loved ones. She never expected to wake up as the villain in her grandson's romance novel! Not wanting to ruin the story her grandson worked so hard on, this kind-hearted granny tries her best to make it through her second life as a hated villain.","description_hash":2864560362639606744},{"title":"Hiking in a fantasy world","fiction_id":"87369","link":"https:\/\/www.royalroad.com\/fiction\/87369\/hiking-in-a-fantasy-world","tags":["LitRPG","Portal Fantasy \/ Isekai","Comedy","Female Lead","Slice of Life","Action","Adventure","Strong Lead","Magic","High Fantasy"],"lable":"Original","following_count":19,"rating":4.5,"page_count":86,"view_count":1471,"chapters_count":9,"last_update":1717364760,"description":"Arya died in her old world and was born again in a new world filled with magic. Everyone has a game-like system window to track the progress of their abilities. Apparently, the gods transported her soul here and gave her cheat abilities for 'fun'. Not everyone is lucky enough to be born with the ability to use magic. Kids with mana skills are often kidnapped, so she needs to be careful, at least while she is young and still learning about the new world. As an adrenaline junkie in her last life, Arya doesn't mind the action, as long as they don't mess with her family and friends. She tries to live her life to the fullest. Where would be better to hike than a fantasy world?!","description_hash":-8966449583352523904},{"title":"Curse of the Crimson Moon","fiction_id":"87368","link":"https:\/\/www.royalroad.com\/fiction\/87368\/curse-of-the-crimson-moon","tags":["Anti-Hero Lead","War and Military","Xianxia","Psychological","Multiple Lead Characters","Action","Adventure","Fantasy","Martial Arts","Male Lead","Strong Lead","Magic","High Fantasy","Mythos","Ruling Class","Attractive Lead"],"lable":"Original","following_count":49,"rating":4.83,"page_count":276,"view_count":3906,"chapters_count":34,"last_update":1718486161,"description":"Just your run-of-the-mill story where the MC sets out to destroy the world.\nMagic, Politics and a little bit of Genetic Engineering.\nWar, Conflict and a Looming Threat of Planetary Destruction\nCultural Diversity, Racial Tensions and just enough Romance to Sate your Thirst.\nBetrayal, Conspiracies and just enough Blood to fill an Ocean.\nGods, Devils and Mankind Stuck in the Middle.\nAll in All, just a guy seeking something from a world that has denied him everything.\nFollow Felix as he seeks to gain back everything he lost.\n************************************\nWhat to expect:\n- 2k-2.5k words chapters every 2 days\n- Multiple points of view all focused on the same overarching plot centred around Felix.\n- Action, intrigue and a little bit of romance.\n- A high fantasy setting with mysterious creatures and a little bit of magic.\n- A diverse cast of characters with their own goals and ideology and a melting pot of cultures.\nPS: Consider supporting me on Patreon in order to gain access to over 10 early chapters. Every little bit you can afford makes a big difference and allows me to continue writing this series.\nAlso, Check out my new series, Rise of a Planeswalker.","description_hash":-865741158363461990},{"title":"The Deep Sea","fiction_id":"87367","link":"https:\/\/www.royalroad.com\/fiction\/87367\/the-deep-sea","tags":["Urban Fantasy","Male Lead","Fantasy","Horror","Supernatural","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":65,"view_count":654,"chapters_count":21,"last_update":1718607620,"description":"Giants, ancient creatures and dieties of the biggest ocean to ever exist. An exploration into the ocean realm known as The Deep Sea leads to unexpected dangers and secrets yet to be revealed. Come see what dangers the explorers will face and how they will solve it all! Will insanity win in the end or shall the explorer facing it overcome it!\n\n*Some of the characters belong to someone else but they have given me full permission to use their characters in my stories*","description_hash":-8149383244730894197},{"title":"Lightning Lord of Catgirls [LitRPG][Progressively worse dad jokes]","fiction_id":"87100","link":"https:\/\/www.royalroad.com\/fiction\/87100\/lightning-lord-of-catgirls-litrpgprogressively","tags":["LitRPG","Reincarnation","Progression","Ruling Class","Male Lead","Action","Adventure","Fantasy","Romance","Magic"],"lable":"Original","following_count":257,"rating":4.44,"page_count":126,"view_count":12777,"chapters_count":14,"last_update":1718559849,"description":"If dad jokes and cat puns are your thing, this book is outta catrol.\nAll William Wilson wanted in life, was to become a doctor and make his grandma proud. Instead, he wakes up in the debauched body of Baron Green, a spineless noble who's earmarked for assassination by the powers that be.\nNow, the doctor-in-waiting has to escape his body’s well-earned execution. With the help of a single loyal knight and a captive catgirl. Of course, he’s got pissed off nobles on his heels, and just as many hungry monsters.\nWhat to expect\nMild LitRPG elements\nCat-astrophic puns\nSome romance\nBook 1 is finished, and uploads will be 5 times a week til book 1 is fully published. If you wish to read ahead, check out the patreon.","description_hash":724244701123827139},{"title":"Circuits & Sorcery: A World In Ruin","fiction_id":"87099","link":"https:\/\/www.royalroad.com\/fiction\/87099\/circuits-sorcery-a-world-in-ruin","tags":["LitRPG","Dungeon","Post Apocalyptic","Steampunk","Male Lead","Action","Adventure","Fantasy","Sci-fi","Cyberpunk","GameLit","High Fantasy","Dystopia"],"lable":"Original","following_count":6,"rating":0.0,"page_count":41,"view_count":445,"chapters_count":4,"last_update":1718312449,"description":"In a world reshaped by the Gate Crisis, where monstrous creatures roam and the remnants of a human civilization lie scattered, a young Inhuman named Asher Alymmeris finds himself thrust into a perilous world of danger and discovery. Abandoned by a human society that fears and distrusts his kind, Asher lives a sheltered life in Dust Creek, a ramshackle frontier town clinging to the edges of a ruined metropolis. Hidden but nurtured by his parents, Elara and Thomas, two slightly notable Skill Engineers on the frontier.\nBut Asher's world is about to be shattered when forces, fueled by prejudice and a thirst for power, target his parents. Driven by a fierce protectiveness and a burgeoning rage, Asher embarks on a perilous quest to save them, confronting his own fears and unleashing the full potential of his latent abilities. His journey leads him beyond the familiar confines of Dust Creek and into the heart of the hollows, where he encounters a grizzled adventurer named Gareth Brim and his band of Crimson Raiders, a group of seasoned brothers who live on the fringes of society.\nAsher's path unfolds amidst danger and opportunity, as he encounters a world teeming with monsters, Awakened individuals wielding extraordinary powers, and the remnants of a technology that holds the key to a brighter future. He discovers the true depths of his powers, forging new alliances and facing down enemies who threaten everything he holds dear. In a world where the lines between good and evil blur, Asher must forge his path.","description_hash":-6914067622152828409},{"title":"11. HADEAN [TALES FROM THE CROSSROADS vol. 1]","fiction_id":"87098","link":"https:\/\/www.royalroad.com\/fiction\/87098\/11-hadean-tales-from-the-crossroads-vol-1","tags":["Male Lead","Fantasy","Historical","Horror","Short Story","Supernatural","Magic","Low Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":34,"chapters_count":1,"last_update":1716507975,"description":"Tales from the Crossroads is a series of 17 micro-fiction horror stories set in the Primordial Crossroads Universe.\nHADEAN observes a man's punishment by the gods of the underworld.","description_hash":2030172549368680163},{"title":"Theories of the Dark Soul","fiction_id":"87097","link":"https:\/\/www.royalroad.com\/fiction\/87097\/theories-of-the-dark-soul","tags":["Portal Fantasy \/ Isekai","Urban Fantasy","Grimdark","Female Lead","Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":27,"view_count":104,"chapters_count":2,"last_update":1716670475,"description":"Lumi One can’t catch a freaking break. Their mom is showing signs of relapsing back into her drinking, the rent is due and on top of that, Lumi is trying to deal with the survivor’s guilt from their brother’s death. In one last crappy attempt to make everything okay, Lumi buys a demon bonding spell kit from a small business on…Betsy. \nThe good news: It works. It gets them into The Darkness, the land of black magic, where personal demons can get you a wish. The bad news: It works too well. Lumi finds themselves stuck in an unbreakable bond and tossed into a world of trouble that they never saw coming.\nFollow her adventure into a world painted one color with an invisble demon to The King, Astan, for a chance at something more.","description_hash":-5539167942029342190},{"title":"Brockton Bays Marvelous Mage","fiction_id":"87096","link":"https:\/\/www.royalroad.com\/fiction\/87096\/brockton-bays-marvelous-mage","tags":["Portal Fantasy \/ Isekai","Super Heroes","Male Lead","Secret Identity","Action","Adventure","Fantasy","Supernatural","Magic"],"lable":"Fan Fiction","following_count":72,"rating":4.75,"page_count":75,"view_count":2838,"chapters_count":8,"last_update":1718292832,"description":"Taken from his home and stranded in a dark world of heroes and villains that he does not recognize, William Kalus must learn adapt and grow with his magic, before the world around him spirals into chaos and death. Will William be able to master magic and grow powerful enough to fight the monstrous fate the world of Worm holds, or will he fold and fail to live up to his potential?","description_hash":-7703815855921206024},{"title":"𝒯𝑜 𝒩𝑒𝓌 𝐵𝑒𝑔𝒾𝓃𝓃𝒾𝓃𝑔𝓈 (Book One)","fiction_id":"87095","link":"https:\/\/www.royalroad.com\/fiction\/87095\/book-one","tags":["Female Lead","Slice of Life","Drama","Adventure","Fantasy","School Life","Supernatural","Magic"],"lable":"Fan Fiction","following_count":6,"rating":5.0,"page_count":303,"view_count":2395,"chapters_count":28,"last_update":1717797387,"description":"𝐻𝒶𝓇𝓇𝓎 𝒫𝑜𝓉𝓉𝑒𝓇 𝐹𝒶𝓃𝒻𝒾𝒸𝓉𝒾𝑜𝓃: 𝒪𝒞 𝑀𝒶𝒾𝓃 𝒞𝒽𝒶𝓇𝒶𝒸𝓉𝑒𝓇𝙱𝚘𝚘𝚔 𝙾𝚗𝚎 𝚘𝚏 𝚃𝚑𝚎 𝚂𝚑𝚊𝚌𝚔𝚕𝚎𝚍 𝚂𝚎𝚛𝚒𝚎𝚜𝙴𝚟𝚎𝚗𝚝𝚞𝚊𝚕 𝚃𝚑𝚎𝚘𝚍𝚘𝚛𝚎 𝙽𝚘𝚝𝚝𝚡𝙾𝙲~~~No story truly begins with the first chapter. Just as no life begins at the first crossing of paths. No. Rather each first chapter is a new start. Each crossing is a new beginning. A new beginning to something hopefully great.\n~Tom met lots of people in his lifetime. And with his job... all the different types he saw come and go... he thought himself rather good at spotting when someone special was staying in his Inn. And Tom retired to bed that night, certain that he had just met someone extraordinary.\nBut that was none of his business..~","description_hash":4703578977325787322},{"title":"my soul has travelled long and far (to find yours) ","fiction_id":"87094","link":"https:\/\/www.royalroad.com\/fiction\/87094\/my-soul-has-travelled-long-and-far-to-find-yours","tags":["Multiple Lead Characters","Drama","Action","Horror","Romance","Male Lead","Female Lead"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":2,"view_count":29,"chapters_count":1,"last_update":1716505795,"description":"It's been six years since Raccoon City. Under the president's orders, Mei Tatsumi and Leon Kennedy have been tasked with rescuing Ashley Graham, the president's daughter.","description_hash":4249752034920129701},{"title":"The Matriarch's Daughter","fiction_id":"87093","link":"https:\/\/www.royalroad.com\/fiction\/87093\/the-matriarchs-daughter","tags":["War and Military","Non-Human Lead","Strong Lead","Action","Adventure","Fantasy","Female Lead","Magic","High Fantasy","Mythos","Ruling Class"],"lable":"Original","following_count":7,"rating":0.0,"page_count":132,"view_count":773,"chapters_count":15,"last_update":1718570428,"description":"For satyr Thepa Warbol, the world of Sainta has been at war for as long as she can remember. Savage beasts ravage the lands, and the five allied nations are fractured in their ability to unite and deal with the ever-growing horde. As resources and lives dwindle, mandatory conscription drafts every fresh body, and Thepa, being the daughter of the Matriarch, is no exception.  \nIn Thepa's mind, her future is sealed- but fate has other plans for her. Her mother, Lockti Warbol, sends her not to train in one of the three Beachwick guilds, but to the Halfling city of Wildehaven. It is there she meets a mischievous elven cleric named Rory. Through twists of destiny, Rory introduces her to a new life and friendship, not bound by blood, but by an unbreakable bond-the one who will become Thepa's sister.  Battling self-doubt, Thepa must confront her destiny, as a looming threat and a forgotten past entwine, forcing a choice between newfound freedom- and a fateful birthright.","description_hash":-6553663951263192725},{"title":"Shadow World II: King's Ascension","fiction_id":"87092","link":"https:\/\/www.royalroad.com\/fiction\/87092\/shadow-world-ii-kings-ascension","tags":["Reincarnation","Multiple Lead Characters","Action","Adventure","Fantasy","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":5.0,"page_count":11,"view_count":33,"chapters_count":1,"last_update":1716505399,"description":"Embark on a riveting journey with the “King’s Ascension”, the second book in the series. Join Rafael Windcaller as he faces new challenges and adversaries, navigating a world filled with magic, intrigue and the delicate balance between light and darkness. Brace yourself for an immersive adventure where destinies unfold, secrets unravel and sacrifices shape the path ahead. Get ready for a compelling continuation that transcends realms and promises an unforgettable experience.","description_hash":972587821457633782},{"title":"The Southern Qi Cowboy (A Xianxia & litrpg & training story)","fiction_id":"87091","link":"https:\/\/www.royalroad.com\/fiction\/87091\/the-southern-qi-cowboy-a-xianxia-litrpg-training","tags":["LitRPG","Reincarnation","Xianxia","Male Lead","Action","Adventure","Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":10,"view_count":159,"chapters_count":2,"last_update":1716847236,"description":"Jake, a Southern cowboy with dreams of adventure, suddenly finds himself in a mystical world where martial arts and ancient magic reign supreme. Clad in unfamiliar robes and surrounded by people speaking of Qi and fate, Jake must navigate this strange new land while staying true to his roots. With a mix of Southern charm and determination, Jake sets out to prove that even a cowboy from the South can master the mysterious arts of the Bow Clan and stand up to the arrogant inner disciples.\n**What to Expect in the Story:**- **Cultural Clash and Adaptation:** Follow Jake as he learns to adapt to a world vastly different from his own, where he must reconcile his Southern upbringing with the customs and practices of the Bow Clan.- **Humor and Charm:** Experience Jake’s Southern wit and charm as he interacts with the locals, tries to find sweet tea, and navigates the complexities of life in the outer sect.- **Rivalries and Conflict:** Witness the tension between Jake and the inner disciples, particularly with an arrogant young man who looks down on the outer sect members. Expect heated confrontations and challenges that push Jake to his limits.- **Growth and Training:** Join Jake on his journey of mastering Qi techniques and martial arts with his own spin on things. Watch as he trains hard to improve his skills and prove his worth, aiming to join the inner sect.\nWith a blend of humor, action, and heart, \"The Southern Qi Cowboy\" promises an exciting and unique adventure that bridges the gap between Western cowboy grit and Eastern mystical traditions.\nWeak to strong\nNew chapters each Monday","description_hash":-8837144925159374340},{"title":"Once In a Memory","fiction_id":"87090","link":"https:\/\/www.royalroad.com\/fiction\/87090\/once-in-a-memory","tags":["Progression","Male Lead","Tragedy","Drama","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":23,"view_count":113,"chapters_count":3,"last_update":1716841244,"description":"The moment that Alex met Zach changed everything. He never expected to find himself moving up north, falling in love, and experiencing grief like never before. A chance meeting in a bookstore led to the ending of one story and the beginning of another. Their time together was brief but their love lives on as chapters that unfolded Once in a Memory.","description_hash":6525399703053069303},{"title":"My Best Friend Admitted That She Likes Another Close Friend of Mine","fiction_id":"87089","link":"https:\/\/www.royalroad.com\/fiction\/87089\/my-best-friend-admitted-that-she-likes-another","tags":["Comedy","Multiple Lead Characters","Romance"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"A high school student-Yuuto Akiyama finds himself entangled in a whirlwind of friendship and romance when his best friend, Hina Tachibana, confesses her feelings for another close friend, Riku Sugihara. Caught off guard by Hina's revelation, Yuuto reluctantly agrees to help her win Riku's heart. As Yuuto and Hina embark on their mission to bring Riku and Hina together, they find themselves drawn closer to each other in unexpected ways. Amidst the chaos of study dates, cultural festivals, and school plays, Yuuto begins to realize his own growing feelings for Hina, leading to a whirlwind of emotions and hilarious misunderstandings...Through laughter and tears, Yuuto and Hina discover the true meaning of friendship, loyalty, and love. As they journey through high school and beyond, they learn that the path to happiness is paved with laughter, forgiveness, and the courage to follow their hearts.","description_hash":5281452744554960966},{"title":"The Pirate's Ruby","fiction_id":"87088","link":"https:\/\/www.royalroad.com\/fiction\/87088\/the-pirates-ruby","tags":["LitRPG","Dungeon","Male Lead","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":47,"view_count":279,"chapters_count":5,"last_update":1718345054,"description":"Shaky Scaffolds. Mesmerising Magic. Bumbling Bards and Devilish Rogues.\nHolsley is a down-on-his-luck bard whose life only gets worse when he discovers that his best friend, Roland Darrow, is about to be hanged in the cliffside city of Tressa.\nSuddenly, it’s a frantic race against time to save the rogue before he meets the noose, but there’s more to the story than what first appears. Roland has a secret. One concerning the mystery surrounding a peculiar shattered ruby he was found with. A secret that everyone wants to get their hands on.\nTogether, the pair will need to navigate the various dangers of the city in order to escape, but it all seems quite hopeless when the villains of their past are out to get them.\nThe Pirate’s Ruby is a thrilling, light-hearted fantasy tale inspired by the often fun and chaotic nature of Dungeons & Dragons. The characters have been built using the fifth edition ruleset, and the story is built around the features and rules present in that edition.","description_hash":277869690632471664},{"title":"Willful One ","fiction_id":"87087","link":"https:\/\/www.royalroad.com\/fiction\/87087\/willful-one","tags":["Action","Adventure","Historical","Romance"],"lable":"Original","following_count":1,"rating":0.0,"page_count":6,"view_count":143,"chapters_count":4,"last_update":1718028603,"description":"The one who rules the world of ronins and stands the freest among them is known as Tomoe Gozen, the Ronin Ruler. Her reputation precedes her, for she is often called “willful,” a testament to her unyielding spirit and unmatched skill.Tomoe Gozen was a name that echoed through the annals of history, immortalized in the pages of the Tale of Heike, a chronicle of the Genpei War. She was renowned not just for her beauty—described as having white skin, long hair, and pleasant features—but for her unparalleled prowess in archery and swordsmanship. Her skills were legendary: an archer so powerful she could fell her enemies from great distances, and a swordswoman whose combat abilities were said to be worth a thousand men, capable of facing demons and deities alike, whether mounted or on foot.In the fierce battles of the Genpei War, Tomoe Gozen served as the first commander to Minamoto no Yoshinaka. Her valor and leadership were unmatched, inspiring fear and respect in equal measure. Yet, the chronicles remain silent on her fate after Yoshinaka's defeat in 1184, leaving her legacy shrouded in mystery.\nA world of uncertainty and constant conflict, another figure emerged—a ronin named Sasaki Akimitsu. Unlike Tomoe Gozen, Akimitsu was a man driven by an inner turmoil, always ready to engage in a duel at a moment's notice. His reputation as a fearsome warrior was well-earned, but it came at a cost.Akimitsu's sister, Aoi, often worried about him. She watched over him with a heart full of concern, knowing his quick temper and solitary nature made him a target in the bustling towns he frequented. While Akimitsu sought solace in the chaos of the towns, Aoi knew that his loneliness was a wound that never healed. She feared for his safety, hoping that one day he would find peace.\nIt was in one such bustling towne and cities that the paths of Tomoe Gozen and Sasaki Akimitsu would eventually cross. Tomoe, always seeking the next challenge, and Akimitsu, with his relentless drive to prove himself, were on a collision course that neither could foresee.Their meeting would not be one of mere chance but of destiny, intertwined with the threads of fate that bound all ronins together. The sword named Unmei, a relic of great power and mystery, would play a crucial role in their story, guiding them toward a future neither could predict.As the shadows of the past and the uncertainties of the future loomed over them, Tomoe Gozen and Sasaki Akimitsu would discover that their wills were not so different after all. In the end, their journey would be one of understanding, redemption, and the unbreakable bonds forged in the fires of battle.Thus begins the tale of Tomoe Gozen and Sasaki Akimitsu, two souls in the world of ronins, each seeking their path, each carrying their burdens, and each destined to leave a mark on history.","description_hash":2299600545415944008},{"title":"Rwby: The Gathering","fiction_id":"87086","link":"https:\/\/www.royalroad.com\/fiction\/87086\/rwby-the-gathering","tags":["Progression","Strategy","Martial Arts","Multiple Lead Characters","Action","Adventure","Fantasy","Supernatural","Mythos"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":7,"view_count":52,"chapters_count":1,"last_update":1716505290,"description":"People from all over Remnant and other planes must unite and fight together to protect their homes from evils, be it the Creatures of Grimm or otherwise.","description_hash":-1154088155223983419},{"title":"Sierpentine","fiction_id":"87085","link":"https:\/\/www.royalroad.com\/fiction\/87085\/sierpentine","tags":["Portal Fantasy \/ Isekai","Sci-fi","Mystery","Reincarnation","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":120,"chapters_count":3,"last_update":1717465772,"description":"A cruel topology of rebirth, relife, and redeath.","description_hash":8078743606961890779},{"title":"The \"Expedition Squad\"","fiction_id":"87084","link":"https:\/\/www.royalroad.com\/fiction\/87084\/the-expedition-squad","tags":["Adventure","Fantasy","Historical","Magic","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":11,"view_count":103,"chapters_count":3,"last_update":1716753882,"description":"Florence and his allies are guided by a cryptic message from a Viking rune stone. They traverse the icy Northlands in order to awaken the legendary Valkyries, hoping to enlist their help in an impending invasion by demonic forces.","description_hash":6440948958871498212},{"title":"Time Travel","fiction_id":"87083","link":"https:\/\/www.royalroad.com\/fiction\/87083\/time-travel","tags":["Time Loop","Psychological","Sci-fi","Tragedy","Short Story","Time Travel","Soft Sci-fi"],"lable":"Original","following_count":2,"rating":0.0,"page_count":16,"view_count":176,"chapters_count":4,"last_update":1716531772,"description":"Do you dream of going back in time? Think again.\nTime travel has a bad reputation. Forget the movies with their dramatic tension and happy endings. In reality, it's a messy business. And its real problems are far more unsettling.\nBuckle up, because this isn't your typical time travel adventure. This is a story about the human cost, the psychological scars etched by tampering with the past. Dive into the chilling reality of time travellers and discover the truth: Messing with time isn't for the faint of heart.","description_hash":-4731311473728515399},{"title":"The Dreamer","fiction_id":"87082","link":"https:\/\/www.royalroad.com\/fiction\/87082\/the-dreamer","tags":["Urban Fantasy","Anti-Hero Lead","Strategy","Male Lead","Contemporary","Horror","Mystery","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":18,"view_count":536,"chapters_count":12,"last_update":1716699662,"description":"A series of suicides and seeming accidents stump detective Miller. He has a nagging suspicion that they are connected.\nBut the more he uncovers the truth, the impossibility of it sees his sanity slipping away. And he is not the only one losing his mind.","description_hash":-6399240746859007634},{"title":"Primordial ","fiction_id":"87081","link":"https:\/\/www.royalroad.com\/fiction\/87081\/primordial","tags":["Post Apocalyptic","War and Military","Psychological","Tragedy","Drama","Action","Supernatural","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":74,"view_count":3121,"chapters_count":71,"last_update":1718166400,"description":"In a world shaped by the relentless passage of time, Tyson, an immortal cursed to live for millions of years, serves as a silent guardian of humanity. Bestowed with eternal life by enigmatic gods, Tyson's duty is to protect and observe the ever-changing world, bearing witness to the rise and fall of civilizations, the ebb and flow of human progress, and the ceaseless cycles of birth and decay.\nHaunted by the memories of his mortal family, who were also chosen to protect the world but found peace in their finite lives, Tyson grapples with an overwhelming sense of pain and regret. The choices he never made and the paths left untaken weigh heavily on him, each a wound that time cannot heal. His immortality, once a gift, has become an unending burden, isolating him from the fleeting joys and sorrows that define human existence.\nAs he wanders through the remnants of ancient forests and the ruins of once-great cities, Tyson reflects on his role as a guardian. Despite his suffering, he remains committed to his duty, finding solace in the small acts of protection and guidance he offers to humanity. Yet, he envies the mortals he watches over, longing for the freedom and meaning that comes with a finite life.\nTyson's journey is one of introspection and endurance, as he seeks to understand the true purpose of his immortal existence. Through the pain and regret, he clings to the hope that one day he will find redemption and peace. His story is a poignant exploration of the human condition, the weight of eternity, and the search for meaning in a world that is constantly changing.\nAs the ages pass and new generations rise, Tyson remains the ever-watchful sentinel, the guardian of humanity's fragile flame. His eternal vigil is a testament to the enduring spirit of humankind and the possibility of finding purpose amidst the ceaseless flow of time.","description_hash":-1840572522465435078},{"title":"Armand Fights Monsters","fiction_id":"87080","link":"https:\/\/www.royalroad.com\/fiction\/87080\/armand-fights-monsters","tags":["LitRPG","Portal Fantasy \/ Isekai","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":4,"view_count":103,"chapters_count":1,"last_update":1716500389,"description":"Isakais are for ancient archmages and teenagers wasting their potential, so when James Mathis wakes up in a hedge maze with a display screen displaying his stats like he was some sort of computer and the ability to cast healing magic through programming he just wants to go home to his loving wife and job that he actually enjoys. Unfortunately a world full of cannibals, magic, monsters, and a too literally named subway system seem intent on making that as hard as possible.A Fanfic of \"He Who Fights with Monsters\" by Shirtaloon (Travis Deverell)","description_hash":7207448128774466269},{"title":"Bones in the Ocean","fiction_id":"87079","link":"https:\/\/www.royalroad.com\/fiction\/87079\/bones-in-the-ocean","tags":["Portal Fantasy \/ Isekai","Urban Fantasy","Female Lead","Adventure","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":70,"view_count":155,"chapters_count":4,"last_update":1718190004,"description":"Ruby suffers from night terrors in the weeks following her cousin Henry's disappearance, night terrors strong enough to put her frail, sickly body in danger. And they're getting worse. Her mother, Morgause Reveur, sees no other recourse than to send Ruby on her quest, the rite of passage that everyone in their witch clan goes through, to steal a source of magic from another plane. A quest Ruby is too young for, that she was never really intended to go on. But it may be the only way to save her life. Ruby plunges, literally, into Undaina, the elemental plane of water, where she will contend with pirates, merfolk and sea monsters by day, and with the choking darkness of her subconscious fears at night.\nA spinoff to The Dream Quest of Henry Sinclair, though it can be read it any order.\nUpdates every Wednesday.","description_hash":-5149610783805899817},{"title":"Destined in another world","fiction_id":"87078","link":"https:\/\/www.royalroad.com\/fiction\/87078\/destined-in-another-world","tags":["Portal Fantasy \/ Isekai","Multiple Lead Characters","Secret Identity","Action","Adventure","Fantasy","Mystery","Male Lead","Magic","Low Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":3.0,"page_count":61,"view_count":456,"chapters_count":9,"last_update":1717836661,"description":"Who made the monster and what is the truth behind the past and another world? \nGilden is an ordinary man who suddenly enters another world where there are monster and magic in there. Having a terrible past, he believe that this other world holds a mystery involving the death of his parents due to a monster and also the disappearance of his older brother. Can he solve the mystery behind this another world and can he achieve his goal? And who is the real villain behind everything?","description_hash":-6649047160028511733},{"title":"Unquenchable Soul","fiction_id":"87077","link":"https:\/\/www.royalroad.com\/fiction\/87077\/unquenchable-soul","tags":["Xianxia","Male Lead","Tragedy","Action","Adventure","Romance","Martial Arts","Wuxia"],"lable":"Original","following_count":1,"rating":0.0,"page_count":24,"view_count":189,"chapters_count":4,"last_update":1716589251,"description":"Xu Tian, the son of a powerful clan leader, is born without the meridians essential for qi cultivation, marking him as a cripple in a world where strength means everything. His dreams of power and respect are shattered until a mysterious, broken pearl offers him a new path: soul cultivation through alchemy. As he delves into the ancient art of pill refining, Xu Tian discovers that the path of an alchemist is perilous, demanding immense resources, unrivaled spiritual sense, and secrecy.Facing internal clan politics, external threats, and the stigma of his crippled status, Xu Tian must navigate a treacherous journey. Armed with the pearl's knowledge and an unyielding determination, he aims to rise above his limitations, reclaim his place in the clan, and forge a new destiny. \"Unquenchable Soul\" is a gripping xianxia tale of resilience, transformation, and the relentless pursuit of one's true potential. Follow Xu Tian as he strives to master his soul, defy the odds, and become a legend.","description_hash":5730035345122558828},{"title":"They Who Hide Under Top Hats","fiction_id":"87076","link":"https:\/\/www.royalroad.com\/fiction\/87076\/they-who-hide-under-top-hats","tags":["War and Military","Multiple Lead Characters","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":231,"view_count":532,"chapters_count":14,"last_update":1718423103,"description":"The City of Hatlynshire is ruled by two opposing forces. The Order of Man, a shadow government ruled over by an autocratic dictator and the Circle, a hidden community of telekinetic people descended from the forest that surrounds the city, known as the Arylmoor. These Circulions are ruled by the Great Houses, eight powerful families that hail from industry.\nFollow the multiple perspectives of multiple leads sch as Henry Demon, the reluctant Circulion Baron of Demonum who is forced to wage a silent war as his conflicts with the Order escalate, Anna Dawon, a Circulion girl from Everton who's home is about to become a battleground and Lucian Demon, the timid heir to Demon Family whose flung headfirst into danger and strange places with only his fellow friends by his side.\nAs this story unfolds, set in a city themed around the 19th-early 20th century, many secrets shall reveal themselves, the plots and prophecies of eldritch gods and scheming politicians converge in a conflict that will decide the fate of Hatlynshire and it's inhabitants...The King sits upon his Moorish throne, his eternal children praise his name, for the sins of the old the young shall atone, returning once more from the Flame...","description_hash":937629012687019246},{"title":"Of Fire's Marks","fiction_id":"87075","link":"https:\/\/www.royalroad.com\/fiction\/87075\/of-fires-marks","tags":["Female Lead","Drama","Action","Fantasy","Short Story","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":32,"view_count":49,"chapters_count":1,"last_update":1716485471,"description":"When a natural disaster erupts, a young shaman puts everything on the line to avert tragedy.\n\nThis is a self-contained complete short story.","description_hash":6035604959966924878},{"title":"Feywild","fiction_id":"87074","link":"https:\/\/www.royalroad.com\/fiction\/87074\/feywild","tags":["Progression","Female Lead","Slice of Life","Harem","Drama","Adventure","Fantasy","Romance","School Life","Supernatural","Magic","Low Fantasy","Attractive Lead"],"lable":"Original","following_count":38,"rating":4.67,"page_count":15,"view_count":438,"chapters_count":2,"last_update":1717481751,"description":"Hello, readers, my name is Jade—23-years-old—and I'm the unluckiest woman alive...that always escapes! \nHaving woke up at a New York adoption center's doorstep at 5 years old, my first memories are of my best friend—scratch that...only friend, Powder! My trusted, imaginary bird friend that no one can see but me! Yeah...I'm probably crazy. So crazy that I ran away from my foster family when I was ten and have been on my own ever since! I get into insane situations but always somehow manage to get away. The unluckiest and luckiest woman alive!\nNow, I'm staring at a dragon man, in an ice cave, and great, I'm going to be executed... How did I get here again? Right. I'm just that unlucky! Or am I?\n\nIf it gets enough people talking about it, then I'll continue. If you enjoy it, then comment and talk about it. It is more Reverse Harem.","description_hash":-6052021491381614314},{"title":"GREY: Of Dragon and Dungeon","fiction_id":"87073","link":"https:\/\/www.royalroad.com\/fiction\/87073\/grey-of-dragon-and-dungeon","tags":["Dungeon","Fantasy","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":12,"view_count":82,"chapters_count":2,"last_update":1716512663,"description":"A fantasy novel that follows the extraordinary journey of Marris and Rammis Johnson, twin siblings born under the rare seventh solstice in the humble fishing village of Cardinal Peaks. As the twins uncover the mysteries of their world Aena, they also embark on a personal journey of growth, discovering the true extent of their powers and the strength of their bond as siblings. Will they unlock the secrets of Aena, fulfill their destinies, and safeguard the realm from impending darkness?","description_hash":5274881641027989903},{"title":"The New Guidance Counselor at Sunshine Reformation Insitute ","fiction_id":"87072","link":"https:\/\/www.royalroad.com\/fiction\/87072\/the-new-guidance-counselor-at-sunshine-reformation","tags":["Sci-fi","Drama","Action","Adventure"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":76,"chapters_count":1,"last_update":1716485354,"description":"In a war no matter what side your on theirs considered the good side, the bad side and the neutral side.   Welcome to The year is 2047 where your country is either taken over or your in fear of being the next country to be taken over.  By  Konton Ogichi aka The Demon in red. A one woman army capable to take down an army. Are story takes place with the lives of five Deliquents kids who play the biggest role in deciding the fate of the world. A 19 year old boy who him and his dead sisters soul share the same body, a 16 year old girl fixated on destruction and maid cafes and has never lost at anything gambling related, a 16 year old boy who with a slick tongue and has an IQ that can put world renowned scientist to shame, a 14 year old boy whose obsessed with his cousin and will protect her no matter what even if it means killing and 15 year old boy called the demon jester of chaos and not only is determined to live the life he wants he's also the son of The Demon in Red.","description_hash":3624169788804249961},{"title":"Short Stories with your Imouto!","fiction_id":"87071","link":"https:\/\/www.royalroad.com\/fiction\/87071\/short-stories-with-your-imouto","tags":["Slice of Life","Adventure","Romance","Short Story"],"lable":"Original","following_count":1,"rating":0.0,"page_count":9,"view_count":56,"chapters_count":2,"last_update":1716797799,"description":"Just some non My little sister things that I write for fun. No editing at all just fun (maybe)","description_hash":6218221170063150644},{"title":"My Little Sister","fiction_id":"87070","link":"https:\/\/www.royalroad.com\/fiction\/87070\/my-little-sister","tags":["Slice of Life","Adventure","Romance","Short Story","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":39,"view_count":184,"chapters_count":4,"last_update":1716797911,"description":"This story is about a older brother and his little sister traveling the world together getting out of a monotonous life. Or I'm pretty sure this is my train of thought writing page so it could really go anywhere! All feedback is appreciated though please be nice.","description_hash":2036047615018616603},{"title":"Mana Seeds ~*~Kathy's story~*~","fiction_id":"87069","link":"https:\/\/www.royalroad.com\/fiction\/87069\/mana-seeds-kathys-story","tags":["LitRPG","Urban Fantasy","Female Lead","Fantasy","GameLit"],"lable":"Original","following_count":2,"rating":0.0,"page_count":13,"view_count":60,"chapters_count":1,"last_update":1716485320,"description":"In a dark, dingy room, a young woman wakes up with a throbbing headache and fragmented memories. She recalls being assaulted and imprisoned by a man but struggles to remember her name or how long she's been there. She notices a strange blue screen floating in front of her, displaying cryptic messages about a \"system\" and \"mana seeds\" that have been introduced to save her world from a virus. The screen indicates that she has survived an initial transformation and must now adapt to this new reality.\nBound and disoriented, she manages to free herself using a hammer she finds nearby. As she explores the room, she discovers books that impart knowledge directly into her mind when she interacts with them. Through these books, she learns about crafting and basic spells, which she uses to create a tunic and a magical bag that can store items and memories. Despite her physical and mental pain, she gains small boosts in her abilities, gradually clearing her mind and strengthening her resolve.\nWith each crafted item, she unlocks achievements and slowly pieces together fragments of her past. She chooses a new name for herself, Kathy, to replace the blank spot where her identity should be. As she gains more control over her situation, she fashions a cloak to protect herself and a bag to carry her newfound belongings.\nDetermined to escape, Kathy uses a key she finds in the man's clothing to unlock the door to her prison. Armed with her crafted items and the knowledge she has absorbed, she steps out into an uncertain world, ready to find food, freedom, and a way to rebuild her shattered life.","description_hash":2945709128193548516},{"title":"The Chosen Few - Echoes ","fiction_id":"87068","link":"https:\/\/www.royalroad.com\/fiction\/87068\/the-chosen-few-echoes","tags":["Portal Fantasy \/ Isekai","Anti-Hero Lead","Fantasy","Romance","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":2,"view_count":46,"chapters_count":1,"last_update":1716485275,"description":"When Nova dies, he is offered another chance at life by a god from another world. A chance to fight the very thing he fought for so long before death; his own fate. Except this time, he's planning to hit the ground running. The part of him that hardened over the years. The part that grew ruthless. That part will no longer be hindered by the naivety of a lost and scared child. They will remember him, this time.","description_hash":-8942874124236910027},{"title":"Ace in the Hole","fiction_id":"87067","link":"https:\/\/www.royalroad.com\/fiction\/87067\/ace-in-the-hole","tags":["Ruling Class","Female Lead","Secret Identity","Strong Lead","Drama","Fantasy","Romance","Mystery","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":64,"view_count":395,"chapters_count":10,"last_update":1717765954,"description":"Living under the shadow of her older sister, Yvette became used to being compared to \"the golden girl\" who was as bright as \"gold\" and being treated like the \"silver\" in comparison. \nThe only person in their family that she could rely on was her twin brother, Yvon. Their parents, unconsciously favoring their older siblings, unintentionally overlooked the twins. Counting on only each other to have their backs, the twins grew protective of each other, not wanting the other to suffer.\nTo the outside world, Yvette was seen as a sweet unremarkable young woman  but in reality the personality she shows to the public is a carefully curated facade hiding her ambitions and intellect. \nAs more people grew to like their older sister, the twins felt differently knowing of her nefarious side, one that caused them pain and trauma.\nA month after her older sister's marriage to the empire's crown prince, Yvette found herself engaged to Lev, her sister's former suitor. Yvette found it ironic that she, who had harbored a childhood crush on the crown prince, was now to be married to Lev, someone who was in a love triangle with her older sister.\nDespite the initial shock, Yvette and Lev get married, gradually growing closer and discovering each other's hidden strengths and vulnerabilities, insecurities, slowly falling in love.\nHowever, things aren't going to be easy for this couple.\nYvon and Yvette's secret plans were gradually coming to fruition, their dream of building an empire of their own. \nLev, who before the wedding said that it didn't matter what kind of person Yvette was, was slowly seeing  the layers beneath his wife's surface.\nThe twins' painful past had left deep physical and emotional scars that were still far from healed and their older sister's heinous shadow still loomed over and influenced them.\nAs secrets emerge and tensions mount, can Lev and Yvette pull through against the obstacles in their path and remain in each other's arms?","description_hash":3153160090748989085},{"title":"Black Hole","fiction_id":"87066","link":"https:\/\/www.royalroad.com\/fiction\/87066\/black-hole","tags":["Space Opera","Sci-fi","Action","Adventure","Romance","Supernatural","Genetically Engineered ","First Contact"],"lable":"Original","following_count":0,"rating":0.0,"page_count":28,"view_count":229,"chapters_count":5,"last_update":1717833813,"description":"Earth comes together after it is attacked by an Invading force of Aliens, they build a few ship to map space, this is the journey of the starship Salvation, which follows Earth in as it gets sucked into a blackhole.","description_hash":-5024797256874503186},{"title":"Lmao Legend","fiction_id":"87065","link":"https:\/\/www.royalroad.com\/fiction\/87065\/lmao-legend","tags":["Wuxia","Comedy","Action","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":30,"chapters_count":1,"last_update":1716485242,"description":"Hopefully, you clicked into this not expecting anything serious. \nThis is the epitome of brain rot.\nTurn back if you are not ready.\nThis is my dumpster territory","description_hash":-1551912937404325004},{"title":"Just a normal mage school ","fiction_id":"87064","link":"https:\/\/www.royalroad.com\/fiction\/87064\/just-a-normal-mage-school","tags":["Urban Fantasy","Comedy","Multiple Lead Characters","Drama","Action","School Life","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":77,"chapters_count":2,"last_update":1717500561,"description":"Some people are born with control over certain types of magic, and eventually schools are made for people with magic. The most prestigious school in Japan Tokyo mage high has always been above the others. But this years batch of sixteen students is at a whole new level. This would change the power of balance in the mage world but maybe it's for the better or maybe it's for the worse....","description_hash":7797878382229612203},{"title":"Quantum Gambit","fiction_id":"87063","link":"https:\/\/www.royalroad.com\/fiction\/87063\/quantum-gambit","tags":["GameLit","Space Opera","War and Military","Male Lead","Sci-fi","Action","Adventure","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":85,"chapters_count":1,"last_update":1716485216,"description":"In a universe where the stakes are life and death, Jack \"Lucky\" Dawson has always played the odds. A professional gambler down on his luck, Jack's world is turned upside down when he wins a mysterious lottery that catapults him into the cockpit of a cutting-edge space fighter.\nThrust into the heart of an interstellar war, Jack must quickly adapt to his new role in the elite Sentinel Armada. Guided by ACE, his wryly humorous AI companion, and supported by a squadron of seasoned pilots, Jack faces an implacable enemy: a rogue AI known as Nexus, bent on humanity's destruction.\nUsing his gambler's instincts and quick thinking, Jack must navigate intense space battles, outwit his enemies and uncover the secrets of the Sentinel Armada. As the lines between luck and skill blur, Jack realises that the game he's playing has never been more real - or deadly.\nQuantum Gambit is a high-octane mix of space combat, strategic warfare and relentless action. Will Jack's luck hold out, or will the House finally win?\nPrepare for a thrilling ride into the void, where every move is a gamble and the future of mankind hangs in the balance. If you enjoyed the intense dogfights of Wing Commander and the epic space battles of Star Wars, you'll love Quantum Gambit.","description_hash":-2892364722538675577},{"title":"The Song and the Serpent","fiction_id":"87061","link":"https:\/\/www.royalroad.com\/fiction\/87061\/the-song-and-the-serpent","tags":["Male Lead","Strong Lead","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":19,"rating":4.5,"page_count":99,"view_count":1521,"chapters_count":12,"last_update":1718381825,"description":"Strange rumors have reached the city of Farel, rumors of unexpected attacks and mysterious disappearances. \nWhen Lord Hathian charges his son, Kian, to find the source of these rumors, Adan, a seventeen-year-old bodyguard, must honor his vows and accompany his best friend on a voyage north into the unknown to find the source of the rumors. \nBut rumors only share a passing resemblance to reality. \nAdan’s loyalty is put to the test when they are attacked at sea and abducted by strange men with covered faces and spiked helmets. The two friends soon find themselves caught in a desperate struggle for hope and survival against a secret foe. \nNew chapters released twice a week, Tuesdays and Fridays. Patreon members get access to everything as it is written.","description_hash":-3727182413577640005},{"title":"Ages of Learning","fiction_id":"87059","link":"https:\/\/www.royalroad.com\/fiction\/87059\/ages-of-learning","tags":["LitRPG","Progression","Strategy","Historical"],"lable":"Original","following_count":2,"rating":0.0,"page_count":8,"view_count":115,"chapters_count":2,"last_update":1716479386,"description":"Synopsis subject to change*Studying anything and everything at her university for the 18th year in a row one moment, to studying how to survive in an age long ago without her modern comforts in the middle of the tumultuous time in the 3rd Century, all the while the planet is going through a system awakening almost 1800 years too early in the next moment after she tripped into a bush.tldr; i tripped into a bush and based a fiction off of it.AI-generated Cover using Craiyon. No other AI has been used however.","description_hash":-1755171588231945649}]