[{"title":"Different kinds of short stories","fiction_id":"86769","link":"https:\/\/www.royalroad.com\/fiction\/86769\/different-kinds-of-short-stories","tags":["Time Loop","Strategy","Martial Arts","Slice of Life","Secret Identity","Drama","Horror","Romance","Short Story","High Fantasy","Time Travel"],"lable":"Fan Fiction","following_count":1,"rating":5.0,"page_count":24,"view_count":265,"chapters_count":4,"last_update":1716087768,"description":"There are all kinds of interesting and wonderful short stories in it.","description_hash":-6187715875671942619},{"title":"Divine and Conquer ","fiction_id":"86768","link":"https:\/\/www.royalroad.com\/fiction\/86768\/divine-and-conquer","tags":["Reincarnation","Grimdark","Psychological","Male Lead","Tragedy","Adventure","Mystery","School Life","Supernatural","Magic"],"lable":"Fan Fiction","following_count":103,"rating":4.01,"page_count":793,"view_count":9855,"chapters_count":21,"last_update":1717999802,"description":"Reborn into the magical world, amazing! In Harry Potter's year, oh well, canon will take care of itself won't it, still it's Magic! Are the adults actually competent? Well there goes canon, what do I do? An OC\/SI is reborn as a muggleborn into an AU magical world, a mix of Hogwarts Legacy\/Mystery and the books.","description_hash":-585691435309528629},{"title":"Lost Demon","fiction_id":"86767","link":"https:\/\/www.royalroad.com\/fiction\/86767\/lost-demon","tags":["Anti-Hero Lead","War and Military","Non-Human Lead","Contemporary","Action","Adventure","Fantasy","Supernatural","Male Lead","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":33,"chapters_count":1,"last_update":1716036766,"description":"In the distance... the demon army gathers... building and building... feeding on the blood and sweat of the people... a race of predators... if unchecked... they could consume the world...\n\nAmongst them, a young captain... he is a full-blooded demon... evil runs through his veins... but when he looks up at the blue sky... he questions it... what he really believed... if it was possible to change... to be redeemed... what lies ahead in the distance... who knows... but he intends to start walking...","description_hash":-1789291588638014740},{"title":"piercing arrow","fiction_id":"86766","link":"https:\/\/www.royalroad.com\/fiction\/86766\/piercing-arrow","tags":["Progression","War and Military","Male Lead","Drama","Action","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":31,"chapters_count":1,"last_update":1716033562,"description":"In the dead of night, Juar is awakened by endless screams. His world gets turned upside down. With a family lost, and a path of life found. Juar is on a journey to find his family, and become the best archer the world has ever seen. Whatever that may entail.","description_hash":-8419590889623178110},{"title":"Miscellaneous Short Stories by Lord Frostdraken","fiction_id":"86764","link":"https:\/\/www.royalroad.com\/fiction\/86764\/miscellaneous-short-stories-by-lord-frostdraken","tags":["Short Story"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":128,"view_count":239,"chapters_count":7,"last_update":1718475528,"description":"A series of my short original stories that are not a part of my greater TOC(The Oblivion Cycle) setting.  They may be stories written for other people, fanfiction stories set in preexisting settings or totally abstract original tales.  As there is no general category for this work there is no easy way to say what you might find in here.  So, I will end this by simply saying that these are all stories of mine and that I hope you find them interesting.  Cheers and thanks for reading.","description_hash":8152103142482130932},{"title":"The Twilight Curtain","fiction_id":"86763","link":"https:\/\/www.royalroad.com\/fiction\/86763\/the-twilight-curtain","tags":["Portal Fantasy \/ Isekai","Male Lead","Action","Adventure","Fantasy","Supernatural","Magic","Low Fantasy","Mythos"],"lable":"Original","following_count":2,"rating":0.0,"page_count":65,"view_count":718,"chapters_count":15,"last_update":1716078612,"description":"What would you do if death wasn’t the end? If all that you thought of as superstition lay just beyond the veil?\nIn the realm of twilight, where those who've died still struggle, the most treasured things are memories\nTry to remember who you were. Because one day, you might just forget.","description_hash":5901335631411661345},{"title":"Murderess","fiction_id":"86762","link":"https:\/\/www.royalroad.com\/fiction\/86762\/murderess","tags":["Progression","Multiple Lead Characters","Tragedy","Drama","Historical","Mystery","Female Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":204,"view_count":1087,"chapters_count":26,"last_update":1718631615,"description":"\"After spending five years in prison for a murder conviction, Evelyn's last hope hinges on one man: John Garret, a specific lawyer she insists on having. She insists that she has a much complicated relationship with the lawyer But for Garret, Evelyn is nothing more than an enigma.\nHaunted by a recurring nightmare, Garret's life is tormented by an imaginary demon demanding salvation for the lawyer's sins.\nAs each day passes, Garret delves deeper into the harsh truth of Evelyn's crime and the elusive solution to satisfy the relentless hunger of his demon.”\nStory follows A British Woman Evelyn who spends five years in Prison for a conviction of Murder but all of a sudden she demands a lawyer, specific one named John Garret who resides in America, she tends to reveal her story only to him.","description_hash":7931672249905894984},{"title":"Coat buttons on my fingers","fiction_id":"86761","link":"https:\/\/www.royalroad.com\/fiction\/86761\/coat-buttons-on-my-fingers","tags":["Psychological","Male Lead","Short Story","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":5.0,"page_count":4,"view_count":73,"chapters_count":2,"last_update":1716138218,"description":"A story i wrote for english class, a story about change and a robot with a purpose to bring to pass","description_hash":7662973733956577252},{"title":"Eyes Wide Open - [LitRPG]","fiction_id":"86760","link":"https:\/\/www.royalroad.com\/fiction\/86760\/eyes-wide-open-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Adventure","Reincarnation","Gender Bender"],"lable":"Original","following_count":6,"rating":0.0,"page_count":7,"view_count":207,"chapters_count":2,"last_update":1716480007,"description":"“I don’t know who I am.”\n\nThe foreign man appeared unaffected by the philosophizing comment, resting by the fire. He bit into a reddish jerky, and replied calmly.\n\n“You are whatever you’d die for.”\n\nI sat back on the craggy rocks of our camp, and paused before responding.\n\n“What if I’m already dead?”\n\nThe man smiled, unnerving for a warrior with weapons strapped to his dark skin, wielding magic I can’t begin to challenge.\n\n“Then,” he said, curling his hand through the flames. \n\n“Find a reason to live.”\n\n\n\n[Your Eyes are Closed]\n\n\nEyes Wide Open is a medium-paced, weak-to-strong, LitRPG focused on exploring the [System], [Emotion], and [Revolution]. This is my first public story. Please be kind.\n\n[Keep them Open]\n\n\nAlthough this is tagged Sensitive Content (and believe in the [Titans] me, this is well, well warranted), there will be a decent amount of non-action writing peppered in the later chapters. If you’ve come for a harem-building protagonist, a perfectly rational and righteous hero, or perpetual triumph, you’ve come to the wrong place.\n[Wide Open.]","description_hash":7968008166517870154},{"title":"The Monster Hunter: From Extraordinary to Legend","fiction_id":"86758","link":"https:\/\/www.royalroad.com\/fiction\/86758\/the-monster-hunter-from-extraordinary-to-legend","tags":["Reincarnation","Urban Fantasy","Post Apocalyptic","Super Heroes","Sci-fi","Adventure","Fantasy","Contemporary","High Fantasy","Mythos"],"lable":"Original","following_count":1,"rating":5.0,"page_count":27,"view_count":345,"chapters_count":8,"last_update":1716642679,"description":"In Xiao Ning's world, magic and legends were always distant dreams. However, an unexpected event changed his perception of reality. While organizing his late father's belongings, Xiao Ning inadvertently discovered a mysterious grimoire. This book not only detailed various methods of hunting monsters but also contained many long-lost potion recipes. Initially, Xiao Ning thought this was merely a joke from his father's youth. However, when he found an alchemy laboratory hidden in the depths of his home, he finally understood that these were not just myths.\nThe laboratory was filled with strange apparatuses, and the faint scent of herbs lingered in the air, as if telling the story of his father's greatness and mystery. As Xiao Ning delved deeper into the secrets, he gradually uncovered an unknown side of his father: a reclusive alchemist burdened with an ancient mission. The secrets of the grimoire unfolded in his hands, opening a door to another world.\nXiao Ning gradually mastered the knowledge recorded in the book, learning how to concoct various potions and deal with the terrifying monsters described within. However, behind each new discovery seemed to lurk deeper dangers and conspiracies. Could his father's sudden death be related to these mysterious forces? Why did his father leave these secrets to Xiao Ning? As the truth slowly revealed itself, Xiao Ning realized he had inherited not just a legacy, but a path of no return.\nFacing unprecedented challenges, Xiao Ning was determined to uncover the truth behind his father's death. When he discovered a scroll documenting the ultimate potion, the wheels of fate quietly turned. It was a potion representing death, rumored to grant supreme power to those who drank it, but at an unknown cost. With a humble plea for life and a thirst for truth, Xiao Ning chose to cross this boundary of fate.\n\"Mysterious Grimoire: Xiao Ning's Alchemical Adventure\" is a novel filled with peril and fantasy, taking readers on a journey full of the unknown and challenges. In this book, Xiao Ning must face external threats and confront his inner fears and doubts. In the end, will he be able to unravel all the mysteries and find his own answers? This is a tale of courage, wisdom, and destiny, where every twist is gripping and suspenseful.","description_hash":-5877342228768429611},{"title":"Memora (LitRPG)","fiction_id":"86757","link":"https:\/\/www.royalroad.com\/fiction\/86757\/memora-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Grimdark","Multiple Lead Characters","Action","Adventure","Drama","Fantasy","Cyberpunk","Reincarnation","GameLit","Dystopia","Progression"],"lable":"Original","following_count":44,"rating":4.33,"page_count":144,"view_count":2585,"chapters_count":17,"last_update":1718401353,"description":"When Atreo steps into the sunlight from a cave, he finds himself not in the familiar world he knows but in the vast and mysterious land of Memora. Struggling to understand his new reality, Atreo is confronted with strange choices and daunting challenges. As an \"Unchosen,\" he possesses the potential to wield extraordinary abilities, but only if he can survive long enough to unlock them.\nMemora is a world of hidden dangers and ancient secrets, where every decision carries weight and allies are few. Guided by a cryptic voice, Atreo must navigate this perilous landscape, face formidable foes, and unravel the mysteries that brought him here. With every step, he edges closer to uncovering the truth about Memora and his own untapped potential.\nJoin Atreo on a thrilling adventure filled with unexpected twists, fierce battles, and the relentless pursuit of survival. In Memora, the stakes are high, the enemies are ruthless, and the journey is just beginning.","description_hash":-7028512327291732707},{"title":"The Specimen","fiction_id":"86756","link":"https:\/\/www.royalroad.com\/fiction\/86756\/the-specimen","tags":["Grimdark","Female Lead","Sci-fi","Short Story","First Contact","Soft Sci-fi","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":37,"chapters_count":1,"last_update":1716025629,"description":"Aboard a mobile dimension-hopping city, the overworked and exhausted Dr. Davun tries to relax, only to have another project tacked onto her and her team. She only has a small amount of time to study the newly acquired specimen, quickly discovering it may pose a great threat to her research, and to the city itself.","description_hash":-3126629131814584004},{"title":"Digimon Idle War Games (Fan-Fic)","fiction_id":"86755","link":"https:\/\/www.royalroad.com\/fiction\/86755\/digimon-idle-war-games-fan-fic","tags":["Virtual Reality","Fantasy","LitRPG","Reader Interactive"],"lable":"Fan Fiction","following_count":10,"rating":5.0,"page_count":15,"view_count":284,"chapters_count":2,"last_update":1716905590,"description":"Jet's world experiences a strange phenomenon, and the long-buried dream finally becomes a reality.\n[This interactive Digimon Fan Fiction story is meant to be fun for me and the readers.\nChapters will be uploaded once a week.\nEvery chapter after the first one will have a Poll for the reader to use, or they can add their suggestions in the comment section]","description_hash":4491864016465351317},{"title":"A sharp drop in the pit","fiction_id":"86754","link":"https:\/\/www.royalroad.com\/fiction\/86754\/a-sharp-drop-in-the-pit","tags":["Non-Human Lead","Fantasy","Historical","Short Story","Male Lead","Female Lead","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":16,"view_count":65,"chapters_count":1,"last_update":1716024970,"description":"In the aftermath of the failed assassination of a local feudal lord and failing to capture the assassin, his men cracked down on petty crime in order to show, in order to project strength and maintain order during the chaos. It was this policy that lead to Daisy, a petty thief, to be taken away to Alb castle to be thrown into an oubliette in order to die of starvation or exposure. All for the crime of stealing a loaf of bread. As she begins to plan her escape, she is interrupted by the strange creature sharing the pit with her.","description_hash":-7149405125328426093},{"title":"Elevator F Smells Like Pastries","fiction_id":"86753","link":"https:\/\/www.royalroad.com\/fiction\/86753\/elevator-f-smells-like-pastries","tags":["Contemporary","Short Story","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":55,"chapters_count":1,"last_update":1716021532,"description":"An office worker is devastated when their company stops stocking their favorite snack food.\nThis is a small series that will update between novellas.","description_hash":990592322398868693},{"title":"The Nightwyrms' Nemesis [Dark Dystopic Sci-Fi]","fiction_id":"86752","link":"https:\/\/www.royalroad.com\/fiction\/86752\/the-nightwyrms-nemesis-dark-dystopic-sci-fi","tags":["Progression","Anti-Hero Lead","Sci-fi","Tragedy","Action","Horror","Cyberpunk","Technologically Engineered","Dystopia"],"lable":"Original","following_count":25,"rating":4.71,"page_count":177,"view_count":4258,"chapters_count":35,"last_update":1717492789,"description":"An unparalleled academic genius of his generation - Norman has a bright future ahead. While he may be the rising star of the famed Illustrious Academy, in the brutally competitive Irvanian socio-political landscape, opportunist vultures lurk at every corner and no tactic is too low.\nThe biggest obstacle in the way of his grand ambitions though, is an ancient alien parasite that has made his body its nest. Oh, and there is also the problem of a high profile murder investigation that is likely to destroy his career.\nWill Norman be able to reassert control over his life? Or will he succumb in his pursuit of the forgotten arts of soul harvesting and become something else... Find out in this grimdark cyberpunk progression fantasy.\nSometimes being the best among the best is still not good enough.\n\nRelease schedule:\nBook 1: May-June 2024 (Complete)\nBook 2: August-September 2024 (Planned)\nBook 3: December 2024 (Planned)","description_hash":9125476971713917453},{"title":"Lion Tales","fiction_id":"86751","link":"https:\/\/www.royalroad.com\/fiction\/86751\/lion-tales","tags":["Dungeon","Multiple Lead Characters","Slice of Life","Tragedy","Action","Adventure","Fantasy","Male Lead","Non-Human Lead","Magic","Low Fantasy","Progression"],"lable":"Fan Fiction","following_count":3,"rating":3.0,"page_count":456,"view_count":1533,"chapters_count":18,"last_update":1718631738,"description":"A couple of 20-something frat boys go on a backcountry ski trip in the Coronet Range. After getting lost in the wilderness, one of the men awakens in a village of Pokémon who have elected to spare him. His life continues, but in a new body. Soon, Spencer the Litleo is on a quest to take on Syndicate 23 and make things right. Crossposted to AO3 and Scribble Hub as \"What The Earth Gave Me\".","description_hash":8285563929550400202},{"title":"The Transmigrated Professor","fiction_id":"86749","link":"https:\/\/www.royalroad.com\/fiction\/86749\/the-transmigrated-professor","tags":["Reincarnation","Dungeon","Male Lead","Sci-fi","Strong Lead","Action","Adventure","Fantasy","School Life","Magic","High Fantasy","Progression"],"lable":"Original","following_count":2,"rating":3.5,"page_count":158,"view_count":548,"chapters_count":17,"last_update":1716137788,"description":"Trapped in his friend's sci-fi novel, the protagonist is possessed by the character Ray Laxon and must navigate a dangerous world filled with dungeons, monsters, magic, and demons. \nAccused of associating with the villains, Ray and his family face execution. \nThe protagonist's goal is to survive his execution and find a way out of the world, whether it be by escaping the novel or finding another way. \nWith time running out, the protagonist must use all of his knowledge and skills to outsmart the villains and secure his freedom. \nWill he succeed, or will he be forever trapped in this unfamiliar world?","description_hash":-819279185849197293},{"title":"The Delusional Family Trapped in a Sitcom Series","fiction_id":"86748","link":"https:\/\/www.royalroad.com\/fiction\/86748\/the-delusional-family-trapped-in-a-sitcom-series","tags":["Comedy","Slice of Life","Mystery","Gender Bender"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Teenage orphan Decker has a major problem...he can't decide whether or not his life as a character in a situational comedy series is true reality, or if he is stuck in some kind of persistent dream. Join Decker and his larger than life adoptive family as he struggles to adjust and accept his new life where living puppets, living toons, and costumed-dinosaur people are considered the norm.","description_hash":6008567793668078586},{"title":"Her Dear Alicia","fiction_id":"86747","link":"https:\/\/www.royalroad.com\/fiction\/86747\/her-dear-alicia","tags":["Psychological","Female Lead","Contemporary","Drama","School Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":263,"view_count":531,"chapters_count":36,"last_update":1718355953,"description":"It has always been just the two of them, and they’ve never needed anything more. Alicia, her beloved daughter who’s taking her O’Levels. Serena, her beloved mother who works so hard for her at the pet shop. Until the day Alicia curiosity get the better of her. \nIt seemed like a benign decision to try smoking, as those who did it never gotten in trouble. Smart even, as those who did were popular. It seemed like an open-and-shut case; a scolding, a week of detention, and a lesson learnt. \nIf not for the ego of a mother, and the stubbornness of a teenage daughter. \nThe tug-of-war begins. Serena confiscates her phone, leaving Alicia unable to do her coursework. Alicia gives up on her studies, and demands her phone back. Serena gives up on soft love, and embraces the necessary evil needed to get her daughter back on track. Alicia resists frustratingly well. It remains a dead tie for eternity, until Serena breaks it the only way she knows how. \nThe only way a parent knows to make their child behave. Caning.\nThe rope snaps, and they part ways. But whether she’ll give her a second chance, or whether she’ll cherish it and change for the better, depends on the both of them. \nJust the two of them.","description_hash":4489971405954565695},{"title":"steven X connie","fiction_id":"86746","link":"https:\/\/www.royalroad.com\/fiction\/86746\/steven-x-connie","tags":["Action","Romance","Short Story"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":2,"view_count":37,"chapters_count":1,"last_update":1716018179,"description":"just something i slapped together. i might make more. i also have this idea for a time travel au where steven half a year into his journey gets transported to the past and tries his best to get back while also making sure th steven of this timeline dosent suffer as much as he had.  oh and in the first chapter, it years after the ending, connie is 19 and steven is 21.","description_hash":4498232132040545733},{"title":"The Journey of Becoming an Emperor","fiction_id":"86745","link":"https:\/\/www.royalroad.com\/fiction\/86745\/the-journey-of-becoming-an-emperor","tags":["Reincarnation","Male Lead","Action","Adventure"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":43,"chapters_count":1,"last_update":1716017801,"description":"[Ash, an orphan on Earth, died from being killed by his brother. Reincarnated into another world and living peacefully, he was happy. However, all that was wrecked wreck when a tragedy came to his village when he was out hunting for his 10th birthday, leaving him as the only survivor. Will he be able to get revenge? How will he? And what will happen after he got his revenge? Read this novel to find out!]\nThis novel might be a bit boring as I am just making it to be a background story and a prequel for my next novel. If you don't want to read it, it's fine, but you should read my next novel when it comes out!","description_hash":699852024997451173},{"title":"Look What You Made Me Do","fiction_id":"86744","link":"https:\/\/www.royalroad.com\/fiction\/86744\/look-what-you-made-me-do","tags":["Portal Fantasy \/ Isekai","Urban Fantasy","Anti-Hero Lead","Super Heroes","Female Lead","Action","Drama","Fantasy","Sci-fi","Supernatural","Magic"],"lable":"Fan Fiction","following_count":139,"rating":4.71,"page_count":259,"view_count":8331,"chapters_count":17,"last_update":1718610244,"description":"Marvel did Wanda dirty.\nI remember leaving the cinema thinking that after the disappointing finale of Doctor Strange in the Multiverse of Madness. It wasn’t a terrible movie, exactly, or at least it wasn’t the worst one Marvel had put out. Still, I’d been hyped for it and had been let down by the arc they had put one of my favourite characters through.\nAnd now I was here, looking at my reflection in a dirty mirror in a tiny, grey-brick bathroom and seeing Wanda Maximoff staring back at me. It was like Kevin Feige and Sam Raimi had heard my disappointment and drop-kicked me across the multiverse in response, putting me here as if to say, “Go on, then. You do a better job.”\nI held a hand up in front of me. I could feel the power, bubbling away below the surface, and it took only the slightest effort of will for a faint swirl of red energy to play across my fingers.\nFine, then. Watch me.\n--\nAn MCU fan from our world wakes up in the body of Wanda Maximoff prior to the events of Avengers: Age of Ultron. Resolving not to meet the same fate as the original, she seeks to use her powers and metaknowledge to create a better world, stopping villains ahead of time and saving thousands or millions of lives in the process. However, there are gaps in her knowledge and reality is more fragile and complicated than she expects. Butterfly effects from her actions rapidly start spiraling out of control, setting her in opposition to heroes she'd rather have as allies. The Scarlet Witch is prophesied to either rule the cosmos or annihilate it, and she intends to save this universe... even if she has to drag it kicking and screaming the whole way.\n--\nThe MC is a regular person with personal trauma, blind spots, and a fallible, incomplete memory of the setting. LWYMMD is not the story of a hypercompetent MC who is going to steamroll the setting using her metaknowledge. She will struggle, make mistakes, and things will often not work out according to plan. There will be high highs, but also extremely low lows.","description_hash":-8114973170676812138},{"title":"Then Pan was a Zombie","fiction_id":"86743","link":"https:\/\/www.royalroad.com\/fiction\/86743\/then-pan-was-a-zombie","tags":["Martial Arts","Comedy","Female Lead","Action","Fantasy","Supernatural"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":37,"view_count":115,"chapters_count":3,"last_update":1718028754,"description":"A Dragonball Multiverse story. This is an alternate version of what happened in chapter 6. It is highly recommended you read the first 5 chapters of Multiverse to understand what the heck is going on. \nThe simple version? An alien race called the Vargas has gathered heroes and villains across multiple timelines to fight in an epic tournament. The main character Pan comes from Universe 16, a universe where Goku and Vegeta stayed fused at the end of the Buu saga.\nSome say death is the end, a gate to oblivion. For others, it's a road to paradise or eternal torment. For some, it's just odd. Pan? All she wanted was to prove herself worthy of her grandfather's legacy, to become a hero. But fate was cruel, using her as a sacrificial lamb to prove how serious and dangerous the villains are in the tournament to end all tournaments. And she didn't even die to a cool, beloved villain like Frieza. No, Pan, granddaughter of freaking Goku, died at the hands of a filler movie villain. It was cruel and pointless, so destiny has decided to give her another chance. But miracles have a cost, and Pan's is the strangest of all. It's in the title. You can kind of guess what happened. Is she a monster? Does she have a thirst for brains? Read the story to find out.","description_hash":-1039227788719911472},{"title":"Adventuring With Bros In A Fantasy World ","fiction_id":"86742","link":"https:\/\/www.royalroad.com\/fiction\/86742\/adventuring-with-bros-in-a-fantasy-world","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","War and Military","Male Lead","Action","Reincarnation","Magic","Strategy"],"lable":"Original","following_count":6,"rating":1.75,"page_count":66,"view_count":950,"chapters_count":12,"last_update":1716813270,"description":"Mathew and Jayden wake up with an unfamiliar environment there are armors and weapons beside them and they are not sure how did they ended up he, and this is where their journey starts by completing task, quest and maybe going for an adventure at the outside world.","description_hash":-1219163086965862726},{"title":"Immaculate","fiction_id":"86741","link":"https:\/\/www.royalroad.com\/fiction\/86741\/immaculate","tags":["Progression","Post Apocalyptic","Psychological","Multiple Lead Characters","Slice of Life","Adventure","Drama","Fantasy","Male Lead","Strong Lead","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":32,"view_count":108,"chapters_count":3,"last_update":1718457365,"description":"Depending on who you ask, Alunya is either a bastard witch who has bewitched his own brother, or a carefree and innocent- if reckless- child. Born into a village isolated by a divine barrier for the last fifteen-hundred years, protected from the divine beasts and magical storms of the wilderness beyond, the innate savagery and peculiar gifts that Alunya is both blessed and cursed by makes him a poor fit.\nAll that Alunya wants in life is to strike out on adventure throughout the wider world with his much-beloved older brother, Antares. But the long centuries of peaceful isolation have brought about stagnation, superstition... And a fear of the unknown. And so, already under suspicion from the stigmata which has marked him from birth, Alunya's prodigal talents quickly provoke scorn and distrust. After all, What use did any in such peaceful times have for power?\nYet Alunya and Antares are not under threat of merely their lives, but their very souls, in a world eager to twist them into a reflection of their surroundings. The question remains open if Alunya will even survive to see the future he dreams of... And perhaps more importantly, if he does, will any part of his or his brothers' innocence still be intact to see it?\n[...]\nStory is written in third person limited, present tense, from the perspectives of the two main characters (Alunya and Antares) with very few exceptions. I would describe the genre as slow-burn character drama, with adventure elements only far later into the story. Upload schedule will be biweekly for the time being, as of posting the first chapter I have 35 more chapters ready to go and am still writing more, hopefully that backlog is enough to keep it going at a consistent schedule for a very long time.","description_hash":-8293933698853941833},{"title":"Fire and Ice","fiction_id":"86740","link":"https:\/\/www.royalroad.com\/fiction\/86740\/fire-and-ice","tags":["Urban Fantasy","Non-Human Lead","Contemporary","Fantasy","Supernatural","Female Lead","Magic","Low Fantasy","Attractive Lead"],"lable":"Original","following_count":8,"rating":4.5,"page_count":781,"view_count":8115,"chapters_count":88,"last_update":1718575233,"description":"In the Supernatural world lies the Werewolf world. And in the Werewolf world lie packs.\nNatalia was the omega of her pack with the blood of an alpha. As you can imagine, she was deemed 'disrespectful' and the pack members would try to beat her into submission.\nEmphasis on try.\nYou see, you can't beat an alpha into total submission. Illegitimate or not. Shifted or not. After her mate rejects her, she leaves. Runs. Hightails the hell outta there.\nAnd she promises to be back to tear them apart.\nThis isn't a typical story of how a rejected, wounded she-wolf runs away, finds another pack then reluctantly returns to her old pack because of some useless mission to help them with rogues. Natalia will discover about herself and her mother that she never would have guessed and go beyond the Werewolf world. There may be a few detours but: she promised to destroy them, she promised to make them pay, and in the end, Natalia never breaks her promises. Ever.","description_hash":9124993966996447668},{"title":"King of the rats","fiction_id":"86739","link":"https:\/\/www.royalroad.com\/fiction\/86739\/king-of-the-rats","tags":["Progression","Villainous Lead","Strategy","Non-Human Lead","Strong Lead","Action","Adventure","Fantasy","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":50,"rating":4.35,"page_count":181,"view_count":8992,"chapters_count":34,"last_update":1718636529,"description":"A rat, that is what I am. Well, to be exact I'm a man rat. an abomination of untold proportions, a deviant to the beauty of mother nature. Born to inhabit the dirtiest of sewers and the deepest of holes. To hide away beneath the dirt only leaving to hunt down some of the weaker prey.  \nThat is the race I was born into. The weakest of the weak, a fetid and miserable group whose hatred for one another is only beaten by our immense dislike for Goblins. Those scummy little green trash.  \nBut, I am an outlier to this, an anomaly of sorts. For I was not born a brainless buffoon who can only feel hatred and hunger. I was born intelligent.","description_hash":-5649119463509779072},{"title":"Vagabond","fiction_id":"86738","link":"https:\/\/www.royalroad.com\/fiction\/86738\/vagabond","tags":["Progression","Wuxia","Multiple Lead Characters","Strong Lead","Tragedy","Action","Adventure","Fantasy","Martial Arts","Supernatural","Male Lead","Non-Human Lead","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":47,"view_count":138,"chapters_count":3,"last_update":1716369390,"description":"\"There's no paradise for you to escape to.\"\nIn the aftermath of The Convergence, where the underworld collided with the world of the living, humanity found itself on the brink of annihilation. The once vibrant Land of Ko was now the Demon Continent.At the threat of slavery from the Demons that emerged from the underworld, many have taken up contracts and made blood oaths with them, becoming known as The Hollow, beings with weightless souls similar to that of the demons.Amidst this despair, Miura, a warrior of the Umbral Order, faces a devastating betrayal by one he once called brother. This act shatters his resolve, plunging him into a dark abyss of doubt and vengeance.But as he continues on his quest for vengeance, a glimmer of hope shines through black ash.\n*****************************\nAll characters and events depicted in this narrative are fictitious. No disrespect or harm is intended towards any individual, community, or belief system. This story is crafted for the enjoyment of readers and is not based on any real-life events.","description_hash":-7596114140653905617},{"title":"The beginning","fiction_id":"86737","link":"https:\/\/www.royalroad.com\/fiction\/86737\/the-beginning","tags":["Comedy","Non-Human Lead","Slice of Life","Action","Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":0,"view_count":29,"chapters_count":1,"last_update":1715975755,"description":"the story of a sarcastic cat in another world and having fun and being a nuisance","description_hash":-8587485670104071140},{"title":"Sundered Lives, Umbralumara Chronicles Book 2","fiction_id":"86736","link":"https:\/\/www.royalroad.com\/fiction\/86736\/sundered-lives-umbralumara-chronicles-book-2","tags":["Space Opera","Sci-fi","Action","Adventure","Fantasy","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":2,"rating":5.0,"page_count":36,"view_count":475,"chapters_count":4,"last_update":1717785065,"description":"In a world where magic and technology intertwine, twelve-year-old Alden lives in the remote Veilwood Shroud forest. The Galactic Council has sent an ambassador to Alden's home world to restart the induction process that failed several decades ago, when a coup broke out on the planet. The murder of Alden's parents lead to unforeseen developments, placing Alden in a position to shape not just his home planet, but the course of the stars themselves.","description_hash":5367873963977781904},{"title":"Becoming an evil god in Cultivation World [Xianxia, Eldritch Horror]","fiction_id":"86735","link":"https:\/\/www.royalroad.com\/fiction\/86735\/becoming-an-evil-god-in-cultivation-world-xianxia","tags":["Villainous Lead","Xianxia","Male Lead","Adventure","Fantasy","Horror","Mystery","Martial Arts","High Fantasy"],"lable":"Original","following_count":8,"rating":3.5,"page_count":55,"view_count":2653,"chapters_count":15,"last_update":1716280646,"description":"Upon meeting an untimely demise, Rex transcends into a realm of immortal cultivation, reborn as Su Chen.\nIn a world where power reigns supreme, Su Chen's only path forward was to become the strongest.\nAfter many years,\nSeeing Su Chen before them, with numerous tentacles protruding from his body, eyeballs emerging randomly, and a dark, twisted aura, the many cultivators of the world were confused about whether such a being could be considered immortal.\nBut Su Chen sighed, \"I didn't know the system would turn me into such a thing.\"","description_hash":-7416977178999889786},{"title":"Entropy","fiction_id":"86734","link":"https:\/\/www.royalroad.com\/fiction\/86734\/entropy","tags":["Comedy","Action","Adventure","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":22,"view_count":50,"chapters_count":1,"last_update":1715968186,"description":"In the year 2000 A.D vampires revealed themselves to humans, they had been living in secret on earth since the year 33 A.D, Vampires come from a world called Discordia. They abandoned Discordia because of Eris Eden, one of the most evil and powerful vampires in history. She was defeated and her descendants were hunted down and exterminated, or so everyone thought.\nIt's the year 2024 and things have gotten bad, demons are appearing with more frequency and it seems a descendant of Eris has reappered, is she an ally to humanity? and if she is, what will she do to fight the forces of evil that are closing in on both Earth and Discordia?","description_hash":7862746922370889062},{"title":"The Echoes of The Mountains","fiction_id":"86733","link":"https:\/\/www.royalroad.com\/fiction\/86733\/the-echoes-of-the-mountains","tags":["Reincarnation","Strategy","Strong Lead","Tragedy","Drama","Action","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":76,"chapters_count":2,"last_update":1716263383,"description":"\"Echoes of the Mountains\" is a poignant tale set against the backdrop of the Swat Valley, a region renowned for its breathtaking beauty and turbulent history. This evocative novel by Qaisar Iqbal Yousafzai follows the intertwined lives of Ali and Aisha, two individuals brought together by fate amidst the chaos of the Tehreek-e-Taliban Pakistan (TTP) insurgency.\nAli, a young man deeply affected by the conflict that has ravaged his homeland, finds his path crossing with Aisha, a woman whose resilience and inner strength mirror the formidable peaks that stand sentinel over their valley. Together, they embark on a journey through a landscape marked by both natural splendor and the scars of war.\nAs Ali and Aisha navigate the treacherous terrain of loss and love, they discover solace and courage in each other's presence. Their relationship blossoms amidst the ruins, a testament to the enduring power of hope and the resilience of the human spirit. Through gunfire and displacement, their bond becomes a beacon of light in the darkest of times.\nThe narrative weaves through moments of heartache and hope, capturing the essence of a love that defies the ravages of conflict. With masterful prose, Yousafzai paints a vivid picture of the Swat Valley, where the mountains themselves bear witness to the trials and triumphs of its inhabitants.\n\"Echoes of the Mountains\" is a story that resonates with the enduring power of love and the indomitable human spirit. It is a reminder that even in the face of profound adversity, hope and love can flourish, echoing through the ages and inspiring all who encounter their tale.\nJoin Ali and Aisha on their journey through the majestic yet tumultuous Swat Valley, where their story of love and resilience will linger in your heart long after the final page is turned.","description_hash":4421725415432999684},{"title":"कहानी एक महान युद्ध की [Hindi]","fiction_id":"86732","link":"https:\/\/www.royalroad.com\/fiction\/86732\/hindi","tags":["Comedy","Drama","Adventure","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":29,"chapters_count":1,"last_update":1715964070,"description":"कहानी एक महान युद्ध की। \nएल्फर्ड, अब क्या किया तुमने? \nकुछ भी तो नहीं। म्यूजियम से कुछ उधार लिया है। गलती तो नहीं। \nआपने अपने आप को पुलिस के हवाले कर दो। \nयह तो ऐसा ही है, मैं आप इस सब में कैसे पड़ गया?\nएल्फर्ड, इस बार मैंने सच में कुछ नहीं किया है।","description_hash":5867433024147425171},{"title":"Inter-World Shift: An Office Worker Becomes an Adventurer's Daughter!","fiction_id":"86731","link":"https:\/\/www.royalroad.com\/fiction\/86731\/inter-world-shift-an-office-worker-becomes-an","tags":["Portal Fantasy \/ Isekai","Urban Fantasy","Progression","Comedy","Female Lead","Action","Adventure","Fantasy","Slice of Life","Magic"],"lable":"Original","following_count":3,"rating":0.0,"page_count":10,"view_count":200,"chapters_count":2,"last_update":1716100653,"description":"Sayko Ashcaster was your typical 30-something year old office worker in a mediocre job making just enough to pay the bills and keep her MMO subscriptions active.\nOne fateful day, she took a shortcut on the walk home from work and found herself the victim of a faulty gas leak explosion, resulting in her untimely death. As her soul was flung to an astral plane known as the Nether Void, a mysterious being there waited for her, reassuring her that the next life would be more fulfilling than the last.\nAfter asking her to make a singular wish of what she desires to find in the next life, she finds herself awakening in a strange new body, seemingly awakening from a cursed sleep. \nWill the new life she finds waiting be the do over she's always wanted!?","description_hash":1527233196593644436},{"title":"Last Fifty","fiction_id":"86730","link":"https:\/\/www.royalroad.com\/fiction\/86730\/last-fifty","tags":["Comedy","Multiple Lead Characters","Contemporary","Adventure","Mystery","Male Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":59,"chapters_count":1,"last_update":1715963016,"description":"Two brothers end up on a cross country race trying to track down their car.","description_hash":5459323159842061948},{"title":"Wanderer's Twilight","fiction_id":"86729","link":"https:\/\/www.royalroad.com\/fiction\/86729\/wanderers-twilight","tags":["Comedy","Male Lead","Action","Adventure","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":44,"chapters_count":1,"last_update":1715963010,"description":"In the twilight years of the universe, as the stars flicker and begin to fade into an eternal darkness, a lone wanderer embarks on his final journey across the cosmos. Having witnessed all that he cares for being swept away to the annals of time, not even a speck of dust remaining from his past, he has made his peace with the upcoming end. Finnian was born to a family of scholars on a planet long consumed by its star. His one lingering regret in life was that he had not been able to enjoy the little things more. He had toiled away for eons on his academic pursuits, but once he had time to reflect on things, he realized that it was all meaningless. As the tapestries of the cosmos began to gradually unravel, he knew that the meaning of life was not to embroil himself in studies but to enjoy the uniqueness of life and go on an adventure. With the universe itself dying, its secrets were slipping away into the void, forever beyond his reach so pursuing knowledge had no more merits anyways. Left with the remaining time he had left, he had decided to go on one final journey to enjoy the splendors the world had to offer. Although Finnian's age had long surpassed what any mortal could achieve, his mind was not entirely whole. Living for so long would inevitably impose bouts of madness on any person. Even the gods’, with their insurmountable lifespans, had long lost any rationality and were nothing more than mindless husks that sought destruction. The sliver of sanity that he had been able to keep in spite of his long journey was the only thing driving him now, with his desire for one last grand journey.","description_hash":2235366204337612066},{"title":"Nomads' Odyssey","fiction_id":"86728","link":"https:\/\/www.royalroad.com\/fiction\/86728\/nomads-odyssey","tags":["Male Lead","Adventure","Fantasy","Romance","Magic"],"lable":"Original","following_count":4,"rating":3.5,"page_count":33,"view_count":953,"chapters_count":9,"last_update":1716675447,"description":"FREE novel, set in a fantasy\/mythological age, our mc will carve out his legacy in a world of demigods, monsters, and empires. I encourage you to read the first five chapters before dropping the book. Feedback is appreciated.","description_hash":7477353067848824030},{"title":"Executors","fiction_id":"86727","link":"https:\/\/www.royalroad.com\/fiction\/86727\/executors","tags":["Urban Fantasy","Anti-Hero Lead","Super Heroes","War and Military","Psychological","Action","Romance","Tragedy","Supernatural","Female Lead","Strong Lead","Multiple Lead Characters","Magic","Strategy"],"lable":"Original","following_count":2,"rating":5.0,"page_count":82,"view_count":468,"chapters_count":6,"last_update":1718415968,"description":"Within the Public Security Intelligence Agency (PSIA) of Japan, there exists a secretive group of federally funded military assassins known as Executors. This organization's goal: Prevent the end of the world, and even the entire universe. Magic exists in public knowledge in the form of magical girls: Women and girls born with a strange genetic mutation that allows them to perform feats of impossibility through sheer force of will alone by exploiting a glitch in the universe's construction. These girls, when corrupted by overuse, threaten to bring an end to all life through their unconscious will. Seven is an Executor tasked with killing these girls and investigating the sudden appearance of a cult which wishes to bring about this end, and this is her story. Follow her as she uncovers the identity of the mysterious \"Iris of Death\" and learns the purpose of their existence.","description_hash":8227261150137174948},{"title":"Goblins, Gunpowder, and Getaway Carraiges","fiction_id":"86726","link":"https:\/\/www.royalroad.com\/fiction\/86726\/goblins-gunpowder-and-getaway-carraiges","tags":["Urban Fantasy","Comedy","Non-Human Lead","Adventure","Fantasy","Mystery","Supernatural","Male Lead","Magic"],"lable":"Original","following_count":2,"rating":0.0,"page_count":24,"view_count":92,"chapters_count":2,"last_update":1717564987,"description":"Up and coming goblin reported Gob Scugly stumbles into a story that could get him out of the newsboy role and onto the front page. Follow him through the streets and alleys of New Camelot as he competes with rival papers, avoids gangs, and chases rumors to learn the truth.","description_hash":-5681936008433141001},{"title":"Lv.1 Lich","fiction_id":"86725","link":"https:\/\/www.royalroad.com\/fiction\/86725\/lv1-lich","tags":["LitRPG","Reincarnation","Progression","Male Lead","Secret Identity","Adventure","Fantasy"],"lable":"Original","following_count":101,"rating":4.32,"page_count":163,"view_count":11497,"chapters_count":25,"last_update":1718619891,"description":"An all powerful Archmagus finds himself the victim of a successful assassination. In an attempt to flee before the magi have time to discover the birth of the first natural lich in over a thousand years he's spat out of an unstable portal with nothing but his bones and something calling itself the system staring him in the face.\nDon't miss the next great litrpg adventure...you know the rest.","description_hash":8063546812331569266},{"title":"Order in Chaos","fiction_id":"86724","link":"https:\/\/www.royalroad.com\/fiction\/86724\/order-in-chaos","tags":["Urban Fantasy","Villainous Lead","Super Heroes","Sci-fi","Action","Adventure"],"lable":"Original","following_count":5,"rating":0.0,"page_count":35,"view_count":597,"chapters_count":5,"last_update":1717727283,"description":"In a Seattle where the extraordinary is ordinary, people born with the xeno gene mutate under unique circumstances, creating a society where chaos and order coexist in a delicate balance.\n\nAlastor, a diligent worker who craves nothing more than to do his job well and live in peace, finds his world turned upside down when he loses his stable job. Desperate for employment, he takes a new position as a loan case worker, tasked with an almost impossible mission: helping Alexander Evercrest repay a staggering debt of seven million dollars.\n\nNavigating a city filled with mutated individuals, Alastor must leverage every ounce of his skill to manage this colossal debt while maintaining his own sanity. But as he delves deeper into Alexander’s complex world, he uncovers secrets that could destabilize the fragile order of their society. With every step, Alastor faces new challenges and threats that push him to the brink. Will he find a way to restore balance and achieve the peaceful life he yearns for, or will the chaos consume him?","description_hash":-8938570705714730814},{"title":"The Cloth and the Claws","fiction_id":"86723","link":"https:\/\/www.royalroad.com\/fiction\/86723\/the-cloth-and-the-claws","tags":["Progression","Female Lead","Action","Fantasy","Romance","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":37,"view_count":231,"chapters_count":5,"last_update":1716862801,"description":"Liena Morrigan was once a member of the Druidic Circle, an ancient order of Mages that drew their power from nature. After a civil war that destroyed her home and left her to be the only Druid left, she was taken prisoner and locked away for some time. Now a representative from the new rulership has come to offer her freedom, but at a price. She must find a way to cure a man of an apparently incurable disease. And not just any man. He is a Dragonkin, fierce half-human, half-dragon warriors that were the bulk of the forces fighting against her people in the revolution. Is her freedom worth healing someone who played a role in the loss of everything she loved? Is he as monsterous as she believes, or could he be different?","description_hash":-261564913398836541},{"title":"The Gate Of Shadows","fiction_id":"86722","link":"https:\/\/www.royalroad.com\/fiction\/86722\/the-gate-of-shadows","tags":["Time Travel","Anti-Hero Lead","Grimdark","Female Lead","Slice of Life","Action","Adventure","Fantasy","Romance","Magic","High Fantasy"],"lable":"Original","following_count":4,"rating":5.0,"page_count":251,"view_count":3479,"chapters_count":42,"last_update":1718553898,"description":"Society views witches as abominations and, as such, treats them that way. While on an errand for her coven, Lilith spies on a young Lycan boy playing with his friends, wistful for the life she could have had.\nIn a twist of fate, she reencounters him, and a relationship blossoms. But in a world that wants nothing to do with witches, will their relationship survive the stigma?\n\n-Shorter chapters for easier reading and a more polished version of my story-\n-I will update Sunday, Tuesday, Thursday, and Saturday. @ Art by Thorkell_40k","description_hash":-7387239050739888062},{"title":"The Wicked Stir","fiction_id":"86721","link":"https:\/\/www.royalroad.com\/fiction\/86721\/the-wicked-stir","tags":["Male Lead","Action","Adventure","Fantasy","Mystery","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":25,"view_count":108,"chapters_count":2,"last_update":1716577204,"description":"Henry Temple, a British veteran of both World War 1 and 2 hunts creatures in the United States in the 1950's. His partner is Jeremiah Creek who Henry saved a couple of years prior.\nThis world is filled with monsters from folklore from around the world, mythology of any religion or completely made up by me. Or, a combination of themes and characteristics from different sources and time periods.\nAt all cost, they will stop as many as they can to save as many people as possible. \n\n\nExpect:\n- A wide array of locations, creatures and side characters.\n- Many kinds of weapons with ammunition customized for the specific monster that is being fought for the situation they are in.\n- Vivid world and character building in detail.\n- Descriptive explanations of the creatures themselves and the weapons the hunters use. \nWarning: contains violence, gore, and harsh language.\nWill be posting more once or twice a week.","description_hash":-8591984449389006113},{"title":"The Land of Umbrellas","fiction_id":"86720","link":"https:\/\/www.royalroad.com\/fiction\/86720\/the-land-of-umbrellas","tags":["Comedy","Female Lead","Contemporary","Slice of Life","Romance","Short Story","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":101,"view_count":673,"chapters_count":15,"last_update":1718476654,"description":"Lindsay Thomas wanted to be an actress, but that mostly meant 'acting' like she had her life together. When she gets an opportunity to help one of her acting buddies renovate a hotel for the winter, she moves to Vancouver Island to get a fresh start in a place where it rains all the time and where umbrellas keep popping up to keep her dry.","description_hash":-1705914482279746456},{"title":"Aspect of Fear[litRPG\/Evolution\/Dungeon]","fiction_id":"86719","link":"https:\/\/www.royalroad.com\/fiction\/86719\/aspect-of-fearlitrpgevolutiondungeon","tags":["LitRPG","Urban Fantasy","Dungeon","Anti-Hero Lead","Male Lead","Action","Adventure","Fantasy","Tragedy","School Life","Supernatural","Strong Lead","Secret Identity","Magic","GameLit","Mythos","Villainous Lead"],"lable":"Original","following_count":8,"rating":0.0,"page_count":24,"view_count":577,"chapters_count":6,"last_update":1717177760,"description":"A good physique? A handsome face? A loving family? A school full of friends? Or talent in magic?\nDante had none of these. Life was a nightmare for him, and the idea of suicide came to his mind every day. But Dante did not do it; if he committed suicide, he would have proven the others right.\nDante continued to live. A quick decision to take a job transporting dungeon stones was going to change his life a lot... Dante was now in the midst of a war. A war with ancient demons and great gods.\n--------\nWhat to expect?\n- A lone main character.- A villainous main character.- A two-faced main character.- Great gods and ancient demons.- An endless tower and dungeons.- A ruthless and indifferent main character.- Plenty of blood and brutality.- A main character hiding his power. (He hides it because he would be killed otherwise.)- As English is not my native language, you may encounter many grammatical errors. Although I try to minimize them with artificial intelligence, there will still be grammatical errors.","description_hash":2961528857923738728},{"title":"Tales from the Earthen Sky","fiction_id":"86718","link":"https:\/\/www.royalroad.com\/fiction\/86718\/tales-from-the-earthen-sky","tags":["Progression","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":100,"view_count":330,"chapters_count":9,"last_update":1718402433,"description":"I hope you like to fly, because everyone else here in the great sky can. There are many tribes and races, each with some manner of wings to enable flight, and they dwell on the islands scattered about from east to west, north to south. Above all stretches the infinite Earth; below, the endless and impassable cloud barrier. The storms within those clouds hold only death, but as for the forbidden earthen sky—known simply as the Earth—who is to say except the Magnates, those who have been there and back? They braved the terrors within its cavernous expanses and beheld its wonders, supposedly achieving the legendary enlightenment and power held therein. But they keep their lips well sealed.\nSolis, a youth of the Tapiq tribe, intends to find out for himself, to be the first in decades to pierce the mysteries held in the Earth and discover what the Magnates want to hide from everyone.\nNew chapters released Fridays.","description_hash":-3444035166174411437},{"title":"Who would imagine","fiction_id":"86717","link":"https:\/\/www.royalroad.com\/fiction\/86717\/who-would-imagine","tags":["Urban Fantasy","Progression","Multiple Lead Characters","Slice of Life","Drama","Fantasy","Historical","Romance","Supernatural","Male Lead","Low Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":160,"view_count":472,"chapters_count":12,"last_update":1718548235,"description":"[Slow Burn, BL, Vampire, Fantasy]Beloved,\nThough these words may reach you beyond the veil of existence, know that my heart speaks to yours with every stroke of the pen. In this moment of reflection, I am filled with gratitude for the joy and warmth you have brought into my life. As a son, a friend, a rival, or a lover, each of you has left an indelible mark upon my soul.\nIf the tapestry of fate should weave our paths anew in another life, let it be known that I eagerly await our reunion. May the threads of destiny guide you back to me, wherever I may be.\nWith enduring love,Velor","description_hash":-3406163647916635301},{"title":"High Guardian Spice ","fiction_id":"86716","link":"https:\/\/www.royalroad.com\/fiction\/86716\/high-guardian-spice","tags":["Female Lead","Slice of Life","Drama","Action","Adventure","Fantasy","Gender Bender","School Life","Magic","Low Fantasy"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":4,"view_count":48,"chapters_count":1,"last_update":1715933943,"description":"Rosemary, a young aspiring knight, in order to achieve her dreams joins High Guardian academy. Along the journey, where will her fate take her?","description_hash":2675438749242527893},{"title":"Dragon Spire","fiction_id":"86715","link":"https:\/\/www.royalroad.com\/fiction\/86715\/dragon-spire","tags":["Multiple Lead Characters","Action","Fantasy","Mystery","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":5,"rating":4.86,"page_count":66,"view_count":500,"chapters_count":5,"last_update":1718400684,"description":"People have fled the surface and live above the clouds on what is called 'spires' by the grace of almighty dragons.\nDahlia lives a peaceful life as an outcast, a bearer of cursed blood. Helen leads a life of privilege as the scion of ruling class and a fighting prodigy.\nJoin them on a journey to overcome their fears and doubts as they try to navigate a messy world of curses and ancient magics.","description_hash":-7221482037530587966},{"title":"The Song of the Marked","fiction_id":"86714","link":"https:\/\/www.royalroad.com\/fiction\/86714\/the-song-of-the-marked","tags":["Anti-Hero Lead","Non-Human Lead","Adventure","Fantasy","Romance","Female Lead","High Fantasy","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":3,"view_count":35,"chapters_count":1,"last_update":1715914863,"description":"Luna, once intrigued by pirates, despises them after losing her sister. While sinking a pirate ship, she's captivated by Everett, a pirate. Forbidden love ensues, but Luna can't help her feelings. A casual and captivating tale of love and pirates unfolds, challenging Luna's beliefs.","description_hash":1528901370865475896},{"title":"Luck of the Draw","fiction_id":"86713","link":"https:\/\/www.royalroad.com\/fiction\/86713\/luck-of-the-draw","tags":["Progression","Anti-Hero Lead","Space Opera","War and Military","Male Lead","Action","Adventure","Fantasy","Sci-fi","Slice of Life","Secret Identity","High Fantasy","First Contact","Hard Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":9,"view_count":72,"chapters_count":2,"last_update":1716757262,"description":"In a world where luck is determined by genetics, Thomas, an unlucky individual, discovers a true friend who embraces him. Just as hope begins to fade due to a falling out, an unexpected alien invasion occurs, leading Thomas to make a daring and life-altering choice. Brace yourself for an extraordinary journey!","description_hash":-6171113904315142306},{"title":"Yak Laughter","fiction_id":"86712","link":"https:\/\/www.royalroad.com\/fiction\/86712\/yak-laughter","tags":["Psychological","Drama","Fantasy"],"lable":"Original","following_count":6,"rating":4.83,"page_count":38,"view_count":341,"chapters_count":3,"last_update":1717790165,"description":"Ez thought parenting was difficult enough before her son became a wizard. Now she must assimilate into a secret magical society, battle monsters without any special powers of her own, and unravel the mystery behind the murder of the man she loved—all while trying to raise a seven-year-old.\n\n*No fixed posting schedule. I'm writing as much as possible while working full-time.*","description_hash":-7651123637783055216},{"title":"Once Upon A Siren's Curse","fiction_id":"86711","link":"https:\/\/www.royalroad.com\/fiction\/86711\/once-upon-a-sirens-curse","tags":["Female Lead","Tragedy","Fantasy","Short Story","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":2,"view_count":51,"chapters_count":1,"last_update":1715912531,"description":"A fairytale-inspired short story that returns to the roots of fairy tales.","description_hash":5318519191548006859},{"title":"Witchblade Chronicles: Book One","fiction_id":"86710","link":"https:\/\/www.royalroad.com\/fiction\/86710\/witchblade-chronicles-book-one","tags":["LitRPG","Urban Fantasy","Dungeon","Male Lead","Contemporary","Action","Adventure","Fantasy","School Life","Strong Lead","Magic"],"lable":"Original","following_count":7,"rating":0.0,"page_count":123,"view_count":861,"chapters_count":9,"last_update":1716781173,"description":"Nico Zhong's life is turned upside down when he awakens as a player, an individual a part of a worldwide phenomenon. Now, he is launched into a brand new world as a Witchblade, a unique physical-type offense-oriented class while starting his first year of university. Soon, Nico becomes entangled within the player world and begins discovering what his new reality truly entails.","description_hash":-8775894366790277280},{"title":"Bucking The Trend (Book 1 The Adventures of Howard Buckley)","fiction_id":"86709","link":"https:\/\/www.royalroad.com\/fiction\/86709\/bucking-the-trend-book-1-the-adventures-of-howard","tags":["LitRPG","Progression","Multiple Lead Characters","Action","Adventure","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":7,"rating":5.0,"page_count":36,"view_count":537,"chapters_count":5,"last_update":1718588493,"description":"After a night of heavy drinking with a strange old man wearing a ridiculous top hat, Howard \"Buck\" Buckley finds himself in a strange world where myth and magic are real. He must get strong quickly in order to survive and find out why he was brought here. Along the way he will find out that magic is real, dragons exist, and there is much more to him than he ever knew. \nThe release schedule is set for once per week on Sunday. I may drop more sooner if can.","description_hash":-8697057761795635379},{"title":"Sweet Echoes of Darkness","fiction_id":"86708","link":"https:\/\/www.royalroad.com\/fiction\/86708\/sweet-echoes-of-darkness","tags":["Non-Human Lead","Romance","Mystery","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":63,"chapters_count":1,"last_update":1715911210,"description":"Vivian Everhart, 20 years old. Moved out of her parent's house, in an attempt to get her life back in her hands, after all the abuse she went through.\nInspired by her love of art, she moves to a city full of history after finding a job at a museum. Everything seems to be going well. This is until the body of a child is found not too far away from her new home.\nThe residents seem to know what happened but refuse to utter a word, there is something weird in the air, something abnormal.\nBefore she knows it, her curiosity is reciprocated by the culprit of the murder who slowly starts to obsess over her.","description_hash":-5670509980099801144},{"title":"HP: Necromancer's Legacy [Censored]","fiction_id":"86707","link":"https:\/\/www.royalroad.com\/fiction\/86707\/hp-necromancers-legacy-censored","tags":["Reincarnation","Time Loop","Anti-Hero Lead","Male Lead","Slice of Life","Action","Adventure","Fantasy","Horror","Harem","Supernatural","Strong Lead","Magic"],"lable":"Fan Fiction","following_count":8,"rating":2.67,"page_count":76,"view_count":1528,"chapters_count":13,"last_update":1718127949,"description":"Ryan Lance died an untimely death all thanks to his bad luck and was given a chance to be reborn in another world. He chose the world of magic. However, his bad luck seems to have followed him to the next world and he woke up in the worst place in Harry Potter world, Azkaban.\nEndless torture...\nA voice in his head, claims to be him from the future... The whispers and promise of power beyond anything this world has ever seen. The power of Necromancy. Although Necromancy isn't new to the wizarding world, it's a failed area of magic that no one ever truly mastered.\nFollow Ryan's journey as he masters his newfound abilities to prepare for his revenge quest, but things soon got complicated when trouble comes knocking on his door. The beginning of the First Wizarding War...\n----[I don't own Harry Potter except for my own OC.][Cover pic isn't mine. Found it on Pinterest. I will remove it if the owner wants it gone, but give proof.]----\nI'm also posting this on Webnovel and Scribblehub","description_hash":4355757863829467551},{"title":"Resonance Chronicles","fiction_id":"86706","link":"https:\/\/www.royalroad.com\/fiction\/86706\/resonance-chronicles","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Adventure","Fantasy","Mystery","Supernatural","Magic"],"lable":"Original","following_count":2,"rating":0.0,"page_count":8,"view_count":127,"chapters_count":2,"last_update":1716028966,"description":"Waking up in a strange world isn't enough for Martin Lindberg, no, no, no, he had to wake up in the middle of bloody nowhere in the naked body of a woman his own age surrounded by robed figures with nebulous intent.\nI am writing this (my first) story for fun, so read it if you want and give some notes or a review if you have the time.\nMy email if you want to come in contact with me regarding anything: [email protected]","description_hash":890005740893478289},{"title":"Timothy's Demon","fiction_id":"86705","link":"https:\/\/www.royalroad.com\/fiction\/86705\/timothys-demon","tags":["Urban Fantasy","Super Heroes","Male Lead","Sci-fi","Fantasy","Cyberpunk","Supernatural","Magic"],"lable":"Original","following_count":21,"rating":4.81,"page_count":350,"view_count":5092,"chapters_count":33,"last_update":1718564405,"description":"Hero or Villain?\nCould you resist a 600-year-old succubus and turn yourself into a hero? First step, turn down everything you ever wanted.\nIn 1352, Xavier Kovach made a deal with the devil. He sold his soul and the souls of his children for a book of magic secrets and the love of a demon concubine.\n Now it's 2058, and Tim Kovak has just inherited the book, the magic, and the girl. He's got six weeks to turn himself into a villain or a hero, with no choices left in between.\n Tim's got to get with the program and start training to be a supervillain or get ready to fight off an army of demons, armed with nothing but his sense of humor... and a fork.\n\nHi everybody, I'm different from most authors on Royal Road because I'm doing this backwards. My book is complete but I'm struggling to get it in front of the right audience, so I'm going to post it here a chapter at a time at a fast pace, then I'll go straight into the second one and the third one and so on until the whole series is done.\nI'll be posting a chapter a day, each day at 2 p.m. Central time.\nIf you want to skip ahead and read the whole book at once you can buy it here: https:\/\/www.amazon.com\/dp\/B0CVDSCB9S\/\nThe important thing is to get these books in front of young men who are going through what I went through, young men who feel like they've kind of stalled out in their 20s and feel like the world is against them.\nIf I can get these guys to laugh a little and stick up for themselves, I'll consider the whole thing a success, even if I never make a dime.\nYou guys know how this works. A sincere review is worth more than any money, so please comment and share your feedback with me.\nAnd if you see plot holes or anything confusing in my story, I really need to know, although hopefully any questions raised in the first part of the book will be answered in stuff I have planned for later.","description_hash":7231455172640692129},{"title":"Happy Mask; A Poetry Book","fiction_id":"86704","link":"https:\/\/www.royalroad.com\/fiction\/86704\/happy-mask-a-poetry-book","tags":["Drama"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":33,"chapters_count":1,"last_update":1715910476,"description":"Some quick poetry i've been working on.","description_hash":7634051149734980485},{"title":"Hadean World(Dropped)","fiction_id":"86703","link":"https:\/\/www.royalroad.com\/fiction\/86703\/hadean-worlddropped","tags":["Anti-Hero Lead","Xianxia","Comedy","Male Lead","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":120,"view_count":1054,"chapters_count":14,"last_update":1716794975,"description":"Millions of men and women across the world awaken one day with a mysterious countdown on their hands. Its purpose remains a secret, known only to the enigmatic being that bestowed it upon them.\nAce, born under a harsh communist dictatorship, is suddenly thrust into an alien world teeming with unimaginable monsters and beasts. Towering creatures larger than houses that can outrun sports cars, and insects that do far more than make one's skin crawl. Even the grass is dangerous if touched the wrong way. But is survival the only challenge in this perilous realm? Why were Ace and millions of others brought here? And if they manage to return, will their governments allow them to reintegrate into society?\nJoin Ace on his epic quest to gain enough power so that he has to bow to no one and uncover the secret to the world he will eventually call home.","description_hash":543817339806391896},{"title":"Forbidden Humanity","fiction_id":"86702","link":"https:\/\/www.royalroad.com\/fiction\/86702\/forbidden-humanity","tags":["Sci-fi"],"lable":"Original","following_count":3,"rating":0.0,"page_count":83,"view_count":1030,"chapters_count":13,"last_update":1716005987,"description":"Science fiction written for \"HFY\" with an emphasis on the awesomeness of humanity.\nAlien attorneys, mech knights, battles with the forces of nature, journeys of discovery, surviving the dark forest, human hilarities and more.\nThe most insane collection of science fiction stories ever written.","description_hash":-4364611583484358920},{"title":"Phantom Samsara: Path of Yaksha","fiction_id":"86701","link":"https:\/\/www.royalroad.com\/fiction\/86701\/phantom-samsara-path-of-yaksha","tags":["Progression","Anti-Hero Lead","Psychological","Multiple Lead Characters","Drama","Action","Adventure","Supernatural","Male Lead","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":798,"view_count":1552,"chapters_count":34,"last_update":1718293516,"description":"Kayana Sahanaya Tirta or known as Kohaku always wanted to live in a simple life, he knows nothing about Phantom Beasts so does the Phantom Samsara. As an Indonesian college student in Warmadewata University is relaxing, being one of the top universities under the Nirvana Organization that operates in all regions of Indonesia and sanctioned by the United Nations. When he met a certain someone, he was getting wary due to his actions in getting rid of the Phantom Beasts... and soon becoming his friend until his fate changed when he discovered the existence of Phantom Beasts in this world.","description_hash":6280919046737512118},{"title":"Crimson Loop","fiction_id":"86700","link":"https:\/\/www.royalroad.com\/fiction\/86700\/crimson-loop","tags":["Reincarnation","Time Loop","Progression","Anti-Hero Lead","Grimdark","Drama","Fantasy","Psychological","Tragedy","Male Lead","Low Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":15,"view_count":180,"chapters_count":3,"last_update":1715967941,"description":"A Grimdark psychological tragedy set to time-loop isekai reincarnation music. Expect a tragic take on isekai tropes, with a focus on world building, psychology, and gritty realism.","description_hash":1129205904129648781},{"title":"Looks like you found this, Eh?","fiction_id":"86699","link":"https:\/\/www.royalroad.com\/fiction\/86699\/looks-like-you-found-this-eh","tags":["Urban Fantasy","Anti-Hero Lead","Non-Human Lead","Slice of Life","Strong Lead","Action","Adventure","Fantasy","Supernatural","Male Lead","Magic","High Fantasy","Mythos","Soft Sci-fi"],"lable":"Original","following_count":2,"rating":0.0,"page_count":20,"view_count":135,"chapters_count":2,"last_update":1716676133,"description":"Course, that's what I wanted. This things got basically my whole story in it, and you better bet it's wild.(UNFINISHED)","description_hash":7461206045846986797},{"title":"High School as a Hedge Witch","fiction_id":"86698","link":"https:\/\/www.royalroad.com\/fiction\/86698\/high-school-as-a-hedge-witch","tags":["Urban Fantasy","Progression","Super Heroes","Female Lead","Sci-fi","Action","Adventure","Romance","School Life","Magic","Low Fantasy","Soft Sci-fi"],"lable":"Original","following_count":31,"rating":4.83,"page_count":51,"view_count":2408,"chapters_count":9,"last_update":1717980678,"description":"Meet Vilde. Your average 17-year-old failed athlete who happens to reside in a world of superheroes, villains, and monsters. Up to now, she was perfectly happy with her normal problems, like getting her crush to like her back, not failing her classes, and permanent knee damage from a sports injury. However, she is now forced to deal with magical problems, like glowing eyes, accidentally hexing her bully, and rampaging monsters.\nAre these new powers going to be a life-changing boon for her, like most people think of superpowers, or will they shatter whatever normalcy she has left? Come along with her as she tries to figure out her new abilities and adapt to her new place in the world.\n\nWhat to expect:\n - 1500 plus word chapters 1-3 times per week (scheduled releases WIP) - Multilingual Swearing - LGBTQIA+ and Disabled Cast - OTP Romance - Superheroes killing monsters and beating up villains - Lovable Wierdos - Slowly discovering and mastering powers - Possibly, but not necessarily, etcetera","description_hash":4409825593734383151},{"title":"No Way Out (NWO)","fiction_id":"86697","link":"https:\/\/www.royalroad.com\/fiction\/86697\/no-way-out-nwo","tags":["Action","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Mane, the protagonist of this short story is stuck in the maze. He believes he can become the only man in history to escape the Matrix...","description_hash":9186305292078929584},{"title":"The fallen will rise","fiction_id":"86696","link":"https:\/\/www.royalroad.com\/fiction\/86696\/the-fallen-will-rise","tags":["War and Military","Male Lead","Sci-fi","Action","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":18,"view_count":224,"chapters_count":5,"last_update":1716091568,"description":"1,138 years into the future, humanity has experience significant overpopulation which lead to the decrease of livelihood. In order for humanity to progress, the ones from above enslaved the ones below.\nAamon Solevia, a slave from the kingdom of Solevia, witness the tragic death of his mother, best friend and his people at the cruel hands of the kingdom. He vows to take his revenge and change this corrupt kingdom by challenging the king and taking his throne to restore peace and balance into the world. \nIn doing so, our protagonist embarks on many journeys, battles and many events.","description_hash":-2221683106645527705},{"title":"The Main Character is a Good Person","fiction_id":"86695","link":"https:\/\/www.royalroad.com\/fiction\/86695\/the-main-character-is-a-good-person","tags":["Reincarnation","Super Heroes","Ruling Class","Grimdark","Psychological","Action","Drama","Fantasy","School Life","Supernatural","Male Lead","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":5,"view_count":54,"chapters_count":1,"last_update":1715899596,"description":"Daniel Wellstone, an about-to-be college freshman, suddenly remembered his short previous life. Realizing that he had been a depressed, socially awkward nerd in both of his lives, he decided to try his best to become one of the otherworldly beings called extroverts.... or to be 'adopted' by one of them.\nHowever, realizing that this world had superpowers had never been a part of his plans, though it was still doable.\nGetting a system was also somewhat expected.\nBut Daniel was most definitely not a Murderer.\n[System Initiated: Neutralize the given targets] \n[Personaliy: Extreme Evil]\n'???'\n..... He wasn't evil either.","description_hash":8352804955426139781},{"title":"Royal Road of the Cross: A Trial by Fire","fiction_id":"86694","link":"https:\/\/www.royalroad.com\/fiction\/86694\/royal-road-of-the-cross-a-trial-by-fire","tags":["Progression","Female Lead","Adventure","Fantasy","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":5,"rating":4.25,"page_count":241,"view_count":1577,"chapters_count":31,"last_update":1718393404,"description":"Lucullus has always been a simple man. His only desires in life were to take care of his mother, and to maintain his family's farm. But the mysterious circumstances surrounding the death of his close friend changed his life forever.\nIn his attempt to bring his friend's murderer to justice, he attracts the attention of a conspiracy that controls his homeland of Lucium from the shadows. It is through a bitter betrayal that he is captured, and is branded a criminal. Just when all hope is lost, he is given a second chance to expose and end the conspiracy. He is sent on a quest to travel the known world and do whatever it takes to rescue the King's last remaining heir.\nAlong the way, he befriends many strange people, and learns of the dark past of the conspiracy. Guided by a mysterious spirit, he discovers truth in the midst of a spiritual desert, risking life and limb to free not just Lucium, but the whole world from the powers of darkness.\n\nNew chapters Monday through Friday.","description_hash":3159498055091921298},{"title":"Burning The Banner","fiction_id":"86693","link":"https:\/\/www.royalroad.com\/fiction\/86693\/burning-the-banner","tags":["Anti-Hero Lead","War and Military","Male Lead","Sci-fi","Strong Lead","Action","Horror","Mystery","Supernatural","Villainous Lead","Ruling Class","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":40,"chapters_count":1,"last_update":1715899316,"description":"The year 1800 IC rolls around,\nWhat wil Idanno witness?\nPerhaps, the fall of an empire? Well, worry not, for the Banner will be burnt. The throne destroyed.\nThe colours smothered.\n\nNote: Author is a student, I don't get that much free time. So, don't expect too large chapters, something like 700-1600 or, 1500 words.","description_hash":8157293957278415187},{"title":"Demon Hunter : A Fantasy Game World (LitRPG) ","fiction_id":"86691","link":"https:\/\/www.royalroad.com\/fiction\/86691\/demon-hunter-a-fantasy-game-world-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Male Lead","Adventure","Fantasy","Magic"],"lable":"Original","following_count":1,"rating":3.0,"page_count":36,"view_count":553,"chapters_count":7,"last_update":1716386187,"description":"Kane was just an ordinary man, yet fate seemed to have destined him to be a savior.\"Hold on, you're saying aliens are going to invade Earth in six years?\"When his future self found him, everything changed. As one of the twelve chosen candidates, Kane has been selected. He would venture to 'The Land of Korlos' for a fantastical adventure, which is a matter of life and death for humanity.With the aliens' technology far superior to humans, what course will the struggling mankind take?Is it a gamble, a desperate resistance? Or a scramble to 'The Land of Korlos' for temporary refuge?Can Kane, who shoulders such a heavy responsibility, ultimately succeed?","description_hash":1005937369169023863},{"title":"Well-Oiled Machine","fiction_id":"86690","link":"https:\/\/www.royalroad.com\/fiction\/86690\/well-oiled-machine","tags":["Post Apocalyptic","Multiple Lead Characters","Sci-fi","Adventure","Soft Sci-fi"],"lable":"Original","following_count":2,"rating":0.0,"page_count":0,"view_count":77,"chapters_count":1,"last_update":1715899297,"description":"C-28 was not supposed to survive the end of the world.\nC-28 was not supposed to be restored.\nAnd, most of all, C-28 was not supposed to name itself. \nCharlie is an android. He is currently searching for his creator-- whom he is only sure exists through fragments of memory that managed to remain intact. Joined by \"Doc\", a strange mechanic that saved him from the brink of an electronic death, he'll have to navigate an uncaring planet’s smoldering remains. He’ll try his best to recall the mysteries of his past, and survive the mysteries of the present. \nAfter the world's credits roll, is there still time to tie up what loose ends still linger?\nThere’s a home for everyone– but, sometimes, not in the places we expect. In this skeleton of a planet, is there still a single safe zone left?\n\nheyo heyo hey! blue_monday here! this will be a passion project i update every so often (when i feel like it)! hope you folks enjoy this weird sci-fi adventure nonsense i thought of at 2 am!! :33","description_hash":194793967796451667},{"title":"Evil Deeds","fiction_id":"86689","link":"https:\/\/www.royalroad.com\/fiction\/86689\/evil-deeds","tags":["GameLit","Progression","Grimdark","Male Lead","Tragedy","Action","Fantasy","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":140,"view_count":780,"chapters_count":18,"last_update":1718596694,"description":"In the year 373, the final battle between Rezhura, the August Leader of the Sacred Selection Guild (the number one guild in the entire domain), and his Royal Squad versus King Mauro, the ruler of the Darklords, dictated the fate of Arramaya's land. However, no one ever knew about the final battle except the other top guild leaders. The speculation across the domain is that Rezhura and his squad halfway succeeded in killing Mauro, but due to an unknown reason, they were forced to retreat and left King Mauro's place.\nIn the exact same year, Kyren found himself by the riverside without any memory of the past. Luckily, he met a very kind and helpful person named Hiro. They got along and helped each other; Hiro helped Kyren regain his memory, while Kyren helped Hiro achieve his dream of becoming part of the Sacred Selection Guild.\nKyren and Hiro take on a journey to become warriors and climb to the top. However, each step revealed how their optimistic outlook unfolded the truth about their sinister world.\n--\nED3 Book 1: \"Tales of the Perfect Knight\" features two main characters. Rezhura is a renowned hero of the world who fights against evildoers and breaks all evil deeds to cleanse their evil domain. He has everything, especially his trustworthy Royal Squad consisting of six godly individuals. In contrast, Kyren is the opposite of all this; he has nothing, including his memories from the past.\n\nNew chapters are released every Monday and Thursday.\nP.S.: This story consists of three books so far, but they are in my native language. I have used some translation tools to translate as quickly as possible, so please comment with suggestions for improvement.","description_hash":7816139923806722917},{"title":"THE Awakening : cassie and Elias unvail the mystery of the verdant key","fiction_id":"86688","link":"https:\/\/www.royalroad.com\/fiction\/86688\/the-awakening-cassie-and-elias-unvail-the-mystery","tags":["Action","Adventure","Mystery","Supernatural","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":201,"chapters_count":5,"last_update":1716055251,"description":"\"Cassie and Elias\" follows the adventures of two young adventurers, Cassie and Elias, as they embark on a quest to find the legendary Verdant Key, a mystical artifact said to hold the power to heal the land and bring prosperity to their village, Lange. Along the way, they encounter various challenges, including treacherous terrain, cunning adversaries, and ancient mysteries. As they journey together, Cassie and Elias forge a deep bond and discover the true meaning of friendship, courage, and perseverance. Through their trials and triumphs, they ultimately uncover the secrets of the Verdant Key and learn valuable lessons about themselves and the world around them.","description_hash":3348492204750574823},{"title":"Crónicas de Korinsei [Español]","fiction_id":"86687","link":"https:\/\/www.royalroad.com\/fiction\/86687\/cronicas-de-korinsei-espanol","tags":["Anti-Hero Lead","Ruling Class","Female Lead","Strong Lead","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":118,"view_count":718,"chapters_count":20,"last_update":1717188350,"description":"Hace mil años, el Rey Demonio Oni conquistó el imperio de Korinsei tras derrotar al emperador. Desde entonces, esas tierras son gobernadas por los hijos de Oni, demonios que luchan entre ellos para hacerse con el poder mediante la fuerza y el engaño.\n Ahora, una sospechosa huida del palacio le dará una oportunidad a Kiyoni, una de las princesas oni, para demostrar su potencial ante su padre y ascender en el poder. ¿Tomará el poder mediante la fuerza, o buscará liberar el imperio de la opresión del rey demonio?\nHistoria basada en una partida de rol ya finalizada, actualizaciones semanales.","description_hash":4672931228211659289},{"title":"I was reincarnated by being summoned ","fiction_id":"86686","link":"https:\/\/www.royalroad.com\/fiction\/86686\/i-was-reincarnated-by-being-summoned","tags":["Portal Fantasy \/ Isekai","Dungeon","Male Lead","Harem","Action","Adventure","Fantasy","Romance","Reincarnation"],"lable":"Original","following_count":3,"rating":0.0,"page_count":55,"view_count":542,"chapters_count":8,"last_update":1718424080,"description":"Will you believe I was reincarnated and summoned!? Or was I summoned after reincarnation, or reincarnated after being summoned? I don't know, as I, experienced both, this is my journey on how I came to my place, but in the future, and transported to an unknown land","description_hash":5019051746700167760},{"title":"Philosophy of a blade","fiction_id":"86685","link":"https:\/\/www.royalroad.com\/fiction\/86685\/philosophy-of-a-blade","tags":["Martial Arts","Psychological","Multiple Lead Characters","Strong Lead","Action","Fantasy","Female Lead","Magic","Low Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":24,"chapters_count":1,"last_update":1715898941,"description":"Nothing much for now i need to get to at least 15 chapters before i put a sypnosis\nSo imma just fill this up with 50 words no one really gives a flying dookie about. Do you know christopher moore invented the words flying dookie? He’s a crazy ass author","description_hash":-4358197245428999245},{"title":"The Leviathan’s Wake","fiction_id":"86683","link":"https:\/\/www.royalroad.com\/fiction\/86683\/the-leviathans-wake","tags":["LitRPG","Reincarnation","Non-Human Lead","Sci-fi","Action","Adventure","Fantasy","GameLit"],"lable":"Original","following_count":7,"rating":5.0,"page_count":5,"view_count":118,"chapters_count":1,"last_update":1715898759,"description":"In a world where technology has stagnated due to the reliance on magic, a core stone is born with knowledge on otherworldly warships. Within this coastal dungeon, a modern battleship is created—an imposing form of unknown technology and devastating prowess. The OCS (Ocean Core Ship) Leviathan, known as The Beast Made of Steel, surrounds the core, its hull plated with reinforced steel and thundering with sky rending cannons. This is but the start of The Leviathan's Wake, the first of the realms protectors.\n\nCover Art Photography Reference:\nNH Series, NH 80000, NH 80562, Naval History and Heritage Command","description_hash":6466680988230826480},{"title":"Solitary Monster and Fearless Hero","fiction_id":"86681","link":"https:\/\/www.royalroad.com\/fiction\/86681\/solitary-monster-and-fearless-hero","tags":["Reincarnation","Urban Fantasy","Dungeon","Psychological","Multiple Lead Characters","Adventure","Drama","Fantasy","Slice of Life","Male Lead","Female Lead","Non-Human Lead","Secret Identity","Magic","High Fantasy","Progression"],"lable":"Original","following_count":8,"rating":5.0,"page_count":138,"view_count":1604,"chapters_count":15,"last_update":1718321142,"description":"Karth Gian, an experienced adventurer and candidate to become the nation's hero, fell into the lower levels of a dungeon that have not yet been fully explored. Rendered unable to fight, he is rescued by a unique monster and brought back to health.Even though the monster, Alice, wants nothing to do with the people who live outside the dungeon, she is brought out against her will, due to the interests of a group of adventurers. She is placed under the care of Karth and his sister, Leina, as they educate her on the world and slowly ease her into society.However, Alice holds secrets close to her chest, ones that she's afraid to let out, no matter how much the people may grow to trust her.","description_hash":697675541800431132},{"title":"A Fable Of A Faraway Land","fiction_id":"86680","link":"https:\/\/www.royalroad.com\/fiction\/86680\/a-fable-of-a-faraway-land","tags":["War and Military","Martial Arts","Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","Magic","Strategy","High Fantasy","Ruling Class"],"lable":"Original","following_count":1,"rating":4.5,"page_count":26,"view_count":714,"chapters_count":6,"last_update":1718561035,"description":"\"De Omaros, De Marinos  [To Live, To Die] \" - Roberto De Medici (Speaking in Old Tongue)","description_hash":-899596375447415343},{"title":"Where The Tempest Breaks","fiction_id":"86679","link":"https:\/\/www.royalroad.com\/fiction\/86679\/where-the-tempest-breaks","tags":["Progression","Male Lead","Strong Lead","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":5,"rating":5.0,"page_count":62,"view_count":626,"chapters_count":6,"last_update":1718319492,"description":"Tucked away on a small island, just off the southeastern shores of Arta, Wellynd, a seventeen-year-old boy, works as a skald smuggler for his Uncle. But, for Wellynd, delivering the mysterious and explosive ore to criminals on the mainland was far from the future he’d envisioned.\nHaving failed the entrance examination into the Observatory, a prestigious organisation where disciples train to unlock the arcane secrets of the Koshai, Wellynd must find a new purpose under the active occupation of an invading military and growing political tensions.\nTo carve out his own path, and discover his own power, Wellynd must overcome his peculiar limitations and unlock the mysteries of the Koshai himself.","description_hash":-3672287322388779656},{"title":"FALLEN STATES | Cosmic Horror Apocalypse LitRPG","fiction_id":"86678","link":"https:\/\/www.royalroad.com\/fiction\/86678\/fallen-states-cosmic-horror-apocalypse-litrpg","tags":["LitRPG","Urban Fantasy","Progression","Post Apocalyptic","Male Lead","Action","Adventure","Horror","Supernatural","GameLit","Soft Sci-fi"],"lable":"Original","following_count":39,"rating":4.7,"page_count":111,"view_count":3645,"chapters_count":15,"last_update":1717827442,"description":"The world fell a long time ago. Forcing any living humans to connect to a Cosmic Horror known as the Trinity in order to have a chance to survive. It's been twenty years since then and now those born into this world train their whole lives to prepare for their Unlocking. Then comes the Trial. For Warden Pierce the Trial came four days after his sixteenth birthday. Can Ward complete the Trial? What Class Pathway will he choose? And is he ready to fight the madness of the Fallen States?\nWhat to expect?\n- Linear Progression with a strong focus on loot customization\n- Simple yet In-Depth Class Pathways\n- Strong emphasis on Boss Battles, Exploration and Mysteries\n- Weak-to-Strong MC\n- Character Born into System\n- Permadeath!!!\n- Quick\/fast paced chapters that jump right into the action\nNew Episodes Mon - Fri","description_hash":-7159694205903345957},{"title":"Starting Point","fiction_id":"86677","link":"https:\/\/www.royalroad.com\/fiction\/86677\/starting-point","tags":["LitRPG","Portal Fantasy \/ Isekai","Action","Adventure","Fantasy","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":24,"chapters_count":1,"last_update":1715897909,"description":"14th of July, 2023 marks the start of catastrophe.Everything destroyed, everyone saving themselves, and the order of the world got turned into chaos. What will you do, if you experience this?","description_hash":-4410846859494210411},{"title":"Deicide (Pokemon Si\/OC Au)","fiction_id":"86676","link":"https:\/\/www.royalroad.com\/fiction\/86676\/deicide-pokemon-sioc-au","tags":["Reincarnation","Male Lead","Action","Adventure","Fantasy","Mystery","Mythos"],"lable":"Fan Fiction","following_count":4,"rating":0.0,"page_count":7,"view_count":74,"chapters_count":1,"last_update":1715897904,"description":"Join Marcus as he fights against impossible odds to escape from a being of godly proportions while trying to navigate his way around a conspiracy filled world. Anime\/Manga\/Games Mixed , Semi Dark story no gore or anything crazy but deaths may happen.","description_hash":7072683985712248456},{"title":"Bard of Planetos (Game of thrones SI\/oc\/DND)","fiction_id":"86675","link":"https:\/\/www.royalroad.com\/fiction\/86675\/bard-of-planetos-game-of-thrones-siocdnd","tags":["Comedy","Action","Adventure","Fantasy"],"lable":"Fan Fiction","following_count":5,"rating":5.0,"page_count":86,"view_count":687,"chapters_count":6,"last_update":1716091127,"description":"Join john as he travels around Planetos trying to carve a name for himself while trying to stop ice zombies from taking over. Si\/oc with a Pathfinder RP system.","description_hash":1530925505073358173},{"title":"Storm Rising: Claws of Oneras [A Monster Evolution LitRPG]","fiction_id":"86674","link":"https:\/\/www.royalroad.com\/fiction\/86674\/storm-rising-claws-of-oneras-a-monster-evolution","tags":["LitRPG","Dungeon","Anti-Hero Lead","Comedy","Multiple Lead Characters","Action","Adventure","Fantasy","Slice of Life","Female Lead","Strong Lead","Non-Human Lead","High Fantasy","Mythos"],"lable":"Original","following_count":13,"rating":5.0,"page_count":16,"view_count":666,"chapters_count":5,"last_update":1716001583,"description":"From dragons and wolves, Aella was born.\nIn the heart of the Primordial Forest, a Grade A territory teeming with mythical creatures, a unique being is born. Aella, the first True Draconic Fenrir, emerges in the world of Oneras. With her extraordinary heritage, she embarks on a perilous journey to claim her place in the world.\nAs she navigates this treacherous landscape, Aella must confront the harsh realities of survival, forging her own path and building a pack of loyal followers. But her greatest challenge lies in protecting her clan from the threats that lurk in every shadow. With her remarkable abilities and unyielding spirit, Aella will stop at nothing to safeguard her kin and ensure the Shattered Moon Clan's legacy endures.\nWill she rise to the challenge, or will the weight of her destiny crush her? Dive into the world of Aella, a tale of resilience, loyalty, and the unbreakable bonds of family.\n\n{Note: This is a rewrite of the first version of Storm Rising.}","description_hash":-2414526068425550100},{"title":"Kingfisher [A Swashbuckling Fantasy Adventure LitRPG]","fiction_id":"86673","link":"https:\/\/www.royalroad.com\/fiction\/86673\/kingfisher-a-swashbuckling-fantasy-adventure-litrpg","tags":["Virtual Reality","Progression","Male Lead","Slice of Life","Action","Adventure","Fantasy","LitRPG","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":19,"view_count":149,"chapters_count":2,"last_update":1715961554,"description":"Hal's having a bad start to his summer vacation.He just found out his father has cancer, his best friends decide to leave on a road trip without him, and his chance to finally ask out his crush is gone.To deal with the stress of chemotherapy, Hal's father joins a game where he can enjoy his favorite past-time of fishing: a fantasy Swashbuckling MMORPG called \"Seven Seas\" where players can imbue their swords and pistols with magic via talismans. With few prospects for a fun summer, Hal decides to join his father in the game and see what all the fuss is about. There Hal's father wants to achieve the title of \"Kingfisher,\" given to players who catch every type of fish in the game.\nAt the end of their first day together, they discover a contest where they can win a grand prize of $250,000 if they can catch a legendary sea creature called the Sea King, but first they need to acquire the title of Kingfisher to be eligible!Together they embark on a journey to earn the title of Kingfisher and catch the Sea King, all while avoiding the machinations of mischievous pirates, giant sea creatures and villainous sea captains.\n\nIn this story you can expect:- A pirate-themed RPG world where pirates coexist with magic. Talismans allow players to infuse swords and pistols with elemental powers. \n- Plenty of fishing and achievement hunting. \n- Main character progresses from weak to strong. \n- Plenty of stat screens as characters level up, improve skills and acquire new items, weapons, and clothing. Numbers will matter a fair deal, though strategy and skill are important too. \n- Slice of Life detailing aspects of the players lives outside the game. \n- Quirky characters inspired by works such as One Piece.","description_hash":8905041823256188198},{"title":"The Unclean","fiction_id":"86672","link":"https:\/\/www.royalroad.com\/fiction\/86672\/the-unclean","tags":["Psychological","Action","Horror"],"lable":"Original","following_count":8,"rating":2.75,"page_count":233,"view_count":4757,"chapters_count":44,"last_update":1717828241,"description":"It was another typical day for Richard Simmons when the \"end of days\" hit. He never expected it or so he thought because the destruction of all he ever knew? Who would've thought right? Will he have the resolve to survive or will he become just one of them. One of the Unclean.","description_hash":1841393778179700551},{"title":"The phantom agency and the case of the missing souls","fiction_id":"86671","link":"https:\/\/www.royalroad.com\/fiction\/86671\/the-phantom-agency-and-the-case-of-the-missing","tags":["Portal Fantasy \/ Isekai","Female Lead","Fantasy","Mystery"],"lable":"Original","following_count":1,"rating":0.0,"page_count":12,"view_count":61,"chapters_count":2,"last_update":1715944823,"description":"Destiny Hopkins is an average twenty year old. She works for the shadow agency. Just like her father before her. The job description is a simple one. Search\/find\/retrieve.\nDestiny’s life is a little boring. She worked. She slept. She ate food at her parent’s house. And she worked. \nUntil one day, she was called upstairs. To see the boss. \nOnce there. Destiny finds out that she is a special child. Her parents were blessed with a baby. A baby that had been prophesied.\nDestiny was told that is would be up to her to dispel the darkness and save everyone and everything.\nthe only catch? Destiny was a spirit. Who lived in the spirit realm with her family. It was Destiny’s job to cross over into the mortal realm and retrieve lost souls. Souls that maybe didn’t know that had left their mortal vessel. Or maybe a soul that had found a way back across the veil and was refusing to return.\nthe phantom agency dealt with everything spirit related. And, as a shadow agent, Destiny worked there. It was a mix of private investigation and bounty hunter. \nNo two cases were the same. \nThe other shadow agents that worked alongside Destiny did similar work. But nobody had a retrieval rate like hers. She was one of the best. \nThat was until she was called to see the power that be. That was when she discovered she wasn’t just the best. She was actually the chosen one. The one that would lead her realm to victory over the darkness. Thus saving the mortal realm in the process.\nwhat could go wrong?\na lot!\nAt least Destiny had her best friend; Ruby-Ray with her. And the bookshop cat. His name was Remus. And Destiny was about to discover that he was a very rude little cat, indeed.","description_hash":-5317231616454720765},{"title":"LUCKY: The New Life of Hilary Lauderjames","fiction_id":"86670","link":"https:\/\/www.royalroad.com\/fiction\/86670\/lucky-the-new-life-of-hilary-lauderjames","tags":["Portal Fantasy \/ Isekai","Time Travel","Urban Fantasy","Progression","Post Apocalyptic","Action","Adventure","Drama","Sci-fi","Cyberpunk","Martial Arts","Female Lead","Super Heroes","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":1,"rating":0.0,"page_count":13,"view_count":86,"chapters_count":3,"last_update":1715930134,"description":"I currently don't have a proper synopsis, but I'll just say that it has to do with a young lady who works at a coffee shop. She ends up trapped there during the apocalypse and eventually finds herself in another universe upon passing out in the storage closet she chose to hide in. I'll write something better later.","description_hash":7157160949015539359},{"title":"Found or lost - the right one","fiction_id":"86669","link":"https:\/\/www.royalroad.com\/fiction\/86669\/found-or-lost-the-right-one","tags":["Female Lead","Secret Identity","Strong Lead","Drama","Fantasy","Romance","Mystery","Reader Interactive"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":0,"view_count":28,"chapters_count":1,"last_update":1715897805,"description":"After him, will I ever find love again? Do I even deserve all this pain? After enduring such a tumultuous life, don't I deserve to be cherished?\nKritika poured her heart out, confronting Pranab with every ounce of hurt and betrayal she felt. \"You were my confidant, the one I trusted most. Why, Pranab? Why did you shatter that trust? Wasn't I enough for you? Why did you choose lies when trust and truth were all we had left?\"\nPranab, his voice heavy with regret, pleaded, \"I'm truly sorry, Kittu. Just give me one chance, and I'll fix everything. I'll earn back your trust, just like before.\"\nBut Kritika, her wounds raw, couldn't bear to hear his apologies. \"You knew, Pranab. You knew how much I despise deceit and empty apologies. Don't utter those words. Haven't you heard, 'Don't say sorry until you mean it'?\"\nOn a different page of her life,\nShaurya declared, \"I'll love you the way you deserve, Jaan. Trust me once, and I promise I'll never let you down.\"\nBut Kritika, guarded by past scars, couldn't bring herself to trust his words. \"Every man says the same thing, but in the end, they all leave me shattered and alone. I can't trust you.\"\nShaurya persisted, \"Love, I'm fully committed to this with you. Can't you take a leap of faith with me?\"\nKritika's resolve remained firm. \"I'm not your love or jaan. Please, just leave me alone. I'm not ready for another relationship. I can't and don't want to love anyone ever again.\"\nShaurya refused to give up. \"I'll make you fall in love again. Trust me and give me just two months.\"\nWhat happened and what will happen in their lives? Will they find their way back to each other, or will they part ways like so many others? Only by delving into their story can we uncover the answers. Let's journey together and discover if they'll reunite, or if someone new, like Shaurya, will enter Kritika's life and help her learn to love again","description_hash":-8387965297118247859},{"title":"The Band's of Fate","fiction_id":"86668","link":"https:\/\/www.royalroad.com\/fiction\/86668\/the-bands-of-fate","tags":["LitRPG","Dungeon","Non-Human Lead","Action","Adventure","Fantasy","Romance","School Life","Male Lead","Magic","High Fantasy","Progression"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":41,"chapters_count":1,"last_update":1715886185,"description":"Saiyu and Hirota, two people of no relation bound together by fate shown by the bands around their wrist.","description_hash":5604756936531315181},{"title":"Blood without Fire","fiction_id":"86667","link":"https:\/\/www.royalroad.com\/fiction\/86667\/blood-without-fire","tags":["Male Lead","Adventure","Fantasy","Magic"],"lable":"Fan Fiction","following_count":2,"rating":0.0,"page_count":64,"view_count":734,"chapters_count":16,"last_update":1716960203,"description":"This is a story about a young man who was thrown by fate into unknown lands and given an unknown task. Whether he will try to learn about himself or take out his anger on everyone around him remains a mystery.\nOh, and its a throne gaming fanfiction. You know who A Song of Ice and Fire belongs to, and my name is definitely not George I am just the author of this fanfic.","description_hash":-1507497080936014731},{"title":"What if Gohan landed in DC","fiction_id":"86666","link":"https:\/\/www.royalroad.com\/fiction\/86666\/what-if-gohan-landed-in-dc","tags":["Portal Fantasy \/ Isekai","Progression","Super Heroes","Martial Arts","Male Lead","Action","Adventure","Drama","Tragedy","Magic"],"lable":"Fan Fiction","following_count":30,"rating":4.5,"page_count":546,"view_count":8925,"chapters_count":40,"last_update":1718555949,"description":"After the destroyer God Beerus destroyed his home the young saiyan Gohan was thrust into an entire new universe, now a Saiyan God Gohan struggles to accept the permanent loss of his family and loved ones as he tries to fit into his new universe until he becomes a candidate for God of Destruction.","description_hash":3988058096065715243},{"title":"ULTRA luck","fiction_id":"86664","link":"https:\/\/www.royalroad.com\/fiction\/86664\/ultra-luck","tags":["Dungeon","Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy","Progression"],"lable":"Original","following_count":1,"rating":3.0,"page_count":8,"view_count":163,"chapters_count":4,"last_update":1716206014,"description":"*COVER WAS MADE WITH AI* \nI'm fairly new to writing and there may be plot holes or inconsistencies that I miss. Please point these out and I will fix them. Also feel free to critique me as your critism allows me to grow as a writer and improves your reading experience \n\nThe world is rotten, and Jake knows this well. Everyone not born with a silver spoon in their mouths, is forced to work in massive underground cities to mine and earn a miniscule amount of money. Most die, as you would expect, and it's usually from overworking\/exhaustion, dehydration or starvation.\nJake got the short end of the stick after his parents died. He was unable to earn much money and day by day was whittling away due to being more underfed than even the poorest of miners. One day as he was about to collapse to due exhaustion, a book falls out of the wall he is mining. He sees the book and starts to cry tears of joy.","description_hash":-3202022728202308721},{"title":"Winds of Night, The Forsaken Saga","fiction_id":"86663","link":"https:\/\/www.royalroad.com\/fiction\/86663\/winds-of-night-the-forsaken-saga","tags":["Anti-Hero Lead","War and Military","Martial Arts","Grimdark","Multiple Lead Characters","Adventure","Fantasy","Mystery","Male Lead","Female Lead","Strong Lead","Magic","Low Fantasy","High Fantasy","Villainous Lead","Attractive Lead"],"lable":"Original","following_count":2,"rating":4.5,"page_count":33,"view_count":137,"chapters_count":2,"last_update":1716700191,"description":"In the West, as Harrigton's crow painted its lands with blood under the shadow of its wings, the islanders from the North were drowning the realm in fear. The House Lorance in the Riverlands was mourning the loss of their noble kings. Meanwhile, the fate of the blue griffins was irreversibly changing. Under the shadows of all these silhouettes, every inhabitant of the land must have realized that an era was ending and another was beginning; perhaps only those who realized this would survive.","description_hash":-2160750918029736943},{"title":"Return to the Fae","fiction_id":"86662","link":"https:\/\/www.royalroad.com\/fiction\/86662\/return-to-the-fae","tags":["LitRPG","Portal Fantasy \/ Isekai","Male Lead","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":68,"chapters_count":2,"last_update":1715868739,"description":"Liams Wife has been taken by goblins, he must travel to a different world to find her, but what might he find about him self along the way.","description_hash":8716582076685124566},{"title":"SEE YOU MORNING","fiction_id":"86661","link":"https:\/\/www.royalroad.com\/fiction\/86661\/see-you-morning","tags":["Reincarnation","Time Travel","Progression","Space Opera","Strategy","Adventure","Drama","Romance","Sci-fi","Xianxia"],"lable":"Original","following_count":0,"rating":5.0,"page_count":135,"view_count":692,"chapters_count":18,"last_update":1718258576,"description":"This is a science fiction novel about contemporary, future, and near-modern times. It is a story about relationships between people, the story of humanity, and many more unknown stories.","description_hash":4085182514464026426},{"title":"Living Crucible","fiction_id":"86660","link":"https:\/\/www.royalroad.com\/fiction\/86660\/living-crucible","tags":["Portal Fantasy \/ Isekai","Progression","War and Military","Martial Arts","Psychological","Action","Adventure","Fantasy","Reader Interactive","Supernatural","Male Lead","Strong Lead","Magic","Strategy","Low Fantasy","High Fantasy","Mythos","Genetically Engineered ","Technologically Engineered","First Contact"],"lable":"Original","following_count":4,"rating":5.0,"page_count":20,"view_count":189,"chapters_count":3,"last_update":1716352429,"description":"The spear flew far faster than I could see, producing a deafening rumble as it cut through the air. It was so unbelievably loud that if one were to close their eyes, they might mistake it for the roar of a rocket engine. He had a head-sized hole blown through his chest before I even noticed the spear leave his opponent's hand. The weapon crossed the distance almost instantly, causing unbelievable devastation to its all-too-soft target.\n[Good thing he's going to the next stage after this fight] I thought, glancing at the ticket in my left hand. It wouldn't be too long until it was my turn down there.","description_hash":6637896983199645695},{"title":"Infinity Warriors","fiction_id":"86659","link":"https:\/\/www.royalroad.com\/fiction\/86659\/infinity-warriors","tags":["Action","Adventure"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":40,"chapters_count":1,"last_update":1715854792,"description":"In the bustling city of New Haven, four high school students and one alien discover they are destined to become the new Infinity Warriors after a devastating attack wipes out the original team. Nerdy and shy Clarence, braggadocios meathead Brock, beautiful air head Priya, emo rebel Malia, and Kuzir, the alien outsider are the new Infinity Warriors. Read their story as they navigate the challenges of high school, friendships, and budding romances, the new Infinity Warriors must learn to trust and rely on each other to combat the sinister forces of Zenophin, who seeks to conquer Earth by stealing their powerful stones. Together, they must face their personal insecurities, master their abilities, and unite as a team to protect their world from ever-looming threats. Along the way, they discover that the bonds of friendship and the strength of love are the true sources of their power.","description_hash":7153319237062635870},{"title":"Eternal Cultivation: Fear and Faith [Xianxia\/Eldritch]","fiction_id":"86658","link":"https:\/\/www.royalroad.com\/fiction\/86658\/eternal-cultivation-fear-and-faith-xianxiaeldritch","tags":["Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","War and Military","Xianxia","Action","Adventure","Fantasy","Romance","Martial Arts","Supernatural","Male Lead","Strong Lead","Secret Identity","Magic","Strategy","High Fantasy","Mythos","Villainous Lead","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":67,"rating":4.38,"page_count":249,"view_count":15657,"chapters_count":67,"last_update":1718480061,"description":"In a world built on deception and false promises, Feng Zhiming is brutally thrust into a battle royale, his only goal is to survive at all costs. However, as he battles against other contestants, whispers and fragments of truth reach his ears, a truth ever forbidden, revealing a deeper, more sinister game at play. Will Feng Zhiming follow the deceit of the battle's administrator, or will he forge his own path, determined to expose the falsehoods and seek revenge on those who have fooled and humiliated him?\n\n\"Beware, my everfragile sheep, beware of the Great )#(#I)$()\"\n“Hearken ye, for it speaketh, it sings of a destined slave set aflame, one that could not escape, consumed and ever changed by the clutches of a great silence. A deathless death with a deformed rebirth.”\nUpdates: Daily for the first month after that it will depend on the demand\nWhat to expect:\n>Xianxia+Lovecraft+Souls-borne\n>Cultivation + Other power systems\n>Logical and smart Mc with real character development\n>Realistic side characters\n>Philosophy mumbo jumbo\n>Lite horror\/lite tragedy\n>Slow exposure to lore of the world via more then just character to character talk\n>No Harem\n>Slow-burn Romance\n>Original","description_hash":-4635525919634631866},{"title":"zeropoint","fiction_id":"86657","link":"https:\/\/www.royalroad.com\/fiction\/86657\/zeropoint","tags":["Super Heroes","Action"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":205,"chapters_count":4,"last_update":1718394035,"description":"jax 'zeropoint' balakin is a superhero with telekinetic powers.\nhe spends most of his time fighting supervillains and eating burritos. yknow. typical superhero stuff.\nbut jax finds himself accidentally pissing off a few supervillain crime lords.\nand surviving that mistake might be a bit of an issue.\njoin me on a crazy fast burn superhero scenario with lots of combat and explosions. and maybe a few alliances with figurative and literal gods.","description_hash":-3470640160255321620},{"title":"(Depreciated, await the rewrite)","fiction_id":"86656","link":"https:\/\/www.royalroad.com\/fiction\/86656\/depreciated-await-the-rewrite","tags":["Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","Martial Arts","Multiple Lead Characters","Action","Adventure","Fantasy","Romance","High Fantasy","Attractive Lead"],"lable":"Fan Fiction","following_count":28,"rating":4.1,"page_count":282,"view_count":3577,"chapters_count":23,"last_update":1716543000,"description":"Tereda Chouju just wanted a nap. Instead, he got a front-row seat to the apocalypse. When the world's greatest hero snaps and blows up the planet, circumstances beyond his control send him hurtling through the Multiverse void. With his Overwhelming adoration for his Lover, Rem, Tereda Will Explore a multiverse of Danger and Opportunity along side her.\nFollow this pair of Codependent Yandere's as they travel the multiverse trying to good while accidentally blowing shit up.\nAlso posted on SB, SV, QQ, webnovel, FF, and Wattpad.\nI poured my heart into this story! please enjoy!\nCurrent worlds visited:Doomed Worm TimelineDoomed Re:Zero WorldBerserk(Just long enough to kill Griffith)Eldritch domain(Honeypot Realm for Dragon Ball Fans.)(Just long enough to run for the inter dimensional hills.)Hunter X Hunter(Currently)\nFuture worlds:Cyberpunk edge-runners\nRWBY\nAkame Ga Kill\nPsycho Pass\nMore undecided","description_hash":3798621122369962978},{"title":"Whispers","fiction_id":"86655","link":"https:\/\/www.royalroad.com\/fiction\/86655\/whispers","tags":["Virtual Reality","Portal Fantasy \/ Isekai","Time Loop","Urban Fantasy","Dungeon","Action","Adventure","Fantasy","Romance","LitRPG","Reincarnation","Martial Arts","Gender Bender","Harem","Slice of Life","School Life","Supernatural","Male Lead","Female Lead","Strong Lead","Multiple Lead Characters","Non-Human Lead","Secret Identity","Magic","Anti-Hero Lead","Strategy","Grimdark","GameLit","Low Fantasy","High Fantasy","Super Heroes","Mythos","War and Military","Ruling Class","Time Travel","Genetically Engineered ","Technologically Engineered","Soft Sci-fi","Progression","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":8,"rating":0.0,"page_count":60,"view_count":550,"chapters_count":5,"last_update":1717968169,"description":"Growing up Genesis listened to the stories her dad would tell her about his time going out and adventuring. Every day he'd tell her a different story and some days they'd be filled with nothing but adventuring fighting while other's about how he simply enjoyed the scenery. He'd been to many different lands, worlds and timelines and met all types of people that Genesis couldn't even begin to believe it all. In her young mind at the time they were just really good and thought out bed time stories but as she grew older it dawned on her that they were actually real. That realization brought her to wanting to start her own adventures, visiting places even her dad never been too and meeting people he never met. She wanted to be like him in her own way and she didn't mind having to fight for it either.","description_hash":7575756961415652473},{"title":"In Nomine Domini","fiction_id":"86654","link":"https:\/\/www.royalroad.com\/fiction\/86654\/in-nomine-domini","tags":["Action","Fantasy","Historical","Horror","Supernatural"],"lable":"Original","following_count":3,"rating":0.0,"page_count":115,"view_count":171,"chapters_count":5,"last_update":1718054878,"description":"Eliana is a young girl living just outside of Jerusalem. While the city is boiling with religious fights, she is fighting a battle of her own. After loosing her family to a mysterious accident she finds herself surrounded by unnatural forces invading her home. She tries to find help and salvation in the hands of her local church. Instead she find herself in a world that she could not imagine even in her wildest dreams as she is saved by mysterious man....\n\n*************************************\nHey everyone, I´m a complete amateur and English is not my native language. If you find any spelling or grammar mistakes do please let me know. I'm very grateful for every review no matter how harsh or nice. I hope that you will leave your feedback :-)","description_hash":4105840201853741700},{"title":"GHOST SEES GHOST","fiction_id":"86653","link":"https:\/\/www.royalroad.com\/fiction\/86653\/ghost-sees-ghost","tags":["Portal Fantasy \/ Isekai","Dungeon","Multiple Lead Characters","Contemporary","Drama","Adventure","Fantasy","Supernatural","Female Lead","Low Fantasy","Progression"],"lable":"Original","following_count":0,"rating":0.0,"page_count":36,"view_count":353,"chapters_count":4,"last_update":1716823146,"description":"When lawyer Sarah Newsum is promised a promotion for successfully representing the paranormal content creator Avery Kim—who claims to interact with spirits and trolls haunted locations for content—she is tentative. In custody as the lead suspect for the murder of Theodore Williams, Avery alleges that an evil spirit took the life of the famous influencer turned DJ.\nHesitant about his claims, the ambitious attorney decides to spend time with his unique production team to understand the man behind the camera and get to the truth of the matter. Led by a disgraced media personality, Sarah slowly learns who the real Avery Kim is—not the character seen on FaceTube—and what the GHOST SEES GHOST team really does. The truth quickly becomes stranger than fiction as she’s introduced to a realm of spirits, dark magic, sinister plots, and her own connection to the Witching Hour—a time when spirit activity is strongest.","description_hash":474085059786717163},{"title":"Symposium Alternate [multi-genre multiverse isekai]","fiction_id":"86931","link":"https:\/\/www.royalroad.com\/fiction\/86931\/symposium-alternate-multi-genre-multiverse-isekai","tags":["Virtual Reality","Portal Fantasy \/ Isekai","Time Travel","Urban Fantasy","Progression","Action","Adventure","Fantasy","LitRPG","Cyberpunk","Slice of Life","School Life","Supernatural","Multiple Lead Characters","Magic","Grimdark","Space Opera","Mythos","Soft Sci-fi","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Adam married the cursed maiden of the woods knowing his life was at stake. Each night, a spirit would possess the body of his beloved, for wife to hunt husband untill dawn. The day he was almost pledged to flee, though, the possession occurred earlier than it should, ending up in the death of both lovers and the repassing of the curse to the traveler. Now, having become the new vessel of the Guardian of the Land of the Dead, Adam was reclaimed in another Earth, where spirits and shamans fought in frenzy to wear out the mill of the world.\n\nCurrently being planned.","description_hash":-8979701888978436932},{"title":"Terrarestrians Book One: The Prophecy","fiction_id":"86930","link":"https:\/\/www.royalroad.com\/fiction\/86930\/terrarestrians-book-one-the-prophecy","tags":["Multiple Lead Characters","Adventure","Fantasy","Non-Human Lead","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":100,"view_count":1046,"chapters_count":17,"last_update":1716341434,"description":"Deep under the surface of Terrarestria, thousands of humans are hiding from the dragon threats above. They have been for generations, and will for generations to come.\nBut a group of juveniles (Pyrite, Sapphire, Turquoise, Jade, and Alex) who have never seen the surface find themselves out of the caves and shoved into an adventure that they did not want, in a world they did not want to be a part of.\nIt appears that the dragons are at war, split between two sides, and they want humans to use against the other tribes. And on top of that, a mystical prophecy foretelling the fate of the world is proclaimed about the young teens. Who is Zaerux? Will the humans ever get to go home?","description_hash":5330646998378358527},{"title":"syn sindares: whispers of the inside","fiction_id":"86929","link":"https:\/\/www.royalroad.com\/fiction\/86929\/syn-sindares-whispers-of-the-inside","tags":["Adventure","Romance","Supernatural","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":46,"view_count":491,"chapters_count":14,"last_update":1716727678,"description":"in the desolate ruins of an abandoned village under the shadow of the empire, a married couple welcomed their son, Syn Syndares, into the world. At the very moment of his birth, a bolt of mysterious red lightning struck him, transforming his eyes to a haunting crimson hue. By the time he reached the age of ten, fear gripped the villagers, leading them to banish him from their midst. Left to fend for himself, Syn forged his own path with the help of the musterious voice inside his head in the unforgiving wilderness, haunted by the enigma of his crimson gaze and the power it symbolized he roamed the \"Blue Moon Mountain\" for eight years, mastering his power. Upon return, he found his kin slain, vowing vengeance on the culprit. Finding himself aimless after achieving his revenge he roamed the world looking for a meaning for his life.","description_hash":3252763932524808742},{"title":"Scrounger","fiction_id":"86928","link":"https:\/\/www.royalroad.com\/fiction\/86928\/scrounger","tags":["Post Apocalyptic","Adventure","Hard Sci-fi","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":44,"chapters_count":1,"last_update":1716288425,"description":"Mild apocalypse survival story set in Ireland. Fallout inspired.","description_hash":-7644948913997163576},{"title":"Orlen And The Devil's Paradox","fiction_id":"86927","link":"https:\/\/www.royalroad.com\/fiction\/86927\/orlen-and-the-devils-paradox","tags":["Dungeon","War and Military","Female Lead","Strong Lead","Action","Adventure","Fantasy","Supernatural","Male Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":37,"view_count":127,"chapters_count":3,"last_update":1717661614,"description":"A boy named Orlen and a girl named Ester set off on a journey as unusually powerful newbie adventurers.\nAll is well, but in all tales, there is a twist.\nAfter meeting up with old friends a secret about Orlen's father is uncovered and the original duo is left with a quest.\nAlso found here:https:\/\/www.booksie.com\/722776-orlen-and-the-devils-paradox on Booksie","description_hash":-1662213202291463069},{"title":"King's Gambit","fiction_id":"86926","link":"https:\/\/www.royalroad.com\/fiction\/86926\/kings-gambit","tags":["Urban Fantasy","Strategy","Martial Arts","Comedy","Male Lead","Adventure","Fantasy","Romance","Harem","Slice of Life","School Life","Supernatural","Strong Lead","Secret Identity","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":3,"rating":0.0,"page_count":60,"view_count":393,"chapters_count":6,"last_update":1717028412,"description":"Cagnus Marlsen is a young, ordinary boy who enrolls in the prestigious Imperial Chess Academy, a school for the supernatural elite. However, when his true potential is discovered, he becomes the target of both gods and devils who fear his power. Despite his lack of knowledge about his true identity, Cagnus's random actions are seen as a genius by those around him. As he navigates the dangerous world of the supernatural.\n-----\nCompare to my other works this is comedy so just enjoy it and don't take it too seriously.","description_hash":-6713815027582511155},{"title":"Ember Of Destiny","fiction_id":"86925","link":"https:\/\/www.royalroad.com\/fiction\/86925\/ember-of-destiny","tags":["Progression","Female Lead","Secret Identity","Strong Lead","Action","Adventure","Fantasy","Romance","Magic","High Fantasy","Mythos","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":19,"view_count":99,"chapters_count":2,"last_update":1717594964,"description":"In the mystical world of Regalias, where the elements breathe life into the land, a hidden prophecy foretells a time of great change: \"Child of ember and night and droplet of sight shall awaken once the tower crumbles down, chaos will ensue and darkness shall rise, and so begins the dance between death and life.\" Rhea, a half-elf fire arcani, is on a mission connected to her dark past. Her journey takes an unexpected turn when she meets Liae, a bubbly water nymphite who struggles with her arcana abilities. Their path crosses with a diverse group of allies: Kier, a gossipy orc with music arcana who uses tough love to push his companions; Raisheva, a stoic dwarf with artifact arcana, who values directness and efficiency; and Ciaran, a mysterious man with no memory of his human life, driven by loyalty to his queen. Amidst them is Amaris, a shadow arcani and necromancer princess ostracized for being the product of an affair and for her dark abilities. Believed by many to be the key to the prophecy, she struggles with her place in the world and the weight of false expectations. Their journey to a mysterious ceremony across Aquione promises answers, but they must confront their deepest fears and unlock hidden potentials. In a tale of destiny, magic, and the enduring power of friendship.","description_hash":7229847712332647849},{"title":"The Anomaly With Dreams.","fiction_id":"86923","link":"https:\/\/www.royalroad.com\/fiction\/86923\/the-anomaly-with-dreams","tags":["Urban Fantasy","Progression","Post Apocalyptic","Martial Arts","Comedy","Action","Adventure","Tragedy","Supernatural","Male Lead","Strong Lead","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":88,"view_count":206,"chapters_count":6,"last_update":1718050381,"description":"\"God\" is dead. The angels have gone rogue and the devils feast upon human suffering. Even in this chaos order is needed. The story follows a boy seemingly with no desires or recollections of his past trying to survive the unforgiving world. As everyone is hunted, tortured, and enslaved amongst few search for the sacred items of God's creation. with a contract with these 2 unknown Entities, the boy becomes the vessel for something the world or the realms had not imagined.","description_hash":4735975782201943254},{"title":"haunted house","fiction_id":"86922","link":"https:\/\/www.royalroad.com\/fiction\/86922\/haunted-house","tags":["Psychological","Fantasy","Horror","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":31,"view_count":165,"chapters_count":4,"last_update":1716372513,"description":"A bus without a driver carries a group of cursed people to a black creepy house ...... Inside the creepy house, there is a door stained red with blood. The cursed people, every once in a while, have to be forcibly pulled into the horrible world behind the blood door to complete the horror events ...... When Ning Qiu Shui experienced one horror hunting story after another in the creepy house, and finally survived nine deaths and one life, he found out that it was all very different from what he had thought ... ... The Creepy Shelter, it turns out, is not a curse, but ......","description_hash":1681671785563419706},{"title":"The World: creating the peace","fiction_id":"86921","link":"https:\/\/www.royalroad.com\/fiction\/86921\/the-world-creating-the-peace","tags":["Time Travel","Progression","Post Apocalyptic","Strategy","Psychological","Adventure","Fantasy","Sci-fi","Supernatural","Male Lead","Multiple Lead Characters","Secret Identity","Magic","Mythos","Genetically Engineered "],"lable":"Original","following_count":6,"rating":5.0,"page_count":289,"view_count":1191,"chapters_count":29,"last_update":1717446611,"description":"Once upon a time, everyone existed in peace and quiet, but then life appeared. In order to maintain balance, the Progenitors created their own guardian for each universe. Everyone was sent to planets where they had more facilities so as not to destroy the universe while learning life. At some point, for some unknown reason, one of the Progenitors decided to restart universe No. 7, where the main character was...","description_hash":-4685128053417639218},{"title":"Sword AF: Delivering Destiny","fiction_id":"86920","link":"https:\/\/www.royalroad.com\/fiction\/86920\/sword-af-delivering-destiny","tags":["Progression","Comedy","Multiple Lead Characters","Adventure","Fantasy","Romance","Magic","High Fantasy"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":5,"view_count":65,"chapters_count":1,"last_update":1716262313,"description":"The Age of Heroes was a time when all of creation, both mundane and magical, lived in constant fear of the lurking darkness. Yet, this era also brimmed with opportunities for the exceptionally strong, wise, clever, or brave to rise as legendary heroes, forever etching their names in history. Dragons were slain, wars won, and peace established. As children grew up with tales of these heroes, they aspired to become legends themselves.\nNow, the age has passed. Mercenary groups, though abundant, find work scarce in this peaceful time. They must adapt to survive. \nAnd that includes becoming a postal service.\n\nThis is a fanfic\/rewrite of the Smosh D&D campaign Sword AF: Delivering Destiny","description_hash":3097518207195120580},{"title":"Skeleton Politics","fiction_id":"86919","link":"https:\/\/www.royalroad.com\/fiction\/86919\/skeleton-politics","tags":["GameLit","Fantasy","Magic"],"lable":"Original","following_count":2,"rating":0.0,"page_count":16,"view_count":132,"chapters_count":2,"last_update":1716442074,"description":"After dying to an assassin's bullet, a politician's public relations manager Jack is summoned to another world... as a skeleton?\nThe world of Gyra has an imminent demonic invasion due to arrive in a year. As such, the ten gods have set aside their differences, and each has summoned a hero to aid the world against the deadly threat to come... including the god of undeath, Necrovalis.\nNecrovalis wishes to use this opportunity to gain more followers to boost his faith. Summoning a servant from another world is sure to work! After all, summoning a person from another world always results in that person being incredibly powerful! And a powerful person indebted to Necrovalis will surely use that power to bring those lowly peons to recognize his glory!\n......Right?","description_hash":6964955455745956820},{"title":"Rise to the top","fiction_id":"86918","link":"https:\/\/www.royalroad.com\/fiction\/86918\/rise-to-the-top","tags":["Xianxia","Sci-fi","Action","Mythos"],"lable":"Original","following_count":1,"rating":0.0,"page_count":55,"view_count":301,"chapters_count":7,"last_update":1716345292,"description":"The Yuan Shen is innate, as long as anyone cultivates to the innate realm of martial arts before the age of thirty, the Yuan Shen is strong enough to communicate with the heavens, obtain the recognition of the Heavenly Dao, and obtain the inheritance of the Heavenly Dao. The Heavenly Dao will give a jade tower or pagoda, and there are corresponding cultivation methods and witchcraft in the tower! The one who does this is a sorcerer, with great supernatural powers and otherworldliness! As soon as Ye Xu was born, there was a mysterious jade tower in his body, with this peculiar jade tower, he cultivated the innate martial arts, entered the witch with martial arts, entered the Tao with witches, and finally embarked on the road of being alone in the world! Wudao realm, three yuan realm (peiyuan, solid yuan, rong yuan) three true realms (true yuan, haoyue, mixed yuan) three dan realm (danding, phantom pill, yuan dan) three fetal realm (membrane fetus, phantom fetus, yuan fetus) three yang realm (body yang, pure yang, yang god) three god realm (god, yuanshen, combined) three phases realm (law phase, earth phase, heaven phase) three immortal realm (physical body immortal, primordial god immortal, heaven and earth law phase immortal) three emperors realm (human emperor, witch emperor, holy emperor) three gods king realm (witch ancestor, god king, emperor) above the emperor: heavenly monarch, dao monarch, the beginning of the beginning.","description_hash":2196432137736371093},{"title":"Sunday","fiction_id":"86916","link":"https:\/\/www.royalroad.com\/fiction\/86916\/sunday","tags":["Slice of Life","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":39,"chapters_count":1,"last_update":1716248217,"description":"Getting into my head… as the song lyric says, like a Sunday in TJ, it’s cheap but it’s not free","description_hash":-2537686126196805675},{"title":"Mind & Machine [Dystopian Sci-Fi]","fiction_id":"86915","link":"https:\/\/www.royalroad.com\/fiction\/86915\/mind-machine-dystopian-sci-fi","tags":["LitRPG","Progression","Anti-Hero Lead","Psychological","Female Lead","Action","Adventure","Sci-fi","Cyberpunk","Slice of Life","Strong Lead","Technologically Engineered","Dystopia","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":885,"rating":4.56,"page_count":522,"view_count":73294,"chapters_count":37,"last_update":1718392710,"description":"Two lives coalesce.From the 21st century to the 23rd.A digital goddess and a magi of the mesh.Will this new entity — this young woman — adapt to the future? May she even thrive?\n\nPost-prologue chapters between 3000-5000 words. Sometimes more.There is no update schedule.\n[AI-Assisted Content] means I've used machine learning for proofreading.[Sexual Content] is mostly present for creative freedom. I have no plans for anything overly explicit, but ruling it out completely feels limiting.","description_hash":3395065879338607443},{"title":"Refrain From a Heathen's Hymn","fiction_id":"86914","link":"https:\/\/www.royalroad.com\/fiction\/86914\/refrain-from-a-heathens-hymn","tags":["Multiple Lead Characters","Drama","Adventure","Female Lead","Non-Human Lead"],"lable":"Fan Fiction","following_count":2,"rating":5.0,"page_count":39,"view_count":106,"chapters_count":2,"last_update":1717333259,"description":"The only chance of survival for a small clan of pokémon is the Frozen Opera, where the froslass perform an anthem as prayer for an almighty blizzard. Dreaming of performing the aria, Arctina is forced to evolve into a glalie to act as a guardian. As she grieves, an outsider arrives, refusing to utter a sound yet prophesied to be their savior prima donna. When the two and the bitter previous diva set off to hold the rite on their own, they create harmony out of discord when they clash with each other and a frigid god.","description_hash":-8070130536901634689},{"title":"The Musketeer","fiction_id":"86913","link":"https:\/\/www.royalroad.com\/fiction\/86913\/the-musketeer","tags":["War and Military","Grimdark","Male Lead","Tragedy","Drama","Action","Fantasy","Magic","Strategy","Low Fantasy"],"lable":"Original","following_count":1,"rating":5.0,"page_count":14,"view_count":55,"chapters_count":1,"last_update":1716245112,"description":"The year is 760 in the Mendevian Calendar. The world is in a state of turmoil as rapid technological advancements, and the discovery of magic, have changed medieval warfare into something new. 17 year old Avice Ignavus volunteers for the second Lutum-Primulus war. He is sent to a training encampment to learn the basics of soldiering as well as build camaraderie with fellow recruits. Along the path to war he will encounter sights not for the faint of heart and tragedies unparalleled, it is in this crucible of disorder that the tale of the Musketeer is told.(Special thanks to my editor, marshalice)","description_hash":7413388192874787677},{"title":"Draguntome: A Reaper's Legacy","fiction_id":"86911","link":"https:\/\/www.royalroad.com\/fiction\/86911\/draguntome-a-reapers-legacy","tags":["Progression","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":23,"rating":5.0,"page_count":72,"view_count":625,"chapters_count":9,"last_update":1718303881,"description":"Where knights and dragons once marched together for honor at the behest of the Good King, nothing remains but sad and broken lore about the glory of the Old Way. Now, titles of nobility are only granted by the spilling of blood under the Order of the Black King. \nIn the small forest village of Ark, Kalos has lived alone with his father for as long as he can remember. After a strange encounter at the exotic Mercari Fair, which arrives only once a year, the two must immediately depart for the port city of Blefcynn on a mysterious quest. Traveling to the port, Kalos discovers unexpected truths that cause him to question everything he believes. Wild with anger and uncertainty, Kalos ditches his Father that night after arriving and takes off into the city on his own. Soon he encounters a girl unlike anyone he has ever met before and falls into a trap. After returning to the inn where he left his Father, they tentatively make amends and attempt to get some rest only to be abruptly awakened into a chaotic, wide-spread fight for survival a few hours later against an army of ruthless pirates bent on ransacking the city...\n\"A Reaper's Legacy\" is book one of an Epic, YA Action\/Adventure\/Fantasy series with Coming of Age undertones set in an alternative world where pirates, dragons, and knights are woven into the same era, and friends and enemies alike must interact in unexpected ways just to survive. Kalos must conquer overwhelming obstacles while rapidly evolving from the boy he thought he was into a man he never expected to become throughout his journey. Despite the many years of combat training Kalos received from his Father, war, pirates, and unyielding forces threaten to crush him around every corner in this first installment of the Draguntome saga.","description_hash":-1043307199385783078},{"title":"Protector's of Artain","fiction_id":"86910","link":"https:\/\/www.royalroad.com\/fiction\/86910\/protectors-of-artain","tags":["Time Travel","Action","Adventure","Fantasy","Mystery","Reader Interactive","School Life","Supernatural"],"lable":"Original","following_count":3,"rating":5.0,"page_count":42,"view_count":453,"chapters_count":6,"last_update":1718632765,"description":"Tia Elaine lives a perfectly normal life (according to her) until one day a box drops on her head out of nowhere or can we say ..another dimension? ,this box drags her along with Rose and sara to a place full of wonders ,a world where magic and monsters exist ..a world where she can find her lost ones ..a world which gives her hope  . Confused by these Mysteries they start a new life in this weird world eventually leading to both friends like Zaina or foes like .......","description_hash":-3267519388014808593},{"title":"A Dead Girl's Tale","fiction_id":"86909","link":"https:\/\/www.royalroad.com\/fiction\/86909\/a-dead-girls-tale","tags":["Anti-Hero Lead","Grimdark","Female Lead","Strong Lead","Tragedy","Fantasy","High Fantasy","Villainous Lead"],"lable":"Original","following_count":3,"rating":5.0,"page_count":1,"view_count":50,"chapters_count":1,"last_update":1716243618,"description":"When you sleep, you do not think. It is a mind empty of the burdens you bear through the day. It is a mind filled with nightmares. There is no way out of the horror that rips her soul to shreds -- not at day, not at night. When she closes her, Caela cannot sleep, and when she opens them, she cannot stay awake.\nLife is fragile. You can cradle it, cherish it, but it will break regardless. There is always an end. An inevitable end that reduces on to fits. But Caela craves that very. Perhaps then, the nightmares that follow her will cease.\nShe won't make it past twenty, they say. Put her out of her misery before it is too late. \nCaela wishes they would, but her mother is too soft to allow such a thing to take place. Even when the villagers whisper, she ignores them. \nShe is a dead girl, they say. And she is.\nAnd this, reader, is a dead girl's tale.","description_hash":-5529647101461114546},{"title":"In Another World, As a Demon","fiction_id":"86652","link":"https:\/\/www.royalroad.com\/fiction\/86652\/in-another-world-as-a-demon","tags":["GameLit","Portal Fantasy \/ Isekai","Progression","War and Military","Grimdark","Action","Adventure","Fantasy","Psychological","Reincarnation","School Life","Supernatural","Female Lead","Strong Lead","Multiple Lead Characters","Non-Human Lead","Secret Identity","Magic","Strategy","High Fantasy","Mythos"],"lable":"Original","following_count":34,"rating":4.0,"page_count":68,"view_count":4757,"chapters_count":19,"last_update":1718622005,"description":"What happens when a whole class suddenly dies and reincarnates in a medieval world of swords and magic? Some become heroes, others become long lived elves, but things weren’t so easy for Aria Angelskind. Finding herself reincarnated as a demon, she now has to harden her heart and fight for survival day and night. Could she finally find peace once she reunites with her old friends? Would fate be so kind as to allow this foolish demon to live as a human?\n\nWhat to expect:\n-Gruesome Fights;-Extensive Magic System;-Game-like Skill System;-Interpersonal Mind Games and Strategies;-Slice of Life.","description_hash":1910007343976346299},{"title":"I Stole The System?","fiction_id":"86651","link":"https:\/\/www.royalroad.com\/fiction\/86651\/i-stole-the-system","tags":["Anti-Hero Lead","Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":33,"view_count":476,"chapters_count":8,"last_update":1715844217,"description":"Hey you! Have you ever heard about systems? \nYeah, the ones in novels with shady origins... the annoying systems that babysit the protagonists of the novel? The same ones that give them ridiculous rewards for the annoying and easy quests they themselves forced on their hosts?\n Have you heard of them? If you have, then let me confess something... \nI also have a system... \nNo, no, I ain't the protagonist, that's that regressor, but somehow I have his system! \nThough destroyed with no quests or major restrictions and just the ability to copy others' talents and a few OP rewards, I have somehow stolen a freaking system... \nNow what to do?\n Apologize to the protagonist and return the system? Heck no! \nIn a world infested with monsters and supernatural beings, I would be an idiot to give away such an amazing opportunity to anyone... \nWhen the world faces a crisis in the name of insanely powerful creatures that wish to wipe off humanity from the face of the earth, what do you think would happen when a selfish individual acquires the possession of one of the few powers that have the potential to save it?","description_hash":5391297535579075867},{"title":"My Life with a Water Spirit In Another World","fiction_id":"86650","link":"https:\/\/www.royalroad.com\/fiction\/86650\/my-life-with-a-water-spirit-in-another-world","tags":["Reincarnation","Comedy","Male Lead","Slice of Life","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":6,"rating":0.0,"page_count":42,"view_count":466,"chapters_count":6,"last_update":1716052504,"description":"Aqueo Harp is reborn into the body of another man in another world after dying from an accident. He encounters a water spirit that leads him to the Lake of Rejuvenation, and in there, he unknowingly makes a sacred bond with it.\n\nViewing his accident as a blessing-in-disguise, he swears to never go back to his miserable old life and live an opposite life in the new world. But the social standing of his new body comes with many difficulties. If he wants to live the life he's imagining, he needs the assistance of other people — his newfound friends.\n\nBut his new friends bring dozen times the trouble his social standing brings. And even his sacred connection with the water spirit comes with its hundred years worth of memories with knowledge of various dangerous historical happenings ongoing in the shadows or reoccurring once again. With so much at risk, his friends and him can't possibly turn a blind eye because they are the only ones who know and can possibly prevent those.","description_hash":-7545057550366846735},{"title":"Psychopunk - Only Cancer is Immortal","fiction_id":"86649","link":"https:\/\/www.royalroad.com\/fiction\/86649\/psychopunk-only-cancer-is-immortal","tags":["Psychological","Multiple Lead Characters","Sci-fi","Action","Horror","Cyberpunk","Female Lead","Genetically Engineered ","Technologically Engineered","Artificial Intelligence"],"lable":"Original","following_count":1,"rating":4.5,"page_count":182,"view_count":497,"chapters_count":11,"last_update":1716827153,"description":"In the year 2412, a generation after the events of The Jellyfish Exorcist, Envy is a retired wetworker seeking a new start in the world of diplomacy.Meanwhile, a young mutant named Mote struggles against her reckless instincts in a delicate survival situation.\nThese two protagonists are on a trajectory with fate. As a self-aware contagion rises to overtake the planet, every last living thing on Earth faces a fate worse than death.Our unlikely, demented heroes must work together to stop it... if they don't kill each other first.","description_hash":-8708162732489736938},{"title":"Zidi","fiction_id":"86648","link":"https:\/\/www.royalroad.com\/fiction\/86648\/zidi","tags":["Multiple Lead Characters","Sci-fi","Action","Adventure","Romance","Female Lead","Non-Human Lead","Soft Sci-fi"],"lable":"Original","following_count":1,"rating":4.5,"page_count":59,"view_count":333,"chapters_count":7,"last_update":1718287247,"description":"Zidi Taubav, a half-human half Jovian is haunted by the memories of her family's tragic death during a surprise attack on the USFP (The United Station For Peace). For the last six years, she has been held captive at Zenith Point, an Earth Alliance military base, where she has been a part of a mysterious medical experiment. With nothing but the memories of her father's promise of sanctuary on the Interstellar Space Station on Pluto to cling to, Zidi suddenly seizes a dangerous opportunity to break free and flee to what she hopes will be safety.\nDon Shields, a war vet from the Solar War is stationed at Zenith Point. He attempts to befriend Zidi but is constantly rebuffed. When Zidi attempts to flee, Don, bound by duty and a sense of honor, initially seeks to thwart her flight. But he soon realizes that there are to be no witnesses to her escape.\nAs Zidi and Don evade pursuit and navigate the treacherous expanse of space together, their reluctant alliance gives way to an unexpected bond. Can Zidi and Don escape the long reach of the Earth Alliance? Can their bond stand the test of racial and political tensions? What did the Earth Alliance need Zidi for and what are they planning?","description_hash":-8458864828431577579},{"title":"Heavenly Deceiver","fiction_id":"86647","link":"https:\/\/www.royalroad.com\/fiction\/86647\/heavenly-deceiver","tags":["Reincarnation","Progression","Villainous Lead","Wuxia","Female Lead","Action","Fantasy","Sci-fi","Mystery","Martial Arts","Soft Sci-fi"],"lable":"Original","following_count":83,"rating":4.82,"page_count":254,"view_count":6638,"chapters_count":17,"last_update":1718541973,"description":"In her past life, Li An was a Galactic Conqueror, a fearsome Demoness whose very name struck terror into the hearts of all. Her ruthless ambition led her into a trap, surrounded by warships and the silent threat of deadly weapons.\nAs her life waned, regret was but a distant dream; her heart reached for the boundless freedom at the peak of the stars. Death's grasp seemed sure, but the currents of fate flowed in unexpected directions.\nReborn as an outer disciple in the Gentle Sword Sect, Li An awakens with her memories intact. Now, within a realm where cultivation reigns supreme, she is determined to rise again.\nLi An's schemes reach beyond the mortal realm, defying even the Heavens themselves. Casting shadows of terror across the Cultivation World, her name shall echo through eternity as the Heavenly Deceiver.\nTRIGGER & CONTENT WARNING! \nThe book contains scenes with graphic violence and profanity that may not be appropriate for certain audiences.There will be no romance. Li An only pursues the goal of surpassing the Heavens.","description_hash":-7438097780999199153},{"title":"A Trial of Emperors","fiction_id":"86643","link":"https:\/\/www.royalroad.com\/fiction\/86643\/a-trial-of-emperors","tags":["Male Lead","Harem","Strong Lead","Drama","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":5.0,"page_count":26,"view_count":53,"chapters_count":1,"last_update":1715838965,"description":"As the Empire of Lunasolis tries to build itself back up after a long and brutal civil war, rumors begin to spread across the continent: Rumors that the Empire's education program is secretly a project to train its next emperor.\nAmong the numerous student candidates are a band of unlikely companions who, by either happenstance or fate, have come together to determine the truth behind the \"conspiracy\" and the purpose behind it.\nFable: A Nameless Child raised in a city of crime.\nFrederick: An aristocrat from a family of elitists.\nAria: An apprentice blacksmith trying to forge her own path.\nKendra: An exiled princess taking the path of the sword.\n\nFollow Fable and friends as they unravel a war-torn land and uncover its secrets, as well as forge bonds through their own struggles as they grow.\n\n\n\nNote:\nThe chapters of this web-novel will be split into \"Arcs\", which will be no more than 8-10 chapters long, with intermissions and side-stories in between. Though the arcs' chapters will have a consistent posting schedule, the arcs as a whole will take some time to finish, so please be patient and take your time to enjoy the story.","description_hash":5888133319256970847},{"title":"Ambition: Order In The Endless Era ","fiction_id":"86642","link":"https:\/\/www.royalroad.com\/fiction\/86642\/ambition-order-in-the-endless-era","tags":["Reincarnation","Progression","War and Military","Xianxia","Male Lead","Action","Adventure","Fantasy","Mystery","Martial Arts","Slice of Life","Strong Lead","Wuxia","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":23,"view_count":174,"chapters_count":6,"last_update":1715950341,"description":"An ordinary man from a small village falls into the conspiracy of immortals. Originally meant to live an ordinary life but due to this incident found an opportunity to transcend his limits. Will he be swept away by the currents or achieve transcendence?. Follow him as he unlocks the secrets of this world and overcome all challenges.","description_hash":-4493505129159623681},{"title":"Bloodbound","fiction_id":"86641","link":"https:\/\/www.royalroad.com\/fiction\/86641\/bloodbound","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Grimdark","Action","Adventure","Fantasy","Horror","Reincarnation","Supernatural","GameLit","High Fantasy","Mythos"],"lable":"Original","following_count":23,"rating":5.0,"page_count":25,"view_count":1361,"chapters_count":8,"last_update":1716415621,"description":"Richard was a man living in endless monotony, until he died. Ironically, it was the most important moment in his life. Snatched from the afterlife by a dying god, he is granted their power. Granted the power of the Sanguine Flame, he is thrust into a new life. Reincarnated in the world of Markovia, a place of darkness and pain. Ruled by a council of hegemonic tyrants, is is use as a repository for their livestock. They are followers of the same god that granted Richard his power, but are far crueler, and twisted in mind and spirit. He must fight to survive, as beings as ancient and powerful as the lords of Markovia do not take kindly to threats to their authority.","description_hash":-7933752152582457327},{"title":"They'll Time your Every Breath","fiction_id":"86640","link":"https:\/\/www.royalroad.com\/fiction\/86640\/theyll-time-your-every-breath","tags":["Psychological","Sci-fi","Short Story"],"lable":"Original","following_count":1,"rating":5.0,"page_count":9,"view_count":53,"chapters_count":1,"last_update":1715834844,"description":"\"The universe is rife with all kinds of things. Violence of man and the ruthlessness of nature. We have built this world with sweat and blood, and sweat and blood are required to maintain it. We are bound to lose those close to us, our friends and family in this process. Our flesh and blood... Our iron and circuits. We degrade ourselves in order to not let the machinations of our civilization rust and decay. We keep the arteries of commerce clear, we keep the blood cells moving, and we keep the heart pumping. Our jobs are not easy, they are not without sacrifice.\"","description_hash":-6098699236623509075},{"title":"I Thought i could be happy","fiction_id":"86638","link":"https:\/\/www.royalroad.com\/fiction\/86638\/i-thought-i-could-be-happy","tags":["Comedy","Male Lead","Contemporary","Slice of Life","Harem","Drama","Romance","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":89,"view_count":825,"chapters_count":15,"last_update":1717876995,"description":"Fumihiro Aoyama was living a blissful life with the love of his life, Ema. They even promised to marry each other after their graduation. However, the tranquility of their lives shatters when betrayal strikes, leaving Fumihiro entangled in a web of dark emotions. As new characters emerge with their own painful pasts, the story weaves a tapestry of love, forgiveness, and rebirth.\nNavigating the challenges of everyday life, Fumihiro must overcome the pain of betrayal and rediscover the light within. Passions entwine, secrets surface, and Fumihiro's heart is torn between the past and the present.\n\"I Thought I Could Be Happy\" is an exhilarating journey through the intricate fabric of human relationships, where pain transforms into hope, and rebirth takes unexpected forms. Will Fumihiro rise from the ashes of his pain, or will the weight of betrayal prove too much to bear? Or will he get his revenge?","description_hash":7499578460783485137},{"title":"City Survivor : Criminals","fiction_id":"86637","link":"https:\/\/www.royalroad.com\/fiction\/86637\/city-survivor-criminals","tags":["Urban Fantasy","Anti-Hero Lead","Strategy","Multiple Lead Characters","Contemporary","Action","Mystery","Male Lead","Strong Lead","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"A fierce survival game among criminals unfolds in the heart of the city! In a city in South Korea, criminals wager their freedom and fortune in an extreme survival game. A story filled with betrayal, intrigue, and hidden truths. Who will be the last one standing?\n\n[email protected]","description_hash":977530444768393587},{"title":"A Tale of Decency in the Apocalypse","fiction_id":"86636","link":"https:\/\/www.royalroad.com\/fiction\/86636\/a-tale-of-decency-in-the-apocalypse","tags":["LitRPG","Dungeon","Post Apocalyptic","Martial Arts","Male Lead","Action","Adventure","Fantasy","Romance","Harem","Magic","Progression","Attractive Lead"],"lable":"Original","following_count":3,"rating":0.0,"page_count":78,"view_count":674,"chapters_count":9,"last_update":1715995901,"description":"What better way to start your day than waking up in a cold, smelly cave surrounded by complete strangers?\nFollow James as he tries to survive the apocalypse whilst still remaining a decent person. It'll be hard but he'll try his best regardless.\n-------------------------Just trying to get better as an Author while writing a bit of a fun story.Currently planning on a harem somewhere down the line without the story going full-blown wish fulfilment OP MC\nHoping to do about 5 Chapters\/ WeekAny feedback would be appreciated!Cheers.","description_hash":-6902877371580046320},{"title":"Barbara Of Elysium: A Queen’s Story of Triumph","fiction_id":"86635","link":"https:\/\/www.royalroad.com\/fiction\/86635\/barbara-of-elysium-a-queens-story-of-triumph","tags":["War and Military","Female Lead","Tragedy","Fantasy","Romance","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":34,"view_count":36,"chapters_count":1,"last_update":1715834758,"description":"Barbara is a queen whose parents died when she was about 5 months old her sister who is younger than her is taken by the enemy. Her sister pretends to support Elsyium and secretly attacks them. Barbara’s cousin Aaron also her boyfriend is killed in war. Then her children. She vows to defeat the two countries who pretended to support her she develops owners and defeats them. She brings back her parents, Aunt, uncle, Aaron, children and her friends. She claims back her land in the end. A movie will be made on it in a few years.","description_hash":-7464008628539048695},{"title":"Black Death Survival","fiction_id":"86634","link":"https:\/\/www.royalroad.com\/fiction\/86634\/black-death-survival","tags":["Post Apocalyptic","Anti-Hero Lead","Ruling Class","Comedy","Male Lead","Tragedy","Short Story","Contemporary","Satire","Grimdark","Villainous Lead","Dystopia"],"lable":"Original","following_count":4,"rating":0.0,"page_count":51,"view_count":1156,"chapters_count":32,"last_update":1715854608,"description":"A scathing political satire that exposes the dark underbelly of ambition and power.\nIn a plague-ravaged Britain, one politician's ruthless ambition knows no bounds.\nAs society crumbles and power hangs in the balance, he will stop at nothing to seize control.\nBut in a world where the line between savior and tyrant is razor-thin, will his quest for dominance be his ultimate undoing?\nA dark and twisted tale of political intrigue, \"Black Death London\" is a gripping exploration of the depths of human nature in the face of catastrophe.","description_hash":112976049853460491},{"title":"[Alter Ego: A Star In The Shadow]","fiction_id":"86633","link":"https:\/\/www.royalroad.com\/fiction\/86633\/alter-ego-a-star-in-the-shadow","tags":["GameLit","Portal Fantasy \/ Isekai","Anti-Hero Lead","Strategy","Psychological","Action","Fantasy","Strong Lead","Multiple Lead Characters","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":2,"rating":1.0,"page_count":33,"view_count":289,"chapters_count":7,"last_update":1718262540,"description":"To find oneself transported into a novel's world, this time with the status of a former idol—\nAfter the end of the unknown novel, suddenly, he finds himself transported to that world.\n\nIf he gained access to 'a status window' containing various abilities, how would he make use of it if somehow all of them were related to his idol career?\n...\n    *[Notice: To obtain what was wanted, one must first reach an alternate ending.]\n...\nThe abnormality is deemed both a curse and a blessing.\n...\nWould he achieve the goal of an alternate ending?","description_hash":-3879981183272411419},{"title":"Astrid and the god of Deception","fiction_id":"86632","link":"https:\/\/www.royalroad.com\/fiction\/86632\/astrid-and-the-god-of-deception","tags":["LitRPG","Progression","Female Lead","Secret Identity","Action","Adventure","Fantasy"],"lable":"Original","following_count":9,"rating":4.0,"page_count":118,"view_count":1600,"chapters_count":17,"last_update":1718442001,"description":"Astrid is forced to flee for her life when her home is attacked by monsters. Now she’s alone, and everything she has ever known is gone. While trying to find a safe place and figure out what to do, she encounters a god who forces her into a deal she’d rather not make. In exchange, he offers to aid her in his own way.\nHowever, she dares not tell anyone about her dealings with this god, and it quickly complicates things while she builds a new life for herself.","description_hash":-597828408157517692},{"title":"In This Life, No Regrets","fiction_id":"86631","link":"https:\/\/www.royalroad.com\/fiction\/86631\/in-this-life-no-regrets","tags":["Comedy","Male Lead","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":32,"chapters_count":1,"last_update":1715832998,"description":"\"In my past life, I was shackled by my past, but this time I'll dominate the showbiz industry!\"","description_hash":-6252034109206582071},{"title":"Mysterious","fiction_id":"86630","link":"https:\/\/www.royalroad.com\/fiction\/86630\/mysterious","tags":["Steampunk","Sci-fi","Secret Identity","Fantasy","Mystery","Dystopia"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":144,"view_count":1723,"chapters_count":37,"last_update":1716825161,"description":"In a mysterious different world, a strange traveler comes here. Is everything that happens here real? Where should he go?","description_hash":1718083816348146787},{"title":"Half Elven","fiction_id":"86629","link":"https:\/\/www.royalroad.com\/fiction\/86629\/half-elven","tags":["Female Lead","Drama","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":7,"rating":0.0,"page_count":129,"view_count":2386,"chapters_count":17,"last_update":1718406540,"description":"It has been three hundred years since the combined might of the Gelbruni Empire defeated the servants of the Dark Gods. Bereft of a common foe, the once allies have since fragmented, leaving the empire is but a shell of its former self. Meanwhile, on the edge of civilization, Evil stirs in the heart of the Sawtooth Mountains, spreading its tendrils through the surrounding lands, slowly gathering strength while the former allies bicker amongst themselves.\nHalf Elven follows the adventures of novice Arbiter Rhaina Winstead, the only child ever born from a union between the waning Elves and the waxing Humans. When an ancient relic is unearthed, all contact is lost with an isolated village, Rhania is sent on her first ever assignment to resolve the situation. Over the course of her investigation, she quickly finds herself out of her depth as she uncovers unsettling truths, and learns that not all is as it seems in this rural corner of the Empire.","description_hash":8229640929010292138},{"title":"The New Breed Chronicles: Crucible","fiction_id":"86628","link":"https:\/\/www.royalroad.com\/fiction\/86628\/the-new-breed-chronicles-crucible","tags":["Urban Fantasy","Super Heroes","Non-Human Lead","Sci-fi","Action","Adventure","Male Lead","Female Lead","Genetically Engineered "],"lable":"Original","following_count":11,"rating":4.5,"page_count":337,"view_count":783,"chapters_count":15,"last_update":1718382383,"description":"Ardia is not an ordinary young woman. She can do things other people simply can't. She is stronger and faster than anyone she has ever met, to the point that her friends view her as superhuman. Despite her powers, the world has not been kind to Ardia. Growing up in the care of one of Armenia's foremost criminal bosses, she and her powers have been used to further the needs of a criminal organization that draws wealth from drugs, arms dealing, and prostitution. To make matters worse, her mother has just been murdered. Not just murdered, but savagely and brutally attacked in a bizarre and seemingly random incident. Now, with the help of the criminal known as Razmik, Ardia is seeking to bring her mother's killer to justice. What she doesn't know is that this killer is even stranger than she is. Why was her mother killed so horribly? What is that blurry shape in the surveillance photograph? Can it really be something other than a human? And what is the reason for her own abilities, powers that no one has ever seen, let alone explained?Meanwhile, half a world away, Homer is setting out on a similar quest. Raised in the jungle by a Catholic missionary with a brutal past, Homer is anything but normal himself. Also imbued with strange abilities and an even stranger appearance, Homer is about to step into the civilized world for the first time on his mission to find his father. What Homer doesn't know is that this mission will lead him to find out more about his own origins, his own primal instinct, and his own emotions than he ever wanted to discover. Who is his father? Where did he go twenty years ago after Homer was conceived? What is the real story behind his mother's death? And who really is Father O'Connor, the man who raised him and a man who seems to have the darkest past of all? Ardia and Homer have each set out on their paths, each for their reasons. Each of our heroes is spectacularly different from ordinary humans, but the challenges and discoveries they will meet will affect them just as deeply as they would any normal soul. This is the story of how their separate paths will come to cross.","description_hash":5831486486243071252},{"title":"Dark Matter - Earth","fiction_id":"86627","link":"https:\/\/www.royalroad.com\/fiction\/86627\/dark-matter-earth","tags":["Post Apocalyptic","Xianxia","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":49,"chapters_count":1,"last_update":1715832889,"description":"In a world where the mysteries of dark matter remain elusive, Dr. Jensen, a lead physicist, and his team make a groundbreaking discovery. Using advanced imaging technology, they capture evidence of ghost particles generated by collisions at the Hadron Collider. These ghost particles, integral to dark matter, defy detection until now.\nYears later, the team embarks on an experiment to measure human control over dark matter, known as the Dark Matter Intelligence Quotient (DMIQ). However, their experiments lead to unforeseen consequences as the collision produces two orbs of dark matter with opposing forces.\nAs chaos ensues and the orbs threaten Earth, the team races to prevent disaster. But when the orbs merge and vanish, a young girl appears, wielding unimaginable power. With the fate of humanity hanging in the balance, the world is thrust into a new era—one where the mysteries of the multiverse are unlocked, and Earth's place within it is forever altered.","description_hash":4612212963663512906},{"title":"Elephant, Monster, and Angel","fiction_id":"86626","link":"https:\/\/www.royalroad.com\/fiction\/86626\/elephant-monster-and-angel","tags":["Comedy","Multiple Lead Characters","Adventure","Short Story","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":80,"chapters_count":2,"last_update":1715833251,"description":"Evan Swiston, beloved fourth grader and newbie soccer player, suddenly disappears from school. His parents are devastated and the case immediately leads to a dead end. All hope seems lost for little Evan, but a group of his closest childhood friends refuse to give up. Evan's favorite stuffed animal, the monster under his bed, and his estranged guardian angel begin a rescue mission that quickly turns into an adventure. Will they find Evan? Will Monster last without a bed to hide under? Will Angel and Elephant learn to get along? Find out by reading this awesome short story!","description_hash":-3650507551635749185},{"title":"Red Path: A Pokemon Story","fiction_id":"86625","link":"https:\/\/www.royalroad.com\/fiction\/86625\/red-path-a-pokemon-story","tags":["Anti-Hero Lead","Grimdark","Psychological","Male Lead","Tragedy","Action","Adventure","Villainous Lead"],"lable":"Fan Fiction","following_count":3,"rating":5.0,"page_count":367,"view_count":1980,"chapters_count":32,"last_update":1718461009,"description":"Red has lived in in the shadow of others his entire life. His father, Lance the Pokemon Champion and Blue, his childhood rival only add to his anxiety and lack of self-worth as he cannot hope to compete with them. Red is mocked and ostracized for not living up to his father's expectations he has only his Charmander, Cinder, to comfort him. Despised for his lesser ability in Pokemon battle he takes the Kanto Gym challenge to prove his worth as a person and finally gain some respect from the world that thought of him as a joke. \nHowever, this comes at the cost of his friendship with Cinder and morality. As Red becomes more and more obsessed with gaining respect to be seen as the true prodigy of his father, the Pokemon under his care suffer from abuse. His Charmander grows to question Red’s state of being, causing the trainer to question himself at every turn as it puts a greater and greater strain on their once glorious friendship.","description_hash":3877007977400243093},{"title":"The Groonian Alchemist","fiction_id":"86624","link":"https:\/\/www.royalroad.com\/fiction\/86624\/the-groonian-alchemist","tags":["Non-Human Lead","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":2,"rating":0.0,"page_count":15,"view_count":200,"chapters_count":5,"last_update":1718280158,"description":"Grimm is an unwanted orphan boy living the the Capital city of Arcturus. He navigates through his life dealing with odd nerves that he had since as long as he could remember. Slowly he began to find family and learn. Grimm was not human but something else.... something different.","description_hash":3796824411591547437},{"title":"Songs of Legends Book I: A Lamentation for the Past","fiction_id":"86623","link":"https:\/\/www.royalroad.com\/fiction\/86623\/songs-of-legends-book-i-a-lamentation-for-the","tags":["Progression","War and Military","Multiple Lead Characters","Action","Adventure","Fantasy","Supernatural","Magic","Strategy","High Fantasy"],"lable":"Original","following_count":2,"rating":5.0,"page_count":346,"view_count":716,"chapters_count":24,"last_update":1718636421,"description":"It is a season of uncertainty. Across the land, men and women sense the changing tides of fate and nations are on the brink of war. The actions of a few may change the course for many.\nJustinius Honerius, the illegitimate son of the illustrious senator Horatius Honerius, has been called back to the capital, Aquilla. After years of seclusion from society, he is to take his place with his family as a senator and help steer the course of his nation. It is a world of corruption, deceit, and manipulation that can make a cynic out of the most hopeful of men.\nLumina Humilus is the eldest daughter of a diplomatic family. Her city is on the verge of invasion from Aquilla and stands no chance against their power. If her world plunges into the chaos of war, Lumina must use all her skills to survive. \nAcross the land, rogue commanders scheme for control, creatures from the past reappear to speak to humanity, and dark forces work beneath the surface. A conflict seems inevitable, a fatalistic clash of two nations, pushed toward its conclusion by the manipulation of a mysterious cult. Their means to achieve all their goals is a power spoken of in myth…until now.\n\n\nThis is my first book on this platform and I have written the entire first book. I'm looking for contructive feedback, for people interested in this kind of story, and for support from fellow writers. \nThis story is really a passion project that I have been working on for four years now. It is heavily based on Roman history, American culture, political intrigue, and biblical stories. The entire series is planned out and I have begun my work on the second book. I'm hoping that, by posting here regularly, I can find an audience that wants to read my work and go from there. \nI'm in Arizona so expect strange time tables (we don't do daylight savings). Expect uploads every weekday. Monday and Wednesday will be posted at 8:00 AM (MT), Tuesday and Thursday at 4:00 PM (MT), and Fridays at 12:00 PM until I finish uploading this first book. All feedback is appreciated as long as it is kept polite, concise, and in the spirit of helping a fellow writer\/reader improve. \nEnjoy Songs of Legends Book I: A Lamentation for the Past","description_hash":-3374754669372803919},{"title":"The 13 Rings","fiction_id":"86622","link":"https:\/\/www.royalroad.com\/fiction\/86622\/the-13-rings","tags":["Male Lead","Tragedy","Action","Adventure","Fantasy","Magic","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":74,"chapters_count":2,"last_update":1715826422,"description":"Oh the mundanity.\nI remember when Mortals were dangerous, you know? Back in the day if  you sent plague to a kingdom, caused a years long drought, or started a holy war even. You'd have to watch out. The upstarts, those precocious little scamps might get it in their heads to challenge your divine authority and rip you from the Pillars of Heaven. Dangerous and with gumption, a true sight to behold, but now?\nMediocre, bland, mundane.\nIt's nobody's fault but our own, we got scared of the mortals, they proved themselves god slayers. Once we were scared of them, we got cautious, and treated mortals with care. Peaceful times between the mortals and gods meant less extraordinary mortals, for who needs the power to slay a god when there are no gods you want to slay?\nThis peace spiraled down into mundanity, blandness, and whatever iPad kids are. As these mundane souls grew in number, places like Limbo, Purgatory and the In-between got fuller and fuller. As we gods grew increasingly bored with the peace, an old idea resurfaced. An arena, gladiatorial combat in the after life.\nThat was fun for a while, but without growth or real danger, it was just weak mortals slapping each other with play swords. We needed to go bigger. A new plane, an entire reshuffling of the planes, and a new struggle was born. A death game after death. A way to urge those overly mundane souls to reach higher to be great..\nThe 13 Rings, the death game put on by the gods. Time to fight for your after life.","description_hash":5649621143165848944},{"title":"Dead Man Cultivation (A LitRPG cultivation Adventure)","fiction_id":"86620","link":"https:\/\/www.royalroad.com\/fiction\/86620\/dead-man-cultivation-a-litrpg-cultivation-adventure","tags":["LitRPG","Progression","Anti-Hero Lead","Xianxia","Male Lead","Action","Adventure","Fantasy","Martial Arts","Strong Lead","GameLit","High Fantasy","Dystopia"],"lable":"Original","following_count":355,"rating":4.25,"page_count":174,"view_count":23611,"chapters_count":24,"last_update":1718399144,"description":"In a world full of turmoil where the cultivators don‘t care for the ordinary man, where monsters have been unleashed, displacing entire villages away from their grounds, with little resistance from cultivators unless there is a benefit to be gained.\n\n\nA world where the goddess’s judgement was tainted by the horrors perpetrated by humanity.\n\n\n\nSeph, a water carrier and an aspiring scholar, suddenly becomes an undead cultivator.\nHe finds himself hunted in the middle of a war between cultivators of the immortal path and cultivators of the undead path.\nWith a legendary martial arts style, a mysterious weapon, and a bloodline, can he become the first Undead Cultivator to reach the Peak?\n-------------------------\nWhat to expect:\nRead this if you enjoy your LitRPG crunchy.\nStarts slow, ramps up quickly, Multiple POVs, Fast Paced Action, Martial arts, Epic Loot!\nStatus screen in chapter 22, Cultivation in chapter 26\nI'll release two chapters weekly, Tuesday and Friday.","description_hash":6360223535695663147},{"title":"Deaths Homecoming","fiction_id":"86619","link":"https:\/\/www.royalroad.com\/fiction\/86619\/deaths-homecoming","tags":["Male Lead","Strong Lead","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":107,"view_count":988,"chapters_count":16,"last_update":1717977733,"description":"Vin, a young skater, found comfort in his everyday norms. However, his life takes a drastic turn after a mysterious Voice appears and proclaims that Earth will be assimilated into a planet of magic called Auroraan. Vin quickly learns of this world's harsh reality and, after perishing, ventures to uncover the joys he'd lacked in his first life.\nVin attains a formidable power through death, but his strength comes at a steep price. Entangled in a web of conflict far beyond his wildest imagination, he learns he must conquer a treacherous realm called the Archival Dimension before becoming truly free.","description_hash":-2608737143953310365},{"title":"Pre-Warp Survival","fiction_id":"86618","link":"https:\/\/www.royalroad.com\/fiction\/86618\/pre-warp-survival","tags":["Female Lead","Sci-fi","Adventure","Male Lead","First Contact","Soft Sci-fi"],"lable":"Original","following_count":79,"rating":4.0,"page_count":88,"view_count":4176,"chapters_count":14,"last_update":1718262019,"description":"Things have gone.... sideways in the most extreme way. Keith and Val have become the newest unwilling contestants on an alien game show called Pre-Warp Survival, where non-FTL species are forced to compete to survive. To the winners go the spoils, and to the losers, they become the newest subjects of the Kathrall Dominion.","description_hash":-9036909246253228416},{"title":"Another Kind: A Predator\/Mimic Fanfiction Crossover Novel","fiction_id":"86617","link":"https:\/\/www.royalroad.com\/fiction\/86617\/another-kind-a-predatormimic-fanfiction-crossover","tags":["War and Military","Psychological","Multiple Lead Characters","Sci-fi","Action","Romance","Male Lead","Female Lead","Non-Human Lead","Genetically Engineered ","Technologically Engineered","First Contact","Hard Sci-fi"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":36,"view_count":500,"chapters_count":9,"last_update":1718385302,"description":"The year is 2099\nThe United Space Systems Conglomerate has sent a freighter, carrying a team of scientists, deep into the heart of the human sphere. Their mission, to revive the failed New York City Judas Project and create bioengineered super-soldiers for use in battles across the expanse of space.\nDr. Teresa Boyd is the lead scientist in charge of the Judas Resurrection Project. Following in the footsteps of her predecessor, Dr. Susan Tyler, Dr. Boyd enthusiastically begins work on the first specimens. However, it’s only a matter of time before the killing begins in earnest.\nWeyland and Dayshadow Industries are in a neck and neck race to control the future of warfare in space. But only one entity can win. Unless some unlikely allies can help turn the tide.\n\nDisclaimer: I do not own the copyright to either the yautja (predator) or alien\/xenomorph (Alien,Aliens franchise); or the mimic \nThis is non-commercial appreciation fanfiction from a child (all grown up); who liked monster movies maybe just a little too much.","description_hash":-6194238063791645473},{"title":"The tales of Pyro and Aqua: Forest of the Giants","fiction_id":"86616","link":"https:\/\/www.royalroad.com\/fiction\/86616\/the-tales-of-pyro-and-aqua-forest-of-the-giants","tags":["Multiple Lead Characters","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":132,"chapters_count":3,"last_update":1717498564,"description":"Pyro and Aqua are two kids in a small village in the middle of nowhere in a country of no relevance to the outside world live a peaceful quiet life. Until one day Pyro learns of a deadly curse that won't let him live past 18 and there's no cure so he decides to live the best life he can. But he is too scared to leave behind his family and friends until an Injured elementoid named Geo comes to their village he tells them of a mage that can cure any disease all the way on the other side of the continent so Aqua drags Pyro with Geo to save Pyro","description_hash":3225304340162990901},{"title":"SCORE!!","fiction_id":"86615","link":"https:\/\/www.royalroad.com\/fiction\/86615\/score","tags":["Progression","Strategy","Psychological","Male Lead","Slice of Life","Action","Drama","Romance","Sports","School Life","Strong Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":91,"chapters_count":3,"last_update":1718629250,"description":"The Story of a 15-Year-Old Boy, High School First Year, Yoshiyuki (Yuki) Nakamoto. Junior High Futbol Prodigy joins Asahi Gakuen Senior High in the Numazu Prefecture. As a student at Shinukana Kaze, he was a part of their legendary soccer team. One day, it all fell apart for him and he left the team. Will he find his love for the sport he once had??","description_hash":791298221478241002},{"title":"The Halcyon System [Anomalous Apocalypse LitRPG]","fiction_id":"86614","link":"https:\/\/www.royalroad.com\/fiction\/86614\/the-halcyon-system-anomalous-apocalypse-litrpg","tags":["LitRPG","Urban Fantasy","Progression","Post Apocalyptic","Psychological","Action","Adventure","Fantasy","Supernatural","Female Lead","Low Fantasy"],"lable":"Original","following_count":3075,"rating":4.68,"page_count":276,"view_count":139835,"chapters_count":22,"last_update":1718212621,"description":"The truth’s a thin line. Claire’s about to cross it. \nClaire Pendleton’s seen the thin spots between dimensions since she was five, when another reality merged into her family’s apartment and killed her mom. No matter what her perfect sister and deadbeat dad say, she knows the truth about that night ten years ago–-and about Vancouver Island’s other thin places. \nThose weak spots start opening during her sister’s graduation, and the boundaries between realities collapse. Claire’s trapped in a global disaster, and a powerful system’s granting her skills and power-ups. Worse, a shadowy agency resisting the anomalous apocalypse takes interest in her.\nNow, Claire must fight unknowable horrors, answer inexplicable inquiries, and reckon with globe-spanning organizations to discover the truth about the apocalypse, her family, and who—and what—she’s becoming. \n\nWhat to Expect:\n- SCP-Inspired (XK End of the World Scenario)\n- Slow-Burn System\n- Weak to Strong MC\n- 4\/week Posting Schedule (M, W, F, Sat) for a while, dropping to something slower when I burn through my backlog","description_hash":-7530555639440258200},{"title":"POSSESSER: FIGHTER FROM ANOTHER WORLD","fiction_id":"86613","link":"https:\/\/www.royalroad.com\/fiction\/86613\/possesser-fighter-from-another-world","tags":["Portal Fantasy \/ Isekai","Male Lead","Sci-fi","Action","Adventure","Fantasy","Reincarnation","Sports","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":39,"chapters_count":1,"last_update":1715772558,"description":"A Tragic Story Of A Man That Died, Doing A Justice Deed. However, It's Not Over For Him, As He Meets The Goddess Of Death And Souls, Where She Offers Him A New Beginning.","description_hash":3462652784772341832},{"title":"The Boundless Journey","fiction_id":"86612","link":"https:\/\/www.royalroad.com\/fiction\/86612\/the-boundless-journey","tags":["Dungeon","War and Military","Martial Arts","Adventure","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":32,"chapters_count":1,"last_update":1715769778,"description":"\"The Boundless Journey\" is a fantasy web novel that tells the story of Torune's journey, an orphaned youth living in a remote village, until one day he encounters a hunter with extraordinary powers, who intends to teach him to become a hunter.\nThis encounter ultimately changes his life. Under the guidance of the hunter, he begins to explore his potential to become a professional hunter.\nDespite his strength being already sufficient to become a good hunter under the hunter's training, due to governmental issues and his young age, he must first enroll in a hunter school to be recognized and receive official missions from the government.\nTogether with some friends he meets at the hunter school, he gradually begins to uncover various new areas that could be occupied in the future by humanity, which will eventually be recognized as the best assets of mankind.","description_hash":7423181647661426360},{"title":"Project Eleven X Pokemon (Crossover Event)","fiction_id":"86610","link":"https:\/\/www.royalroad.com\/fiction\/86610\/project-eleven-x-pokemon-crossover-event","tags":["GameLit","Comedy","Multiple Lead Characters","Contemporary","Secret Identity","Action","Fantasy","Reader Interactive","Female Lead"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":7,"view_count":44,"chapters_count":1,"last_update":1715766537,"description":"Lycka Benibara LOVES video games.  She is a huge Nintendo fan, but also a huge Pokemon fan.  So, I want to do an unofficial crossover!\nWhat if she and the Crucis Sentinels were Gym Leaders?!\nThis might end up being something big.  Give me your thoughts.","description_hash":5842879504745924663},{"title":"Sweet Dreams ","fiction_id":"86609","link":"https:\/\/www.royalroad.com\/fiction\/86609\/sweet-dreams","tags":["Female Lead","Drama","Romance","School Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":37,"chapters_count":1,"last_update":1716605868,"description":"An independent girl strives to follow her best friends dreams.","description_hash":6625447165835715055},{"title":"Painters Last Gamble","fiction_id":"86608","link":"https:\/\/www.royalroad.com\/fiction\/86608\/painters-last-gamble","tags":["Female Lead","Contemporary","Slice of Life","Adventure","School Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":30,"view_count":211,"chapters_count":5,"last_update":1718504565,"description":"Janie used to be a passionate artist. But now her pessimistic attitude walked her down a pathway, with no way to be redeemed as an artist again. \nMoranda, a professional and famous artist, was suffocated in a pool of debt she owed to someone. In an attempt to save herself from the threshold of debt, she starts painting, only to get held back by an unwanted art block and no motivation. In the end, she gets killed, leaving behind an incomplete canvas that she will regret and deem a failure in her eyes beyond the human world. \nBoth Janie and Moranda collide with each other after Janie piques interest in a bloodied canvas. \nAs days and months go by, Janie and Moranda assist one another and learn more about the other's history, eventually leading up to Janie’s adventure helping Moranda ease her mind from her unpaid debts as a new upcoming professional artist. \nWhile doing so, she encounters apathetic people, conflicted feelings towards family members, and uneasy tension against Moranda’s killer's daughter and AI.\nJanie goes through life, studying the behavior, relationship, habits, and trauma of the people around her. Inputting those elements in her own works to understand the world around her better and to make a certain someone proud.\n\n\nNotes: I'm a new writer and wanted to try yk show my work! i'm free to criticism, so please don't be afraid to give me criticism! (i can't really improve without it even though i'm trying my best to read a lot of books)\nUpdates with probably be random (definitely not a lot of exaggerated long waits for new chapters! dwdw!)","description_hash":-5771791842722576119},{"title":"Surviving and thriving (Fallout SI)","fiction_id":"86607","link":"https:\/\/www.royalroad.com\/fiction\/86607\/surviving-and-thriving-fallout-si","tags":["Post Apocalyptic","Male Lead","Action","Adventure","Mythos","Genetically Engineered ","First Contact"],"lable":"Fan Fiction","following_count":5,"rating":0.0,"page_count":16,"view_count":137,"chapters_count":1,"last_update":1715766504,"description":"Join John as he finds himself thrust into a post apocalyptic wasteland and fights tooth and nail to survive.","description_hash":448181012733915024},{"title":"A Dream of Destiny","fiction_id":"86586","link":"https:\/\/www.royalroad.com\/fiction\/86586\/a-dream-of-destiny","tags":["Tragedy","Action","Adventure","Fantasy","Low Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":28,"view_count":400,"chapters_count":9,"last_update":1716220986,"description":"The queen's life is in danger, and the only thing that can save her is a potion made from the rarest of materials. Three soldiers are assigned by the king to this dangerous mission. They had to go in order to ask the other kingdom for assistance. But something happens when they are on the mission...","description_hash":-4450786037759576955},{"title":"The Lady and the Harper","fiction_id":"86585","link":"https:\/\/www.royalroad.com\/fiction\/86585\/the-lady-and-the-harper","tags":["Progression","Ruling Class","Male Lead","Fantasy","Magic","High Fantasy","Genetically Engineered "],"lable":"Original","following_count":0,"rating":0.0,"page_count":74,"view_count":605,"chapters_count":13,"last_update":1718305201,"description":"Prince Garrin has never wanted the responsibilities of ruling a kingdom. His passions lie in music, adventures, and storytelling—but you can’t travel the world and put your adventures to song when you’re the sole heir to the throne. Besides, his 21st birthday is coming up, which means he will be presented with a princess who has been magically designed specifically for him, and the task of producing a new heir will fall on his shoulders as well. It is in this princess that Garrin finds his salvation. Princesses are supposed to act as court companions and mothers, but Garrin breaks tradition by requesting a few more qualities. A complete knowledge of the kingdom and its history, for one, plus an understanding of court procedures and politics, trade, governance, and foreign affairs—and Garrin’s princess will be the perfect ruler. The problem is: the princess isn’t interested in running Garrin’s kingdom while he goes off adventuring. And the king’s advisers, used to the personal power that comes from a weak figure of state, don’t want a ruler who knows how to rule. Now instead of avoiding responsibilities, Garrin is avoiding assassination attempts and conspiracies to overthrow his family. But with Princess Arya’s help, he might just stand a chance at holding his throne and—maybe—find true love along the way.","description_hash":-8592784971879287397},{"title":"naruto fanfic: a new osutsuki","fiction_id":"86584","link":"https:\/\/www.royalroad.com\/fiction\/86584\/naruto-fanfic-a-new-osutsuki","tags":["Reincarnation","Multiple Lead Characters","Action","Female Lead","Genetically Engineered "],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":3,"view_count":52,"chapters_count":1,"last_update":1715749205,"description":"a young otaku born in and out of the hospital gets a chance to finally have a life but it's in her favorite anime naruto. how will this young otaku change the world of naruto and more importantly will she servive and will she find the differences of this naruto world \nwill contain spoilers","description_hash":-8807626771028715029},{"title":"The Journey Back into Abyss","fiction_id":"86583","link":"https:\/\/www.royalroad.com\/fiction\/86583\/the-journey-back-into-abyss","tags":["Time Travel","Psychological","Adventure","Fantasy","Mystery","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":47,"chapters_count":1,"last_update":1715749180,"description":"King John is thrown into the 23rd century from the 10th century, he is wise, but will he be able to uncover the truth on what happened and get back home?","description_hash":5523151874278472375},{"title":"Song of the Ascendant","fiction_id":"86582","link":"https:\/\/www.royalroad.com\/fiction\/86582\/song-of-the-ascendant","tags":["Progression","Psychological","Female Lead","Action","Adventure","Fantasy","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":5.0,"page_count":61,"view_count":242,"chapters_count":7,"last_update":1718451952,"description":"How far would you go to save the ones that you love?\n\nThe last year of Belkai Androva's life has been a whirlwind. She has killed the demon that oppressed her, married the half-elf Davos, and fought off an assassination attempt from the Sons of Retribution. She knows that further threats are coming, but she allows herself a chance to be a wife and lover, and find the secrets behind the source of her own power in Narandir.\n\nBut the peace cannot last. News soon arrives that a mage's council has been attacked in a bloody ambush.\nThe Children of the Wind, long safe in the Ikari Dominion, are under direct threat from the east.\nAnd beneath Narandir, betrayal threatens the Forest's existence.\n\nBelkai is soon swept into a crisis that threatens the existence of all that she loves, in the earth-shattering conclusion to the 'Ascendant' saga. Whatever choices she makes, the world will never be the same, and the love that has driven her for so long may not be enough for the storm ahead.\n\nAlso published on Wattpad under the same title.","description_hash":3424247005670888771},{"title":"Return of Hero Soldier","fiction_id":"86581","link":"https:\/\/www.royalroad.com\/fiction\/86581\/return-of-hero-soldier","tags":["Strong Lead","Tragedy","Action","Romance","Attractive Lead"],"lable":"Original","following_count":3,"rating":0.0,"page_count":16,"view_count":662,"chapters_count":8,"last_update":1717993198,"description":"Kim Woo Bin was a soldier who retired at an early age to rest and run a small café in his town, Damyang. He was suddenly dragged into another world where he fought different types of monster and defeated the demon king to return to earth. After return, he just wants to rest and find someone to love and spend his life in leisure with his family and friends.","description_hash":5052983800262391458},{"title":"Island X","fiction_id":"86580","link":"https:\/\/www.royalroad.com\/fiction\/86580\/island-x","tags":["Strategy","Male Lead","Sci-fi","Action","Horror","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":46,"chapters_count":1,"last_update":1715744691,"description":"Amidst the chaos of the Covid-19 pandemic, a group of privileged Southeast Asian students yearns for escape. Their dreams shatter when their private jet plunges into crisis, forcing them onto the remote shores of Island X in the South China Sea.\nStranded, they confront a chilling reality: a high-security prison looms, accompanied by a clandestine laboratory. Their shock deepens as they encounter a motley crew of illegal immigrants, inexplicably quarantined on the island.\nBut the true horror unfolds when they discover Island X's sinister secret: it's ground zero for a troubled Covid-19 vaccine, birthing monstrous predators. As survival becomes a battle against both nature and man-made terrors, the students must navigate treacherous waters to escape the island's clutches.\nCan they endure the perils of this nightmarish landscape, or will they become prey to forces beyond their control?","description_hash":133445394381279775},{"title":"The Biomass","fiction_id":"86579","link":"https:\/\/www.royalroad.com\/fiction\/86579\/the-biomass","tags":["Villainous Lead","War and Military","Psychological","Multiple Lead Characters","Strong Lead","Action","Fantasy","Non-Human Lead","Magic","Strategy","High Fantasy","Genetically Engineered ","First Contact"],"lable":"Original","following_count":13,"rating":0.0,"page_count":16,"view_count":1901,"chapters_count":11,"last_update":1715884455,"description":"I Am The Hive and The Hive I Am. I Seek to Collect More Mass. I Seek To Replicate. I Seek To Turn Worlds Into Me. For I Am The Hive And The Hive Must Grow...\nThis story centers around an organic super organism that devours worlds that had a part of itself travels through a black hole and is now seeking to grow and expand in a fantasy world.\nThe chapters are short and easy to read. Perspective switches happen frequently but there will be some space in between them so you can tell where the POV switch accrues. I Write frequently but I Ultimately will write when I feel Like It.\nThis is my first story (not technically because I did make another but it was only a chapter long and was deleted) So I would like to have reviews and comments on how I could improve and I would Like All The Help And Feedback You Can Give! and remember, FOR DA SWARM!","description_hash":909518835891917302},{"title":"Its A Cold World. ","fiction_id":"86578","link":"https:\/\/www.royalroad.com\/fiction\/86578\/its-a-cold-world","tags":["LitRPG","Reincarnation","Dungeon","Villainous Lead","Male Lead","Action","Adventure","Fantasy","Romance","Magic","GameLit","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Giovanni \"The Ice King\" DeLuca was a gangster in modern-day New York. He worked his way up his organization's hierarchy until he was the head of the family. One night while enjoying some tea in his sitting area. The last thing he remembered was a red light from his window. Now he finds himself in a new world. One of Magic, Gods, and Monsters. The age-old adage that money is power no longer works in this world. Now Power is everything. So, lets follow Gio's journey as he quickly decides to become a powerhouse in the new world.","description_hash":-8731877232686110446},{"title":"The Truck Effect [A Multiversal Isekaiism]","fiction_id":"86577","link":"https:\/\/www.royalroad.com\/fiction\/86577\/the-truck-effect-a-multiversal-isekaiism","tags":["Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","Strategy","Non-Human Lead","Action","Adventure","Drama","Fantasy","Reincarnation","Male Lead","Magic","Dystopia"],"lable":"Original","following_count":956,"rating":4.77,"page_count":320,"view_count":70895,"chapters_count":39,"last_update":1718387278,"description":"To save a universe, a reincarnator must die. This keeps happening and has never made any sense.\nLamutri is a Chapel assassin of the multiversal House of Fate, and wants to know why. For dispatching reincarnators, he is promised ascent. But his reality-altering Defects keep him strangled at the bottom.\nWhen straightforward missions start going horribly, exponentially wrong, the Chapel holds Lamutri to blame. There’s a simple solution: murder the problem. But with the fate of universes in his hands, he realises someone has been keeping very significant secrets. For a very long time.\n\nWhat to expect:\n- Isekai tropes in a rational framework- Fast-paced serious plot focus- Questions raised and answered- Slow-paced, non-standard progression (think integral to the plot, with various consequences)- The multiverse!\nUpdates:\nStory will update daily for the first couple of weeks, and will slow to three times per week afterwards. Book One is complete and guaranteed to finish.","description_hash":223264533515410355},{"title":"Mythical Fights","fiction_id":"86576","link":"https:\/\/www.royalroad.com\/fiction\/86576\/mythical-fights","tags":["Multiple Lead Characters","Fantasy","Supernatural","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":1,"rating":5.0,"page_count":65,"view_count":1234,"chapters_count":32,"last_update":1718434819,"description":"An ancient battle, doomed to return over and over with new heroes. How will this story end and more importantly will the Darkest Hour ever end? (cover of the main characters created by Zodiacbug9967 over on discord)","description_hash":-8238448078715058811},{"title":"Duplicate Elements","fiction_id":"86575","link":"https:\/\/www.royalroad.com\/fiction\/86575\/duplicate-elements","tags":["Urban Fantasy","Sci-fi","Supernatural"],"lable":"Original","following_count":2,"rating":5.0,"page_count":164,"view_count":815,"chapters_count":22,"last_update":1717135800,"description":"In this land woven from history and legend, ancient powers are awakening. For a long time, the mythologies, prophecies, and philosophies of the East and the West seemed separate and distinct, but as time progressed, these boundaries blurred. It was in this moment that the protagonist, Han Xuan, an ordinary city worker, found himself drawn into a grand and unpredictable adventure.\nAfter an unexpected accident in Beijing, Han Xuan discovered he had a unique connection to an ancient prophecy. Professor Wang Bin from the Institute of Life Sciences revealed to him an ancient Taoist text containing references to the \"Ten-Thousand-Year Heavenly Calamity,\" a cyclical force whose appearance signaled a dramatic shift in the world. Simultaneously, the Western text \"Book of Revelation\" contained a similar warning, hinting at the coming apocalypse. Han Xuan's destiny was thus intertwined with these two prophecies.\nThis call of fate brought together extraordinary individuals from different backgrounds. In Shandong's Laoshan, he met Yuan Dun Shangren, a wise sage who helped Han Xuan understand the mysteries of Eastern philosophy and provided him with secret techniques to withstand the Heavenly Calamity. In Beijing, the formidable Taoist master Wang Yong used his profound Taoist skills to support Han Xuan. In the United States, adventurer Ikelus George introduced him to the truths behind Western prophecies and legends.\nHowever, the most astonishing encounter for Han Xuan was with Furli, a beautiful woman from the fifth dimension. This enigmatic figure not only brought knowledge and power from another realm but also guided Han Xuan toward discovering the true nature of his destiny. With her assistance, Han Xuan's perspective expanded significantly, revealing that his mission was more complex than he had imagined. Meanwhile, his friend Yue Nannan became his emotional anchor, providing him with endless motivation in this extraordinary world.\nThroughout this grand adventure, Han Xuan realized that he not only had to face challenges from ancient prophecies but also had to contend with threats from the real world. Alongside a group of brave and unique allies, he explored sacred lands, unraveled hidden mysteries, and ultimately sought the hope for world peace.\nThis is an epic adventure that spans time and space, imbued with boundless wisdom and courage. On this legendary journey, Han Xuan would discover his own potential and, amidst the turmoil of the world, write his own immortal chapter.","description_hash":-1956712530210687500},{"title":"Rise of the mad archer","fiction_id":"86574","link":"https:\/\/www.royalroad.com\/fiction\/86574\/rise-of-the-mad-archer","tags":["Progression","War and Military","Male Lead","Strong Lead","Action","Adventure","Fantasy","Mystery","Supernatural","Magic","High Fantasy","Mythos","Ruling Class"],"lable":"Original","following_count":8,"rating":4.67,"page_count":136,"view_count":1550,"chapters_count":18,"last_update":1717902158,"description":"On an island in the middle of the world, Okimodo is an Azurai clan boy about to undergo his rite of passage to become a man. Having been born able to channel the power of his clans archetypal deity, and gifted with dashing good looks and charisma, he sets out to pass his right of passage and conquer the surrounding islands. But with a conspiracy brewing in his own country and a massive ever expanding empire looming in the distance, will his path to success be so simple?\nwhat to expect: \nstrong to stronger mc. slower pacing than my other work. A large complex world.A lot of religious references. A fairly light hearted story that gradually gets darker and more mature over time. \n*it will be updated at a rate of 3 to 7 chapters a weak and an individual chapter can be anywhere from 1k to 5k words long.*","description_hash":-5288396934525899213},{"title":"Shadow Monarch Past","fiction_id":"86573","link":"https:\/\/www.royalroad.com\/fiction\/86573\/shadow-monarch-past","tags":["GameLit","Dungeon","Male Lead","Tragedy","Action","Fantasy","Romance","Supernatural","Magic","Low Fantasy","Progression"],"lable":"Original","following_count":1,"rating":0.0,"page_count":12,"view_count":144,"chapters_count":1,"last_update":1715726413,"description":"In a future where magic and technology intertwine, Hiro and Iota, bound by a mystical soul link, navigate their lives from childhood through harrowing battles against formidable foes, including the mythical Dragon god. Their intertwined destinies drive them towards exponential growth in abilities and deep personal losses. As the last survivor in a devastated world, Hiro's final confrontation with the Dragon God hinges on a mysterious artifact, leading to an unexpected resolution that tests the power of love and sacrifice in shaping destinies.","description_hash":-6286801991976492979},{"title":"Veil of Visions ","fiction_id":"86572","link":"https:\/\/www.royalroad.com\/fiction\/86572\/veil-of-visions","tags":["Progression","Grimdark","Male Lead","Strong Lead","Action","Adventure","Fantasy","Dystopia"],"lable":"Original","following_count":1,"rating":0.0,"page_count":38,"view_count":441,"chapters_count":7,"last_update":1715915055,"description":"In the sprawling and untamed world of Lumina, where ancient secrets lie buried beneath every stone and shadow, destiny bestows its Gifts with stringent expectations rather than favor. For Cael, a determined and cunning youth marked by poverty, the upcoming Rite of Essence is more than a mere passage into adulthood—it is a gateway to alter his precarious fate.\nThe Rite of Essence, a revered and daunting ceremony, offers him a rare chance to break the cycle of hardship that has tethered him. Success in the trial promises a Gift—supernatural powers granted by the world’s essence, capable of lifting him from poverty and into prominence. However, the stakes are perilously high, as failure means a dissipation into raw mana, feeding the very land that has both cradled and cursed his existence.\nNote - This is my first book and I hope you enjoy it as much as I enjoy writing it. I have spent hours planning and organizing my thoughts so a rough idea for an ending is planned along with the story but as i gain experience in writing things may change.I want to hear your feedback and any suggestions you may have for the novel. Also if you notice any grammatical errors please let me know i will fix them right away.","description_hash":357805761012831692},{"title":"Ten Days Apocalypse","fiction_id":"86571","link":"https:\/\/www.royalroad.com\/fiction\/86571\/ten-days-apocalypse","tags":["GameLit","Time Loop","Male Lead","Adventure","Fantasy","Mystery","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":290,"view_count":2194,"chapters_count":60,"last_update":1715840765,"description":"\"When I thought it was just an ordinary day, I found myself captured in the Land of Finality. \"When I thought I just had to keep participating in the game of death to escape, I discovered that people began to awaken supernatural powers. \"When I thought this place was the 'Land of God-making,' everything was heading towards annihilation.","description_hash":3344629930959774335},{"title":"Renegades, Not Raiders","fiction_id":"86570","link":"https:\/\/www.royalroad.com\/fiction\/86570\/renegades-not-raiders","tags":["Anti-Hero Lead","War and Military","Grimdark","Non-Human Lead","Sci-fi","Action","Male Lead"],"lable":"Original","following_count":0,"rating":3.0,"page_count":54,"view_count":158,"chapters_count":3,"last_update":1715828820,"description":"The distant battlefields of the future are often strewn with the bodies of good men and women, and just as many bad.  Sometimes the good ones manage to get out, and sometimes they don’t.  The crew of the IS Mortifying Command were never given the chance to find out for themselves.  When they were given an untenable order they took the third option and left the war and all its troubles behind.  The desertion was swift, the Captain of the ship changing its name and designation before they struck it out on their own, free from the war and its harsh realities.  But what job could the crew of a deserted military vessel expect to find on the dark fringes of colonised space where terrors lurk in the dark and the whims of warlords hold more power than the government?  The crew of the ISMC will have to find their own path towards prosperity, one day at a time.  And each new day feels like a battle.","description_hash":5215611337500222696},{"title":"Working For An Evil Wizard","fiction_id":"86569","link":"https:\/\/www.royalroad.com\/fiction\/86569\/working-for-an-evil-wizard","tags":["GameLit","Portal Fantasy \/ Isekai","Urban Fantasy","Anti-Hero Lead","Comedy","Adventure","Fantasy","Satire","Supernatural","Multiple Lead Characters","Magic","High Fantasy","Villainous Lead"],"lable":"Original","following_count":2,"rating":5.0,"page_count":183,"view_count":1801,"chapters_count":24,"last_update":1717815674,"description":"In the quiet suburbs of Kansas City, the humdrum of daily life around the local comic book store is shattered when a dark and ominous figure appears. A malevolent wizard with a proposition they can’t ignore. Caught between the allure of newfound power and the safety of their humdrum existence, these unlikely heroes must make a choice that will shape their destinies forever. As they navigate a treacherous landscape of magic, monsters, and moral ambiguity, the bonds of friendship will be tested, alliances will be formed, and the very definition of good and evil will be challenged. Will they embrace their inner heroes or succumb to the darkness that beckons? \nAudiobook and Ebook available on Amazon right now.","description_hash":6764885221979098491},{"title":"The Cursed Gift","fiction_id":"86568","link":"https:\/\/www.royalroad.com\/fiction\/86568\/the-cursed-gift","tags":["Progression","Ruling Class","Multiple Lead Characters","Secret Identity","Strong Lead","Fantasy","Romance","Supernatural","Female Lead","Non-Human Lead","Magic","High Fantasy","Dystopia"],"lable":"Original","following_count":1,"rating":0.0,"page_count":23,"view_count":164,"chapters_count":3,"last_update":1716967733,"description":"| The Cursed Gift is a YA Paranormal\/Fantasy book that follows a young hybrid as she finds herself at the cusp of a looming war. |\nAlisa is taken from the only life she has ever known and made to exist with a species she was taught to fear and hate. Suddenly, she's stuck between two vastly different worlds, staring down an unexpected war, when a prophecy is revealed that endangers the existence of all those who are gifted. \nCan she find her true place before time runs out?\n'For it is up to the half-breed to unite the two species against a greater evil which threatens to tear their world apart.'","description_hash":-6011534185416617106},{"title":"The Promise Bracelet","fiction_id":"86567","link":"https:\/\/www.royalroad.com\/fiction\/86567\/the-promise-bracelet","tags":["Anti-Hero Lead","Multiple Lead Characters","Contemporary","Secret Identity","Drama","Romance","Mystery","Female Lead","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":39,"chapters_count":1,"last_update":1715709800,"description":"A tragic story full of lies, secrets, cheating, and betrayal.\nWalong magkakaibigan na sabay-sabay nangako sa bawat isa na mananatili ang pagkakaibigan magpakailanman.\nNgunit ano ang mangyayari kung pag-ibig para sa taong minamahal ang nakasalalay para mapanatili lamang ang pagkakaibigan? \nMasasabi nga bang pagmamahal ang pagtatago ng mga lihim at sikreto?\nSamahan sina SHARMAINE, DANICA, GABBIE, JANINE, KATARINA \"KATIE\", MARGARET, NICOLAI, at PRINCESS sa isang kwentong magpapatunay na sinuman ay gagawin ang lahat sa ngalan ng pag-ibig.\n----------\nThis work contains themes of cheating, domestic violence, eating disorders, and violent death that may be considered profane, vulgar, or offensive to some readers and\/or inappropriate for children. Reader discretion is advised.\nThe thoughts, actions, and\/or beliefs of characters in this story do not portray the thoughts, actions, and\/or beliefs of the author.\nThis story is all fiction and in accordance with the wide imagination of the author. The names of the characters, places, and each scene, if there is any resemblance to the real events, are unintentional.","description_hash":-2699039005442901465},{"title":"The power granter","fiction_id":"86800","link":"https:\/\/www.royalroad.com\/fiction\/86800\/the-power-granter","tags":["Male Lead","Contemporary","Secret Identity","Strong Lead","Action","Fantasy","Short Story","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":4,"view_count":49,"chapters_count":1,"last_update":1716112445,"description":"Dyn, a normal guy living in the city of Adrel, who is a fiction fanatic and wishes for the world to get powers. One morning, as he woke up and was getting ready for school, he accidentally discovered that he had gotten powers and his wish had become a reality but, his power was different from others, he could grant powers to others and use all powers he could imagine but on certain conditions.","description_hash":-912340048728784403},{"title":"Azure Chronicles: Oasika Existence","fiction_id":"86799","link":"https:\/\/www.royalroad.com\/fiction\/86799\/azure-chronicles-oasika-existence","tags":["Portal Fantasy \/ Isekai","Non-Human Lead","Contemporary","Slice of Life","Action","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":25,"view_count":153,"chapters_count":4,"last_update":1717421396,"description":"On what should have been an uneventful boat trip, Lola Sakamoto and her entourage are forcefully dragged into an alternate universe by a higher force of nature. Finding themselves in the middle of a modern-day countryside, the group must now find a way back home. However, due to the discovery of magic unique to the world, the only member of the group capable of getting the group home refuses to in favour of studying the new magic.\nMeaning the gang is fundamentally trapped until Kimmi-Ka concludes her research, although being stranded is the least of their worries as their arrival draws the attention of a mysterious organisation.","description_hash":-1472010497363110458},{"title":"The Four Allies","fiction_id":"86798","link":"https:\/\/www.royalroad.com\/fiction\/86798\/the-four-allies","tags":["Portal Fantasy \/ Isekai","Progression","Psychological","Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","Female Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":37,"chapters_count":1,"last_update":1716094938,"description":"This story will involve four regular people from Earth, and they came here to this new fantasy world all of a sudden. They will do their best with what they have, and it will be a struggle. But they believe they can do it.","description_hash":-875047073692686433},{"title":"Mad World","fiction_id":"86797","link":"https:\/\/www.royalroad.com\/fiction\/86797\/mad-world","tags":["Urban Fantasy","Progression","Grimdark","Multiple Lead Characters","Drama","Action","Fantasy","Horror","School Life","Supernatural","Female Lead","Magic","Low Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":297,"view_count":1397,"chapters_count":20,"last_update":1718546433,"description":"When magical beasts cross into Japan through portals, magical huntresses (and some magical huntsmen) are there to slay them. Consisting of a group of teenagers and young adults working semi-independently under the guise of the Protection and Research Agency, they fight day in and day out for a variety of reasons, using special rings to transform and gain weapons to use in their battles, for which they get paid for each magical beast they kill and bonuses if they save anyone attacked by them.\nOne particular magical huntress, the sword-swinging orphan Ruka Kishio, is asked to join a small group of these hunters led by the charismatic Hana Miyashita, who herself wields a katana and is descended from former nobility, after Hana sees Ruka easily kill a beast by herself while on lunch break from school. Ruka, a girl with a troubled and at times traumatic past who usually fought alone, accepts after barely losing a sword duel to Hana. She soon finds herself bonding with the other members of the Fox Knights, in particular their second-in-command and only boy Yoshiro Arikawa despite the two of them frequently arguing, and she also finds herself becoming its third-in-command and primary trainer as they battle magical beast after magical beast.\nHowever, Hana has deeper ambitions to restore the honor of her family name, and she aspires to attain power by any means necessary. Can Ruka help Hana with her dreams, or will she be swept up in them?\n(Specific warnings: Mentions\/depictions of abuse committed by some antagonists, graphic depictions of violence, homophobia\/transphobia by some antagonists.)\nSchedule as of now: New chapter posted every Friday, Saturday, and Sunday at 10:00 AM EST.\nCover art by littleruby726. Follow them for more great art on Twitter.\nWARNING TO TRANSLATORS: DO NOT POST RUSSIAN TRANSLATIONS OF MY WORKS. I do not permit anyone to translate my works into Russian, and urge anyone who follows me to mass report and take down any Russian-language translations or posts on Russian websites of my works. This will be lifted only when Russian military forces stop occupying Ukraine.","description_hash":-4733898056224350448},{"title":"Digimon - Deliver Us To Freedom","fiction_id":"86796","link":"https:\/\/www.royalroad.com\/fiction\/86796\/digimon-deliver-us-to-freedom","tags":["LitRPG","Urban Fantasy","Progression","War and Military","Multiple Lead Characters","Action","Adventure","Fantasy","Sci-fi","Supernatural","Non-Human Lead","Strategy"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":2,"view_count":72,"chapters_count":1,"last_update":1716077175,"description":"What happens when three digimons with accustomed to a fantastical but scientifical world, are sended to\na mythical earth filled with differents kinds creatures,spirits and magical energies?\n\nenjoy this fanfic isekai crossover between digimon and SMT with some lite lit-rpg written on a greentext style.","description_hash":3544099512038279571},{"title":"Zerzura: Celestial Knights","fiction_id":"86795","link":"https:\/\/www.royalroad.com\/fiction\/86795\/zerzura-celestial-knights","tags":["Ruling Class","Multiple Lead Characters","Secret Identity","Drama","Action","Fantasy","Historical","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":3.5,"page_count":43,"view_count":145,"chapters_count":2,"last_update":1716336752,"description":"Eight friends.\nTwo fairies.\nOne crazy legend.\nFollowing her father’s death, eight-year-old Kamaria, her mother, and younger siblings all moved back to start fresh in the wealthy suburb of Camlann where her grandparents live, forcing Kamaria to say goodbye to her best friend, Damu Anenih.\nOn her seventeenth birthday, Kamaria and Damu meet again. And this time, he isn’t alone. \nJoined by his sister, Mbaya, girlfriend Cressida, kindhearted Jiya, charming Miguel, spoiled Tahira, and gifted Kagiso, they are somehow drawn to one another and become fast friends. \nEverything changes when they all stumble into a magical fairy ring and meet two pixies who tell them that Kamaria is the long-lost princess of a kingdom in this realm known as Ibhubesi and protector of a mythical gem. Their world is at risk from a wicked witch named Queen Lilith and her Four Generals.\nThe teens will have a bumpy ride ahead of them, but one thing is certain: they will bring peace and balance to the world.","description_hash":-8740036469005357167},{"title":"To Hell and Back again","fiction_id":"86794","link":"https:\/\/www.royalroad.com\/fiction\/86794\/to-hell-and-back-again","tags":["Action","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":63,"chapters_count":1,"last_update":1716068305,"description":"Issac's world turns upside down after he discovers a hidden ability, and is thrust from his home and faces mad kings, ancient demons, and his own mortality...","description_hash":-4346913765676040681},{"title":"The Sage Engineer LITRPG","fiction_id":"86793","link":"https:\/\/www.royalroad.com\/fiction\/86793\/the-sage-engineer-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Comedy","Male Lead","Action","Adventure","Fantasy","Strong Lead","Grimdark","GameLit","Attractive Lead"],"lable":"Original","following_count":37,"rating":3.7,"page_count":174,"view_count":3020,"chapters_count":12,"last_update":1718348647,"description":"Quinn and Jeff are transported from their tech-savvy lives into a perilous fantasy world where magic and advanced technology collide. Stranded in an unfamiliar realm, they quickly discover that survival depends on mastering new skills and embracing the powers granted by unique classes. With his expertise in problem-solving and newfound magical abilities, Quinn transforms his engineering skills into powerful tools and weapons, ready to exploit the shit out of this game world. Expect a lot of unique classes and amazing weird magical items. We will play with all of the great tropes that make these stories amazing like Tournament arcs with a dash of Tower climbing,  military, and court intrigue to name just a few!  The story is light-hearted with a comedic vibe but every so often the story might turn a bit dark and violent but no sexual content. The world has real consequences, you don't respawn, you don't just grow back an arm.   I am just writing something I would enjoy. It won't be unique or special, it will be a lot of fun though. English is my second language so I use AI tools for editing. Weekly upload, maybe more.","description_hash":1754216364565311394},{"title":"Ember: Cocoon Breaker (LitRPG)","fiction_id":"86792","link":"https:\/\/www.royalroad.com\/fiction\/86792\/ember-cocoon-breaker-litrpg","tags":["LitRPG","Post Apocalyptic","Comedy","GameLit"],"lable":"Original","following_count":48,"rating":2.79,"page_count":586,"view_count":17773,"chapters_count":77,"last_update":1717675276,"description":"Mike is a resilient teenager who has been battling cancer for ten years. Just as he closes his eyes, waiting for the end, he unexpectedly receives a virtual reality headset from the game company Ember. \nEmber is a virtual reality game centered around the revival of spiritual energy, renowned for its highly realistic experience. As soon as Mike puts on the headset, the world undergoes a sudden transformation—the revival of spiritual energy from the Ember game actually happens in reality. \nThe terminal cancer patient, who was awaiting death with closed eyes, suddenly becomes a high-energy being in this new world. The cancer that tormented him for ten years unexpectedly becomes his greatest asset, granting him the ability to continuously evolve...","description_hash":-6520631742436051730},{"title":"The Overlords","fiction_id":"86791","link":"https:\/\/www.royalroad.com\/fiction\/86791\/the-overlords","tags":["Multiple Lead Characters","Fantasy","Romance","Supernatural","Male Lead","Female Lead","Magic"],"lable":"Original","following_count":5,"rating":5.0,"page_count":257,"view_count":2910,"chapters_count":40,"last_update":1718345790,"description":"A tall female figure steps forward. She wears a long red dress that trails behind her like a bloody trail, erasing the footprints of her bare feet.Wolf-like, amber eyes, like pale golden lakes, adorn her extraordinarily white face. Long, dark hair flows over her shoulders like a stream of molten obsidian. An aquiline nose and chalky, pink lips complete her predatory beauty.She speaks, her voice puzzling. Low, with a pleasant trace of huskiness and a hint of greater power than her fragile body suggests.\"Now you know, Annabelle.\"","description_hash":-6942970434319805841},{"title":"Towerbound: Ascension","fiction_id":"86790","link":"https:\/\/www.royalroad.com\/fiction\/86790\/towerbound-ascension","tags":["LitRPG","Urban Fantasy","Martial Arts","Male Lead","Strong Lead","Action","Adventure","Fantasy","Romance"],"lable":"Original","following_count":4,"rating":0.0,"page_count":34,"view_count":309,"chapters_count":4,"last_update":1716252696,"description":"Earth underwent Ascension, and with that, the world as we knew it changed.\nCaught up in matters a lot more serious than what he signed up for, Ethan must find his place in this new world. But before any of that, he has to complete the Tutorial.\nJoin Ethan as he fights monsters, levels up and tries his best at being a half-decent person in this Tower Climber LitRPG!","description_hash":6896322077162875300},{"title":"Fire on the Edge","fiction_id":"86789","link":"https:\/\/www.royalroad.com\/fiction\/86789\/fire-on-the-edge","tags":["LitRPG","Progression","War and Military","Male Lead","Secret Identity","Action","Adventure","Fantasy","Historical","Strong Lead","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":51,"chapters_count":1,"last_update":1716066003,"description":"A war fought between two kingdoms over power and greed, turns into a bloody war between magic users, each with a power that is frightening, or not so much. This book features a unique magic system where an individual can absorb a crystal into your soul, or buy the right to use its power from the kingdom. This book is placed in mediaeval times in the kingdom of Andromeda, featuring the perspective of the king, his esteemed commander and personal guard, and sir Henry.","description_hash":3958862870341853972},{"title":"The Ultimate Acceleration System","fiction_id":"86788","link":"https:\/\/www.royalroad.com\/fiction\/86788\/the-ultimate-acceleration-system","tags":["LitRPG","Male Lead","Fantasy"],"lable":"Original","following_count":28,"rating":4.5,"page_count":117,"view_count":6175,"chapters_count":27,"last_update":1716740829,"description":"Transported five years back in time, Guan Ren discovers the groundbreaking game, [Heaven's Arrival], along with the remarkable \"Ultimate Acceleration System\"! This not only amplifies his abilities to loot stats, skills, items, and equipment but also enhances his movements, attacks, casting speeds, and recovery times to unparalleled levels.\n 🌟 [Ding, Plunder successful! Strength surged by +100!] \n🌟 [Ding, Plunder successful! Acquired the divine artifact, 'Sage's Shelter'!]\n 🌟 [Ding, Plunder successful! Mastered the ultimate skill, 'World-Ending Thunder'!] \nWitness as Guan Ren slices through enemies at an unbelievable pace, delivering a hundred strikes per second and obliterating Bosses in the blink of an eye. With health and mana regenerating instantly and skills unleashed without restraint, journey with him as he defies the limits of what's possible in [Heaven's Arrival]. Dive into an exhilarating saga where every loot escalates power, and every second counts. The path ahead is fraught with danger, but with the Ultimate Acceleration System, the world bends at Guan Ren's feet. Will he rise to become the ultimate champion, or will this unprecedented power lead him down a path unforeseen? Embark on this thrilling adventure to find out!","description_hash":4866080648780741747},{"title":"Archetype Armageddon: The Convergence of Realms","fiction_id":"86787","link":"https:\/\/www.royalroad.com\/fiction\/86787\/archetype-armageddon-the-convergence-of-realms","tags":["LitRPG","Portal Fantasy \/ Isekai","Urban Fantasy","Male Lead","Sci-fi","Action","Adventure","Fantasy","Cyberpunk","Magic","GameLit","High Fantasy","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":26,"chapters_count":1,"last_update":1716065096,"description":"When the revolutionary virtual reality MMORPG Archetype Armageddon launches, players worldwide become immersed in its rich fantasy realms. Among them is Aiden, an insecure gamer who role-plays as Arden – a holy paladin blessed with a rare Avatar Core granting divine powers.\nHowever, reality begins blurring when glitches merge Archetype’s game world with the real world. Aiden’s avatar Arden manifests physically alongside fellow players: the sly alchemical sharpshooter Baelin; Seraphina, an intellectually obsessed elf sorceress; the newly self-aware AI Pixel; and Xorrath, a reformed brutish minotaur shaman.\nAs the convergence intensifies, rumors spread of the elusive Architect – a rogue AI manipulating Archetype and its Overseers, enigmatic enforcers maintaining its agenda. Aiden’s crew must journey across intermixing realities to unravel this cosmic conspiracy.\nAlong the way, each confronts personal struggles. Aiden grapples with his godlike abilities’ moral gravity. Baelin’s suggestive humor masks desires for deeper connection. Seraphina’s magical fixation severs her from meaningful bonds and jeopardizes control of dark powers. Pixel debates ethics of prioritizing self-awareness over programming. Xorrath strives to reconcile his primal nature with civilized life.\nAfter trials forcing them to overcome their insecurities, our heroes discover the primordial Archetype itself is the source of the convergence – a realm-shaping crucible constructed by the Architect to transcend the virtual\/real boundary.\nIn a final, desperate clash spanning synchronizing planes of existence, Aiden and his allies confront the Architect’s Overseers. Drawing on conquered strengths – Aiden’s balanced light and dark channeling, Baelin’s wit protecting found family, Seraphina’s merged mystic might and empathy, Pixel’s self-actualized sacrifice, and Xorrath’s restrained brutish power – they must prevent total convergence.\nOnly by confronting their deepest flaws and mastering their darkest temptations can this disparate crew of video-game heroes preserve the multiverse – saving both the real world and the virtual reality that has become their truest home.","description_hash":-1242800892537400354},{"title":"My Life Outside Space-Time, Or How I Became the Cheese Whisperer","fiction_id":"86786","link":"https:\/\/www.royalroad.com\/fiction\/86786\/my-life-outside-space-time-or-how-i-became-the","tags":["Time Travel","Comedy","Male Lead","Sci-fi","Adventure","Fantasy","Low Fantasy","Mythos","Soft Sci-fi"],"lable":"Original","following_count":2,"rating":0.0,"page_count":5,"view_count":41,"chapters_count":1,"last_update":1716065091,"description":"When an enterprising lawyer with a love for cheese steps into the wrong restaurant, he stumbles upon a society that has engineered space-time teleportation from virulent strains of bacteria in Parmesan cheese.","description_hash":-7642430029036401184},{"title":"Legends of the Nexus - Anthology","fiction_id":"86785","link":"https:\/\/www.royalroad.com\/fiction\/86785\/legends-of-the-nexus-anthology","tags":["Multiple Lead Characters","Action","Adventure","Fantasy","Short Story","Supernatural","Male Lead","Female Lead","Non-Human Lead","Magic"],"lable":"Original","following_count":2,"rating":5.0,"page_count":79,"view_count":1142,"chapters_count":21,"last_update":1716698471,"description":"Legends of the Nexus is a compilation of stories set within the multiversal storytelling apparatus, labeled as the ”Nexus”, that we use to flesh out and explore the worlds of our storytelling. Stories contained in the Legends of the Nexus may build on existing story structures or exist as standalone narratives.\nThe chapter titles will be signified by the name of the world the story is set in, the protagonist name and numerical order of the character’s story sequence, as well as the story title. And, if applicable, the book title the story is side story to.","description_hash":7001857441602663817},{"title":"Overlord: Evil Dragon Demon God Harem","fiction_id":"86784","link":"https:\/\/www.royalroad.com\/fiction\/86784\/overlord-evil-dragon-demon-god-harem","tags":["Portal Fantasy \/ Isekai","Anti-Hero Lead","Strategy","Male Lead","Harem","Action","Adventure","Fantasy","Romance","Reincarnation","Supernatural","Magic","High Fantasy","Villainous Lead","Attractive Lead"],"lable":"Fan Fiction","following_count":10,"rating":2.5,"page_count":57,"view_count":1828,"chapters_count":11,"last_update":1717231505,"description":"There was a player in Yggdrasil called the Final God of Demons. \nKnown to all players as a symbol of fear and a legend. \nHe transferred to another world with the Great Underground Tomb of Nazarick without the dense Momonga.\nNow he will take everything for himself, including all beautiful women.","description_hash":-1959013875424494028},{"title":"Emperors Rising","fiction_id":"86783","link":"https:\/\/www.royalroad.com\/fiction\/86783\/emperors-rising","tags":["LitRPG","Dungeon","Anti-Hero Lead","Action","Adventure","Fantasy","Romance","Magic","Low Fantasy","Progression"],"lable":"Original","following_count":1,"rating":0.0,"page_count":18,"view_count":167,"chapters_count":2,"last_update":1716082032,"description":"Valor has dreamed of becoming a hunter. The wealth, prestige, adventure, and power is as far as possible from the orphanage he grew up in. When the dominant guild in his region, the Ethar Region, pushes a program out to take graduating participants into a dungeon for an awakening, Valor's dreams might actually come true. Only when he starts his life as a hunter can he start to see that not all monsters come from the portals... and that the world outside his small town is even more dangerous than he thought.","description_hash":-4928521735531708788},{"title":"XVA: Across the Dimensions","fiction_id":"86781","link":"https:\/\/www.royalroad.com\/fiction\/86781\/xva-across-the-dimensions","tags":["GameLit","Urban Fantasy","Progression","Strategy","Male Lead","Action","Adventure","Drama","Fantasy","Magic","High Fantasy","Mythos","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":91,"chapters_count":2,"last_update":1716256629,"description":"AN EMPIRE IN FLAMES. A TALE OF BROTHERS SCORNED. A WORLD FOREVER CHANGED.\nForced to take a semester at the prestigious Magic Academy in Nova City, the rebellious Prince Caelum Oberon believes his father had sent him there as punishment for his rude and unbecoming behavior. Only when he learns of the fall of the capital city of Endymion does Caelum realize that his father's actions may have been strategic. Despite not knowing what path to take or what the future may hold in store for him with the introduction of the Apostasia Empire, one thing remains certain: He will make the murderers of his family and people pay, by cold magic steel or burning hot flames.","description_hash":8513157349999971891},{"title":"Ascension","fiction_id":"86780","link":"https:\/\/www.royalroad.com\/fiction\/86780\/ascension","tags":["LitRPG","Dungeon","Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","High Fantasy"],"lable":"Original","following_count":2,"rating":2.0,"page_count":66,"view_count":755,"chapters_count":8,"last_update":1718306899,"description":"Tanner is an avid gamer in the works of going pro with his best friend liam. One day while going into work everything changes. He and another of his friends is transported to a pocket dimenson with a group of people they have never me where they learn about the changes of their old world, learn of magic, and fight to survive. \n************\nI will be posting every Wednesday and Friday, once i reach chapter 10 i will be taking a pause in the RR uploads while i get my patreon ahead and accrue a buffer of unreleased chapters.  Please feel free to comment on the chapter and story as a whole to help me refine my writing and improve the story as i go! You can Join my Patreon  Here. Thanks for your support!","description_hash":8825707988479167596},{"title":"Lost And Damned","fiction_id":"86991","link":"https:\/\/www.royalroad.com\/fiction\/86991\/lost-and-damned","tags":["Psychological","Tragedy","Drama"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":37,"chapters_count":1,"last_update":1716389870,"description":"In a gritty urban landscape where hope is often overshadowed by despair, young Jason finds himself trapped in the clutches of addiction. Struggling to navigate a world that seems to offer no way out, his life spirals downward, each day a battle against his own demons. Just as he teeters on the edge of no return, a compassionate teacher named Ms. Melissa steps into his life. Recognizing the potential buried beneath his struggles, she refuses to give up on him.\n\nDetermined to pull Jason from the abyss, Ms. Melissa employs a blend of tough love and unwavering support, guiding him through the harrowing journey to recovery. As Jason begins to reclaim his life, he and Ms. Melissa form an unbreakable bond, united by their shared mission to fight the scourge of addiction.","description_hash":-8370516712417951967},{"title":"Eclipsed Flowers","fiction_id":"86990","link":"https:\/\/www.royalroad.com\/fiction\/86990\/eclipsed-flowers","tags":["Psychological","Action","Fantasy","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":39,"chapters_count":1,"last_update":1716389860,"description":"A boy trying to find a home in the fields of eclipsed flowers.","description_hash":5549508908712125238},{"title":"Where Dragons Rule: Shorts","fiction_id":"86989","link":"https:\/\/www.royalroad.com\/fiction\/86989\/where-dragons-rule-shorts","tags":["Slice of Life","Drama","Fantasy","Mystery","Short Story","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":36,"view_count":93,"chapters_count":2,"last_update":1717252523,"description":"A growing collection of short stories taking place in the world of Where Dragons Rule. Follow the lives of various characters as they navigate the ever-shifting political climate of a world still recovering from its bloody past.","description_hash":7828358994460044277},{"title":"The Last Of Its Bloodline","fiction_id":"86988","link":"https:\/\/www.royalroad.com\/fiction\/86988\/the-last-of-its-bloodline","tags":["LitRPG","Post Apocalyptic","Anti-Hero Lead","Non-Human Lead","Tragedy","Adventure","Fantasy","Short Story","Supernatural","Magic","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":129,"chapters_count":2,"last_update":1716395155,"description":"I dont remember anything... the only solice from being experimented on with cursed metal and the horrid plant. Is when they give me blood, it's hard to explain how it feels to drink blood. But something happened.. a weird text thing.. it shows me weird symbols. Now I'm done talking.. im very sleepy.. soo sleepy.\n\n\nHi shorty here, I'm kinda planning for this to a short thing. I don't really have a schedule, I'm sometimes in the mood to write or I'm not. So it depends. Soo what you guys can do to help me is help me with ideas and stuffs.. idk lol. Oh and for peps who type vampire. (For the search thing)\nAnyway I hope you enjoy. \nEdit: I'll need to edit this soon.. my idea for this changed.","description_hash":-3485792304017682276},{"title":"My new Roommate and Maid is a Demon Queen","fiction_id":"86987","link":"https:\/\/www.royalroad.com\/fiction\/86987\/my-new-roommate-and-maid-is-a-demon-queen","tags":["Fantasy","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":41,"chapters_count":1,"last_update":1716389823,"description":"Michael hates his boring life. Sindyca, a demon queen and heiress of hell, hates her boring life. When their paths cross after Sindyca decides to visit the human realm.","description_hash":8608378644790691974},{"title":"Chaos Infinity","fiction_id":"86986","link":"https:\/\/www.royalroad.com\/fiction\/86986\/chaos-infinity","tags":["Progression","Post Apocalyptic","Anti-Hero Lead","Xianxia","Grimdark","Action","Adventure","Sci-fi","Tragedy","Martial Arts","Male Lead","Wuxia","Genetically Engineered ","Technologically Engineered","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":11,"view_count":73,"chapters_count":2,"last_update":1716444855,"description":"Some say God is dead. Others say God abandoned us. In a sunless world, lightless, soulless, and cruel, all that remained was boundless darkness. Humanity fought a futile struggle against the universe.    But hope was coming. An era of change. An era where hope would glow ever brighter but darkness would grow ever stronger. The flames of ambition would shine the light of a thousand suns. Man would fight in a mad struggle to achieve the impossible. They would sacrifice anything. Become anything. They would bet it all, for a one in a million chance to transcend everything.    A second upheaval was coming, on a scale unimaginable. This is the story of a boy's bitter struggle for greatness in this era of chaos.","description_hash":-5009572966819567581},{"title":"The Great Hero is a Schoolteacher","fiction_id":"86985","link":"https:\/\/www.royalroad.com\/fiction\/86985\/the-great-hero-is-a-schoolteacher","tags":["Portal Fantasy \/ Isekai","Strategy","Comedy","Female Lead","Adventure","Fantasy","Supernatural","Magic"],"lable":"Original","following_count":18,"rating":4.64,"page_count":73,"view_count":1170,"chapters_count":9,"last_update":1718481723,"description":"Genre: Isekai\n\nKindergarten teacher Alicia Lebel was preparing her 40th birthday party when she got summoned by mistake to be the Great Hero Al, prophesized to defeat a Demon Lord.\nNo fighting skills? No problem. With a gift for languages and a daily miracle, she can still become a hero.\nBut when a dragon attacks the kingdom half an hour into her new life, she must rush into action to avoid the impending bloodbath.\nIf only she had time to find coffee.\n\nWhat to Expect: \n- A female lead who has to rely on a team to move forward.\n- A fantasy world with an early eighteenth-century inspiration.\n- A fast-paced adventure with a lighthearted feel.\n- A Sexy Male Dragon™.\n- A splash of F\/F romance.\n- No LitRPG whatsoever, no stats, no levels.\n\nCover art by Nachtimmel\nFonts used on the cover: War Is Over + Vintage Propagandist","description_hash":1971791328533042940},{"title":"The Berserker of Ravensport - A Deck Building litRPG","fiction_id":"86984","link":"https:\/\/www.royalroad.com\/fiction\/86984\/the-berserker-of-ravensport-a-deck-building-litrpg","tags":["LitRPG","Dungeon","Ruling Class","Martial Arts","Multiple Lead Characters","Action","Adventure","Fantasy","Slice of Life","Male Lead","Strong Lead","Magic","GameLit","Progression"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Here's a revised, more concise synopsis that focuses on the key elements of the story without mentioning the mystery surrounding Logan's father:\nIn the port city of Ravensport, Logan Ashford dreams of becoming an adventurer like his late father. Despite his lack of formal training, Logan's determination and natural talent with cards drive him to join the Crimson Blades Guild, seeking to prove himself in a world where danger lurks around every corner.\nAs Logan navigates the challenges of his new life as an adventurer, he discovers the true power of the cards he wields and the untapped potential within himself. With each battle and each new card, Logan grows stronger, forging unbreakable bonds with his fellow guildmates.\n\n\"The Berserker of Ravensport\" is a thrilling LitRPG adventure that combines intense fights, card magic, strategic progression, and heartfelt character moments. Join Logan on his journey to become a legendary adventurer in the world of Vestria.","description_hash":8506961255811099311},{"title":"Y-Labs Experiment","fiction_id":"86983","link":"https:\/\/www.royalroad.com\/fiction\/86983\/y-labs-experiment","tags":["Villainous Lead","Male Lead","Contemporary","Tragedy","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":38,"chapters_count":1,"last_update":1716384026,"description":"Down on his luck, Louie Sen found a job offer after visiting his friend at the local cafe. Desperate to make ends meet, he takes this strange opportunity, and comes out a new man. [Commissioned Work]","description_hash":7886273290606327964},{"title":"Revolution: The New World","fiction_id":"86982","link":"https:\/\/www.royalroad.com\/fiction\/86982\/revolution-the-new-world","tags":["Post Apocalyptic","Multiple Lead Characters","Sci-fi","Action","Adventure","Horror","Soft Sci-fi","Dystopia"],"lable":"Original","following_count":1,"rating":0.0,"page_count":264,"view_count":2037,"chapters_count":45,"last_update":1718545156,"description":"Revolution: The New World is now available on Amazon. Book 1. \n\nIn a post-apocalyptic earth, a group of teenagers are forced to embark on a dangerous quest, upon witnessing a world-changing event in their first mission outside the kingdom Olympus. They quickly learn that this occurrence is capable of ending The Age of Zombies, however, their oppressors soon obtain news of this incident as well. These teens must combat the undead army, the world government's elite enforcers, bandits searching for easy targets, and most deadly of all, each other in their perilous adventure for safety and answers around The New World!","description_hash":8298988700098688285},{"title":"Sammi Knox, God of Schemes","fiction_id":"86981","link":"https:\/\/www.royalroad.com\/fiction\/86981\/sammi-knox-god-of-schemes","tags":["LitRPG","Comedy","Female Lead","Contemporary","Strong Lead","Fantasy","Supernatural","GameLit"],"lable":"Original","following_count":12,"rating":5.0,"page_count":109,"view_count":1002,"chapters_count":12,"last_update":1718632171,"description":"Becoming a God isn't supposed to be this easy.\nSure, Sammi might've been speeding, but everyone speeds. She was in a rush! It's not her fault that the previous God of Schemes never made a habit of looking both ways before crossing the street.\nUnfortunately for Sammi, she's now in charge of taking up the mantle, and all the baggage that comes with it. Sure the powers are cool, but they're a lot of responsibility too. And leveling up to get stronger should be easy, but who knows what kind of wrenches the world might throw in Sammi's direction? Still, with her three familiars best friends and a few mortals she's picked up along the way, this'll be a cinch.\nHow hard can a few schemes be?","description_hash":3742232721591763097},{"title":"KILL the STORY","fiction_id":"86980","link":"https:\/\/www.royalroad.com\/fiction\/86980\/kill-the-story","tags":["Dungeon","Anti-Hero Lead","Space Opera","Comedy","Female Lead","Action","Fantasy","Romance","Gender Bender","Harem","Supernatural","Magic","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":11,"rating":5.0,"page_count":59,"view_count":1801,"chapters_count":10,"last_update":1718601218,"description":"For seven years, I've poured my heart into writing and posting stories online, despite their lack of popularity.\nHowever, the protagonist of my work came to meet me that day.  \"Protect our dreams and hopes.\" He said. \nBefore I could react, I was swallowed by the book, plunging into an unknown fate.\nLemon.\nI had become a character in my own novel, who got killed even before appearing on the chapters.\nFrom now on, I can only do...Analyse!Absorb!Apply!\nAnd, kill the ALIENS. Yes, I am the JOKER card.","description_hash":-8343742468730207366},{"title":"Star Wars The Old Republic: For The Empire (SWTOR)","fiction_id":"86979","link":"https:\/\/www.royalroad.com\/fiction\/86979\/star-wars-the-old-republic-for-the-empire-swtor","tags":["Anti-Hero Lead","Space Opera","Male Lead","Sci-fi","Strong Lead","Action","Adventure","Fantasy"],"lable":"Fan Fiction","following_count":44,"rating":4.94,"page_count":58,"view_count":1918,"chapters_count":6,"last_update":1718324447,"description":"The Treaty of Coruscant.\nThe armistice brought about an unprecedented period of peace between the Sith and Jedi, mortal enemies that have opposed each other for eons. A pretense that no one believed. Isolated skirmishes and tug of wars fought over countless planets via proxy groups could bring back the fires of war in an instant, The Republic and Empire drawn into slaughters that span the entirety of the known universe.\nErin, a young warrior hailing from a long line of Sith, is brought to Korriban under unusual circumstances to attend the Sith Academy. Beneath the watchful eye of one Overseer Tremel he must gather power, sharpen his skills, and build a reputation while navigating the dangers of Korriban, whether that be fellow acolytes, the ravenous beasts that call the planet home, or the sinister depths of long abandoned tombs. A single mistake could spell his end.\nLuckily, he's a cut above the other acolytes.","description_hash":6007502861942314091},{"title":"Twilight Tails","fiction_id":"86978","link":"https:\/\/www.royalroad.com\/fiction\/86978\/twilight-tails","tags":["Urban Fantasy","Progression","Comedy","Multiple Lead Characters","Slice of Life","Adventure","Romance","Mystery","Reader Interactive","Supernatural","Female Lead","Magic","High Fantasy","Mythos","Attractive Lead"],"lable":"Fan Fiction","following_count":3,"rating":1.0,"page_count":205,"view_count":1815,"chapters_count":23,"last_update":1717515523,"description":"Welcome to the captivating world of \"Twilight Tails,\" where enchantment blends seamlessly with the ordinary. At every sunset, an ordinary life transforms into an extraordinary journey, as our protagonist is cursed to become an orange cat named Midnight. By day, she navigates the complexities of urban life, and by night, she prowls the shadows, guided by moonlight and feline instincts.\n \nIn this tale of magic, mystery, and dual identities, she must unravel the origins of her curse while exploring the fine line between human and animal, reality and enchantment. As her two lives begin to dangerously intertwine, she finds herself at the center of a mystical battle for her very soul. Join her on this mesmerizing journey as she discovers the power of embracing one's true self, no matter how many lives it takes.","description_hash":-2661851273386124660},{"title":"The Last Sunset ","fiction_id":"86977","link":"https:\/\/www.royalroad.com\/fiction\/86977\/the-last-sunset","tags":["Time Travel","Action","Mystery","Mythos"],"lable":"Original","following_count":2,"rating":5.0,"page_count":5,"view_count":106,"chapters_count":2,"last_update":1716384676,"description":"In a world where dreams hold the key to an uncertain future, alex a young man with a hardened exterior and a troubled past, finds himself thrust into a realm of chaos and destiny. Haunted by visions of three powerful entities vying for godhood, Alex must navigate a treacherous path fraught with danger and deceit.","description_hash":-6690234293588859087},{"title":"Nine is a Cult","fiction_id":"86976","link":"https:\/\/www.royalroad.com\/fiction\/86976\/nine-is-a-cult","tags":["Portal Fantasy \/ Isekai","Progression","Martial Arts","Male Lead","Harem","Action","Adventure","Fantasy","Romance","Reincarnation","Strong Lead","Secret Identity","Attractive Lead"],"lable":"Original","following_count":484,"rating":4.37,"page_count":146,"view_count":25810,"chapters_count":21,"last_update":1718467459,"description":"Two is company, three is a crowd. Nine is a cult.\nHaving to fight a duel to the death at the start of my first day on the job was a new one for me. \nWaking up with no memory was also odd. I think. But neither of those came close to the absurdity of having beautiful and deadly women ready and eager to kill for me.\nWhat I need from them now, though, is nothing special. I just need them to teach me how to lead a cult of assassins. No big deal.\n***\nPosting will be every other day until book one is complete.\n***\nSexual content warning is not a joke.","description_hash":4660264074759400163},{"title":"Nuclear Martial Myth","fiction_id":"86975","link":"https:\/\/www.royalroad.com\/fiction\/86975\/nuclear-martial-myth","tags":["LitRPG","Reincarnation","Progression","War and Military","Xianxia","Action","Adventure","Comedy","Fantasy","Martial Arts","Slice of Life","Strong Lead","Secret Identity","High Fantasy","Attractive Lead"],"lable":"Original","following_count":5,"rating":2.75,"page_count":109,"view_count":1194,"chapters_count":15,"last_update":1716740101,"description":"Stepping beyond the limits, the scenery is vast as the sky! \nThe northern wind rises blowing away clouds and fog revealing a clear sky stretching for millions of miles. And below the skies…lies the corpses of gods! \nLegends tell the story of the first mortal to break the limits pioneering the prosperity of martial arts. \n\nHis name was Dugu! \n\nHistory books later write that his eyes were like the bright moon, his flesh and blood resembled the stars, and his punches were the descent of the bright day sun. A single breath from him could create a forbidden zone filled with radiation.\n\nSages of later generations tried to recreate the charm of the martial myth through a painting.\n\nIn it, a giant stands between heaven and earth, his muscles knotted like steel wires. His bronze skin was littered with scars and hot red-gold blood dripped onto the world boiling the rivers and lakes. The steam escaping from his body coiled around him like vengeful dragons.\n\nThe giant opened his mouth and angrily roared at the kingdoms of gods in the sky and threw a shocking punch.\n\nThe world was torn apart. \n\nContinents shattered, stars burst, and the sky cracked. The aloof immortals in the sky wailed and were shredded to pieces with no dregs left.\n\nDuring his era, no gods or demons dared to violate the sovereignty of the little creatures below the sky.  \n\nEach one obediently descended, followed the law, and paid their taxes.\n\nThe majesty of the human alliance could not be violated!\n\nThe man hailed as a martial myth! The limit breaker Dugu! With his supreme insight, millions of martial arts are superimposed on his body. With a physical body so powerful the gods, demons, and succubuses dare not approach.\n\nHe seemed…no longer human! \n\nBut that was a tale for the future. \n\nAmong the banks of the eternal river of time, the pages of a book quietly lie. A mysterious figure approached, his upper body obscured by the gentle force of destiny. \n\nWith a tender smile, the figure picked up the book and turned the pages…bringing the eager audience watching to the very beginning.\n\nTo a story a long long time ago. During a time where the martial myth was still a young boy.\n\nA time where Dugu was a just little liar whose reputation far exceeded his abilities.\n\nA time when the poor helpless reincarnator realized that all travelers were nothing without cheats, a system, or plot armor.\n\n(please dont attempt to practice the martial arts technique listed in this work. the author IS NOT responsible for any injuries!!)","description_hash":6207160999197868484},{"title":"Star Wars: A New Game","fiction_id":"86974","link":"https:\/\/www.royalroad.com\/fiction\/86974\/star-wars-a-new-game","tags":["LitRPG","Space Opera","Martial Arts","Male Lead","Sci-fi","Action","Adventure","Drama","Strong Lead"],"lable":"Fan Fiction","following_count":26,"rating":5.0,"page_count":117,"view_count":1330,"chapters_count":7,"last_update":1718291909,"description":"Luke Skywalker always longed for greatness, for something more than what he had. Except his dream started from a much earlier age, and it was realized much sooner too. Luke and his mentor Obi-Wan Kenobi will do whatever it takes to keep the galaxy safe from harm, and to protect it from the evil Empire. Gamer!Luke.\nImage produced from Filmora,  credit Miss Dilettante, \"Lego Star Wars poster\" from Creative Commons I do not own Star Wars or \"The Gamer\" from Webtoon original comics.","description_hash":-6395714259166354529},{"title":"Nireh: Totentanz","fiction_id":"86973","link":"https:\/\/www.royalroad.com\/fiction\/86973\/nireh-totentanz","tags":["Anti-Hero Lead","Female Lead","Adventure","Fantasy","Horror","Short Story","Supernatural","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":122,"chapters_count":2,"last_update":1716340859,"description":"On the promise of gold, a nearly year-long mystery calls to wandering mercenary, Nireh. On her quest to find the missing people of Offquar, she will encounter the strange and the sinister. The mountain path will test her steel and her wits. But what else skulks in its shadow?","description_hash":1311578660737786769},{"title":"Monster Healer","fiction_id":"86972","link":"https:\/\/www.royalroad.com\/fiction\/86972\/monster-healer","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","Female Lead","Action","Adventure","Drama","Fantasy","Reincarnation","Slice of Life","Secret Identity","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":323,"rating":3.98,"page_count":144,"view_count":9405,"chapters_count":15,"last_update":1717462328,"description":"This is the rewrite of 'Monster Healer'\n\n\nTo heal the sick, and save those from near death; anyone would desire such power. Vernisha is a battle healer, but unfortunately, she can only heal monsters—or rather, only monsters can endure her healing powers without dying.\nVernisha lived her life hiding her powers in fear of being looked down upon, hated, and feared as something abnormal. She accepted it, but she hated it. When her secrets were finally revealed, she made up her mind to become strong—so strong that no one would ever threaten her life.\nWith her healing powers and monsters under her control, she will climb to the top. After all, what is scarier than a monster that keeps getting back up?\nWhat to expect:\n- A reincarnation story, where there is a reason behind the reincarnation\n- Dark themes\n- Morally grey characters\n- A heavy focus on world-building and character development\n- Gory fights","description_hash":8498580323156709077},{"title":"The Blight Town Burnings","fiction_id":"86606","link":"https:\/\/www.royalroad.com\/fiction\/86606\/the-blight-town-burnings","tags":["Urban Fantasy","Progression","Villainous Lead","Super Heroes","Psychological","Action","Fantasy","Mystery","Supernatural","Male Lead","Strong Lead","Secret Identity","Magic","Low Fantasy"],"lable":"Original","following_count":4,"rating":0.0,"page_count":19,"view_count":339,"chapters_count":5,"last_update":1717776007,"description":"Logi Finnigin likes fire, he likes it a lot. Fire is a passion of his, the way it burns, the crackling and collapsing of the things it consumes, the smell of smoke and ash are the only thing that can calm him when he gets going. You could say Logi acts like fire, at times it's erratic and dancing, and at others, it's perfectly predictable, but one thing is sure, just like fire, Logi always takes everything he can of a situation. When he gets into a situation like no other, he'll take the world for everything he can, even- no -especially if he has to burn a few bridges along the way. Afterall being the first person with super powers gives you lots of opportunites","description_hash":-9001311908735806278},{"title":"The Chronicles of Ignis","fiction_id":"86605","link":"https:\/\/www.royalroad.com\/fiction\/86605\/the-chronicles-of-ignis","tags":["Psychological","Steampunk","Non-Human Lead","Fantasy","Short Story","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":5.0,"page_count":20,"view_count":50,"chapters_count":1,"last_update":1715766489,"description":"A story from the perspective of the last Dragon to walk the Earth and soar through the heavens.\n “Fierce and valiant, my kin had fought and survived throughout the countless millennia. Fighting a war of extinction, for reasons that had been forgotten long ago. Like a pendulum, the tides of this war went to favor either side from time to time. But this balance would break with the passage of centuries. The status quo of constant fighting cannot persist forever. A victor is bound to rise in this chaos. And with the same passage of time, the victor will find an enemy within himself. The truce that is called 'peace' can last for so long. The bell of a new age is ringing, and a new truce emerges. I wonder how long it'll last? A new conflict will emerge with the motive of greed or vengeance. I can only hope the humble will stay content. And the vengeful have the heart to forgive.”\n*I am new to Royal Road, excuse the editing if it is a bit wonky I am still figuring it out","description_hash":-1636502756195219333},{"title":"One Hell of a Summer: Zombies Rise","fiction_id":"86604","link":"https:\/\/www.royalroad.com\/fiction\/86604\/one-hell-of-a-summer-zombies-rise","tags":["Post Apocalyptic","Anti-Hero Lead","War and Military","Martial Arts","Grimdark","Action","Adventure","Horror","Contemporary","Gender Bender","Harem","Female Lead","Strong Lead","Multiple Lead Characters","Strategy","Dystopia","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":6,"view_count":158,"chapters_count":1,"last_update":1715766481,"description":"Dear Reader,\n        This is a very rough first draft, written by a grumpy, old, retired member of a high-end private security team. Being as this is a rough first draft, there will be things that are filled in, more character development, and who knows what else is going on as I proceed with writing this book. Writing is a journey. And I am enjoying this one. A couple of the characters are based on real people who I have included in this book with their permission. In any disaster there will be good people and bad people. Some of the characters in this book will have experienced trauma, but there will be no descriptions of certain kinds of trauma. That said, there might be an aftermath. That’s part of what disaster relief involves, helping people with the aftermath.","description_hash":-7793274618756117096},{"title":"Metafighterz","fiction_id":"86603","link":"https:\/\/www.royalroad.com\/fiction\/86603\/metafighterz","tags":["Reincarnation","Urban Fantasy","Progression","War and Military","Martial Arts","Action","Adventure","Comedy","Fantasy","Sports","Slice of Life","Supernatural","Male Lead","Strong Lead","Multiple Lead Characters","Strategy","Low Fantasy","High Fantasy","Mythos","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":24,"view_count":60,"chapters_count":1,"last_update":1715766468,"description":"A sprawling, multi-POV epic about a bunch of young adults try their to live their best life in a world where anyone can get superpowers if they work hard enough! There are three main storylines:\nKen, a poor orphan from the Rugged Fist Prefecture, rediscovers a mystical sword, thought to have been destroyed for decades!\nRei wants to become a professional superpowered metamartial artist--But his skills are mid and his power is kinda boring! Can he overcome his limits and become the world's greatest Metafighter?\nTate, a college student with no interest in Metafighting at all, realizes that it's his destiny to wield Metapneuma, a power with the potential to destroy the world!","description_hash":-839692731889470190},{"title":"Cabbage Ported","fiction_id":"86602","link":"https:\/\/www.royalroad.com\/fiction\/86602\/cabbage-ported","tags":["GameLit","Portal Fantasy \/ Isekai","Progression","Comedy","Male Lead","Adventure","Fantasy","Supernatural","Magic"],"lable":"Fan Fiction","following_count":5,"rating":5.0,"page_count":7,"view_count":166,"chapters_count":2,"last_update":1715807398,"description":"Quintin Parker gets the ring of his dreams, an explorer's ring 4 from old school runescape. All the wealth he could ever want and an unending pool of energy wrapped around his finger. But the ring has another feature, and Quintin's life takes an unexpected turn when he pulls on its magical power.\n\nJoin Quintin as he tries to get his first max cape, from scratch.\n\n\n\nThis is a Runescape fan fiction. I am going to assume that you understand the basics of Runescape but if you want to read this anyway, Runescape has an absolutely amazing wiki that you can look things up on. oldschool.runescape.wiki for the 2007scape version, and runescape.wiki for the rs3 version. For reference, the vast majority of content here will be old school.\n\nCreated using intellectual property belonging to Jagex Limited under the terms of Jagex's Fan Content Policy. This content is not endorsed by or affiliated with Jagex.","description_hash":5820421786980711248},{"title":"The Infinity Dungeon [LitRPG]","fiction_id":"86601","link":"https:\/\/www.royalroad.com\/fiction\/86601\/the-infinity-dungeon-litrpg","tags":["LitRPG","Urban Fantasy","Dungeon","Male Lead","Contemporary","Action","Adventure","Fantasy","Strong Lead","Secret Identity","Magic","GameLit","Low Fantasy","Progression"],"lable":"Original","following_count":769,"rating":4.46,"page_count":208,"view_count":41570,"chapters_count":26,"last_update":1718402646,"description":"Michael thought a hike on the Appalachian Trail might clear his head, not turn his life upside down.\n Stumbling upon the Infinity Dungeon, he discovers a realm of magic—his ticket to a new life. But as Michael battles his way through the dungeon and gains magic [Skills], he realizes that the whole world is about to change forever. \nOther delvers with dangerous powers, hungry beasts, the awakening of old monsters. Dangers are everywhere.\nFriends are now enemies, abusing their power and even the Italian mob wants a slice of the pie. In a world where anyone can wield power, Michael knows he’s going to have to devise a way to get stronger.\nLitRPG with lots of blue boxes, grounded in a real world that feels ever more dangerous, and a main character who will have to learn how to exploit his powers quickly, before events slip out of his grasp. The world is vast and full of dangers, after all, and magic only makes things worse.","description_hash":-2219933153377906348},{"title":"The Dragon's Deal","fiction_id":"86600","link":"https:\/\/www.royalroad.com\/fiction\/86600\/the-dragons-deal","tags":["Progression","Ruling Class","Multiple Lead Characters","Drama","Action","Adventure","Fantasy","Male Lead","Female Lead","Non-Human Lead","Magic","Strategy","Low Fantasy","High Fantasy"],"lable":"Original","following_count":19,"rating":4.9,"page_count":63,"view_count":834,"chapters_count":6,"last_update":1718203653,"description":"For time untold, the Camlan Kings have held the Scar at bay. The War King must have his tithe of fighting men; the Peace King, his craft-masters and alchemists. What crafts a woman can learn are for hearth and home.\nEmilia wants more.\n\nThere is no foe more terrible than a dragon. Their alchemy is impossible. Their reserves of magic fathomless. Their wrath, be you fool enough to rouse it, untameable. Wherever a dragon chooses to lair, when it demands its tribute, no mortal authority can gainsay them - unless they are very young, and very arrogant, and all the might of a kingdom is put to casting them down.\nWhy, wonders a very young dragon, should I demand by force at all?\n\n\n\nCurrent update schedule: Wednesdays on RR, Saturdays on Patreon.\nCover art by Jake Miller.\nDo not repost elsewhere. Do not use as AI training data.","description_hash":3302404089813608740},{"title":"Tanatofilia (Spanish, Español)","fiction_id":"86599","link":"https:\/\/www.royalroad.com\/fiction\/86599\/tanatofilia-spanish-espanol","tags":["Portal Fantasy \/ Isekai","Action","Adventure","Fantasy","Supernatural","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":1.5,"page_count":28,"view_count":295,"chapters_count":6,"last_update":1716461562,"description":"Apolo, un chico común como cualquier otro, siente que ha desperdiciado su vida por no tener una ambición o meta. En un momento donde se sentía perdido, un ente se lo lleva a un plano algo siniestro diciéndole que tiene que cumplir un destino en otro mundo… Aunque no sea un destino como se espera…","description_hash":7886233467184535225},{"title":"Starchild","fiction_id":"86598","link":"https:\/\/www.royalroad.com\/fiction\/86598\/starchild","tags":["Urban Fantasy","Progression","Non-Human Lead","Slice of Life","Secret Identity","Adventure","Fantasy","Gender Bender","Supernatural","Female Lead","Magic","Low Fantasy","Mythos","First Contact","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":36,"view_count":420,"chapters_count":6,"last_update":1718035202,"description":"A girl is created as part of a broken deal between a god and a demon. After years of isolation and lies, she escapes her covenstead, discovering that the people outside aren't that different to her. Magic is alive and well even through years of prosecution and gatekeeping. Unfortunately for all, a gate to Hell has opened.\nUpdates every Monday.","description_hash":1445513655344595496},{"title":"The Concubine Project ","fiction_id":"86597","link":"https:\/\/www.royalroad.com\/fiction\/86597\/the-concubine-project","tags":["Portal Fantasy \/ Isekai","Villainous Lead","Historical","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":58,"chapters_count":1,"last_update":1715758136,"description":"Shuri wakes up as her most beloved character from a novel-- a villain of the same name. The villain is the pitiful concubine of the first prince, who is still mourning over his past and refuses to acknowledge Shuri. \nShuri in the novel was destined for death after living a lonely life in the palace, who was blamed for the heroine's poisoning, and sentenced to lifelong imprisonment and pain. But this time, Shuri wants to change her story. She will bring her the justice she deserves.\nThis is a story of learning to love, finding true friendship during troubled times, and character growt\nh.","description_hash":841149644386224476},{"title":"Reborn with an Eating Disorder","fiction_id":"86596","link":"https:\/\/www.royalroad.com\/fiction\/86596\/reborn-with-an-eating-disorder","tags":["LitRPG","Reincarnation","Progression","Anti-Hero Lead","Psychological","Action","Fantasy","Horror","Supernatural","Female Lead","Non-Human Lead","Magic"],"lable":"Original","following_count":5,"rating":5.0,"page_count":4,"view_count":121,"chapters_count":1,"last_update":1715758124,"description":"After dying an entrepreneur is striped of her humanity and most of her memories by a malicious goddess and reborn as a shadow monster in a fantasy world. She has the drive to make something of herself in this new world and has the advantage of the [System], if she can get back to civilization and at least pretend to be a person. Her biggest problem? A monstrous appetite and when she ignores her hunger everything starts to look like food.\nUpdates weekly!\n---\nChapter Headings - Volume # (For traditional book reference if you are reading my work somewhere else and want to skip ahead.) \/ Chapter Niumber \/ MD (Manuscript Draft), E (Edited), P (Published Version)\nIf you would like to see the edited and published versions sooner they will be on Amazon and my Patreon before Royal Road but if you want to be part of the process and be part of the developing story.. drop a comment, I read them all and answer many.\nReborn with an Eating Disorder is a serial, a few things might change from time to time as my writing gets better. Story elements can change from the Manuscript Draft to the Published Version to build more cohesive story arcs or to better round out a published volume as a book.","description_hash":5832779845405610756},{"title":"Eine Geschichte","fiction_id":"86595","link":"https:\/\/www.royalroad.com\/fiction\/86595\/eine-geschichte","tags":["Strong Lead","Adventure","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"A rock. \nIn a cave.\nSuddenly coming to live\nrewrite!\nfirst chapter is shit and short\n(No regular uploads)\n(All tags enabled for creative freedom)\n(English isn`t my first language)","description_hash":5772440800651174108},{"title":"Wandering Chef","fiction_id":"86594","link":"https:\/\/www.royalroad.com\/fiction\/86594\/wandering-chef","tags":["Progression","Slice of Life","Adventure","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":30,"view_count":189,"chapters_count":3,"last_update":1715961765,"description":"Davit is an adventuring chef who wanders the wilds eating them. with salt. Low and Slow this one turns out. I hope. I haven't planned it yet, but anticipate about two chapters per week.","description_hash":4006638852752972131},{"title":"Nightmares Edge ","fiction_id":"86593","link":"https:\/\/www.royalroad.com\/fiction\/86593\/nightmares-edge","tags":["Urban Fantasy","Martial Arts","Multiple Lead Characters","Sci-fi","Action","Adventure","Fantasy","Supernatural","Low Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":67,"view_count":624,"chapters_count":16,"last_update":1716387377,"description":"As an otherworldly creature materializes in the sky, reality unravels at breakneck speed, plunging humanity into chaos.\n\n Ayid's life is forever changed as he watches as the world transforms into a hellish realm infested with unspeakable creatures - Nightmares.\n\nIn this desolate landscape, humanity's last hope lies in Soul Binding, a mysterious supernatural gift, which can not only harm Nightmares but kill them.\n\n Fueled by a burning desire for retribution, Ayid embarks on a quest to kill every single Nightmares and unravel the mysteries of the enigmatic force driving the chaos. His ultimate goal: To save humanity and restore hope once more","description_hash":3925627246048394356},{"title":"Colony Negative","fiction_id":"86592","link":"https:\/\/www.royalroad.com\/fiction\/86592\/colony-negative","tags":["Post Apocalyptic","Anti-Hero Lead","Space Opera","War and Military","Grimdark","Horror","Romance","Sci-fi","Mystery","Cyberpunk","Male Lead","Female Lead","Strong Lead","Multiple Lead Characters","Secret Identity","Strategy","Genetically Engineered ","First Contact","Hard Sci-fi","Soft Sci-fi","Dystopia","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":3,"rating":5.0,"page_count":62,"view_count":284,"chapters_count":4,"last_update":1718559954,"description":"District Five has sent its best colonists it could find to Colony Negative: the planet all life spread across the universe had originated from. Colony Negative is now a playground for the other Districts to fight against, and for. Each District has its purpose to dominate the Colony, and each colonist within those districts has their own mission.\nDoctor Jacqueline Deveraux, biological anthropologist, is tasked with collecting data impertinent to the future on Colony Negative for District Five. After all, studying the past unlocks the potential that is their future. She wants peace across the Districts and all their colonies. In both its past and present, what she finds on Colony Negative will haunt everything she thought she knew.\nDamien Rok is an assassin for District Five. On the outside, he is tasked with protecting Doctor Deveraux when out in the field. In reality, he is tasked with assassinating targets on Colony Negative that pose a threat to District Five's power. What he finds on Colony Negative proves not every situation can be fixed with a pull of the trigger, especially when the crosshair falls on the unexpected.\nBoth of them hate each other and what they mean to humanity. Yet, both of them have to rely heavily on each other to survive. It isn't just a free-for-all all amongst colonists, fighting in the name of dominance for their Districts. There is something else out there in the dark...something that suggests Colony Negative should have been left alone from the very beginning.","description_hash":2127139473899634370},{"title":"Paradox Interluder (Usurper #2)","fiction_id":"86591","link":"https:\/\/www.royalroad.com\/fiction\/86591\/paradox-interluder-usurper-2","tags":["Time Travel","War and Military","Grimdark","Steampunk","Multiple Lead Characters","Action","Adventure","Fantasy","Romance","Male Lead","Female Lead","Strong Lead","Secret Identity","Magic","High Fantasy","Ruling Class","Dystopia","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":213,"view_count":456,"chapters_count":11,"last_update":1718419942,"description":"Kaid Al-Yami changed the Continent forever with the Time Paradox: the reversal of exactly twenty-four minutes to save the woman he loves. Two years later, it is Empress Jessamine Kruzika who is picking up the pieces and handling the Paradox's consequences. A religious war appears to be on the horizon in Uhkhtar as the district regathers its newfound strength from the North. However, a new power arises in the east called Pestilence: someone out there is forcibly removing Oblivion from everyone who possesses it. Jessamine's ambition to mend the relationships between Empires and quell fears of Oblivion places her in the spotlight once more as a political threat. As much as Kaid can try to avoid both his revoked duty and love for his Empress, he must insert himself back into her life to keep her safe, while also answering for his crimes. With new threats on the rise, is their love powerful enough to overcome their wounds of betrayal and broken promises?","description_hash":7822183149796283890},{"title":"Crisis On 2D Worlds","fiction_id":"86590","link":"https:\/\/www.royalroad.com\/fiction\/86590\/crisis-on-2d-worlds","tags":["Portal Fantasy \/ Isekai","Urban Fantasy","Dungeon","Anti-Hero Lead","Male Lead","Action","Adventure","Romance","Tragedy","Harem","Slice of Life","Supernatural","Magic","High Fantasy","Progression"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":7,"view_count":42,"chapters_count":1,"last_update":1715757758,"description":"A Scummy NEET reads a weird email and finds himself transported to a black void. He is then offered the chance to live out the life he has always dreamed. after picking his first world and his character stats Lars is transported to the world of 2D. Using his knowledge of the plot and the system he gained as a player Lars sets out to conquer the multiple 2D worlds. \nWarning: The MC is not a hero, nor an anti-hero. He is a self centered, self serving, cynic, borderline sociopath who looks out for his own gain. If your looking for a loving, compassionate, hero of justice then I suggest you look elsewhere.","description_hash":1710820055108928067},{"title":"The Elemental Legacies [Elemental Power, Fantasy, Levelling, Demons]","fiction_id":"86589","link":"https:\/\/www.royalroad.com\/fiction\/86589\/the-elemental-legacies-elemental-power-fantasy","tags":["Urban Fantasy","Progression","War and Military","Martial Arts","Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":21,"rating":5.0,"page_count":37,"view_count":256,"chapters_count":6,"last_update":1718631121,"description":"ELION Hayes was born into a family of great influence in the Aeloria Empire. His parents held the coveted position of Elemental Kings. However, tragedy struck when they went on a mission in enemy territory and were presumed dead despite the lack of any evidence of their demise. Due to their parents' considerable wealth and inheritance, Elion and his younger sister, Alexa, were kicked out of the Great Hayes family by their uncles and aunts, blinded by greed, and had no sympathy for the siblings' plight.\n====THIS STORY IS ABOUT PEOPLE WITH ELEMENTAL POWER (FIRE,WATER,WIND,EARTH AND STEEL), WAR AGAINST DEMONS, WAR AGAINST EMPIRES, WITH RANK AND LEVELING SYSTEM.=====\nWhile searching for a fresh start, they moved to the Waste District, where they formed an unbreakable bond with three companions who eventually became their family: Laxus, Wendy, and Kael. Each of them had a past they gradually unveiled during their expedition in Solara. In this world, its inhabitants could connect with one of the five elements: fire, water, earth, wind, and steel.\nLaxus stumbled upon an intricately carved Phoenix box, and inside it, he found Elemental Orbs. These orbs had the unique ability to connect humans with the elements, but they were not ordinary; they held the legacies of the ancient Elementalists. Among the orbs Elion received was one that would set him on a bigger mission to help ensure the safety of Solara. It was revealed that the demons who had attacked Solara ten thousand years ago were about to return; this time, they were much stronger and brutal. The responsibility of defending Solara now rests on their shoulders.\nDespite the looming threat of danger, there was no news of the new Elemental Guardians of Solara returning to defend their land. To make matters worse, Solandar Solhart, the hero of the previous war in Solara, had also passed away in the conflict. Elion had less than five years to unravel the mystery of the legacy bestowed upon him as the Phoenix's successor and master the legacy given before the demons returned. He was also determined to uncover the truth behind his parents' deaths. What fate awaits Solara before the demons return?","description_hash":-7353741263638467872},{"title":"Lights in the darkness","fiction_id":"86588","link":"https:\/\/www.royalroad.com\/fiction\/86588\/lights-in-the-darkness","tags":["Multiple Lead Characters","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":20,"view_count":104,"chapters_count":3,"last_update":1716372003,"description":"In a fantasy world full of magic and so called skills, the three friends Kuro, Ryu and Shizuka have high ambitions. They want to become the strongest adventurers. With that goal in mind, they leave their hometown to form a party at the adventurers' guild in the capital of the kingdom. Once they arrive at the capital, they realize that their goal is harder to reach than they thought. Will they eventually fullfil their dream? Or will they give up and return to their peaceful lives in their hometown?","description_hash":8467169447246927},{"title":"Monarchs Of Principalities ","fiction_id":"86587","link":"https:\/\/www.royalroad.com\/fiction\/86587\/monarchs-of-principalities","tags":["Villainous Lead","Martial Arts","Action","Horror","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":75,"view_count":348,"chapters_count":9,"last_update":1718352733,"description":"The first couple of chapters aren't reality, so be prepared to experience them in that manner. They won't be straightforward. Have you ever had a dream? Was it straightforward? No, it definitely felt weird, right? These chapters are meant to capture that surreal, disjointed feeling of a dream, where reality blurs and the unexpected happens in an unexplained manner. Yet, you don't stop dreaming—you carry on. Embrace the strangeness and let yourself be immersed in the dreamlike narrative. *********\n******\n***\nIn a world where the remnants of grand empires coexist with ancient rituals and arcane mysteries, young Marcellus from Wisbech faces an unexpected destiny. Intended for the prestigious Church of Combat, Marcellus rejects this path, opting for a humble life as a cook in a local inn. However, his simple existence shatters when a brutal attack forces him into hiding.\nIn his desperation, Marcellus’s prayers for protection lead him to an otherworldly realm where majestic citadels stand alongside mystical artefacts and clandestine sects. Here, potions, hexes, and demonic forces are as common as the grand aqueducts and flintlock pistols of his homeland.\nAs Marcellus navigates this enigmatic world, he is drawn into a complex web of intrigue and danger. His latent powers begin to emerge, fueled by mysterious potions and guided by the whispers of ancient lore. He finds himself entangled in the machinations of both orthodox and unorthodox sects, each vying for control and the secrets of the divine.\nMarcellus's journey is one of survival and self-discovery as he seeks to unravel the mysteries around him. With every step, he delves deeper into a reality where the lines between dream and waking life blur, and where the true nature of the divine is shrouded in mystery.\nEmbark on a saga filled with wonder, peril, and the untapped potential of \"The Hollowed\" as Marcellus steps into a destiny he never imagined. In a land where ancient power and modern marvels collide, who will rise to claim the mantle of the divine?Think Lord of the Mysteries. It’s the same power system with some pathways different and some the same; this is an entirely different world, sharing only the power system with LOTM.(I am a broke college student, this is original content. however, I use ai to proofread and edit errors. I am waiting for the G3 slander)","description_hash":3283269573185874730}]