[{"title":"The General at Twelve - G&G Contest Entry ","fiction_id":"88166","link":"https:\/\/www.royalroad.com\/fiction\/88166\/the-general-at-twelve-gg-contest-entry","tags":["LitRPG","War and Military","Contemporary","Drama","Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":24,"view_count":106,"chapters_count":3,"last_update":1718364248,"description":"In 1979, a young man in crisis finds fellowship and glory at a wargaming club. When the older boys dismiss him, Robin Martillo enlists his abuela to paint a legendary army and take on the club champion and his unstoppable goblin horde.","description_hash":-7365190748517140225},{"title":"Eternal Ascendancy","fiction_id":"88165","link":"https:\/\/www.royalroad.com\/fiction\/88165\/eternal-ascendancy","tags":["Progression","Xianxia","Male Lead","Action","Adventure","Fantasy","Martial Arts"],"lable":"Original","following_count":3,"rating":0.0,"page_count":105,"view_count":696,"chapters_count":21,"last_update":1718233256,"description":"Azarion the Undying is an ancient, powerful being trapped by his strength. The universe won’t let him die unless someone as strong as him ends his life. For ages, he has sought a worthy successor, but all have failed—until he meets Kai Ren.\n Azarion’s timeless appearance, with silver hair and deep, knowing eyes, hints at his immense power and wisdom. Despite his strength, immortality feels like a curse, and he hopes Kai Ren will finally set him free.\n Kai Ren a 14-year-old boy who lost his entire family in the aftermath of a battle between two cultivators decides to end his life by jumping off a cliff but fate has other plans for him.\n Just as Kai Ren was about to jump off a lightning bolt struck him, he thought that if he was going to die anyway, why be scared of it?\nAs he was waiting for his ultimate demise he felt a pleasant feeling that he thought was the feeling of the afterlife, but the next moment he heard a deep celestial voice in his head \"Open your eyes, child, as you are not dead.\" The voice declared in his head.\n\n\"Who are you? and what do you mean by I am not dead?\" Questioned Kai Ren with a confused tone.\n\"My name is Azarion the undying, and as to why are you not dead, it is simple, the lightning bolt that struck you was created by me using a heavenly treasure, and as for what it does, it increases your talent to what a mortal could ever hope to achieve.\" The celestial voice replied.\"Why me? I mean I am just an ordinary mortal. Why waste such a precious treasure on me?\" Kai Ren asked in an uncertain voice.\n\"You should not worry about that, child when the time comes you will understand why I did this.\"\nSo with the greatest talent known to mortals, Kai Ren will start his journey on the cultivation path, to complete his goal of revenge against the murderers of his family and to complete the goal of Azarion the undying.","description_hash":4921970405010470316},{"title":"The Enigma of Eldoria","fiction_id":"88164","link":"https:\/\/www.royalroad.com\/fiction\/88164\/the-enigma-of-eldoria","tags":["Portal Fantasy \/ Isekai","Male Lead","Action","Fantasy","Mystery","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":30,"chapters_count":1,"last_update":1717937823,"description":"In the tranquil village of Wistmere, nestled within the magical kingdom of Eldoria, the arrival of a mysterious stranger named Aric disrupts the serene daily life of its inhabitants. Cloaked in an aura of ancient magic and carrying fragments of lost memories, Aric seeks refuge and answers about his origins. His presence stirs curiosity and unease among the villagers, particularly the wise elder, Eamon.\nAric believes Wistmere holds the key to unlocking his past and uncovering a hidden realm where the boundaries between the magical and mundane blur. As he integrates into village life, helping and learning from the villagers, Aric spends his nights delving into old texts and maps, piecing together clues about his heritage.\nHowever, his arrival triggers a chain of events that awaken a dark force in the ancient forest surrounding Wistmere. Shadows shift, and an eerie silence falls over the land, hinting at the perilous journey ahead. Aric's quest for truth and identity is fraught with danger, secrets, and the promise of a destiny that could alter the fate of Eldoria forever.\nAs Aric stands at the edge of the forest, feeling the pull of destiny, he knows that his true adventure is just beginning. The path to uncovering his past and understanding the ancient magic entwined with Wistmere will test his resolve, courage, and the bonds he forms with the villagers. Together, they must navigate a world where mystery and fantasy intertwine, facing challenges that could reshape their lives and the kingdom itself.","description_hash":-2803409513756205511},{"title":"Witch of the Gloria Forest","fiction_id":"88163","link":"https:\/\/www.royalroad.com\/fiction\/88163\/witch-of-the-gloria-forest","tags":["Female Lead","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":4,"rating":0.0,"page_count":23,"view_count":243,"chapters_count":4,"last_update":1718362887,"description":"Agnes, an oblivious child from a small village, meets a mysterious stranger in the forest she plays. A warlock.\nAfter that, despite knowing it defies her previous beliefs and her parents' teachings, the little girl studies witchcraft from the mysterious warlock, not knowing what that will entail.","description_hash":6302568101847554145},{"title":"Eternal Empress of the Hellborne","fiction_id":"88162","link":"https:\/\/www.royalroad.com\/fiction\/88162\/eternal-empress-of-the-hellborne","tags":["GameLit","Dungeon","Anti-Hero Lead","Ruling Class","Female Lead","Action","Adventure","Fantasy","Strong Lead","Secret Identity","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":7,"rating":4.0,"page_count":21,"view_count":272,"chapters_count":3,"last_update":1718568858,"description":"The peaceful days of an old woman living in a distant town are interrupted when she finds her home being ransacked by a couple of goblins; Hellborne. It was her desire to live away from the conflict of the Empire and Republic, but with these couple of beings, she’s left with the choice of getting rid of them or aid them, something that could force her to show both the town and the world the kind of woman that she really is.","description_hash":-9045368573822599350},{"title":"Shadows and Nightmares","fiction_id":"88161","link":"https:\/\/www.royalroad.com\/fiction\/88161\/shadows-and-nightmares","tags":["Adventure","Fantasy","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":28,"chapters_count":1,"last_update":1717937805,"description":"Shadows and Nightmares is a collection of Dark Fantasy short stories, each set in a different corner of a haunting and nightmarish world. Venture into cursed lands, haunted forests guarded by magical creatures, and cities ruled by dark forces as you follow the twisted paths of doomed souls and sinister beings lurking in the darkness. Each tale reveals a fragment of a realm where death and despair reign and shadows whisper secrets of horrors too unspeakable to say out loud.","description_hash":6618556380718744438},{"title":"Quest for the Primordial Cookie (A grandma and goblins wholesome isekai novel)","fiction_id":"88160","link":"https:\/\/www.royalroad.com\/fiction\/88160\/quest-for-the-primordial-cookie-a-grandma-and","tags":["Progression","Comedy","Female Lead","Secret Identity","Strong Lead","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":7,"view_count":69,"chapters_count":2,"last_update":1718522516,"description":"Many aspirants, all with different goals, were sent to the new land of Nevatora. A land of war, blood, treachery, and the promise of wealth. But most importantly…Cookies!?\n\nFrom gold to power, many have begun their path in the land to reach their goal, among them, is an elderly woman named Caroline, who found herself plucked from the path to a nearby marketplace to buy ingredients for cookies, now pitted in a realm that would surely kill her. To accomplish this new goal of gaining cookie ingredients, and also ownership of the world which didn't interest her as much, she must cross 3 lands that only get worse in brutality and carnage.\n\nBut rather than fear, she was curious, and saw little wrong or different, hoping to complete her cookie recipe despite the circumstances.\n\nCan she achieve this newfound goal? And will she be able to survive the new realm?","description_hash":-9176249839768247361},{"title":"Mosaic of Simulations","fiction_id":"88159","link":"https:\/\/www.royalroad.com\/fiction\/88159\/mosaic-of-simulations","tags":["Tragedy","Action","Adventure","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":24,"view_count":142,"chapters_count":4,"last_update":1718148275,"description":"In \"Mosaic of Simulations\" Alex finds himself entangled in a mysterious world where simulations blur the lines between reality and illusion. With each simulation, he is granted glimpses of potential futures, but no matter the choices he makes, death awaits him at every turn. As Alex delves deeper into this enigmatic realm, he grapples with existential questions and uncovers startling truths about himself and the nature of reality. With each cycle, he becomes more determined to break free from the cycle of fate and carve his own path, but the consequences of his actions may prove more dire than he ever imagined. Can Alex unravel the mysteries of the simulations before it's too late, or will he remain forever trapped in this labyrinth of uncertainty? \"Mosaic of Simulations\" is a gripping tale of choice, consequence, and the quest for truth in a world where nothing is as it seems.","description_hash":-4941640772018329367},{"title":"Strange fates","fiction_id":"88158","link":"https:\/\/www.royalroad.com\/fiction\/88158\/strange-fates","tags":["Psychological","Non-Human Lead","Adventure","Short Story"],"lable":"Original","following_count":1,"rating":5.0,"page_count":37,"view_count":1041,"chapters_count":9,"last_update":1718569243,"description":"Ryan, a young goblin warrior was chosen to save his tribe from a dreadful curse. Little did he know the quest would be far more than what he bargained for.  \nParticipant in the Royal Road Magazine June 2024 writing contest.\nUpdates (hopefully) : 3 times a week.","description_hash":223865014350286200},{"title":"A Kelpie's Tale","fiction_id":"88157","link":"https:\/\/www.royalroad.com\/fiction\/88157\/a-kelpies-tale","tags":["Post Apocalyptic","Anti-Hero Lead","Female Lead","Drama","Adventure","Fantasy","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":32,"chapters_count":1,"last_update":1717937774,"description":"Is change even possible for a beast like this? To become a creature so opposite that it feels impossible. But the Kelpie must try.","description_hash":9140886065929641818},{"title":"Gorx","fiction_id":"88156","link":"https:\/\/www.royalroad.com\/fiction\/88156\/gorx","tags":["Progression","Non-Human Lead","Action","Adventure","Fantasy","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":55,"chapters_count":2,"last_update":1718615299,"description":"A young goblin, ostracized by his tribe for being too kind, finds solace and friendship with an old human lady.\nHowever, everything changes when a visitor arrives.","description_hash":5288642965164997540},{"title":"Name ","fiction_id":"88155","link":"https:\/\/www.royalroad.com\/fiction\/88155\/name","tags":["Urban Fantasy","Progression","Villainous Lead","Super Heroes","Strategy","Action","Horror","Psychological","Mystery","Reader Interactive","Slice of Life","Supernatural","Secret Identity"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Something you never realize until you're confronted with it is how tenacious life really is. The primal, instinctual desire to survive is so powerful that even when it's illogical, animals will claw and cling to life as desperately as they can until their very last moment. \nI stood there, curiously staring at her body as she helplessly tried to stem the bleeding. I knew her actions were useless; I had made sure to sever her carotid artery completely. Confusion, despair, fear, and panic were evident in her gaze as she struggled to maintain eye contact. It only took 6 seconds for her eyes to start to dull, adopting a doll-like, glassy shine. Yet, even as her life ebbed away, her chest spasmed and heaved, as if breathing would somehow provide more oxygen to her suffocating brain. There was a strange serenity in those final moments as I watched the light in her eyes flicker and finally extinguish, her body going still. \nOnce I confirmed she was definitively dead, I began my protocol.","description_hash":-3990923141575372105},{"title":"Matron of Honor","fiction_id":"88154","link":"https:\/\/www.royalroad.com\/fiction\/88154\/matron-of-honor","tags":["Anti-Hero Lead","Ruling Class","Female Lead","Strong Lead","Adventure","Fantasy","Magic"],"lable":"Original","following_count":17,"rating":5.0,"page_count":15,"view_count":165,"chapters_count":2,"last_update":1718425782,"description":"All Meave wanted to do once she got out of Bleakhouse Prison was to work at a pensioner's job for the Church of the Caregiven as a Lay Person in a quiet job for however many years she had left.\nInstead, she is made the house matron of an orphanage and given the charge of the discarded children, the unwanted, malformed, and half breeds like herself deemed born in sin by the Church.\nShe even gets stuck with the name GrandGram by the children for her size and age.\nThen late one night a mysterious stranger shows up with a writ to take in a few children as his wards... all of the children.\nThere may be some violence and sensitive content, but neither are planned to be described in graphic detail.\nWhat to expect:\nI don't know myself yet. Tough old broad dealing ruthlessly with those who endanger her charges, kids putting themselves in danger doing stupid kid stuff. I'm one chapter in and the plot hasn't emerged other than a very vague framing device.\nIt's how I write and it seems to work me and at least some readers for most of the time.","description_hash":-3454419080719978208},{"title":"The Orkian War","fiction_id":"88153","link":"https:\/\/www.royalroad.com\/fiction\/88153\/the-orkian-war","tags":["Sci-fi","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":203,"view_count":516,"chapters_count":15,"last_update":1717980386,"description":"In a modern parallel magical world where different Ukrainian war is fought.  The follow up Have Will, Will Space Travel Arc may follow soon.  This is based on my original story of Underworld Subspace, which I never did publish.","description_hash":6545516470669159816},{"title":"The First Disciple","fiction_id":"88152","link":"https:\/\/www.royalroad.com\/fiction\/88152\/the-first-disciple","tags":["Time Loop","Female Lead","Strong Lead","Tragedy","Action","Fantasy","High Fantasy","Time Travel"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":160,"chapters_count":3,"last_update":1718183043,"description":"Aya Arama, destined for greatness, nearly has her life cut short when her kingdom is attacked by the Solarian King. On the verge of death, she merges her soul with Ik'thoa, a creature of mysterious origin that her father had imprisoned. Now, Aya struggles to survive in a hostile world, all in hopes that she can one day find a place to live peacefully.","description_hash":4873135842753591815},{"title":"An Unpeaceful Retirement","fiction_id":"88150","link":"https:\/\/www.royalroad.com\/fiction\/88150\/an-unpeaceful-retirement","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Post Apocalyptic","Female Lead","Action","Adventure","Horror","Short Story","Magic"],"lable":"Original","following_count":3,"rating":0.0,"page_count":32,"view_count":229,"chapters_count":4,"last_update":1718460035,"description":"For the entirety of her adult life Momo has put others before herself. First as a soldier and wife, then as a care-giving grandmother her days were filled with someone else's needs and wants. Just when she was ready to put her foot down and says she just wanted to laze about and grow tomatoes, she is pulled into another world to help a snarky disembodied voice carry out a dangerous mission that could save or kill everyone on the planet.\nBut Momo doesn't want to save her new planet, or to kill everyone on it. She just wants to enjoy her retirement all alone and grow vegetables in a little garden. Ignoring her quests and refusing to play along with the scenario built for her, she tries her best to settle into an abandoned village and use her special new skills to enjoy her old age in peace. If only everyone would leave her alone. The living are more bothersome than the zombies wandering around.\n\nA new novella with chapters releasing T, TH, and Saturday until complete!","description_hash":-266728133997808785},{"title":"The Ridge: Justice Unbound","fiction_id":"88149","link":"https:\/\/www.royalroad.com\/fiction\/88149\/the-ridge-justice-unbound","tags":["Male Lead","Strong Lead","Action","Historical"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":26,"chapters_count":1,"last_update":1717937655,"description":"Tagline: Before a World War made them great, the times and The Ridge made them strong.\nThe depression is going full force in 1937 Wynne, Arkansas, but while the Bentwood family has it easier than most, 17 year-old Marshall wants out. The only thing in his life he loves, other than his family, is The Ridge, a beautiful low mountain range near his home. Regardless, he’s sick of farming, sick of mules, sick of plowing, sick of his life and is determined to leave and see the world.\nHe gets his wish, but at a deadly price. After crossing two bootleggers to aid a friend, Marshall is target by these men to be an example. But, by mistake they beat his 18 year-old look-a-like brother, James, to death.\nKnowing the courts are owned by the county’s moon shiners and that, at best, they will get just a “slap on the wrist” Marshall, one of the best hunters and shots in the county, decides to meet out justice to fit the crime, killing the two men from ambush.\nWhen he’s finished, he knows he’s done what is right, but he also knows that further retribution will ensue if he remains in the area. So he leaves home setting out across the southwest by rail and by thumb never expecting to return home and hoping the matter will end there.\nAlong the way he meets a cast of characters, both real and fictional, which only a worldwide depression could create. Destitute families, traveling minstrels and railroad “bulls”, among others, cross his path. He also comes face-to-face with massive human loss in the form of an actual Texas school disaster which is still the greatest of it’s kind. All of these things come together to test the boy’s fortitude, honesty, faith and sense of right and wrong.\nBut even though Marshall leaves, not satisfied to just let the matter drop, the vicious father and two ruthless sisters of one of the bootleggers kidnap Marshall’s six year-old sister. Knowing she will be killed if Marshall isn’t found and returned, a four-state hunt for the teen hunt ensues.\nOnce found, the race is on to get Marshall back to Wynne before the kidnapper’s deadline. What follows is a deadly meeting in the snowy woods of the Arkansas countryside and The Ridge which finally brings this bloody family feud to a stunning conclusion.\n The story of Marshall Bentwood, is a story of courage and family loyalty set against the depression and the rumblings of a coming world war. In The Ridge: Justice Unbound, the reader sees the type of character, Tom Brokaw called, the Greatest Generation.","description_hash":9061377109018119915},{"title":"Empath x Kill: I Was Summoned Into This World By Murderous Psychos Who Want To Take Revenge On Another Group of Psychos","fiction_id":"88148","link":"https:\/\/www.royalroad.com\/fiction\/88148\/empath-x-kill-i-was-summoned-into-this-world-by","tags":["Portal Fantasy \/ Isekai","Dungeon","Strategy","Male Lead","Slice of Life","Action","Adventure","Fantasy","Satire","Magic","High Fantasy","Progression"],"lable":"Original","following_count":1,"rating":4.0,"page_count":12,"view_count":103,"chapters_count":2,"last_update":1718128172,"description":"\"Greatest story ever written.\" - my mom\nJGamer02, also known as \"John\" finds himself summoned into another world after a group of assassins mistake his pro gaming skills for assassination mastery. Tasked by his four disciples, JGamer02 sets out to rain revenge upon the rival The Autumn Shadow Summer Sect and regain the lost honour of his followers.\nOr at least, make them believe that's what's happening.\n- - -\nNew chapters every once in a while like it's hard to write, man.\nTags: parody, weak-to-nowhere-particular, murderhobos (quite literally), anti-anti-hero MC, legal love interest, tax-filing","description_hash":-2430504673054476348},{"title":"Saturday Gazette - Octopus in Space","fiction_id":"88147","link":"https:\/\/www.royalroad.com\/fiction\/88147\/saturday-gazette-octopus-in-space","tags":["Space Opera","Non-Human Lead","Sci-fi","Action","Adventure","Mystery","Genetically Engineered ","Technologically Engineered","First Contact","Hard Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":2,"rating":0.0,"page_count":23,"view_count":110,"chapters_count":4,"last_update":1718356806,"description":"Fighty. Feely. Mighty. Stealy. Sneaky. Pokey. Cheeky. Chokey.\nThese are the arms of Saturday Gazette, an octopus woken to newfound sapience aboard a dying starship.\nTogether they'll need to indulge in acts of piracy, espionage, private investigation and diplomacy, to uncover a conspiracy of galactic proportions, and prevent an interstellar war.","description_hash":-6396008768698672441},{"title":"Tess and Tel's","fiction_id":"88146","link":"https:\/\/www.royalroad.com\/fiction\/88146\/tess-and-tels","tags":["Comedy","Non-Human Lead","Drama","Fantasy","Female Lead","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":42,"chapters_count":1,"last_update":1717932956,"description":"Telia awakes in a forest alone and with no memories, stumbling upon a cottage inhabited by a peculiar old lady named Tessandra. Initially wary of her, Telia expects the woman to treat her harshly, but instead finds herself welcomed with... meals?\nAs Telia navigates her new reality, she discovers that Tessandra's kindness extends beyond mere hospitality. Through cooking, Telia slowly acclimates to human interaction, using food as a bridge to build trust and relationships she never thought possible. \nIt's not magic, it's cooking!","description_hash":-2793094241385433996},{"title":"Oh My! Taking care of your grandchildren as the strongest goblin granny","fiction_id":"88145","link":"https:\/\/www.royalroad.com\/fiction\/88145\/oh-my-taking-care-of-your-grandchildren-as-the","tags":["LitRPG","Comedy","Female Lead","Strong Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":28,"view_count":135,"chapters_count":2,"last_update":1718059566,"description":"The time back with her progeny up in the surface world was supposed to be a sunny vacation forgoblin grandma Grethi after her time of rough-housing in the dark .Sure, she expected some things to have changed over the last few years. Decades? But when she finds her wayback to the lair of her youth, she is rather appalled at the state of things. Shocked even.Grimy girls in dusty dens littered with blood-stained bodies and a full-on goblin genocide are one thing,but no one has even thought to have some cake prepared?\nGrethi seems to have her work cut out for her as even the human's most divine oracle seems to have something againstanyone small and green enough. But allies can be found in the most unusual places, and Grethi still has some moxie left in her.","description_hash":2872714812556085284},{"title":"Tarthocas ","fiction_id":"88144","link":"https:\/\/www.royalroad.com\/fiction\/88144\/tarthocas","tags":["Progression","Xianxia","Tragedy","Action","Fantasy","Mystery","Martial Arts","Magic"],"lable":"Original","following_count":3,"rating":5.0,"page_count":65,"view_count":531,"chapters_count":11,"last_update":1718607207,"description":"Cover Art by Malt ( Discord Handle)\n----------------------------------------------\nDo you love the thrill of world travel?Are you captivated by intricate and high-quality power systems? [ Relative to Creator cough ]Do you relish a good mystery?\nThen, dear readers, this novel is for you!5 Acts4 Stages3 Writers2 Ideals1 Actor................................Carto Harts was just an ordinary college student until he found himself transmigrated to another world. Armed only with a computer and a mysterious library, he must navigate this strange new land. Will he flourish or drown in a river of madness? Only Avacaniya knows. Dive into this enthralling journey and uncover the secrets that await.\n--------------------------------\nThis Book is brought to you by The Big Machine, whom people who have come here from WN may know as The Living Typewriter. \nThis book is currently a solo Project after 2 members left and the release is messed up as well, yet worry not people I can assure you that you'll at least receive a single chap each week.  \nWell that's all for now.\n - The Machine \n--------------------------------\n\n\n\n\n© Copyrighted by The Machine. All Rights Reserved. No permission is given by the author to reproduce, translate, create audio formats, or distribute except for posting on approved sites such as Scribble Hub,Royal Road and Web Novel","description_hash":-998264130301889077},{"title":"레드람~REDRUM~","fiction_id":"88143","link":"https:\/\/www.royalroad.com\/fiction\/88143\/redrum","tags":["Progression","Villainous Lead","Psychological","Male Lead","Secret Identity","Action","Drama","Mystery","School Life","Strong Lead","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":11,"view_count":36,"chapters_count":1,"last_update":1717924104,"description":"A reserved high school student named Kim Jae-min leads a solitary life, his attention solely focused on academic excellence. Unfazed by the distractions of teenage life, Jae-min maintains a quiet existence until he crosses paths with Han Soo-jin, a vivacious and compassionate girl with a heart of gold.\n\nDespite Jae-min's initial reluctance to engage with others, Soo-jin's relentless optimism and unwavering support gradually break through his walls, forging a deep bond between them. As their friendship blossoms into something more, Jae-min finds solace in Soo-jin's presence, her warmth thawing the icy barriers around his heart.\n\nHowever, their newfound happiness is shattered when Jae-min's estranged childhood friend, Park Joon-ho, resurfaces with a twisted obsession for Jae-min's success and a simmering jealousy towards Soo-jin. Consumed by his delusions, Joon-ho becomes determined to destroy anyone who threatens his perceived ownership over Jae-min, leading to a tragic and devastating confrontation.","description_hash":-8252857679551785131},{"title":"Actual Fiction","fiction_id":"88142","link":"https:\/\/www.royalroad.com\/fiction\/88142\/actual-fiction","tags":["Female Lead","Contemporary","Fantasy","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":26,"chapters_count":1,"last_update":1717923441,"description":"Cindy's friend from another world, Yang, decides to visit her on Earth. This causes her to find out that Earth, contrary to popular belief, actually has magic in it. Along with mages, secret mage societies, gods, monsters and much more. \n\nThis is my first time writing so any feedback would be appreciated. I'm still not sure where the story is going so expect edits that change the content of the chapter..","description_hash":1068258394644302793},{"title":"Karin, the Goddess's Sword (RRCM June 2024)","fiction_id":"88141","link":"https:\/\/www.royalroad.com\/fiction\/88141\/karin-the-goddesss-sword-rrcm-june-2024","tags":["Female Lead","Adventure","Fantasy","Short Story","High Fantasy"],"lable":"Original","following_count":27,"rating":5.0,"page_count":5,"view_count":141,"chapters_count":1,"last_update":1717921802,"description":"A paladin in the service of the Goddess pledges their life to the cause. In Her name, they dispense justice, defend the meek, and spread the light of Her faith across the realm. They are the Goddess’s hand, Her sword and shield, and their every action is done in Her name.\nNot out of duty. Or out of tradition. Accepting the mantle of paladin in the Goddess’s service isn’t a lifestyle one falls into or grows tired of. It’s a lifetime of selfless sacrifice in the name of the Goddess. Most die before their primes, standing against orcish hordes or sinister liches. Some die at the peak of their powers, fighting the very forces of Hell. \nThose are the lucky ones, for the contract between Goddess and paladin is irrevocable. \n\nParticipant in the June 2024 Royal Road Community Magazine Contest","description_hash":-6563302076874484166},{"title":"How Book Goblin Got His Name","fiction_id":"88140","link":"https:\/\/www.royalroad.com\/fiction\/88140\/how-book-goblin-got-his-name","tags":["Comedy","Multiple Lead Characters","Slice of Life","Short Story","Supernatural","Male Lead","Female Lead","Magic","Low Fantasy","High Fantasy","First Contact"],"lable":"Fan Fiction","following_count":2,"rating":0.0,"page_count":2,"view_count":37,"chapters_count":1,"last_update":1717921788,"description":"On a cold winter's night a grandmotherly women who lives in a special cottage allowed a Goblin to come in out of the cold.  Goblin likes Grandma but Goblin is still Goblin.  Goblin has heard Grandma has great treasure.  Goblin wishes to have Grandma's treasure and bring back to clan. Granny seems willing to share treasure.  What does treasure and paper have in common?  Why does Granny wish Goblin to learn what squiggles on paper mean?  Does not treasure mean things that are shiny?","description_hash":7640058013481644763},{"title":"Tales of Limbo: Drypeak Curse","fiction_id":"88139","link":"https:\/\/www.royalroad.com\/fiction\/88139\/tales-of-limbo-drypeak-curse","tags":["Tragedy","Fantasy","Horror","Short Story","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":40,"chapters_count":1,"last_update":1717921784,"description":"Having earned leave from the rangers guild Stan decides to go visit his grandma, who happens to be the last living resident of the once beautiful village of drypeak. During his stay however he finds out that his she is held under the sway of an old curse and she doesn't have much time left. With no known cure for the affiction he seeks to spend as much time with her as possible between guild commitments and his desire to find a cure however there isn't much available, so he will just have to make the most of what he has left.","description_hash":-4429370085931788663},{"title":"Adopted by Goblins","fiction_id":"88138","link":"https:\/\/www.royalroad.com\/fiction\/88138\/adopted-by-goblins","tags":["Comedy","Female Lead","Slice of Life","Fantasy","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":15,"view_count":66,"chapters_count":2,"last_update":1718580544,"description":"Evelyn the Fierce is a retired adventurer looking for a quiet place to settle down. After rescuing a pair of goblin children, she realizes their village might just be the place she's been searching for.","description_hash":6930101653369874183},{"title":"Guileful Goblins Unleashed: Silly Shenanigans","fiction_id":"88137","link":"https:\/\/www.royalroad.com\/fiction\/88137\/guileful-goblins-unleashed-silly-shenanigans","tags":["Portal Fantasy \/ Isekai","Dungeon","Comedy","Non-Human Lead","Slice of Life","Adventure","Fantasy","Romance","Female Lead","Strong Lead","Magic","High Fantasy","Progression","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":8,"view_count":35,"chapters_count":1,"last_update":1717921769,"description":"Join Tiktik Clocktok, Urban Bountyhunter Extraordinaire, our goofy gorgeous goblin goober before she leaves the Hidden at the Heart of the Fey's Wilds. In this side-story to AAoMM, we get the full picture of the flashback Tiktik tried to communicate to our beloved Shellcrackers, opening our eyes to her misconceptions. (Or at least to her whole point-of-view as events occurred.)\nTiktik and Littlebit are best friends forever, but what if one or the other of them wanted something else? Something more intimate? The clockwork sorceress, and the steampunk clockwork inventor, both goblins at the lower rungs of social hierarchy within the Fey's Wilds, are bundles of mischief and joy. Neither really fits in where they're from, \"The Courts,\" or at least, the far edges of the \"Lower Courts\" in the Fey's Wilds. Despite having loving families, each really only ever feels at home in the company of the other.\nWill either of them examine these feelings close enough to discover what they might truly mean? Dive into the tale and find out!","description_hash":5798951363586458679},{"title":"The Black Nymph ","fiction_id":"88136","link":"https:\/\/www.royalroad.com\/fiction\/88136\/the-black-nymph","tags":["Tragedy","Drama","Fantasy","Romance","Supernatural","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":12,"view_count":64,"chapters_count":2,"last_update":1717940394,"description":"In the shadowed groves of Vigilum Arbor forest, at the edge of the mythic land of Melanthea, where the whispers of the ancients still linger among twisted boughs, there dwells a being as enigmatic as the moonlit paths that crisscross her domain. She is known as the Black Nymph, she serve as a guardian of the natural world, protectors of specific regions, or companions to deities. They are often depicted as ethereal beings with a deep connection to nature and the elements and a creature of both beauty and dread. Cloaked in midnight hues, her wings shimmer with a subtle iridescence that mirrors the starry sky, making her almost invisible to the untrained eye.\nMaellyn Strom, the black nymph, possesses powers ancient and deep, drawing strength from the very roots of an ancient Rowan tree. She can communicate with the trees, command the creatures of the night, and manipulate shadows to cloak her movements. Despite her fearsome reputation, she is a protector at heart, fiercely guarding the boundary of life and death against those who dare to defy and cause such transgression upon it.\nYet, she is a paradox, for her heart carries the burden of centuries of solitude, making her both aloof and profoundly melancholic. The mystical and enchanted dwellers living at the forest's edge speak of her in hushed tones, mixing reverence with fear. To them, she is a phantom, a whisper of silk wings in the night, a glimpse of otherworldly grace that reminds them of the magic that still pulses beneath the surface of their and others world .\n\n\n                               Disclaimer \nThe contents of this novel stem from the author's creative imagination.  While inspired by real elements, the details within have been creatively modified and all scenarios and characters described are purely fictional, and any resemblance to actual persons, living or dead, or to real events is purely coincidental.Additionally any inaccuracies in the portrayal of cultural or historical aspects are unintentional.","description_hash":-8535897023310476344},{"title":"The Halls of Gregar","fiction_id":"88135","link":"https:\/\/www.royalroad.com\/fiction\/88135\/the-halls-of-gregar","tags":["Male Lead","Action","Adventure","Fantasy","Supernatural","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":22,"view_count":202,"chapters_count":3,"last_update":1718412766,"description":"When college graduate Orer Janesh and his cousin Kena are sent to spend a summer with their grandmother in the rolling countryside of Gregar, Orer is set on getting through the boring months with little zeal. He only has to make it to August before starting a flashy new position at a bank and then he can say goodbye to long stays at Gram’s forever. \nBut as the days progress, the two discover that the urbane and dry residence known as Gram’s is not all that it seems. Green creatures come out of the forest at dusk, some random bird screeches every midnight, and Gram, apparently, has been holding out on family secrets. Armed with only a guidebook, a flashlight, and a suspicious pair of spectacles, Orer’s going to need all his wits about him if he ever hopes to make it to that desk job–much less stay alive.","description_hash":2077027449479904128},{"title":"An Eccentric & Wise Senior’s Taste for Blood! (For the Goblins and Grandmas June 2024 Magazine contest)","fiction_id":"88134","link":"https:\/\/www.royalroad.com\/fiction\/88134\/an-eccentric-wise-seniors-taste-for-blood-for","tags":["Comedy","Action","Fantasy","Short Story","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":17,"view_count":100,"chapters_count":2,"last_update":1718202428,"description":"This is a stand alone story for the Goblins and Grandmas June 2024 Magazine contest.\n\nYou do not need to read any other stories by me to understand and enjoy it.  But you can anyways if you want.","description_hash":-993715912538488204},{"title":"The Suicide Cabin","fiction_id":"88133","link":"https:\/\/www.royalroad.com\/fiction\/88133\/the-suicide-cabin","tags":["Psychological","Horror","Short Story"],"lable":"Original","following_count":1,"rating":0.0,"page_count":7,"view_count":96,"chapters_count":1,"last_update":1717921743,"description":"Inspired by one of my very own dreams, The Suicide Cabin explores a cycle of Trauma and Abuse seen through the eyes of a faceless protagonist. It is a story that delves deep into the dark recesses of the human mind, and the horrors that we conjure. Using a supernatural backdrop, this short story attempts to portray the sheer evil of the Human Mind and speak indirectly about the inevitability of fate. \n\nCover Image from Freepik.com","description_hash":2005932651121225835},{"title":"My Codependent Yandere Multiverse Adventure! ","fiction_id":"88132","link":"https:\/\/www.royalroad.com\/fiction\/88132\/my-codependent-yandere-multiverse-adventure","tags":["Portal Fantasy \/ Isekai","Time Loop","Progression","Anti-Hero Lead","Strategy","Adventure","Comedy","Fantasy","Romance","Male Lead","Female Lead","Strong Lead","Multiple Lead Characters","Magic","High Fantasy","Time Travel","First Contact","Attractive Lead"],"lable":"Fan Fiction","following_count":5,"rating":5.0,"page_count":251,"view_count":1802,"chapters_count":24,"last_update":1718531008,"description":"Tereda Chouju just wanted a nap. Instead, he got a front-row seat to the apocalypse.\n\n\nWhen the world's greatest hero snaps and blows up the planet, Tereda finds himself trapped in a time loop, reliving his death over and over.\n\n\nBut death is just the beginning of his journey.\n\n\nArmed with a mysterious cultivation technique, and his undying love for his Oni companions, Rem and Ram, Tereda navigates a multiverse teeming with danger and opportunity.\n\nFollow this chaotic good trifecta of codependent Yandere's as they accidentally blow shit up while trying to be good!\n---\nHi, guys, this is my dream fanfiction. I have been working on this idea for years and this time, we're doing it RIGHT!\nI have poured my heart and soul into this project and I really want people to enjoy it! I did power scaling for multiple universes, made sure that lore in this story was as close to canon as possible while allowing for my story to take place. Things should match up between events.\nI made sure that the butterflies and the events they created made actual sense! I would absolutely love it if you guys would love this story as much as I love it!","description_hash":2075300711629714449},{"title":"Denizens of the Labyrinth","fiction_id":"88131","link":"https:\/\/www.royalroad.com\/fiction\/88131\/denizens-of-the-labyrinth","tags":["LitRPG","Action","Adventure","GameLit"],"lable":"Original","following_count":2,"rating":0.0,"page_count":45,"view_count":211,"chapters_count":7,"last_update":1718622005,"description":"The story is about a Seeker who has entered the labyrinth (a planetary dungeon) to find his lost foster father. Linking with the system and forming friends\/ a party. You will see the different worlds that exist within the labyrinth and the quests and tasks the labyrinth sets for all those who enter!\nExpect: \n- Currently uploading on MTWTF\n- LitRPG story with fantasy-esque writing style \n- Lots of items and lots of skill moves\n- Long series and massive world(s)","description_hash":-1486909976793390227},{"title":"Fischer Befabled","fiction_id":"88130","link":"https:\/\/www.royalroad.com\/fiction\/88130\/fischer-befabled","tags":["Portal Fantasy \/ Isekai","Time Travel","Psychological","Non-Human Lead","Slice of Life","Action","Adventure","Fantasy","Supernatural","Male Lead","Strong Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":30,"chapters_count":1,"last_update":1717921330,"description":"Fischer had always wanted an adventure, but perhaps this one isn't what he asked for.\n\nWhat to expect:\n— An adorable goblin who likes to fish \n— wonderful grandmothers who are clearly not witches *wink* *wink*\n— Storytelling and style: metamodern and whimsical, because why not?\n— A magic system that doesn't make sense, we do it old school.\n— Fairytales galore (but with their own special twists) \n— multiple worlds and realities to explore! or not, we don't do it like Stars and Fields™.\n— Human characters, even a goblin could be human.\n— Our battles are not just physical, but also mental and emotional.\n— Symbolisms left and right, can one find them all?","description_hash":6855113331618017819},{"title":"Forsaken Realm","fiction_id":"88129","link":"https:\/\/www.royalroad.com\/fiction\/88129\/forsaken-realm","tags":["Portal Fantasy \/ Isekai","Male Lead","Action","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":115,"chapters_count":2,"last_update":1717967854,"description":"Kai, a reserved and distrustful young man, is transported to a mysterious, ancient world. Forced to rely on a group of diverse strangers, he must navigate an unfamiliar and dangerous realm. As they uncover secrets about their new surroundings and develop their unique abilities, the group strives to find a way back home. Along the way, Kai grapples with his past and learns the true meaning of trust and camaraderie.","description_hash":-6814032775631904222},{"title":"A Show for All Ages!","fiction_id":"88128","link":"https:\/\/www.royalroad.com\/fiction\/88128\/a-show-for-all-ages","tags":["Strategy","Male Lead","Adventure","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":55,"chapters_count":1,"last_update":1717921321,"description":"STEP UP, STEP UP! COME ONE, COME ALL! HERE’S YOUR CHANCE TO STRIKE IT BIG! ALL YOU HAVE TO DO – IS WIN! – The Game-Master, 32nd Show=============================================================================\nArthur Conwell is, for lack of a better word, screwed.He’s unskilled, unemployable and un-rich. (poor)So when he is given a chance to win a truly astounding sum of money, he accepts gratefully – only to realise after the fact that that was in actuality a monumental, colossal mistake.Thrust into a world of madness and whimsy, where the only resource he can rely on is his value as entertainment, he does his best to survive the challenges thrown his way, be it the introduction of Genetically Optimised Big, Lethal, Inconvenient Nasties (G.O.B.L.I.Ns for short) by the cheerful and carefree Game-Master; or even his own fellow contestants.And as Arthur navigates the dangerous, life-threatening landscape of the insane show he has found himself in, he finds himself repeating a simple sentence in his mind, over and over again.He shouldn’t have said yes.=============================================================================Participant in Royal Road Community Magazine: June 2024 Edition.","description_hash":3163457418614787910},{"title":"The End Of Destiny","fiction_id":"88127","link":"https:\/\/www.royalroad.com\/fiction\/88127\/the-end-of-destiny","tags":["Action","Adventure","Fantasy","Mystery","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":39,"view_count":271,"chapters_count":7,"last_update":1718436527,"description":"Title: \"The End of Destiny\"\nIn a world teeming with magic and ancient prophecies, a prodigious girl is born with a destiny she cannot escape.\nNyx has always known she was different. Born under the twin moons of Eclipsarum and blessed with unparalleled magical abilities, she is the chosen one destined to confront and defeat the malevolent demon king, Anos. From a young age, Nyx is trained rigorously in combat and sorcery, honing her skills for the day she will face her greatest challenge.\nThe kingdom of Eclipsarum, a land of breathtaking beauty and hidden dangers, teeters on the brink of destruction. The shadow of Anos's reign spreads, leaving fear and chaos in its wake. His dark powers grow stronger, and with each passing day, the hope of the people wanes. They look to Nyx as their beacon of hope, their last line of defense against the encroaching darkness.\nNyx's journey is fraught with peril. Alongside a diverse group of allies—a stoic knight, a cunning rogue, and a wise sorceress—she ventures through enchanted forests, over treacherous mountains, and into the heart of Anos's dark domain. Each step forward reveals more about her own powers and the true extent of the demon king's evil.\nAs Nyx faces trials that test her strength and resolve, she learns that her destiny is not just to wield power but to understand its cost. Her battles against Anos's minions are not only physical but also moral, challenging her to question the very nature of good and evil. In moments of quiet reflection and intense conflict, she begins to see that her purpose might be more complex than simply defeating an enemy.\nIn a climactic showdown, Nyc confronts Anos in his fortress of shadows. The battle is fierce, pushing her to the limits of her abilities.\n\"The End of Destiny\" is a riveting tale of courage, sacrifice, and the power of choice. In a world where magic shapes destinies, Nyx’s journey teaches us that true strength lies not just in fulfilling one's fate, but in forging a new path when the old one no longer serves. Through her struggles and triumphs, readers will be captivated by a story that explores the depths of human spirit and the transformative power of understanding and empathy.","description_hash":-4741992346588050888},{"title":"The Saga of Vibelung the Green","fiction_id":"88126","link":"https:\/\/www.royalroad.com\/fiction\/88126\/the-saga-of-vibelung-the-green","tags":["Strong Lead","Drama","Action","Adventure","Fantasy","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":55,"chapters_count":2,"last_update":1718211427,"description":"[Participant of the June 2024 Magazine Contest]\nGoblins. Peculiar creatures, they are: With curved ears, slanted eyes, and vibrant green skin, they are a species that have always kept to themselves, hidden away in the depths of a great and perilous forest. But when a new danger lurks in the horizon, a calamity known only as the Black Drake Maledictus, a human prince sets off to seek the aid of the Goblins' leader, Vibelung the Green.\nOnly she can help vanquish the dreaded scourge, but her body has long passed its prime. And countless perils await the unlikely duo on their journey to the world's edge. Will they discover a way to stop the dragon's descent, or will the land be bathed in fire and ruin?\nThe people are in need of a hero. Only, a retired one will have to suffice.","description_hash":2201940973135804340},{"title":"Startta Sin","fiction_id":"88103","link":"https:\/\/www.royalroad.com\/fiction\/88103\/startta-sin","tags":["Strategy","Martial Arts","Comedy","Psychological","Male Lead","Action","Drama","Slice of Life","School Life","Strong Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":27,"chapters_count":1,"last_update":1717869042,"description":"In the spy and assassin world ranking is everything, Startta Sin High School is ranked dead last out of the six schools and has been for the past 20 years because they attract the worst types of students causing the school's reputation to drown in the mud. However, an alumni of this school who is now the owner of the highest regarded spy\/assassin agency in the country want's to bring change to this school that holds dear to him. Lane, Simi, and Nol who are considered at the top of this world have been tasked of making this school rank one.","description_hash":-7896375452450765236},{"title":"Grandmother of Goblins","fiction_id":"88102","link":"https:\/\/www.royalroad.com\/fiction\/88102\/grandmother-of-goblins","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Comedy","Female Lead","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":7,"rating":0.0,"page_count":72,"view_count":468,"chapters_count":8,"last_update":1718560153,"description":"\"Halls do not dabble in the supernatural.\" This was the mantra of Sigrid Hall's grandmother and she has held to it all her life, dodging the magic of the world at every twist and turn. However, no one can be perfect forever and one injudicious slip of the tongue lands her right in the thick of it. Now charged with being a grandmother to goblins and saving them from their fate, Sigrid must use all her grandmotherly powers to protect, love, and nurture her new charges; and any other new grandchildren that come along.\n[[Participant in the Royal Road Magazine Contest, June 2024. Writing Prompt: Goblins and Grandmas.]]","description_hash":-7248294201350793597},{"title":"Aggy and I","fiction_id":"88101","link":"https:\/\/www.royalroad.com\/fiction\/88101\/aggy-and-i","tags":["Portal Fantasy \/ Isekai","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":38,"view_count":148,"chapters_count":3,"last_update":1718356249,"description":"Goblins and Grandmas Submission\nJake was a regular guy who died and woke up in the body of a granny in a magical world. Turns out the granny is incredibly powerful and was preparing to save the world again when Jake showed up and took over her body. How will Jake and Aggy manage to save the world? and are those.... goblins?","description_hash":-942369985670046766},{"title":"Wrinkles In The Face","fiction_id":"88100","link":"https:\/\/www.royalroad.com\/fiction\/88100\/wrinkles-in-the-face","tags":["Comedy","Non-Human Lead","Secret Identity","Adventure","Fantasy","Short Story","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":61,"chapters_count":2,"last_update":1718616189,"description":"An ancient council of goblins has been ruling over the vast western territory of the surrounding kingdom for centuries. The council members have been hiding in plain sight for many years, disguising themselves as old ladies. Some would say grandmas.\nThey gained their shapeshifting powers from an ancient creature known as the “Face Stealer”. Using ancient magics they entombed the creature in a rocky coffin deep in the cave system. It slumbered for many years, but the seal lost its power, and it awakened.\nGobby, a fierce goblin pawn of the Grandma Council, must now warn his superiors and become the driving force of a much-needed revolution in goblin politics. \nMaybe the awakening of the “Face Stealer” isn't as tragic as it seems.\n[Participant in June 2024 Royal Road Community Magazine Contest]","description_hash":-5083175468212247740},{"title":"Project:Imagine","fiction_id":"88099","link":"https:\/\/www.royalroad.com\/fiction\/88099\/projectimagine","tags":["Strategy","Multiple Lead Characters","Tragedy","Action","Adventure","Fantasy","School Life","Supernatural","Male Lead","Female Lead","Low Fantasy","Mythos","Genetically Engineered "],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":126,"chapters_count":2,"last_update":1718391605,"description":"After enduring their own separate tragedies, Iris and Maxwell are thrust into a hidden world of the supernatural—a realm concealed from the public eye and cloaked in deception. This world is filled with beings possessing extraordinary abilities, monstrous entities that view humans as mere prey and toys, and countless other hidden horrors.\nAs Iris and Maxwell navigate this treacherous landscape, they are faced with unimaginable dangers and the looming threat of madness. Their paths cross in unexpected ways, and together they must confront both the external monsters and their inner demons. Will they uncover the truth hidden from the public eye and find a way to survive, or will they be consumed by the very darkness they seek to escape?\nIn a tale where survival is uncertain and the line between reality and insanity blurs, Iris and Maxwell must rely on each other and their resilience to withstand the chaos.","description_hash":-8656449281048747624},{"title":"Darkest Depths","fiction_id":"88098","link":"https:\/\/www.royalroad.com\/fiction\/88098\/darkest-depths","tags":["Female Lead","Adventure","Fantasy","Horror","Short Story","Supernatural","Magic"],"lable":"Original","following_count":2,"rating":5.0,"page_count":7,"view_count":54,"chapters_count":1,"last_update":1717868979,"description":"If you stare into the abyss long enough, the abyss will stare into you.\nClimbing, caving, and diving are Odessa’s bread and butter. She makes her living by strapping on a camera and taking the viewers, sitting comfortably at home on their couches, to the highest peaks and down into the world’s darkest depths.\nIn a world where magic and monsters are common and witches rule the world, Odessa is unusual. She’s a fearless human blazing new trails with little more than her wits and an unhealthy dose of bravery. She’s intent on leaving her mark on the world. She’s already made it big on the internet, racking up quite a following.\nBut fame and funding are fleeting. The audience wants more. Odessa must always be looking for the next big thing, and she thinks she’s found it. In the jungle, just outside the small town known as Riftgate, lies an unexplored watery abyss.\nBut there is a reason this abyss has been left alone for so long, and in the hard-to-reach areas of the deepest underwater caves, all footage is pre-recorded. No one will ever know where she has been or what happened there if she doesn’t make it out alive.\nOdessa and her crew think they know what they’re getting themselves into. They have no idea what’s waiting for them in the dark.\nIf only the trip’s main benefactor hadn’t insisted on them taking a tag-along along on the dive. If only that tag-along weren’t his elderly grandma.\n\n[Written for the Royal Road Magazine]","description_hash":-3787788156976395207},{"title":"Soulless Path","fiction_id":"88097","link":"https:\/\/www.royalroad.com\/fiction\/88097\/soulless-path","tags":["LitRPG","Portal Fantasy \/ Isekai","Anti-Hero Lead","Grimdark","Slice of Life","Action","Adventure","Fantasy","Romance","Harem","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":4,"view_count":48,"chapters_count":1,"last_update":1717868974,"description":"Abruptly torn from everything he’s ever known and thrown into a game-like world, Marius, alongside a revered goddess, could live a life of fantasy—but he’d prefer to return to Earth. And so, he can’t afford to stay weak and keep his head lowered. He will do whatever it takes to return home. None who stands in his way will survive his undead!","description_hash":7733600505579610933},{"title":"Gertie's Gobbo Ghastlies","fiction_id":"88096","link":"https:\/\/www.royalroad.com\/fiction\/88096\/gerties-gobbo-ghastlies","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Comedy","Male Lead","Action","Adventure","Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":12,"view_count":84,"chapters_count":2,"last_update":1717951624,"description":"Ethan thought he lost his beloved Grandma Gertrude when she went missing a year ago. But when he discovers a mysterious scepter while cleaning out her mansion, he pulls her back from the fantasy world that imprisoned her. Only, she doesn't come alone. An army of goblins return with her and take up residence in her mansion. They're vile little creatures, but Ethan soon learns they've been protecting Gertie from something much worse.\nNow, with the portal between worlds ripped wide open, they're all that stands between Earth and eternal servitude under the whips of elven masters.","description_hash":-8033476764458987914},{"title":"Space Rock Chronicles","fiction_id":"88094","link":"https:\/\/www.royalroad.com\/fiction\/88094\/space-rock-chronicles","tags":["LitRPG","Portal Fantasy \/ Isekai","Xianxia","Comedy","Non-Human Lead","Action","Adventure","Reincarnation","Male Lead","Strong Lead","Magic","GameLit"],"lable":"Original","following_count":18,"rating":4.8,"page_count":6,"view_count":767,"chapters_count":6,"last_update":1718583341,"description":"Dave was what people would call an \"Average Joe.\" He had a good life, had a good job, and was satisfied with his life. \nThen suddenly, a fledgling god plucked him out of his reality to be reincarnated as... a rock?\nA space rock to be specific\n\nWhat to expect:\nRocky to rockier\nCultivation\nLife going on and on and on\nsum progression\nInhabitating inhabitants\nEgotistic heros...\nAnd more!\n(Also rock puns)","description_hash":-9154273674004225826},{"title":"Fortunes Flunky","fiction_id":"88093","link":"https:\/\/www.royalroad.com\/fiction\/88093\/fortunes-flunky","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Comedy","Action","Fantasy","Reincarnation","Magic","GameLit","High Fantasy","Mythos"],"lable":"Original","following_count":2,"rating":5.0,"page_count":29,"view_count":186,"chapters_count":3,"last_update":1718137661,"description":"Las Vegas glitters with promises of fortune, but for Larry \"Lucky\" Lewis, it's a graveyard of lost hopes. A degenerate gambler with a permanent five o'clock shadow, Larry stumbles out of a rundown casino, a jackpot winner for the first time in his life. Unfortunately Fate seems to have a wicked sense of humor. A speeding truck has Larry questioning the cruel irony of it all as his world fades to black.\nBut instead of pearly gates, Larry finds himself in a bizarre casino unlike anything he's ever seen. Here, Lady Luck isn't the ethereal youthful maiden of myth, but rather an older woman, seasoned by time and life’s unpredictable turns. Puffing on a cigarette and sizing him up with a twinkle in her eye. It turns out, Larry's jackpot wasn't just money, it was a one-way ticket to a fantastical world. Reborn as Fortuna's unlikely champion, Larry finds himself with a peculiar new goblin body and an interesting ability, the power to influence luck, both good and disastrously bad.\nWith a hidden calling as Fortuna's Prophet Larry is thrust into a world of swords, sorcery, and… dwarven bartending? His first mission? secure a job at the local union hall, a boozy den run by a band of criminal dwarves who just happen to be devout Fortuna worshippers. Here, Larry will navigate the complexities of his new role, juggle his unpredictable luck, and maybe, just maybe, rewrite his story, one chaotic quest at a time.","description_hash":6387567098888171225},{"title":"Nightfall","fiction_id":"88092","link":"https:\/\/www.royalroad.com\/fiction\/88092\/nightfall","tags":["Sci-fi","Action","Adventure","Horror"],"lable":"Original","following_count":1,"rating":0.0,"page_count":44,"view_count":238,"chapters_count":8,"last_update":1718559800,"description":"Journeying through a black hole, Matt and his crew find themselves stranded on a desolate planet full of deadly creatures: Earth, from the last known universe. Thrust into this dangerous new world with no way of escape, tensions among the crew rise when Matt meets Andromeda, one of the last humans on Earth. She’s unique and fierce, and Matt is instantly drawn to her, blossoming into his new life on a dark Earth even as alliances among his crew shift. When life on this planet begins to take a devious toll, and betrayals are made known, it’s up to Matt to fight for what’s left of his humanity or perish.","description_hash":1711005458180214393},{"title":"A Fair Exchange","fiction_id":"88091","link":"https:\/\/www.royalroad.com\/fiction\/88091\/a-fair-exchange","tags":["Portal Fantasy \/ Isekai","Female Lead","Drama","Fantasy","School Life","Supernatural","Magic"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":90,"view_count":390,"chapters_count":10,"last_update":1718121606,"description":"Melody had always seen herself as a rather normal girl, the youngest child of her mother, a general nuisance, and the runt of the litter, so to speak. A bit of a nervous wallflower, she spent most of her time at home, reading or playing video games to avoid getting in the crosshairs of her half-siblings' ire. However, when she finds herself suddenly in a place she'd never seen before, without any recollection of how she got there, her very ordinary life becomes something extraordinary.\nBut what few people know is that Melody is not there by random chance, a name picked out of a hat that could have been anyone. She was chosen to be there by a very specific person, for a very specific reason.","description_hash":-8771420470674537255},{"title":"Myrmeke Ascendancy","fiction_id":"88090","link":"https:\/\/www.royalroad.com\/fiction\/88090\/myrmeke-ascendancy","tags":["LitRPG","Progression","Anti-Hero Lead","Strategy","Grimdark","Action","Adventure","Fantasy","Female Lead","Strong Lead","Non-Human Lead","Magic"],"lable":"Original","following_count":24,"rating":4.81,"page_count":77,"view_count":1541,"chapters_count":13,"last_update":1718557205,"description":"In a hive governed by a mystical System, a nameless Myrmidon Larva is born into a thriving colony. Unlike her kin, she possesses incredible mental faculties due to a random, very rare and powerful mutation, setting the stage for an epic journey of evolution and conquest. With her great strategic intelligence and a stroke of luck here and there, as well as the intrinsic ability of the Myrmidons to rapidly evolve and absorb traits from other creatures, she rises through the ranks, transforming from a lowly larva into a powerful being.\nAs she evolves, she faces countless challenges, from defending herself from her very own kin to fighting against civilizations that the Myrmidons hadn't even known existed. Each step of her journey is shaped by the traits she absorbs and the strategic decisions she makes, driving her towards ultimate supremacy. But as she climbs the ranks, she learns how difficult it is to climb above one's station in life, and how perilous their seemingly indomitable position in the world is.\n\nNote: This will probably be a bit more flawed than Resurgence of the Creator, as the system crap is very annoying to keep track of. Please point out any mistakes.","description_hash":3647933056883089752},{"title":"Pistol Packing Grandma (Community Magazine Contestant)","fiction_id":"88089","link":"https:\/\/www.royalroad.com\/fiction\/88089\/pistol-packing-grandma-community-magazine-contestant","tags":["Portal Fantasy \/ Isekai","Female Lead","Action","Adventure","Fantasy","Short Story"],"lable":"Original","following_count":1,"rating":0.0,"page_count":14,"view_count":91,"chapters_count":2,"last_update":1717964254,"description":"Livia has retired. No more adventures for her.Now, she wants to enjoy life, alongside her children and grandchildren.Alas, duty calls once again.The Arlos Kingdom needs her, even though she herself is not the Herald of Light. Even though she has just turned 65 years old.A new threat has appeared: the previously peaceful goblins have turned more and more expansionist.The situation is dire for the Kingdom.Therefore, Livia reaches beyond the veil one last time, to save the land she looked after so much in the past.[Community Magazine Contestant of Spring 2024, on the theme of 'Goblins and Grandmas'. Even though there is only one grandma interacting with goblins, sorry. I marked it as a short story as it should have around 10-15k words once I'm done, although I did not set myself an upper limit. Enjoy the read!]","description_hash":905853703812533089},{"title":"Dungeon Corporation","fiction_id":"88088","link":"https:\/\/www.royalroad.com\/fiction\/88088\/dungeon-corporation","tags":["LitRPG","Reincarnation","Dungeon","Villainous Lead","War and Military","Comedy","Psychological","Mystery","Tragedy","Martial Arts","Female Lead","Secret Identity","Magic","Strategy","Grimdark","GameLit","Ruling Class","Progression"],"lable":"Original","following_count":457,"rating":3.63,"page_count":56,"view_count":7757,"chapters_count":10,"last_update":1718569038,"description":"Monika was a money-driven businesswoman. Nothing changes in the new world. The spendthrift warlady will garner the world's riches to strengthen her dungeon and wreak havoc.\nNeed supplies to fend off a pesky neighboring barony? Our dwarven smiths forge the finest weaponry. No soldiers? Our elven warriors will selflessly protect your lands. Fear not!\nCan’t afford it? That is the least of your concerns. We offer loans of ten thousand life stones. I will double it just for you. Yep, same rates. The Goblin Bank? Their terms make trolls look generous. Haven’t heard the rumors?\nOh, your daughter wants a slimey? Any preferred breeds? Is that so!? Glitters, you say? They’re my favorites too!\nMy heart? It’s priceless. But perhaps~...\n-All the warnings imaginable\n-Amoral goal-oriented lead\n-Art. Polls. Quizzes","description_hash":-4902194553707676574},{"title":"Sowling a Sole Soul","fiction_id":"88087","link":"https:\/\/www.royalroad.com\/fiction\/88087\/sowling-a-sole-soul","tags":["Comedy","Female Lead","Slice of Life","Strong Lead","Fantasy","Supernatural","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":30,"chapters_count":1,"last_update":1717859880,"description":"The Nea family are a close family of exorcists who deal with the occasional evil spirits here and there. But once in a blue moon, they come across an evil spirit so tough to deal with that they have to let a stronger, seasoned professional take care of it.\n\nWhich is why 8-year-old Wynn was dropped off at his granny’s house by his parents for the time being.\n\nYou see—funnily enough for an exorcist family—Wynn has grown to be the host of a malicious, prankish evil spirit that they call the Goblin.\n\nIt takes over sometimes, makes a lot of mess, and does a teensy-weensy bit of attempted murder, but Granny Nola—the most competent exorcist in the family—just sees the boy as her cute grandson.\n\nWynn’s Goblin side is always trying to get the best of his grandma on a daily, while Nola has to draw out the spirit and exorcise it. And this simply gives her more time to bond with her dear relative!\n\n*This is a submission for the June 2024 Magazine Contest.\n*Chapters come out when they are ready.","description_hash":-4460345357778788403},{"title":"Honey, I Leveled the Kids","fiction_id":"88086","link":"https:\/\/www.royalroad.com\/fiction\/88086\/honey-i-leveled-the-kids","tags":["Virtual Reality","Progression","Comedy","Female Lead","Slice of Life","Adventure","Fantasy","Short Story","LitRPG","Magic","GameLit"],"lable":"Original","following_count":2,"rating":0.0,"page_count":18,"view_count":125,"chapters_count":3,"last_update":1718370481,"description":"Grandma's Hook (A Prologue to Honey, I Leveled the Kids)\nGrandma Heidi's visit was a blessing - a chance for Tristan and Esther's dad to recover from the flu. But when she joins in on the kids' newest game, Seconds-Over, she quickly realizes that it's not all fun and games. As a seasoned gamer, she knows the importance of having the right equipment. But instead of starting with the usual intro quests, she makes a critical mistake and purchases a hammer. As she embarks on her adventure with the grandbabies, she soon discovers that a simple hammer may not be enough to defeat the game's simplest enemies. Even with decades of gaming experience, she makes a mistake.\nShe should've bought a hook instead.\n---\nThis is a short fun intro story to the main project, Honey, I Leveled the Kids that I plan on releasing soon on Royal Road. This is an entrant for the Grandmas and Goblin magazine.\nWhat to except in this short:\n- Grandma\n- Goblins\n- Chaos of kids a LitRPG fantasy\n- Leveling stats\n- Yarn\n- Explosions\n- Sheep\n- \"Get back to work\"\nChapter updates are going to be Tuesday and Friday.\n(The author is not gifted in graphic arts or typography. She can barely crochet the goblin on the cover to hint at the style of story.)","description_hash":3898271139668024208},{"title":"History and Magic: The Lost Professor","fiction_id":"88085","link":"https:\/\/www.royalroad.com\/fiction\/88085\/history-and-magic-the-lost-professor","tags":["Portal Fantasy \/ Isekai","Dungeon","Comedy","Multiple Lead Characters","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":23,"chapters_count":1,"last_update":1717856557,"description":"Quando Thomas, um jovem e dedicado professor de história do ensino médio, é misteriosamente transportado para o mundo mágico de Elmsworth, ele se vê imerso em um reino onde a magia e a história se entrelaçam de maneiras que ele nunca imaginou. Guiado pelo sábio Aric e cativado pela bela e enigmática líder da aldeia, Lady Seraphina, Thomas deve navegar pelas complexidades deste novo mundo, mantendo em segredo a sua verdadeira origem.","description_hash":1905261979419544829},{"title":"Sherlock Holmes and the case of the Blind Duchess","fiction_id":"88084","link":"https:\/\/www.royalroad.com\/fiction\/88084\/sherlock-holmes-and-the-case-of-the-blind-duchess","tags":["Male Lead","Drama","Action","Mystery"],"lable":"Original","following_count":1,"rating":0.0,"page_count":9,"view_count":88,"chapters_count":2,"last_update":1718077716,"description":"Holmes and Watson are called upon by royalty to solve a mystery that has baffled security and police a like concerning a matter of life and death. Eager to prove his superiority, Holmes happily takes on the challenge to save someone from grave danger.","description_hash":-4193084276285324549},{"title":"Highschool of the Nexus (Original English Light Novel)","fiction_id":"88082","link":"https:\/\/www.royalroad.com\/fiction\/88082\/highschool-of-the-nexus-original-english-light","tags":["Harem","Action","Adventure","Romance","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":231,"chapters_count":4,"last_update":1718563954,"description":"Hatsyoudo Donkai's school day is going as planned until his school catches fire and he dies in the evacuation.\nWhat feels like seconds later, he wakes up in the Nexus Dimension, before discovering that he's stuck in the middle world between heaven and hell. The only way for him to escape to his rightful home is to find the hidden exit and\ndefeat the devils guarding it. Will Hatsyoudo be able to take back what's rightfully his?","description_hash":-6727203712270240536},{"title":"Maid Squad! D-x-U (Original English Light Novel)","fiction_id":"88081","link":"https:\/\/www.royalroad.com\/fiction\/88081\/maid-squad-d-x-u-original-english-light-novel","tags":["Slice of Life","Action","Fantasy","Romance","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":53,"chapters_count":1,"last_update":1717856504,"description":"When Niko Itchasawai joins his local maid team to get to know his crush better, Sacho Koniwai, he finds that she's\ngot quite the secret to hide...","description_hash":1519096303223896459},{"title":"The Goblins: Grandma's Rise and Return","fiction_id":"88080","link":"https:\/\/www.royalroad.com\/fiction\/88080\/the-goblins-grandmas-rise-and-return","tags":["Portal Fantasy \/ Isekai","Strategy","Female Lead","Secret Identity","Strong Lead","Fantasy","Mystery","Reader Interactive","Magic","Low Fantasy","First Contact"],"lable":"Original","following_count":14,"rating":5.0,"page_count":22,"view_count":432,"chapters_count":4,"last_update":1718461201,"description":"Judy's grandma is dead...\nThat leaves two things for Judy to remember her by, an old hunting lodge in the Colorado Rockies, and a mysterious letter asking her to find out the truth. To get to the bottom of it all we will have to sort through boxes and boxes of grandma's old journals, fantastical documents, and dangerous artifacts. \nExperience the story of an old grandma whisked away to another world in her prime. Who returned with the receipts to prove the existence of another world, only to find her original world had moved on without her.\nParticipant in the June 2024 Royal Road Community Magazine\nPreviously titled Grandma's Goblins: An Epistolary Account. I changed it b\/c a few other fictions had essentially the same title. (I'm not changing the cover)\nExpect:\nA short story told through documents, journals, and videos\nA little bit of mystery\nMuch many Goblins\n\nUpdates (hopefully): Monday, Thursday, Saturday","description_hash":-7861660996137139159},{"title":"They Loom in the Shadows","fiction_id":"88079","link":"https:\/\/www.royalroad.com\/fiction\/88079\/they-loom-in-the-shadows","tags":["Female Lead","Adventure","Fantasy","Horror"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":62,"chapters_count":1,"last_update":1717856490,"description":"A young woman named Charlotte is arranged to be married to the prince of Eroth. When she spends her first night at the castle, she discovers terrifying ghosts and other horrors looming in the hallways during the night. The prince has lost all hope of breaking the spirits and the curse. Charlotte remembers something her grandmother told her about a powerful creature that could summon powers to break any dark magic.","description_hash":1305788214168864844},{"title":"Matriarch of the Bone","fiction_id":"88078","link":"https:\/\/www.royalroad.com\/fiction\/88078\/matriarch-of-the-bone","tags":["Anti-Hero Lead","Female Lead","Drama","Fantasy","Short Story","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":24,"chapters_count":1,"last_update":1717856473,"description":"Matriarch Zara of the Skeletal Grove has acquired all she wished for, but now her grove is under attack, and an opportunity arrises. While the rest of her coven rushes to the grove's defence, Zara prepares to start a new life with her goblin child. But her past is determined to follow her. \n\nA Royal Road Community Magazine: June 2024 Edition Submission.","description_hash":8487031027539926523},{"title":"Broken Lands","fiction_id":"88077","link":"https:\/\/www.royalroad.com\/fiction\/88077\/broken-lands","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Female Lead","Strong Lead","Adventure","Drama","Fantasy","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":168,"rating":4.69,"page_count":75,"view_count":3298,"chapters_count":10,"last_update":1718578820,"description":"The day it all started was supposed to be an ordinary day.\nFor Sophia Rothmer, that meant escorting a new delver through a simple dungeon’s Tier One area. Sure, she knew her mother had seen a future where she ended up in another world on her own adventure, but that was months ago; it probably wasn’t going to happen.\nFor a group of offworld mercenaries, that meant damaging a dungeon’s instance core, snagging some extra treasure, and blaming it on either Sophia or her trainee.\nFor Dav Carolan, that meant exploring a new world. He may not know what’s going on, but he’ll figure it out; he always does.\nThe heist didn’t go as planned. After a disorienting and potentially life-altering trip through the place between everything known as the Origin, Sophia and Dav find themselves in a cave. They have no idea what happened to the bandits, no idea where they are, and Sophia seems to have lost her Skills.\nIt’s not an auspicious welcome to the Broken Lands.\n\nUpdates daily for the first 7 days, then 4 days\/week\nThe content warnings are mostly to give me room to write; this fiction is not intended to be edgy, but there are times when someone is seriously injured and the Bad Guys sometimes do Bad Things. The characters also had lives before the story and they're ... not always happy.\nNo AI assistance was used in the writing, but there is AI art.\n\nThis story is released ONLY on RoyalRoad, Scribblehub, and Patreon. If you're seeing this somewhere else, it was stolen.","description_hash":-2436058191455902024},{"title":"The Devils Daughter is a transfer student!?!","fiction_id":"88076","link":"https:\/\/www.royalroad.com\/fiction\/88076\/the-devils-daughter-is-a-transfer-student","tags":["Urban Fantasy","Dungeon","Non-Human Lead","Action","Adventure","Fantasy","School Life","Supernatural","Female Lead","Magic","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":9,"view_count":84,"chapters_count":2,"last_update":1718233920,"description":"Lucielle Brightstar had been obsessed with the human world for as long as she could remember, ever since her mother had shown her how the humans that she oversaw lived. However since she was the spawn of Asharak himself she was not allowed to walk the mortal plane due to the eternal conflict between her father and grandfather, Gothrak. Until one day her adopted grandfather Clotholian offered her an opportunity to ascend to the human realm she admired so much.\nJoin Lucielle as she embarks on a fantastical journey through the school system and the seedy supernatural underbelly that is threatening to spill over into the light of day!","description_hash":285658014261751020},{"title":"Bura Bura Academy","fiction_id":"88075","link":"https:\/\/www.royalroad.com\/fiction\/88075\/bura-bura-academy","tags":["Comedy","Slice of Life","Drama","School Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":20,"view_count":63,"chapters_count":2,"last_update":1718378229,"description":"Shiro Ishida, an emotionally detached high school student, gives up his dream of becoming a writer in favor of a boring programming job after his estranged childhood friend, Keiko, breaks a six-year promise to attend high school together. But when Keiko returns their senior year, the two estranged friends work towards reconciliation by forming an Art Club together. When a project between friends turns into a fight to save their school from his own employer, Shiro must choose once again between honoring his controlling father’s wishes or his passion for storytelling, before he loses his freedom forever.","description_hash":1994544736546663114},{"title":"Harry Potter Self-Insert","fiction_id":"88074","link":"https:\/\/www.royalroad.com\/fiction\/88074\/harry-potter-self-insert","tags":["Reincarnation","Adventure","Fantasy","Mystery","School Life","Supernatural","Magic"],"lable":"Fan Fiction","following_count":6,"rating":4.5,"page_count":86,"view_count":1894,"chapters_count":24,"last_update":1718555631,"description":"Oliver Evans, a young wizard with a mysterious past, finds himself reborn into the world of Harry Potter with knowledge of the future. As he navigates the halls of Hogwarts, Oliver befriends Harry, Ron, and Hermione, striving to balance his desire to help with the need to let events unfold naturally.","description_hash":-4929151972278973471},{"title":"Weathered Eyes","fiction_id":"88073","link":"https:\/\/www.royalroad.com\/fiction\/88073\/weathered-eyes","tags":["Multiple Lead Characters","Adventure","Fantasy","Short Story","Supernatural","Female Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":43,"chapters_count":1,"last_update":1717855883,"description":"The aftermath of one woman’s crusade for specist equality; a short look into the lives of Rhime’s womanly elders.","description_hash":-8216860937069559950},{"title":"The Search for Atlantis - Book 1","fiction_id":"88072","link":"https:\/\/www.royalroad.com\/fiction\/88072\/the-search-for-atlantis-book-1","tags":["Male Lead","Harem","Adventure","Historical","Romance","Mystery","First Contact"],"lable":"Original","following_count":3,"rating":0.0,"page_count":253,"view_count":867,"chapters_count":14,"last_update":1718482839,"description":"\"The Search for Atlantis\" follows archaeologist Nick Marcus on a gripping quest to prove the existence of Atlantis. Beginning with a golden coin found off Santorini, Nick's journey, once hindered by skepticism from peers and estrangement from loved ones, leads him to Florida. There, he teams up with Dr. Eleanor Harding and her daughter, Julie, whose support revitalizes his mission.\nTogether, they uncover evidence of ancient transoceanic trade and sophisticated civilizations, through artifacts and geological studies, suggesting Atlantis could have thrived before succumbing to the sea. Their explorations take them on perilous dives, facing both natural and scholarly opposition.\nThis tale combines historical fiction, suspense, and adventure, depicting the emotional and intellectual turmoil of characters driven by the lure of discovery. Nick evolves from a solitary researcher to a collaborative leader, while Julie transforms from an enthusiastic supporter to a committed investigator.\nDr. Harding bridges generations, providing wisdom that steers the team through challenges. \"The Search for Atlantis\" delves into themes of resilience, the power of belief, and the transformative impact of historical revelations on our understanding of humanity.\nA testament to curiosity and courage, this novel is a thrilling narrative that captivates those fascinated by history’s mysteries, celebrating the relentless human quest to uncover the truths hidden within our world.","description_hash":-1946717197566032666},{"title":"Risha","fiction_id":"88071","link":"https:\/\/www.royalroad.com\/fiction\/88071\/risha","tags":["LitRPG","Strategy","Non-Human Lead","Drama","Action","Fantasy","Female Lead","High Fantasy"],"lable":"Original","following_count":38,"rating":4.7,"page_count":59,"view_count":1561,"chapters_count":8,"last_update":1718399361,"description":"Congratulations! Due to your great feat of combat, you have qualified for evolution! Would you like to evolve into the war evolution [Orc]?\n\n NO! Risha’s denial echoed through her as she refused the question with her entire being.\n The screen disappeared, leaving nothing but the bleeding corpse of the spider behind.\n The overseer’s look of expectation turned into confusion, then disappointment as he shook his head. \n “It seems that the fates have decided that the tiny servant is unworthy of becoming one of us.” The overseer spoke fluently, and Risha only understood a few words, but she knew that he was wrong.\n She refused the fates, the fates did not refuse her.\n****\nRisha is the smallest goblin of her village, but she managed to survive through her intelligence and cunning. That is, until she is thrown into the pit by an overseer.\nThe overseer has no need for a weak goblin, and would rather use her as food for her village's warbeasts. When she comes out on top against the monster of the pit, the overseer is only more disappointed to see her remain in the weak form of a goblin.\nRisha does not wish to become an orc, and she will forge her own path. Together with the spiderlings she is forced to raise, she will find freedom for herself and her people.\nWhat to expect:\nVillage Building\nCute Goblins\nLots of action!\nSystem Shenanigans\nUnique evolution path\nLots of cool stuff!\n(For those wondering how grandmas relate to this story, you'll find out in chapter 4)","description_hash":-8779848634625527972},{"title":"A place to retire","fiction_id":"88070","link":"https:\/\/www.royalroad.com\/fiction\/88070\/a-place-to-retire","tags":["Anti-Hero Lead","Multiple Lead Characters","Adventure","Fantasy","Short Story","Female Lead","Non-Human Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":10,"view_count":64,"chapters_count":1,"last_update":1717855809,"description":"Zroz hated his teammates for their greed, stupidity, and sadism. He also hated the forest. And he hated scouting. \nNothing good ever happened to goblins scouting. \nWhen Zroz and his teammates found an old woman and her hunting dog, Zroz didn't share his teammates' enthusiasm. Call him a pessimist, but Zroz didn't believe in easy marks.\nHow right could he be?\n\nParticipant in the Community Magazine Contest for June 2024.\nThe cover was A.I. generated on DeviantArt.\nThis novella is only posted here on Royal Road. If you see it anywhere else, please let me know! Thank you.","description_hash":-7816462239849446528},{"title":"Grave of the Bold","fiction_id":"88069","link":"https:\/\/www.royalroad.com\/fiction\/88069\/grave-of-the-bold","tags":["War and Military","Grimdark","Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":11,"view_count":66,"chapters_count":2,"last_update":1717949933,"description":"The mercenaries of Vastrum have brutalized the empire's colonies on the far side of the world. The Company has extracted aethium, the magical drug that powers Vastrum's wizards, from indigo flowers that grow high on the hills in the far flung colony of Vurun. Now a reckoning has come. The dead have risen, and rebellion is sweeping the province. Twenty thousand soldiers and civilians dead or captured. The worst military disaster in the long history of the Vastrum Empire. A lone survivor arrives at the gates of Andaban to warn the garrison, and to tell the story of the death of an army.","description_hash":-4641987402240878136},{"title":"empires and shadows ","fiction_id":"88068","link":"https:\/\/www.royalroad.com\/fiction\/88068\/empires-and-shadows","tags":["Progression","Grimdark","Multiple Lead Characters","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":29,"view_count":51,"chapters_count":2,"last_update":1718557505,"description":"The Roseman Empire is facing war with the Temple of Holy Flames, and it is on the losing side of the war. So, the Emperor ordered the nobility to join the war effort. Orpheus is one of those nobles who joined because he saw no reason to stay doing nothing in the family manor.    At the same time, due to his shady deals and attempting to trick a noble, Richard, who was once a respectable merchant, was vanished from the merchant union. Since he is lucky, he got the chance to join a private merchant organization under the assassins, who are plotting against the empire.And on the side of the Temple of Holy Flame, Selas, whose sister doted on him so much and didn't permit him from exiting outside the temple walls, got bored and decided to ask his sister to let him try to go to war like his peers. After all, he didn't train for nothing.","description_hash":5642676054567906859},{"title":"Bread and prejudice","fiction_id":"88067","link":"https:\/\/www.royalroad.com\/fiction\/88067\/bread-and-prejudice","tags":["Urban Fantasy","Multiple Lead Characters","Slice of Life","Action","Fantasy","Short Story","Male Lead","Female Lead","Non-Human Lead","Magic"],"lable":"Original","following_count":5,"rating":4.5,"page_count":17,"view_count":152,"chapters_count":3,"last_update":1718581405,"description":"WIP synopsis\nExpect:\nGoblins and bread.Grandmothers and magic.Some dark undercurrents, but overall an optimistic story.A self contained short tale, from start to conclusion.\n\nParticipating in Royal Road community magazine, June 2024","description_hash":-7235005785125168453},{"title":"Lament of the Lost","fiction_id":"88066","link":"https:\/\/www.royalroad.com\/fiction\/88066\/lament-of-the-lost","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Female Lead","Action","Adventure","Fantasy","High Fantasy","Attractive Lead"],"lable":"Original","following_count":157,"rating":4.65,"page_count":89,"view_count":6432,"chapters_count":19,"last_update":1718445853,"description":"Torn from her life, pulled away from her family, and thrown before the worst of the new world, Korra Grey fights fang and claw to take back the semblance of normalcy that was stolen from her. Not an easy quest when the world seems hell-bent on making her life anything but what she wishes for. \n»Transported to another world (isekai) fantasy story with litRPG elements and a touch of Slice of Life. A story not rushed, yet full of monsters, beasts, and enemies from the ranks of humans threatening to take everything that is dear to the non-op-MC.«\nThis is a rewrite of Lament of the Slave, a story I couldn't give up and believe deserves a second chance. In many aspects the story will be different, and in others, similar to the old one. In no way, however, do I dare say that you will find the story perfect. But I guess that's for you to judge.\nCover: Art by . . . Me :)\nAlthough I'm working on a new one.","description_hash":-1046952511397553860},{"title":"Heroes of Wonder: Rise of the Arcadians","fiction_id":"88065","link":"https:\/\/www.royalroad.com\/fiction\/88065\/heroes-of-wonder-rise-of-the-arcadians","tags":["GameLit","Progression","Strategy","Multiple Lead Characters","Strong Lead","Action","Adventure","Drama","Mystery","Non-Human Lead","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":97,"view_count":322,"chapters_count":8,"last_update":1717855311,"description":"DISCOVER THE POWER OF WONDER!\nNew Toy on the Shelf Handy Hank had just arrived in Mr. Wonder's Toyland, a toy store inside of a very big mall. But soon learns that the very mall he had just arrived in has been plagued by a sickness for over 40 years. A sickness known as 'The Arcadians. Ruled by a Trio of brutal and fiendish consoles who wish to control all of the power of imagination and rule! \nJoin Handy Hank, and his Party as he and many others embark on a journey across the world they call the mall and put an end to the Arcadians wrath by collecting the Seven Sparks. Will they Succeed? Or will they receive a GAME OVER!","description_hash":5854759305267693774},{"title":"I Wish You Were Never Reborn","fiction_id":"88064","link":"https:\/\/www.royalroad.com\/fiction\/88064\/i-wish-you-were-never-reborn","tags":["Reincarnation","Urban Fantasy","Multiple Lead Characters","Contemporary","Action","Fantasy","Romance","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":4,"rating":5.0,"page_count":12,"view_count":164,"chapters_count":2,"last_update":1717883163,"description":"When Shay’s assassin discovers the identity of her past life, he must choose between her and the city under his protection. \nShay had spent years perfecting her high school persona. \nInstead of sleeping, she studied to keep up her perfect grades. Instead of going to club meets, she earned money for groceries. Instead of making friends... it was better that she didn’t so she could avoid rumors about her home life.\nBut she still had her wuxia light novels, vampire\/werewolf thrillers, and magical girl manga... and hope for a better life.\nThen, she met Tyvan, her perfect fantasy knight, clad in armor and wielding fantastical magics-- in the middle of a coffee shop.\nAnd she recognized those beautiful, hazel eyes... from a distant memory of another world. \n\nGenre: Urban FantasyContains: magic, martial arts cultivators, vampires and other supernatural entities.Content Warning: graphic violence, occasional swearing, abuse. \nBrought to you by CouchSurfingDragon, author of the 1150 chapter webnovel, Headed by a Snake.\nRelease Schedule:First 2 chapters released to test the writing UI.The author plans to release more chapters in July 2024.Monday through Friday, at 11:00 Pacific Time (GMT-8)\nCover: by JammyArts","description_hash":-6813892935525715666},{"title":"\"Eternal Echoes: The Enigmatic Muse of Realms\"","fiction_id":"88063","link":"https:\/\/www.royalroad.com\/fiction\/88063\/eternal-echoes-the-enigmatic-muse-of-realms","tags":["Reincarnation","Villainous Lead","Martial Arts","Female Lead","Slice of Life","Action","Drama","Romance","Mystery","Sports","School Life","Male Lead","Strong Lead","Secret Identity","Magic","First Contact","Attractive Lead"],"lable":"Original","following_count":2,"rating":5.0,"page_count":1,"view_count":51,"chapters_count":1,"last_update":1717841140,"description":"Step into a world where the mundane collides with the mystical, where the ordinary conceals the extraordinary. Meet Seraphine, a mysterious soul reincarnated into the body of another, weaving magic and mystery into the lives of those around her. With each rebirth, she brings with her an irresistible enigma that captures the hearts and minds of all who encounter her.\nWhispers of the elusive muse spread like wildfire across dimensions, drawing the curious and the daring into her orbit. But Seraphine's true nature remains a tantalizing mystery, her purpose entwined with the very essence of magic itself.\nFrom the bustling streets of modern cities to the hidden realms of ancient sorcery, Seraphine's journey takes her and those touched by her presence on a spellbinding odyssey of discovery and transformation. But as she navigates through unfamiliar lives, she leaves behind a trail of changed perceptions and awakened souls.\nDriven by their own desires and ambitions, each individual who crosses paths with Seraphine is propelled on their own journey of self-discovery and growth. As they unravel the threads of destiny, they become intertwined in a tale of interconnected lives and boundless possibilities.\n\"Eternal Echoes: The Enigmatic Muse Of Realms\" is a captivating adventure that beckons the bold and the curious into a world where magic and mystery intertwine, where each moment holds the promise of revelation and the allure of the unknown.","description_hash":6622118437738410953},{"title":"The Stray","fiction_id":"88062","link":"https:\/\/www.royalroad.com\/fiction\/88062\/the-stray","tags":["Slice of Life","Fantasy","Magic"],"lable":"Original","following_count":2,"rating":0.0,"page_count":10,"view_count":104,"chapters_count":2,"last_update":1718407175,"description":"Timothy Weaver, smalltime witch and full-time survivor, is having a rough season, and the dragon child that crash-landed in his forest home hasn't made things any better. Now he's stuck in a new town, hiding the very secret that drove him to spend seven years with only the critters of the wood for company. Still, there's at least one nice thing about living in the small town of Fresa-- it's never boring.\nUpdates every Friday.\nAlso available on Tapas and Wattpad! See my links here: kbear.carrd.co","description_hash":-6600866631980109468},{"title":"Klunx - Summer at Gran'ma Anyr's","fiction_id":"88061","link":"https:\/\/www.royalroad.com\/fiction\/88061\/klunx-summer-at-granma-anyrs","tags":["Comedy","Steampunk","Multiple Lead Characters","Secret Identity","Action","Adventure","Fantasy","Male Lead","Female Lead","Non-Human Lead","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":56,"chapters_count":1,"last_update":1717839783,"description":"(For the June Community Magazine)\n\nthis is a lighthearted and mostly comedic adventure story about a goblin boy's adventures with his grandmother teaching him some important life skills on his road to becoming an adult goblin.\nFollow Klunx, a young goblin who has just graduated Preparatory School, who will be moving to Gob-City once the end of summer comes. Come September, he will do his Mandatory Rider Affinity Exam, and based on his performance he will be trained and he will become a Rider in a field that both work towards a goblins affinity for the Arts of Riding in its many forms, as well as benefits goblin-kind.\nHe is sent away to his grandmother's farm in preparation, finding out through a series of high jinks that she may be more than a regular grandmother, more than a regular goblin.","description_hash":167102950696115082},{"title":"< PLAY-ADVENTURER >","fiction_id":"88060","link":"https:\/\/www.royalroad.com\/fiction\/88060\/play-adventurer","tags":["Reincarnation","Dungeon","Ruling Class","Male Lead","Adventure","Fantasy","Magic","High Fantasy","Progression"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":26,"chapters_count":1,"last_update":1717839745,"description":"Will Benyor a young sixteen years old boy who has been taken by the sea.  With the dream to adventure and explore the unknown , this young boy will claim the head of all villains and earn his right place between the nobility. Please join Will on his adventures , come and help us explore the deep sea or high above sky . let’s reveal the hidden and keep confident which is revealed . \nUnder the name of Will Benyor will you join us on this luxurious and honorable journey ?","description_hash":523352432073054898},{"title":"Cookie Jars","fiction_id":"88059","link":"https:\/\/www.royalroad.com\/fiction\/88059\/cookie-jars","tags":["Anti-Hero Lead","Female Lead","Secret Identity","Short Story","Supernatural","Magic"],"lable":"Original","following_count":1,"rating":5.0,"page_count":33,"view_count":229,"chapters_count":4,"last_update":1718460339,"description":"A grandma is attacked in her own kitchen by four goblins. The old woman kills the little monsters, but things go a lot deeper than that. The old granny holds a few secrets of her own that might be the reason why this attack happened.(This is for the community magazine contest; it will be a short one; I am busy with other projects.)","description_hash":2707477638078120632},{"title":"Lost Treasures: A Wild History","fiction_id":"88058","link":"https:\/\/www.royalroad.com\/fiction\/88058\/lost-treasures-a-wild-history","tags":["Anti-Hero Lead","Multiple Lead Characters","Strong Lead","Adventure","Fantasy","Historical","Mystery","Supernatural","Male Lead","Female Lead","Mythos"],"lable":"Original","following_count":3,"rating":0.0,"page_count":178,"view_count":1369,"chapters_count":34,"last_update":1717860523,"description":"Lost Treasures: A Wild History is a fictional historical adventure novel that unfolds tales of hidden treasures from ancient to modern times across various parts of the world. These treasures include those of ancient emperors, pirates, lost cities, mysterious organizations, and modern treasure hunters. Each chapter reveals the background, hidden clues, and legendary guardians of the treasures, taking readers on thrilling treasure hunts.","description_hash":-7897241094613548636},{"title":"Stonesong","fiction_id":"88057","link":"https:\/\/www.royalroad.com\/fiction\/88057\/stonesong","tags":["Male Lead","Fantasy","Mystery","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":34,"view_count":136,"chapters_count":5,"last_update":1718629251,"description":"Veb’s grandmother, High Mage Tesri of Stonesrest, takes him away from his aunt and to the perpetually cold homeland of the goblins. Tesri insists Veb be trained at the Mage Hall, even if his talent is unusual for a goblin, something she finds embarrassing. Veb befriends two of his fellow students, but the Mage Hall is even more frightening than he imagined. Something stalks the halls, intent on harming one of Veb’s friends.","description_hash":-1968562829738366029},{"title":"NEZHA : THE MONKEY KING","fiction_id":"88056","link":"https:\/\/www.royalroad.com\/fiction\/88056\/nezha-the-monkey-king","tags":["Comedy","Action","Adventure","Fantasy","Supernatural"],"lable":"Original","following_count":1,"rating":0.0,"page_count":31,"view_count":256,"chapters_count":8,"last_update":1718527907,"description":"HI , I LIKE TO WRITE , SO I START TO WRITE THIS STORY A FEW DAYS AGO WHEN I FIND THIS WEB I HAVE SOME OTHER STORIES WRITTEN ON WHICH I WORK FOR AT LEAST A YEAR . \nI HOPE YOU ENJOY THIS STORY .\nAS FOR THE CHARACTER I DIDN'T CHOSE ANY NAME . HIS NAME IS \"THE BOY\" IN STORY.\nHE IS AN ORPHAN BOY . AFTER LIVING FEW YEARS IN ORPHANAGE HE STARTED TO LIVE ALONE . HE WAS INSPIRE FROM RICH AND SART WORKING HARD TO EARN MONEY AND LIVE A LUXURAY LIFE . HE IS STILL IN HIS EARLY AGE OF 17 . THE SPECIAL THING IN HIM IS STILL UNKNOWN BY HIM. HE HAS POWER MORE THAN AN AVERAGE PERSON . \nI WILL EXPLAIN HIS CHARACTER AS STORY PROCCED. TO KNOW I HOPE YOU WILL ENJOY  TO READ IT .\nI HOPE YOU WILL ENJOY THE WORLD I 'M CREATING FOR YOU.","description_hash":353417316198297085},{"title":"AETHER FINALITY: The Dead Ends [LitRPG]","fiction_id":"88055","link":"https:\/\/www.royalroad.com\/fiction\/88055\/aether-finality-the-dead-ends-litrpg","tags":["LitRPG","Progression","War and Military","Male Lead","Sci-fi","Action","Fantasy","Romance","Magic","First Contact"],"lable":"Original","following_count":11,"rating":3.75,"page_count":347,"view_count":3393,"chapters_count":43,"last_update":1718114761,"description":"Subsequent to the abrupt and inexplicable appearance of a habitable planet in the solar system, humanity discovered a new form of energy called Aether. Unsurprisingly, the greed of mankind made them colonize the new planet, which led to a brutal war with the alien species that appeared along with it. Eventually, the humans living on the Aether Planet, became independent shortly after being physiologically affected by Aether, which granted them unique and powerful abilities.\n76 years after the now-dubbed Stellar War, in the bustling metropolis of the Aether Planet, a young man's fate drastically changes after an encounter with a hyper-advanced artifact.","description_hash":-3174123246199822253},{"title":"Beyond the Blaze - Book 1","fiction_id":"88054","link":"https:\/\/www.royalroad.com\/fiction\/88054\/beyond-the-blaze-book-1","tags":["Reincarnation","Male Lead","Harem","Adventure","Fantasy","Romance","First Contact"],"lable":"Original","following_count":6,"rating":0.0,"page_count":248,"view_count":879,"chapters_count":13,"last_update":1718455357,"description":"In the lingering shadows of a world gripped by fear and uncertainty, one man’s destiny is set ablaze. Michael Winters—firefighter, hero, and unwitting traveler through the veils of existence—never thought his life would pivot on the edge of a flame. But as he confronts a fire that rages fiercer than any he has ever faced, the lines between life, death, and what lies beyond begin to blur.\nBeyond the Blaze thrusts you into the harrowing night when Michael's world is irrevocably changed. Amid the chaos of a global pandemic and the heat of unrelenting fires, he saves lives, risking his own in a dance with destiny that transcends the physical world. When a desperate rescue turns into an unexpected journey through the afterlife, Michael is thrust into a realm where time holds no sway, and the mysteries of existence unfold in ways he never could have imagined.\nWith each step into the unknown, Michael encounters celestial beings who challenge him to understand the weight of his life’s actions and the echoes they leave behind. As he navigates this bewildering new existence, the memories of his earthly bonds—his love, his losses, and his undying commitment to saving others—forge his path forward.\nBeyond the Blaze is not just a tale of heroism and sacrifice. It is a story of love that defies the boundaries of life and death, an exploration of spiritual awakening, and a profound journey into the soul of a hero. Here, in the space between breaths, Michael discovers the true extent of his impact on the world he left behind and the one he has come to inhabit.\nJoin Michael as he explores the ethereal landscapes of the afterlife, where each revelation brings him closer to understanding the ultimate purpose of his journey—an odyssey not just of survival, but of profound transformation.","description_hash":3913180648594453722},{"title":"He's Not My Dad!","fiction_id":"88053","link":"https:\/\/www.royalroad.com\/fiction\/88053\/hes-not-my-dad","tags":["Progression","Psychological","Male Lead","Tragedy","Drama","Horror","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":32,"chapters_count":1,"last_update":1717839627,"description":"When his abusive father manages to slither himself into a Not Guilty verdict by the court, Jackson Valkyrie is forced to give up custody of his little sister. But, that doesn't mean he's ready to give up on her just yet.","description_hash":1129549721620550263},{"title":"My Story is Becoming Real","fiction_id":"88052","link":"https:\/\/www.royalroad.com\/fiction\/88052\/my-story-is-becoming-real","tags":["Portal Fantasy \/ Isekai","Dungeon","Male Lead","Strong Lead","Action","Fantasy","Reincarnation","Low Fantasy","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":12,"view_count":145,"chapters_count":2,"last_update":1717910791,"description":"If you died and found out the contents of your novel became real, would you be able to handle it?\nAll the mental pressure? The characters you created acting different than you described? Could you defeat the enemies you created?\nOn one unlucky day, a man will have no choice but to figure these out as he goes.\n~~~\nI’ll be posting this story on:\nWattpad under BebUwU\nWebNovel, ScribbleHub and RoyalRoad under Bebuu","description_hash":-1000996881310313699},{"title":"The Sunny Hill Saga","fiction_id":"88051","link":"https:\/\/www.royalroad.com\/fiction\/88051\/the-sunny-hill-saga","tags":["Comedy","Female Lead","Short Story","Low Fantasy"],"lable":"Original","following_count":4,"rating":0.0,"page_count":8,"view_count":83,"chapters_count":1,"last_update":1717828782,"description":"Barbara Jollymont did not fancy herself as a general, but now she has no choice.\nAfter a routine walk around Sunny Hill Retirement Home results in her defeating a crazed green monster, Barb must lead her platoon of Grandmas to victory against a Goblin Invasion.\nThey've got magical gardening equipment as weaponry, but will that be enough to fight back the horde and take down the impenetrable dome locking them in, and the rest of the world out?\nBarb will find out, after she makes her cup of tea.\n\nThis will be a short, fun story. Thinking around 10k to 12k words :)\n\n[Participant in the Royal Road Community Magazine Contest]Prompt: Goblins and Grandmas","description_hash":-4178347587225050523},{"title":"Decisions: What Is Quinton's Secret?","fiction_id":"88050","link":"https:\/\/www.royalroad.com\/fiction\/88050\/decisions-what-is-quintons-secret","tags":["LitRPG","Progression","Strategy","Martial Arts","Female Lead","Action","Adventure","Fantasy","Supernatural","Strong Lead","Secret Identity","Magic","High Fantasy","Mythos","First Contact"],"lable":"Original","following_count":2,"rating":0.0,"page_count":141,"view_count":1004,"chapters_count":22,"last_update":1718607620,"description":"A normal school year for an 18 year old girl named Quinton is turned into chaos when she discovers a family secret that changes her life forever. The past is revisited, secrets are revealed,  and an organization run by an unknown individual is revealed to be the biggest threat of all. \n{story also on:Pocket FMScribble Huband Web Novel }","description_hash":-1372999680622105714},{"title":"The Dungeon in the wall - Book 1","fiction_id":"88049","link":"https:\/\/www.royalroad.com\/fiction\/88049\/the-dungeon-in-the-wall-book-1","tags":["Portal Fantasy \/ Isekai","Male Lead","Harem","Adventure","Fantasy","Romance","Mystery","Supernatural","First Contact"],"lable":"Original","following_count":6,"rating":0.0,"page_count":309,"view_count":1052,"chapters_count":17,"last_update":1718630247,"description":"**The Dungeon in the Wall** invites readers into the hauntingly beautiful and complex world of Jonas Drianson, a young software developer turned mansion-restorer. Set in the verdant heart of Tennessee, Jonas's life takes a dramatic turn when he acquires a dilapidated Victorian mansion with plans to revive its former splendor. But as he delves into the restoration, he peels back layers of decay to reveal a hidden dungeon in the walls—a chilling testament to the mansion’s murky and mysterious past.\nThe discovery launches Jonas into an unexpected adventure as the dungeon unveils secrets dark enough to disrupt the peace of the small town and powerful enough to reshape Jonas's perspective on his own history. Each room and artifact whispers of long-ago triumphs, tragedies, and betrayals, pulling Jonas deeper into a labyrinth of local legend and scandal.\nAs he explores the enigmatic dungeon, Jonas encounters an eclectic and fantastical group of monster girls. There's Tillu, the spirited Pixie-Gnome with a harrowing tale of escape from werewolves, and Boali, the majestic Dragon beauty who leads a covert tribe of her kin. Together with these enigmatic creatures, Jonas’s life becomes entwined with Christie and Kelly, two human women from the town who had already begun to capture his heart before the dungeon's discovery. The arrival of Cici, a mysterious figure with her own shadowed past and connections to the house’s secrets, adds another layer to the unfolding drama.\nTogether, these women form a diverse harem that not only offers Jonas companionship but also aids him in navigating the complexities of the mansion. As they unearth the intertwined histories of the place and their own lives, they form a bond that transcends the confines of time and circumstance, offering Jonas not just romantic entanglements but a profound sense of belonging and purpose.\nBlending elements of mystery, history, fantasy, and romance, **The Dungeon in the Wall** is more than a thrilling adventure; it's a narrative about rediscovery and redemption. As Jonas and his companions confront the shadows of the past, they illuminate the power of love and hope in even the darkest places. This novel is a portal to a story where the echoes of the past meet the promise of the future, proving that within the walls of the seemingly ordinary, extraordinary tales await. Join Jonas as he steps through the creaking doorways of perception into a world where every shadow holds a story and every heart finds a home.","description_hash":-2645727729160276775},{"title":"Blind lovers ","fiction_id":"88048","link":"https:\/\/www.royalroad.com\/fiction\/88048\/blind-lovers","tags":["Multiple Lead Characters","Contemporary","Slice of Life","Drama","Romance","Short Story","Male Lead","Female Lead","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":5,"view_count":71,"chapters_count":2,"last_update":1718396594,"description":"Blind Lovers is a story about Emilia, CEO of Horizon Enterprises, trying to gain information from her rival company to get the biggest deals and buy all the talents so that they could expand on her rival company's expertise while trying to maintain a partnership, but there is a huge operative named David Manager who does it all and is standing behind her plan. What will she do, and why is the story named Blind Lovers?","description_hash":6446995711910268703},{"title":"Belladonna: The Sciftan","fiction_id":"88047","link":"https:\/\/www.royalroad.com\/fiction\/88047\/belladonna-the-sciftan","tags":["Portal Fantasy \/ Isekai","Female Lead","Fantasy","Romance","Reincarnation"],"lable":"Original","following_count":1,"rating":0.0,"page_count":12,"view_count":122,"chapters_count":2,"last_update":1717914285,"description":"Life as Sciftan— for her, it starts out with terror and a cold introduction to her new world, and it doesn't get better from there.","description_hash":1192678580675540846},{"title":"The Empath","fiction_id":"88046","link":"https:\/\/www.royalroad.com\/fiction\/88046\/the-empath","tags":["Progression","Post Apocalyptic","Anti-Hero Lead","Grimdark","Male Lead","Action","Adventure","Fantasy","Strong Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":49,"chapters_count":1,"last_update":1717822607,"description":"Jamie is special, but not in a good way. He can feel things others feel, but only the bad things. All his life, all he has known are pain and loss, constantly, no matter how good his own personal life is, he just feels horrible constantly, so he stops caring. About everything. Only, when things suddenly arent as easy as working a 9-5, or in his case a 7:00-15:45, how will he cope?\n\n\n\nBe warned, I have trouble keeping consistent pace with writing, I am only posting the first chapter until I know I will continue the story, feel free to chuck this in your read later and check back later if you like what I have here. <3","description_hash":2619059081286791398},{"title":"Step","fiction_id":"88045","link":"https:\/\/www.royalroad.com\/fiction\/88045\/step","tags":["Anti-Hero Lead","Psychological","Female Lead","Fantasy","Horror","Short Story","Supernatural","Magic"],"lable":"Original","following_count":2,"rating":0.0,"page_count":23,"view_count":69,"chapters_count":2,"last_update":1718633765,"description":"Eight-year-old Stella Wolfe lives in a world where extraordinary magic is ordinary. But her life is far from a fairy tale.Stella is special. Gifted with two innate powers, she has more magic than most. With skin that can heal from any injury, she always looks like the perfect daughter. But appearances can be deceiving, and even her visions of the future can’t guarantee her a starring role in the upcoming ballet recital. Her mindwalking mother has high expectations, and the competition is deadly.Luckily, Grandma’s house always has sweet-smelling gingerbread, chairs that fit just right, and a tranquil forest complete with fairy rings only a step through the back gate. But in this world, the fairies use pliers and the goblins don’t always come from the forest.\n\n[Written for the Royal Road Magazine]","description_hash":5715172385276571294},{"title":"It Was My Night-Shift... And Then It Came","fiction_id":"88044","link":"https:\/\/www.royalroad.com\/fiction\/88044\/it-was-my-night-shift-and-then-it-came","tags":["Urban Fantasy","Comedy","Male Lead","Contemporary","Fantasy","Mystery","Supernatural","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":45,"chapters_count":1,"last_update":1717822512,"description":"Bob is a single, ladies-man, ageing detective who enjoys doing the night-shifts. Plenty of time for himself, and no complications from day-shifts crimes.But his usually peaceful night-shift is suddenly interrupted by a screaming woman who runs to him, terrified of what seems to lurk in the dark streets...","description_hash":-2412397143674887634},{"title":"Ion's Gate","fiction_id":"88043","link":"https:\/\/www.royalroad.com\/fiction\/88043\/ions-gate","tags":["Progression","Post Apocalyptic","Super Heroes","Grimdark","Psychological","Action","Adventure","Horror","Mythos","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":22,"view_count":77,"chapters_count":2,"last_update":1718353324,"description":"Louis, Incarcerated Enhanced, was given an option between spending the rest of his days mining with no parole or a position in the Cleaning Crew's 4th division operating inside Broken City B. Joining the latter was akin to suicide. However, the world of Ion and humanity is already broken and under siege by demonic insurrections, alien invasions, and the horrors of the 3rd Great War. Everyone was going to die one way or another. Inevitably. At least, in the Cleaning Crew you were free, of sorts. That was what the Strongest Hero Alive told him anyways.","description_hash":3957137837387511055},{"title":"In Another World With My Cat","fiction_id":"88042","link":"https:\/\/www.royalroad.com\/fiction\/88042\/in-another-world-with-my-cat","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Anti-Hero Lead","Secret Identity","Action","Adventure","Fantasy","GameLit","Progression"],"lable":"Original","following_count":1,"rating":5.0,"page_count":12,"view_count":158,"chapters_count":3,"last_update":1718270451,"description":"Sammy wakes up one morning with no idea where he is, where his clothes are and why in the hell kidnappers would smuggle him out of his apartment and drop him off in the countryside, all while worrying over the well being of his cat, Lord Fizzlesnatch. He has to work out his place in this strange new environment and survive long enough to save his furry little friend before the system timer runs to zero and all hope is lost.","description_hash":4900917571316966},{"title":"Man of gold","fiction_id":"88041","link":"https:\/\/www.royalroad.com\/fiction\/88041\/man-of-gold","tags":["Anti-Hero Lead","Contemporary","Slice of Life","Adventure","Romance","Satire","Villainous Lead","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":33,"view_count":226,"chapters_count":6,"last_update":1717972283,"description":"In this enthralling tale of crookery, romance and suspense man of Gold takes you on journey from the overpopulated prisons of kinshasa DRC to the the lavish suburbs of zambia. in this tale Meschak a down on his luck crook and con man aided by his lover and partner in crime Carolina devise a daring con to get rich or die trying.","description_hash":4612374887277378312},{"title":"Paradox of Palia","fiction_id":"88040","link":"https:\/\/www.royalroad.com\/fiction\/88040\/paradox-of-palia","tags":["LitRPG","Time Travel","Progression","Strategy","Slice of Life","Action","Adventure","Fantasy","Magic","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":22,"view_count":139,"chapters_count":3,"last_update":1718529534,"description":"Christmas is a time of joy and happiness. People gift their loved ones and celebrate together to commemorate the day. It is believed that Santa Claus delivers toys to the kids on Christmas. Another…..peculiar figure also appears during Christmas.\nMutant goblins cause havoc every year during the time of Christmas. The Paradox of Palia explains the origin of these creatures, but in reality no one really knows how and when they first descended upon the world.\nA young boy, Elias, makes it his life purpose to stop the mutant goblin invasions. \nRead how he discovers and unveils the answers to the mysteries of Palia that even the elders of his village don't know about.\n\nPartipant in the Royal Road Community Magazine [June 2024 Edition]","description_hash":-4769964608923192122},{"title":"Veritas Obscura","fiction_id":"88039","link":"https:\/\/www.royalroad.com\/fiction\/88039\/veritas-obscura","tags":["Time Travel","War and Military","Male Lead","Contemporary","Action","Historical","Mystery","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":12,"view_count":89,"chapters_count":2,"last_update":1718170131,"description":"A man who regained his past lives memories have to figure out what to do with them.","description_hash":-7617677968014170248},{"title":"PokeMon: Unchained Idiocy","fiction_id":"88038","link":"https:\/\/www.royalroad.com\/fiction\/88038\/pokemon-unchained-idiocy","tags":["Portal Fantasy \/ Isekai","Progression","Comedy","Male Lead","Secret Identity","Action","Adventure"],"lable":"Fan Fiction","following_count":5,"rating":0.0,"page_count":69,"view_count":433,"chapters_count":5,"last_update":1718364247,"description":"In a drunken birthday celebration, Vajk and his friends drink a mysterious \"Arceus Vodka,\" jokingly speculating about its ability to transport them to the Pokémon world. As the alcohol takes hold, they pass out one by one, with Vajk last to succumb. A strange figure approaches, whispering cryptic words as Vajk slips into darkness.The story can be found at:Fanfiction.net: https:\/\/www.fanfiction.net\/s\/14348923\/1\/Pokemon-Unchained-IdiocyWebnovel: https:\/\/www.webnovel.com\/book\/pokemon-unchained-idiocy_26362333706117205","description_hash":2508353184712337401},{"title":"One last Crusade","fiction_id":"88037","link":"https:\/\/www.royalroad.com\/fiction\/88037\/one-last-crusade","tags":["Urban Fantasy","Dungeon","Villainous Lead","War and Military","Steampunk","Adventure","Drama","Fantasy","Tragedy","Strategy","Progression"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":33,"chapters_count":1,"last_update":1717818414,"description":"This is a story about grandma's love and goblin’s hate.","description_hash":-1034343000730258212},{"title":"Avatar of Storm","fiction_id":"88035","link":"https:\/\/www.royalroad.com\/fiction\/88035\/avatar-of-storm","tags":["LitRPG","Action","Adventure","Fantasy","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":13,"view_count":101,"chapters_count":2,"last_update":1718225768,"description":"Zachariah was excited to finally awaken, as everyone does at age 16, but he wasn't expecting such a powerful class...\nFollow his journey!","description_hash":-3870858951122658408},{"title":"The Great Swordsman Of The Shinobi World","fiction_id":"88034","link":"https:\/\/www.royalroad.com\/fiction\/88034\/the-great-swordsman-of-the-shinobi-world","tags":["Male Lead","Action"],"lable":"Fan Fiction","following_count":16,"rating":4.8,"page_count":47,"view_count":1793,"chapters_count":12,"last_update":1718572162,"description":"Hayashi found himself reincarnated into the world of Naruto, where he discovered the Template System, which granted him the skills of the Greatest Swordsman from the One Piece universe. \nAs he honed his abilities, Hayashi surpassed even the legendary White Fang of Konoha in swordsmanship, earning recognition in the ninja world.\n\nI don't own Naruto or One Piece. Kudos to Masashi Kishimoto and Eiichirō Oda.","description_hash":-6481159719002946969},{"title":"The Elder’s Quest: Amulet of Destiny [GameLit\/LitRPG]","fiction_id":"88033","link":"https:\/\/www.royalroad.com\/fiction\/88033\/the-elders-quest-amulet-of-destiny-gamelitlitrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Female Lead","Secret Identity","Strong Lead","Action","Adventure","Fantasy","Short Story","Supernatural","Magic","GameLit"],"lable":"Original","following_count":3,"rating":0.0,"page_count":6,"view_count":62,"chapters_count":1,"last_update":1717817306,"description":"Agnes thought her quiet village life was safe from her adventuring past—until goblins attacked. Armed with an ancient amulet, she’s thrust back into her game-like world where quests are real, and the stakes are higher than ever. As the unlikely hero, she must unite old friends and new allies to defeat the Goblin King and save both realms. \"The Elder’s Quest: Amulet of Destiny\" is a thrilling blend of action and magic where age is just a number, and heroism knows no bounds.","description_hash":3758800677524253595},{"title":"Cut from Earth","fiction_id":"88032","link":"https:\/\/www.royalroad.com\/fiction\/88032\/cut-from-earth","tags":["Portal Fantasy \/ Isekai","Progression","Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":3,"view_count":40,"chapters_count":1,"last_update":1717817302,"description":"In a mystical cave filled with ancient lore, Justice embarks on a transformative journey. Guided by a mental system, he deciphers the cave’s language and delves into quests embodying Gaia’s gifts. Despite a confrontation with a Dark Cave Spirit, Justice, with his centipede ally, perseveres. As he navigates these challenges, hints of a vast world beyond the cave begin to emerge, suggesting a grander adventure awaits. This tale is a testament to man’s harmony with nature and the promise of undiscovered realms.","description_hash":2267833672183924472},{"title":"Moltev'ji, the Lost Realm","fiction_id":"88031","link":"https:\/\/www.royalroad.com\/fiction\/88031\/moltevji-the-lost-realm","tags":["Portal Fantasy \/ Isekai","Progression","Multiple Lead Characters","Strong Lead","Drama","Adventure","Fantasy","Mystery","Supernatural","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":37,"view_count":156,"chapters_count":4,"last_update":1718386995,"description":"\"We do not have 'visitors', we instead have predicaments. Like you.\"\n A man is found lost, injured, and with little memory besides his name. While the situation is dire for himself, the implications of what this means for the island he washed up on is cataclysmic.\n The path to regain his past is entangled with the future of Moltev'ji and her people. With three Gods to appeal to, can both goals be met? \nAnd with no one having met the Gods and returning to tell the tale, is it even possible?","description_hash":-3879336784704891341},{"title":"This World Hates Me","fiction_id":"88030","link":"https:\/\/www.royalroad.com\/fiction\/88030\/this-world-hates-me","tags":["Portal Fantasy \/ Isekai","Action","Adventure","High Fantasy"],"lable":"Original","following_count":2,"rating":4.0,"page_count":48,"view_count":137,"chapters_count":4,"last_update":1718474400,"description":"Michael, a poor normal kid gets stabbed thanks to a weird pull of fate he gets, and gets reincarnated. Only to get reincarnated as a slave in some prison cell. He can't seem to catch a break, getting terrible lives back to back. And this world only rubs it in with salt. Thankfully he lives, probably, I haven't decided yet.","description_hash":6632054643129931382},{"title":"Untitled: Luna","fiction_id":"88029","link":"https:\/\/www.royalroad.com\/fiction\/88029\/untitled-luna","tags":["Comedy","Female Lead","Action","Fantasy","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":34,"view_count":45,"chapters_count":1,"last_update":1717817268,"description":"Luna is a young girl who lives in an orphanage with her close friend Sol. She always dreamed of leaving and going out into the world.\n One day, under certain circumstances, they decide to run away, but before they can escape, they are intercepted by mysterious mercenaries looking to capture them. But despite all hope being lost one of the mercenaries gives Luna an interesting proposition to kill her. If she can Luna and Sol can both walk off scot-free. But Luna is unable and unwilling to become a cold-hearted killer despite it meaning her freedom. \nBut just before she can be taken, a mysterious but familiar face appears, which causes an interesting turn of events and unleashes a power lying dormant inside Luna, which causes her to lose consciousness, not knowing what will happen after. Is this truly the end of Luna's story? Is her story really over right before it even started? Or is something more brewing in the shadows of this tragic event?","description_hash":-3475803073531632076},{"title":"Pas'Arai","fiction_id":"88028","link":"https:\/\/www.royalroad.com\/fiction\/88028\/pasarai","tags":["Slice of Life","Drama","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":33,"chapters_count":1,"last_update":1717817262,"description":"Intro:\n\nPas'Arai. Known as the city of temples, and there were many. The Bone Temple of Nazveth, the Temple of Drakus the Five Headed, The Wind Temple of Urus, Lightbringer's Temple, Temple of the Elephant God Kalgrash, Manumokus' Many Chambered Hall, the Celestial Temple of Torn, the Night Temple of Ba'lea, to name a few were all within blocks of each other all competing for their follower's loyalty and devotion.","description_hash":-5543262598920709847},{"title":"The Grove Knights Pursue","fiction_id":"88027","link":"https:\/\/www.royalroad.com\/fiction\/88027\/the-grove-knights-pursue","tags":["Action","Fantasy","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":51,"chapters_count":1,"last_update":1717817251,"description":"Intro:\nAdurhast gathered the blue energy into his wrist. The substance flew down his palm, and through his fingertips and blasted outward. The pulse of energy flew through the trees before smashing itself into one of the pursuers, knocking him off his snowmobile. His companions, unfazed at their fallen, continued to pursue. Black snowmobiles giving chase to Adurhast's own bronze snowmobile. The Knights of the Gold Grove would not stop until they had captured or killed him and retrieved what was stolen.","description_hash":-8138376600718443142},{"title":"Wait For Me","fiction_id":"88026","link":"https:\/\/www.royalroad.com\/fiction\/88026\/wait-for-me","tags":["Portal Fantasy \/ Isekai","War and Military","Female Lead","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":37,"view_count":91,"chapters_count":3,"last_update":1718154356,"description":"Kaiya Wilson is a 22-year-old soon to be college graduate who is visiting home for spring break. When visiting a café with her younger sister, she’s transported to a new world.\nZann, king of Yvanta, has summoned her here to become a Suriqi mage—a mage capable of wielding all of the elements in tandem instead of only being able to wield one. In the hopes that she would help end the war Zann has found himself in, he asks her to start training to withstand the ritual. After marinating on the information, Kaiya agrees and begins her training.\nWhile training takes up most of her time, she also finds time to learn more about the kingdom and the people around, leading her to find that not everything is as she’s been told. With steadily accumulating knowledge, Kaiya has to decide what to do with her view of the kingdom, and its ruler, rapidly changing.","description_hash":5455613014578785196},{"title":"Wrath of the Spider","fiction_id":"88025","link":"https:\/\/www.royalroad.com\/fiction\/88025\/wrath-of-the-spider","tags":["Adventure","Fantasy","Horror","Supernatural","High Fantasy"],"lable":"Original","following_count":4,"rating":5.0,"page_count":22,"view_count":372,"chapters_count":6,"last_update":1718594087,"description":"One of the last human bastions of freedom, the peaceful mining village of Belantara is under goblin siege. An unlikely band of heroes form a desperate plan for the salvation of the village and the repulsion of goblin threat - but they will need to seek the services of the Spider, a mysterious Woman of the Woods.","description_hash":-2511037894251246957},{"title":"cliche dungeon adventure no.32 the parody","fiction_id":"88024","link":"https:\/\/www.royalroad.com\/fiction\/88024\/cliche-dungeon-adventure-no32-the-parody","tags":["Dungeon","Villainous Lead","Comedy","Multiple Lead Characters","Adventure","Fantasy","Satire","Male Lead","Non-Human Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":2,"view_count":49,"chapters_count":1,"last_update":1717814414,"description":"this is storyy can be seen as a massive rant, it will be looking at common tropes and cliches and then doing the complete opposite, characters will genuinely be scum or have things wrong with them. characters actions will be absed on actual human interactions the best i can. the story will follow many different characters and their journey with hopefully the only thing in common between them being a terribly constructed knife that is an equally terribly constructed plot point. the story will contain a few common mysteries to keep the readers attention in what is aptly described as a terribly written and long winded rant about the unoriginality of the content this cat has read over the years.\ndisclaimer: the narrator has an attitude and will be insulting everyone (possibly not just characters)\ndisclaimer no.2: the language used will be magnitudes of unfriendly to any living thing and is not for entities that are not of the mental maturity to understand the meaning and the fact that such language should not be used in such a manner... or at all really.","description_hash":-4921540503623729954},{"title":"My Grandma is the Dark Lord","fiction_id":"88023","link":"https:\/\/www.royalroad.com\/fiction\/88023\/my-grandma-is-the-dark-lord","tags":["LitRPG","Villainous Lead","Strategy","Comedy","Female Lead","Action","Fantasy","Satire","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":29,"view_count":294,"chapters_count":4,"last_update":1717803339,"description":"Rodrigues, chosen hero of the people, never could have expected that his encounter with the Dark Lord would end in defeat. But that is exactly what happened, because, as it turns out, the Dark Lord was none other than his grandmother. Thus does granny go into story time, recounting how it was she became the evilest of all evils.\n(Grandmas and Goblins entry)\nWhat to expect:\n-Bad writing\n-Dog shit storytelling\n-Fourth wall breaks\n-satire\n-Complete and utter nonsense.\nNo seriously. This story sucks. Go read my other fiction. Its way better. Or don't. Just read this one instead. Don't say I didn't warn you though.","description_hash":-8732703580470648759},{"title":"𝒮𝓉𝑜𝓇𝓂'𝓈 𝒜 𝐵𝓇𝑒𝓌𝒾𝓃' (Book Two)","fiction_id":"88022","link":"https:\/\/www.royalroad.com\/fiction\/88022\/book-two","tags":["Female Lead","Slice of Life","Fantasy","Romance","Supernatural"],"lable":"Fan Fiction","following_count":2,"rating":0.0,"page_count":340,"view_count":769,"chapters_count":24,"last_update":1718584200,"description":"𝐻𝒶𝓇𝓇𝓎 𝒫𝑜𝓉𝓉𝑒𝓇 𝐹𝒶𝓃𝐹𝒾𝒸𝓉𝒾𝑜𝓃: 𝒪𝒞 𝑀𝒶𝒾𝓃 𝒞𝒽𝒶𝓇𝒶𝒸𝓉𝑒𝓇𝙱𝚘𝚘𝚔 𝚃𝚠𝚘 𝚘𝚏 𝚃𝚑𝚎 𝚂𝚑𝚊𝚌𝚔𝚕𝚎𝚍 𝚂𝚎𝚛𝚒𝚎𝚜𝚃𝚑𝚎𝚘𝚍𝚘𝚛𝚎 𝙽𝚘𝚝𝚝𝚡𝙾𝙲~~~There is always that moment in a story where nothing has gone wrong, not truly, and yet the signs begin showing. The storm clouds begin forming in the distance and all you can do is wait and watch. Wait and watch as the inevitable comes to destroy it all.\n~\"But we aren't seers.\" The statement was so obvious of a place to get stuck for her young mind. Leo did find his smile being a bit more genuine.\n\"It isn't really seeing the future. Just more of a danger sense. A strong intuition or gut feeling,\" his brief bout of happiness faded, smile disappearing entirely.\" For us, it is just a feeling... we don't have the ability to quite know what is coming our way. Just strong feelings....\"~","description_hash":5954967134735725269},{"title":"Fables Fall - The White Wolf [A fairytale mashup short story]","fiction_id":"88021","link":"https:\/\/www.royalroad.com\/fiction\/88021\/fables-fall-the-white-wolf-a-fairytale-mashup","tags":["Portal Fantasy \/ Isekai","Urban Fantasy","Psychological","Female Lead","Drama","Romance","Short Story","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":4,"rating":5.0,"page_count":6,"view_count":74,"chapters_count":1,"last_update":1717791584,"description":"Short Story for Royal Road Community Magazine June 2024\nLacey's only desire is to save her grandmother, but how far will she go into the realms of delusions to succeed?  Real or Unreal, she'll have to follow the white wolf, discover her past, and come to terms with whether to believe it all or not.","description_hash":5271396255431099209},{"title":"BLESSED ","fiction_id":"88020","link":"https:\/\/www.royalroad.com\/fiction\/88020\/blessed","tags":["Urban Fantasy","Martial Arts","Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","Low Fantasy","Mythos"],"lable":"Original","following_count":1,"rating":0.0,"page_count":4,"view_count":145,"chapters_count":3,"last_update":1718470803,"description":"Kamisama Agòri, a college student with a facial deformity tries to take his own life. before he can he meets Dionysus the God of wine and fertility.","description_hash":9134016580649558006},{"title":"Project Steel Eden","fiction_id":"88019","link":"https:\/\/www.royalroad.com\/fiction\/88019\/project-steel-eden","tags":["Virtual Reality","Portal Fantasy \/ Isekai","Post Apocalyptic","War and Military","Psychological","Sci-fi","Male Lead","Female Lead","Strong Lead","Multiple Lead Characters","Non-Human Lead","Genetically Engineered ","Technologically Engineered","First Contact","Soft Sci-fi","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":2,"rating":5.0,"page_count":1,"view_count":39,"chapters_count":1,"last_update":1717784414,"description":"Transmigrated into the future, Felix is forced out of his comfy life into a matriarchal society where not everything is as it seems. His body is broken, and has been broken here for as long as it has been alive. Words whispered in corners that don't make sense. \nWill Felix be able to get his wits about him in time to find out what lurks just out of sight? \nOr will he be devoured whole before he can learn to stand on his feet?\n---\nThis is a submission for the Community Magazine Contest. (June 2024)","description_hash":-5279049641441966658},{"title":"Cat With a Raygun","fiction_id":"88018","link":"https:\/\/www.royalroad.com\/fiction\/88018\/cat-with-a-raygun","tags":["LitRPG","Portal Fantasy \/ Isekai","Male Lead","Adventure","Fantasy","Reincarnation","Magic"],"lable":"Original","following_count":15,"rating":4.83,"page_count":82,"view_count":1339,"chapters_count":13,"last_update":1718384407,"description":"Joe had a rich full life on Earth. then he died. Now his soul's reincarnation has gone wonky as he actually remembers who he used to be and is put into an adult body rather than being reborn. This new body is on another world where magic is real and people have magical Guidebooks that keep track of their classes and attributes. Joe picked Mage as his class on this new world, but found out the glass cannon trope was real. Now he has new friends trying to help him overcome that limitation and revitalize their tiny town devastated by war. As Joe's Mage powers prove insufficient for their daunting challenges, he begins to wonder: Can his knowledge as an Earth-born electrical engineer be combined with his newfound magical abilities?New Chapter releases Monday, Wednesday, and Friday at 1 PM Eastern US time.","description_hash":-8853661705401449448},{"title":"A Break in Reality","fiction_id":"88017","link":"https:\/\/www.royalroad.com\/fiction\/88017\/a-break-in-reality","tags":["LitRPG","Portal Fantasy \/ Isekai","Female Lead","Secret Identity","Tragedy","Action","Fantasy","Romance","School Life","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":93,"chapters_count":1,"last_update":1717776714,"description":"A normal secondary school girl, who was dealing with self-hatred towards the way she looked and her white hair, was known to be a curse. Without any warning, she phases through a portal in the form of a mirror and her world is no longer the same. From a normal world, she was transported to a world full of magic and fantasy.","description_hash":4676142095604564366},{"title":"Fredrik and the School of Knights","fiction_id":"88016","link":"https:\/\/www.royalroad.com\/fiction\/88016\/fredrik-and-the-school-of-knights","tags":["Dungeon","Male Lead","Drama","Action","Adventure","Fantasy","School Life","Magic","High Fantasy","Progression"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":47,"chapters_count":1,"last_update":1717768447,"description":"Join Fredrik on his marvelous adventure on becoming an unconventional yet revered Knight of Altrion!\nKnights in the world of Altrion are the mightiest and respected forces, sworn to fight Evil but as Fredrik grows up, he realizes that the world is far more complex beyond Good and Evil.\nFredrik and the School of Knights is a mixture of Harry Potter and Game of Thrones, so if you like one of those, or even both, then give it a read!\nI‘m very open for comments and\/or suggestions from the community!\nHappy reading, Rino","description_hash":7761397080102700742},{"title":"Adventure Bound: Wind Maker","fiction_id":"88015","link":"https:\/\/www.royalroad.com\/fiction\/88015\/adventure-bound-wind-maker","tags":["Multiple Lead Characters","Action","Adventure","Fantasy","Romance","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":26,"view_count":65,"chapters_count":3,"last_update":1718636420,"description":"A year after the battle of Duke and Orvell. Orvell then was met with a mysterious man that will lead him to his past.","description_hash":-6451470144682112449},{"title":"The Spymaster's Apprentice","fiction_id":"88014","link":"https:\/\/www.royalroad.com\/fiction\/88014\/the-spymasters-apprentice","tags":["LitRPG","Secret Identity","Adventure","Fantasy","Mystery"],"lable":"Original","following_count":3,"rating":0.0,"page_count":51,"view_count":629,"chapters_count":11,"last_update":1718629252,"description":"A LitRPG about secret codes and ciphers\nAn encoded message may be the key to preventing two kingdoms from going to war. The Spymaster is dead and no one knows how to read the message. Now his young apprentice, Ean Fleming, must take control of his master's spy network and gather Intelligence about the forces at play.\nIn the world of shadows and espionage, all communication is encrypted. Ean will need to learn how to use multiple secret codes and ciphers, and fast, if he has any hope of stopping the growing unrest. In this high stakes crisis, not everyone wants him to succeed.\nLearn how to use codes and ciphers alongside Ean in this fantasy LitRPG. Can you and Ean encode and decode messages to learn the truth in time?","description_hash":-4567823631430553653},{"title":"Granny… That’s Not a Kid","fiction_id":"88013","link":"https:\/\/www.royalroad.com\/fiction\/88013\/granny-thats-not-a-kid","tags":["Comedy","Male Lead","Fantasy","Short Story","Supernatural","Low Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":15,"view_count":94,"chapters_count":3,"last_update":1718316965,"description":"When my Dad shipped me off to my Granny Liadan who lives in the woods, I expected her to be the one to answer my knock at the door. You can imagine my surprise when a goblin in a pink dress calmly opened the door.\n\nEntry for the Royal Road Community Magazine: June 2024 Edition.","description_hash":4183873086081228002},{"title":"Our last dance","fiction_id":"88012","link":"https:\/\/www.royalroad.com\/fiction\/88012\/our-last-dance","tags":["Non-Human Lead","Drama","Action","Fantasy","Short Story","Female Lead","Magic","Low Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":23,"view_count":81,"chapters_count":2,"last_update":1718251039,"description":"Deep under a world conquered by humanity, the goblins live in hiding. Once one of the proud magical races that inhabited our world, now completely displaced since the descent of Humanity from the Towers of the Gods. Mama Grimal used to be a great goblin hero, an example of skill and wit, but now, she lives in fear of the sunlight. Just as she starts getting comfortable in the dark, the Gods themselves manifest for goblinkind for the first time in what feels in ages, and call to her and all of her kind for one last trip to a promised land. A place without humans, a bright future under the sun. But the terrible present doesn’t let go so easily, and after the goblin's hesitation to answer the call, the arrival of a new predator in their dark lands will give Grimal the push to brave the daylight once again.","description_hash":3063827315934094720},{"title":"Children of the Cold Moon: The Four Treasures Saga, Book 1 [Isekai \/ LitRPG]","fiction_id":"88011","link":"https:\/\/www.royalroad.com\/fiction\/88011\/children-of-the-cold-moon-the-four-treasures-saga","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Comedy","Male Lead","Action","Adventure","Fantasy","GameLit","High Fantasy","Mythos"],"lable":"Original","following_count":68,"rating":4.83,"page_count":115,"view_count":1653,"chapters_count":21,"last_update":1718625604,"description":"On the winter solstice Bren gets pulled into the Celtic Otherworld, where he uncovers a grave threat looming over the world. Armed with ancient prophecies and guided by legendary figures from Irish mythology, Bren embarks on a perilous quest to retrieve relics said to hold the key to restoring balance. \nBut as he delves deeper into the mysteries of his own identity and confronts the shadows of his past, Bren realizes that his journey is not just about saving the Otherworld— it's about discovering the hero within himself.\nREADER'S COMPENDIUM CAN BE FOUND HERE.","description_hash":-8141764854429029567},{"title":"Hyphae, Weasel, Soldier, Sorc","fiction_id":"88010","link":"https:\/\/www.royalroad.com\/fiction\/88010\/hyphae-weasel-soldier-sorc","tags":["Non-Human Lead","Strong Lead","Adventure","Fantasy","Short Story","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":23,"view_count":71,"chapters_count":2,"last_update":1718325213,"description":"A reluctant leader of the city guard enters into a pact to take down a smuggling operation.\nWritten to participate in the June 2024 writing contest: Goblins and Grandmas.","description_hash":7098166726354614079},{"title":"Song of a Dying Star","fiction_id":"88009","link":"https:\/\/www.royalroad.com\/fiction\/88009\/song-of-a-dying-star","tags":["Grimdark","Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","Female Lead","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":12,"view_count":40,"chapters_count":1,"last_update":1717756332,"description":"\"If a star dies and nobody hears it sing, did it ever matter?\"\nIn the game of religion where the gods vie for followers, Zathiri is winning.\nAilaurus the First Woman of Hell and the Banak tribesman Treyus are two players in this game... as enemies to the gods and a big pain in the divine ass of Zathiri.\nThe pair travel the Floating Isles saving godless atheists from the bloodied hands of religion. In their latest adventure, rumours of the first cult lead them to a far isle where it seems a sacrifice is about to go down.\nSacrifices in church at the hands of a priest? Nasty, but pretty vanilla.Sacrifices in the woods at the hands of a cult leader? What are the gods up to now?\nWhatever the reason, Ailaurus' spirits have a bad feeling about this and she isn't a Woman of Hell for nothing...\n\nNew episode every 2 weeks. Publishing on Fridays.I'm intending to approach this book as a serial writing project, writing as I publish. I know as much as you as far as what's happening next ¯\\_(ツ)_\/¯","description_hash":-1445082198688830055},{"title":"The Goblin Heir","fiction_id":"88008","link":"https:\/\/www.royalroad.com\/fiction\/88008\/the-goblin-heir","tags":["LitRPG","Multiple Lead Characters","Action","Adventure","Fantasy","Male Lead","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":4,"rating":0.0,"page_count":2,"view_count":62,"chapters_count":1,"last_update":1717752791,"description":"Daniyal, a goblin sent by the sage to search for the rightful heir to the goblin throne, made the most foolish mistake. Desperate to save himself, he cast a spell on one of the hunters chasing him, binding their lives together.\n\nMazin, a good-for-nothing, had always dreamed of being a hero. Unfortunately for him, luck had turned its back on him. After passing the classification test, he was named the weakest hunter of all mankind. In an attempt to save face, he joined a group of hunters to hunt the dangerous monster that plagued the forest surrounding their village.\nHe would hunt it himself, and prove to them that he was as capable a hunter as any of them.","description_hash":2804942455935255887},{"title":"Ryan Lewis and Your Not-So-Typical Post-Apocalyptic Adventure","fiction_id":"88007","link":"https:\/\/www.royalroad.com\/fiction\/88007\/ryan-lewis-and-your-not-so-typical-post-apocalyptic","tags":["Post Apocalyptic","Comedy","Male Lead","Action","Adventure","Satire"],"lable":"Original","following_count":1,"rating":0.0,"page_count":4,"view_count":45,"chapters_count":1,"last_update":1717750328,"description":"Read as Ryan breaks the fourth wall time to time and makes the apocalypse a comedy.Inspired by Daybreak, a pretty funny Netflix show. Too bad they canceled it.Proofread by Quill Bot and ChatGPT","description_hash":4193763807464554218},{"title":"A Vynari's Life Cycle","fiction_id":"88006","link":"https:\/\/www.royalroad.com\/fiction\/88006\/a-vynaris-life-cycle","tags":["Non-Human Lead","Fantasy","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":4.0,"page_count":6,"view_count":85,"chapters_count":1,"last_update":1717746113,"description":"Anaïs' life ended, and began, unexpectedly. Now, she's in a strange new universe, on a strange new world, with strange abilities that she has little to no explanation for. She begins anew in a colony as a poor settler, determined to lead a rewarding and fulfilling life. However, can survive the frontier and all its monsters? and can she navigate life as a settler with no backing, barely any money, with a race she apparently needs to hide?","description_hash":-4018588966288127886},{"title":"Scribe's Legacy: Worlds Unwritten","fiction_id":"88005","link":"https:\/\/www.royalroad.com\/fiction\/88005\/scribes-legacy-worlds-unwritten","tags":["Virtual Reality","Female Lead","Action","Adventure","Fantasy","Romance","LitRPG","Reader Interactive","GameLit"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":178,"chapters_count":3,"last_update":1718392186,"description":"You rule the VRMMORPG Scribe's Legacy as AbyssalRose. The longer you play the game, the more obsessed you become with being the top-ranked player. With time and discipline, your guild dominates the leaderboard, and just when you think there's nothing left to accomplish, a new rival, Somnus, makes his debut. Despite his enticing persona, you're unsure of his motives. Will you succumb to his hypnotic charm or fight against his manipulation and save Scribe's Legacy? The choice is yours.Available on Kindle Vella","description_hash":-3366170372800066629},{"title":"Game: Return of the Empress","fiction_id":"88004","link":"https:\/\/www.royalroad.com\/fiction\/88004\/game-return-of-the-empress","tags":["Urban Fantasy","Post Apocalyptic","Anti-Hero Lead","Strategy","Female Lead","Action","Adventure","Fantasy","Romance","Supernatural","Strong Lead","Secret Identity","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":7,"view_count":115,"chapters_count":2,"last_update":1717747145,"description":"In a mysterious world where players are forced to participate in a deadly survival game across 200 floors, Wynona, a former bug created by the Creator, possesses the unique ability to copy the abilities of others. \n\nWith a desire for revenge and a vow to reach the 199th floor, Wynona returns from death by the hands of her own best friend and boyfriend.  \n\nWith the promise of three wishes on the 199th floor and the power to steal opportunities from others, Wynona's path is filled with deceit, strategic alliances, and unexpected encounters. \n\nWill she conquer the game, fulfill her revenge, and emerge victorious in this treacherous world?","description_hash":-1264166831999386066},{"title":"The Mad Man Awakens The Forbidden Eyes","fiction_id":"88003","link":"https:\/\/www.royalroad.com\/fiction\/88003\/the-mad-man-awakens-the-forbidden-eyes","tags":["Portal Fantasy \/ Isekai","Martial Arts","Male Lead","Strong Lead","Action","Adventure","Fantasy","Romance"],"lable":"Original","following_count":11,"rating":4.67,"page_count":112,"view_count":2121,"chapters_count":25,"last_update":1718002404,"description":"As the sun sets over a bustling, lively town, an eerie transformation begins in an abandoned, cobweb-filled room. On a dusty wooden bed lies a decayed corpse, forgotten by time. Suddenly, the long-dead body stirs, defying logic and nature. The heart starts to beat, which had long since stopped. After the resurrection, the decayed figure transforms into a pale, white-haired teenage boy named Xinli, who has transmigrated from another world.\nAs Xinli awakens, he is consumed by excruciating pain, his agonized screams echoing through the silent room. Through a heaven-defying miracle, he awakens his innate talent—the \"forbidden pupil of the eye.\" Which is related to time and comprehensiveness.\nUnbeknownst to Xinli, his resurrection sends shockwaves through the upper realms, rumbling the River of Time and catching the attention of a powerful Dao being, the guardian who watches over the River of Time. This mysterious entity senses a disturbance but cannot pinpoint the anomaly, choosing to let it be for now.\nIn a world filled with boundless anomalies, endless opportunities, and unimaginable powers, Xinli's revival marks the start of a perilous climb toward ultimate power. Only those with unwavering determination and a will of iron can hope to reach the zenith of this world, where even the most divine beings have yet to venture.","description_hash":8240201958798022602},{"title":"Myosotis","fiction_id":"88002","link":"https:\/\/www.royalroad.com\/fiction\/88002\/myosotis","tags":["War and Military","Psychological","Female Lead","Tragedy","Fantasy","Mystery","Male Lead","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":17,"view_count":65,"chapters_count":2,"last_update":1718216880,"description":"Following a journalist by the name of Seron the Scribbler, the history of a gruesome war is uncovered from a most unlikely perspective, that of a goblin. It's a story layered from three points of views, which eventually leads to an ambiguous state of things, as the peaceful state of the three countries may rest on a mountain of innocent corpses.","description_hash":-3609751278559023223},{"title":"Granny's SETI Goblin","fiction_id":"88001","link":"https:\/\/www.royalroad.com\/fiction\/88001\/grannys-seti-goblin","tags":["Psychological","Female Lead","Sci-fi","Contemporary","First Contact"],"lable":"Original","following_count":1,"rating":5.0,"page_count":11,"view_count":115,"chapters_count":2,"last_update":1717835551,"description":"Aine is on her way to a nursing home placement when her granddaughter gives her a toy goblin, but SETI has other ideas.","description_hash":-8863584326743273759},{"title":"The Runic Alchemist","fiction_id":"88000","link":"https:\/\/www.royalroad.com\/fiction\/88000\/the-runic-alchemist","tags":["GameLit","Portal Fantasy \/ Isekai","Progression","Ruling Class","Male Lead","Action","Adventure","Fantasy","Romance","Reincarnation","Strong Lead","Magic","High Fantasy","Mythos","Attractive Lead"],"lable":"Original","following_count":29,"rating":4.33,"page_count":76,"view_count":2432,"chapters_count":15,"last_update":1718597306,"description":"Ben, a postgraduate chemistry student, envisions a future where science unlocks the secrets of the universe. But fate has other plans. In a sudden twist, Ben dies and awakens in a strange new world, reborn as a five-year-old boy named Damian Sunblade.\nDamian's joy at being part of a noble family is short-lived. His family, valuing gold over blood, sells him off to another noble house to be groomed as a homemaker husband, a mere pawn in their political games. Struggling with his new reality and the remnants of his past life’s knowledge, Damian refuses to succumb to his fate.\nIn his new household, Damian discovers that this world is governed by magic circles, Runic symbols wielding immense power. Driven by his scientific curiosity, Damian begins to experiment. Applying the laws of physics to the Rune symbols, he deciphers their secrets and invents his own unique form of magic. \nHowever, The family that bought him has their own plans for him, seeing Damian as a valuable tool to enhance their power. But Damian, ever the independent spirit, has dreams beyond servitude. He longs for freedom, a place to call his own—a life where he can use his talents without restraint.\nAnd so Damian devises a daring plan to escape. His journey is fraught with danger and intrigue, as he navigates a world filled with mystical creatures, powerful adversaries, and ancient secrets. Along the way, he forges alliances and battles enemies, all while refining his magical and scientific skills.\nIn \"The Runic Alchemist,\" follow Damian Sunblade’s epic quest for independence and self-discovery. Witness his transformation from a forsaken child to a formidable Alchemist, determined to carve out an extraordinary future for himself in a world teeming with infinite possibilities.","description_hash":-4043755044603817970},{"title":"RED STRINGS: IF FATE WISHES","fiction_id":"87999","link":"https:\/\/www.royalroad.com\/fiction\/87999\/red-strings-if-fate-wishes","tags":["Comedy","Romance","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":51,"view_count":570,"chapters_count":14,"last_update":1718280962,"description":"Lisa, a introverted Game designer, finds her world upended by Luka, a free-spirited traveler with eyes that hold distant horizons. Stolen moments turn into shared journeys. Their connection deepens as they peel back layers, each revealing a hidden vulnerability beneath the surface. Just as love blooms, a twist of fate throws their newfound happiness into question. Will their love blossom into forever, or will their paths diverge under unexpected circumstances?","description_hash":8969060604422430632},{"title":"The Skill Forger","fiction_id":"87998","link":"https:\/\/www.royalroad.com\/fiction\/87998\/the-skill-forger","tags":["Virtual Reality","Dungeon","Comedy","Male Lead","Adventure","Fantasy","Romance","LitRPG","Magic","Progression","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":36,"rating":5.0,"page_count":89,"view_count":1860,"chapters_count":12,"last_update":1718600259,"description":"Bob Kaiser just got his virtual hands on a new game simply known as The World. He's about to discover that it's very different from any game he's ever played. Also, there might still be some hiccups in the code.","description_hash":-231308995493114172},{"title":"Beads of Time [Short story | Fantasy\/Science Fiction]","fiction_id":"87997","link":"https:\/\/www.royalroad.com\/fiction\/87997\/beads-of-time-short-story-fantasyscience-fiction","tags":["Male Lead","Sci-fi","Fantasy","Mystery","Short Story","Low Fantasy","Soft Sci-fi"],"lable":"Original","following_count":2,"rating":5.0,"page_count":21,"view_count":805,"chapters_count":7,"last_update":1718155817,"description":"In Kanne's tribe, what separates adults from children is owning and mastering the N'Kele -- a strange item that allows one to see through time. And yet, as Kanne is about to find out, not all N'Keles are created the same.\nWhat to expect:\nA soft Science-Fiction short story with a fantasy feel.\nFor more immersion:\nThis story, illustrated and narrated, is also available on my youtube. I highly recommend enjoying this story in video form, as I put a lot of effort into conveying the atmosphere.","description_hash":-4372072038404903714},{"title":"Look After Groznokk","fiction_id":"87996","link":"https:\/\/www.royalroad.com\/fiction\/87996\/look-after-groznokk","tags":["GameLit","Psychological","Female Lead","Slice of Life","Strong Lead","Fantasy","Short Story","Magic","First Contact"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":44,"chapters_count":1,"last_update":1717745021,"description":"Many years ago, Cecille took an oath to defend the innocent and smite the wicked. \nBut on the day a horde of goblins attacked her village, everything Cecille knew about innocence and wickedness was called into question.  In the aftermath of the raid, Cecille found an elderly goblin cradling a newborn. \nThe goblin grandmother departed from the world, leaving behind her grandson and three words: \"Look After Groznokk.\"\nA tale of finding humanity in the nonhuman, of love, of forgiveness, and of redemption.\n[Participant in the June 2024 Royal Road Community Magazine Contest]","description_hash":-3644481673844336297},{"title":"House Braedon's Rise From Ashes","fiction_id":"87995","link":"https:\/\/www.royalroad.com\/fiction\/87995\/house-braedons-rise-from-ashes","tags":["LitRPG","Progression","Ruling Class","Multiple Lead Characters","Adventure","Fantasy","Strategy","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":23,"chapters_count":1,"last_update":1717744884,"description":"House Braedon is a newly founded minor power in the feudal world of Lestrid. After the doom of house Markad, House Braedon is cast away to toil away on a fringe island of the continent. They have nothing to their name and are thought to not last. Baron Mael, however plans to lead his house to prosperity, and avenge his half-brother's lost house. As he says, though house Morkad may have burned to the ground, \"An enemy can still choke on ash.\"","description_hash":3878965175281605333},{"title":"Forever","fiction_id":"87993","link":"https:\/\/www.royalroad.com\/fiction\/87993\/forever","tags":["LitRPG","Reincarnation","Progression","Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":4,"rating":0.0,"page_count":27,"view_count":256,"chapters_count":3,"last_update":1718294401,"description":"A man wakes up in the forest all alone, the last thing he remembers is falling asleep. The forest is pleasant, and the giant redwood trees make it a sight to behold. But as he tries to leave the clearing he found himself in, a menu appears with impossible information on it. He is completely, and utterly, alone. His life expectantly should be decreasing rapidly, but he just can't seem to stay dead.","description_hash":-7245006525505699127},{"title":"All For The Love Of Bread","fiction_id":"87992","link":"https:\/\/www.royalroad.com\/fiction\/87992\/all-for-the-love-of-bread","tags":["Comedy","Multiple Lead Characters","Slice of Life","Fantasy","Romance","Male Lead","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":18,"view_count":64,"chapters_count":2,"last_update":1717895294,"description":"Living in a tree by oneself has a way of making one rather lonely. Who could blame Varavere if she's a little odd, so what if all the nearby villages are terrified at the mere mention of her. When Owain, a bumbling baker, seeks her out to save his sister; neither could have imagined the romance that would bloom all because Varavere has a sweet-tooth and Owain has a tendency not to think things through.","description_hash":-531470337382486811},{"title":"ACCISMUS","fiction_id":"87991","link":"https:\/\/www.royalroad.com\/fiction\/87991\/accismus","tags":["Anti-Hero Lead","Space Opera","War and Military","Grimdark","Multiple Lead Characters","Action","Adventure","Drama","Sci-fi","Male Lead","Female Lead","Strategy","Villainous Lead","Ruling Class","Technologically Engineered","Soft Sci-fi"],"lable":"Original","following_count":2,"rating":0.0,"page_count":34,"view_count":113,"chapters_count":2,"last_update":1718028080,"description":"In the far reaches of the future, the universe in its grand totality submits to the will of the Seventh-Venerated Emperor Volsif XCVII's Great Domain. It is a time of abundant prosperity and of miserable deprivation; of gentle peace and of devastating war. And it is within the backwater fiefdom of Callisto that a man born with everything and a woman born with nothing - both crippled by circumstance beyond their control - will try to carve the shapes of their own existences onto the uncaring world around them as, all the while, the looming hand of the all-knowing Emperor closes its jealous grip tighter and tighter over the future of the known universe.\n\nIt is a fool's gambit, they know.\n\nBut still they must try.","description_hash":-1103686150504380903},{"title":"Our Struggles","fiction_id":"87990","link":"https:\/\/www.royalroad.com\/fiction\/87990\/our-struggles","tags":["Multiple Lead Characters","Slice of Life","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":61,"chapters_count":2,"last_update":1718044199,"description":"These are just some short stories about struggles of many kinds faced by people. Some of these stories may get follow-ups, but most of them are stand-alone that anyone can read and digest.","description_hash":-7050181144687104781},{"title":"Biotechnology in a World of Magic","fiction_id":"87989","link":"https:\/\/www.royalroad.com\/fiction\/87989\/biotechnology-in-a-world-of-magic","tags":["Reincarnation","Male Lead","Action","Adventure","Fantasy","Magic","Genetically Engineered ","Technologically Engineered"],"lable":"Original","following_count":9,"rating":4.75,"page_count":31,"view_count":650,"chapters_count":6,"last_update":1718522406,"description":"Originally an accomplished biotechnologist in his previous life, Ryder wakes up to discover that he has been reincarnated, and that too in a magicless body in a world of magic. Mages with their extraordinary magic and guards with superhuman strength, Ryder finds himself helpless in the face of adversary.\nWill Ryder be able to use his advanced knowledge and experience as a biotechnologist from his previous life to help him survive this harsh setting? Just how will he make up for the lack of magic, something that is crucial for survival and a necessity to become strong.","description_hash":-5699961279754483938},{"title":"Big Time, A Little.","fiction_id":"87988","link":"https:\/\/www.royalroad.com\/fiction\/87988\/big-time-a-little","tags":["Comedy","Multiple Lead Characters","Contemporary","Slice of Life","Romance","Satire","School Life","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":12,"view_count":23,"chapters_count":1,"last_update":1717735985,"description":"Big Time, A Little., follows three friends as they navigate the big-nervy universe of high school. Conrad is invisibly in love, and danger danger. Jon is distracted by a teacher's impossible good looks, holy crap and everything. Joel ponders the work of coming out of the closet, dip a toe in it, baby. Funny, smart, and irreverent, Big Time, A Little., provides an honest entry into the world of being a contemporary teenager.","description_hash":-2297988501674336145},{"title":"Carefree Immortal ","fiction_id":"87987","link":"https:\/\/www.royalroad.com\/fiction\/87987\/carefree-immortal","tags":["Reincarnation","Anti-Hero Lead","Xianxia","Male Lead","Secret Identity","Action","Fantasy","Romance","Mystery","Martial Arts","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":16,"view_count":192,"chapters_count":4,"last_update":1717754208,"description":"In the vast expanse of the universe, there exists a unique connection between heaven and earth and the origins of all living beings. the expanse filed with chaos and darkness, and amidst this chaotic universe, a dim light pierces through infinite darkness, making its way towards an ordinary village. No one knows what this light is or where it came from, but rumors abound. Some say it's alost soul searching for its place in the world, while others believe it to be a precious treasure that will bring wealth and prosperity to whoever finds it. But as the light draws closer, its true nature remains a mystery. Is it a harbinger of hope, or a bringer of doom?","description_hash":-8709753437697596916},{"title":"Equilíbrio das Sombras e Luz [Portuguese]","fiction_id":"87986","link":"https:\/\/www.royalroad.com\/fiction\/87986\/equilibrio-das-sombras-e-luz-portuguese","tags":["LitRPG","Reincarnation","Progression","Action","Adventure","Fantasy","Romance","Magic","GameLit"],"lable":"Original","following_count":1,"rating":0.0,"page_count":13,"view_count":232,"chapters_count":6,"last_update":1718394556,"description":"Lucas, um jovem ávido por jogos de RPG, vive uma rotina monótona até que um acidente inesperado ceifa sua vida. Ao abrir os olhos novamente, ele se encontra diante de uma entidade enigmática, conhecida como O Guardião das Almas. Este ser poderoso lhe oferece uma escolha: aceitar o fim ou ser reencarnado em um novo mundo, onde magia e aventuras são reais, moldados por um sistema de RPG. Lucas, fascinado pela oportunidade, escolhe a reencarnação.\nReencarnado como Orion Umbros, ele desperta em um corpo jovem e vigoroso, imerso em um mundo onde habilidades e poderes são regidos por um sistema similar aos RPGs que ele tanto amava. O Guardião das Almas concede a Orion Umbros um dom raro e poderoso: a magia de luz e trevas. Com essas habilidades dualísticas, ele possui o potencial para curar e destruir, para trazer esperança ou desespero.","description_hash":1333345051292965621},{"title":"Imperial Swordsman of Royal Academy [The Duke's Unlikely Heir]","fiction_id":"87985","link":"https:\/\/www.royalroad.com\/fiction\/87985\/imperial-swordsman-of-royal-academy-the-dukes","tags":["LitRPG","Progression","War and Military","Male Lead","Slice of Life","Action","Adventure","Fantasy","School Life","Strong Lead","Magic","GameLit","High Fantasy","Ruling Class"],"lable":"Original","following_count":36,"rating":4.33,"page_count":136,"view_count":6455,"chapters_count":25,"last_update":1718600761,"description":"Brutality got him through a war. Now, charm, wit, and just a hint of his old ruthlessness might be what gets him through high society. But can a veteran soldier truly become a nobleman? Even when the Duke of the Blue Star names him as heir? All Reinhardt Blazkowicz knows is that he faces his biggest challenge yet. A boarding school for nobles.","description_hash":6647635273325434025},{"title":"The Answer Is Oblivion","fiction_id":"87984","link":"https:\/\/www.royalroad.com\/fiction\/87984\/the-answer-is-oblivion","tags":["Urban Fantasy","Progression","Martial Arts","Male Lead","Slice of Life","Action","Drama","Fantasy","Romance","Supernatural","Strong Lead","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":13,"view_count":76,"chapters_count":2,"last_update":1718314230,"description":"Taron Malvis, a seventeen-year-old boy burdened by a mysterious, lifelong illness, has only ever desired one thing: anointment. A Way to Be Blessed by the Deity-like The Ones Above, Granting the anointed a medium that is tied to the soul. The blessing, which takes countless and varies vastly in power based on the individual. Be a weapon, an piece of clothing, a sigil that when summoned appears on the skin, a piece of armour, or for the unlucky ones, even a toothbrush. All powerful beings beyond comprehension have a sense of humor too. But the anointment also promises enhanced physical abilities that only grow with time, a fierce mind, and a body that will slowly cease to age. And many more benefits. That is, if you live long enough to claim them.\nFor Taron, it represents hope and an end to his suffering.\nHowever, on the night of his anointment, his blessing was nothing like he thought it would be. And tragedy strikes in a way that nearly shatters his mind. Forced to flee from his adoptive family, Taron is plunged into a dark world of pain and betrayal. As he struggles to survive, he uncovers hidden truths about who it was he called home with, the mystery of his birth mother, and his real father's grand plan for him. Through unimaginable hardship, Taron must find the power and purpose to become the man his father always believed he could be, and certainly more than he himself ever thought he'd be.\n\n-This is my first novel and will be a slow burn progression urban fantasy, the world is a mixture of our own and one with the existence mana.","description_hash":2237340332334675862},{"title":"Sonder ","fiction_id":"87983","link":"https:\/\/www.royalroad.com\/fiction\/87983\/sonder","tags":["Progression","Comedy","Female Lead","Drama","Romance","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":35,"chapters_count":1,"last_update":1717735154,"description":"\"It is through the destruction of our hearts that we come to truly appreciate the inherent beauty that exists within the world.\"\nMagnolia's reputation for being daring and 'promiscuous' is often portrayed as affluent, arrogant, and self-centred, causing those to wonder if there's more to her than meets the eye or if she's just putting on a facade.\nMagnolia finds herself drawn in by an irresistible dare, leading to Elias Cardenas, who is typically reserved, finding himself entangled in her world.\nElias Cardenas is a quiet and solitary individual, often seen clutching a sketchbook, who prefers to avoid getting involved in any unnecessary drama. \nHowever, everything changes when he unexpectedly becomes the focal point of a mysterious game that unfolds around him.","description_hash":5164059300151410578},{"title":"Depth of Madness (Book 2 of the Madness Series) ","fiction_id":"87982","link":"https:\/\/www.royalroad.com\/fiction\/87982\/depth-of-madness-book-2-of-the-madness-series","tags":["War and Military","Multiple Lead Characters","Action","Adventure","Fantasy","Supernatural","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":91,"view_count":330,"chapters_count":11,"last_update":1718627340,"description":"In a realm where gods and their chosen champions vie for power, an unprecedented threat emerges, demanding unity among unlikely allies.\n\n Ishar, a Kolotian and the champion of the God of Chaos, disappears into the desert seeking to liberate his hidden kin. His madness, traded for his chaotic power, makes his quest as unpredictable as it is vital.\n\nRehny, housing the Goddess of Love, Nyawe, seeks nothing more than a quiet life of farming, far from the turmoil of civilization. Despite his abandonment of the sword and his title as commander of Binoria’s legions, fate conspires to draw him back into a conflict he cannot escape.\n\nMairek, the champion of the God of Space and Time, finds himself bearing the overwhelming expectations of the kingdom of Talisi. As plans hinge on his success, he faces relentless pressure, all while Time itself seems bent on his destruction.\n\nIn the kingdom of Remu, Edda, newly promoted from spy to knight, embarks on a critical mission to awaken the slumbering Goddess Alietsi. If she fails, she must seek aid from other champions to prepare Remu for an impending assault on a weakened Binoria.\n\nHalf-siblings Dahli and Masutap, champions of the Goddess of Order, find themselves on opposite sides of a devastating conflict. As queen of Binoria, Dahli is determined to thwart their brother Leba and his dark patron, Locha, the bringer of endless night. With annihilation looming, her resolve is unyielding, yet the path to salvation is fraught with peril.\n\nFar across the Rankf Sea, in the hidden land of Basi Haya, Kaza, a member of the exiled Rad es Maalas, embarks on his own journey, one that will reveal his unexpected role as a key figure in the unfolding events. As Kaza’s path to becoming the champion of Sin is revealed, his emergence will have profound implications for the realm, even as many remain unaware of his existence.\n\nAs these champions converge, their fates intertwined, they must set aside their differences to confront the ultimate threat: Leba and his malevolent deity, Locha. With the very fabric of their realm at stake, unity becomes their only hope against the overwhelming power of total obliteration.\n\nIn this epic continuation of the saga, alliances will be tested, destinies forged, and the line between order and chaos will blur as heroes and villains clash in a battle for the soul of the world.","description_hash":5961944289491992220},{"title":"Space Core 1%","fiction_id":"87981","link":"https:\/\/www.royalroad.com\/fiction\/87981\/space-core-1","tags":["LitRPG","Dungeon","Non-Human Lead","Sci-fi","Action","Fantasy","Technologically Engineered","Hard Sci-fi","Progression","Artificial Intelligence"],"lable":"Original","following_count":8,"rating":3.5,"page_count":31,"view_count":520,"chapters_count":5,"last_update":1718452801,"description":"Organic material is sought after for many centuries of galactic societies combating factions, and mercenary groups. \nSpace fights loosen ship parts and other organic materials, aka bodies, blood and brain materials that are gathered by space stations and pods in order to power itself, protect itself, and power resources of protective traps, puzzles, and guard-bots. That organic material is also sought after by those factions and teams to sell to many high bidders since organic material can be used for so many things, galactically accepted. That organic material processes its defence with the help of AI from the space pod \/ station to prevent teams from collecting it to do who knows what, while if the team or station is popular enough, billions watch in delight or horror.","description_hash":594485663287723054},{"title":"The Samsara Agency","fiction_id":"87980","link":"https:\/\/www.royalroad.com\/fiction\/87980\/the-samsara-agency","tags":["Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","War and Military","Male Lead","Action","Adventure","Fantasy","Strategy","Low Fantasy","Ruling Class"],"lable":"Original","following_count":2,"rating":0.0,"page_count":2,"view_count":39,"chapters_count":1,"last_update":1717734152,"description":"Julio Lionheart shows up to an interview only to be recruited into The Samsara Agency. His job to get isekai'ed to other worlds gather karma and fate, die, get paid and repeat. \n\nHis first world is a low magic medieval fantasy world, he'll have modern gear and supplies a few modern weapons along with a body tune up to Peak Olympics Level Human. He'll have a power or to but nothing overpowered and that's it. Oh not to mention a large dog and a mule to carry more stuff. His first world will last a while, don't be surprised if he doesn't kick the bucket till quite late in life, we'll see though. I plan to take as long as I like on each world and this book won't have any schedule but that might change who knows. Don't expect anything though. Ciao. \n\nAlso posted on webnovel.com","description_hash":2898549219576599743},{"title":"Granny ... Not?","fiction_id":"87979","link":"https:\/\/www.royalroad.com\/fiction\/87979\/granny-not","tags":["Comedy","Female Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":31,"chapters_count":1,"last_update":1717734114,"description":"Little Eugenia bewails the fact that she doesn't have any grannies or grandmas. Will her parents set things right for her?","description_hash":3036886303419449622},{"title":"Release me","fiction_id":"87978","link":"https:\/\/www.royalroad.com\/fiction\/87978\/release-me","tags":["Comedy","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":6,"view_count":65,"chapters_count":1,"last_update":1717734099,"description":"For the crime they committed the divine judgement is upon the two archangels, will they be sperd or will they suffer for the rest of there life.","description_hash":-8476603655271761734},{"title":"Empty Shell","fiction_id":"87976","link":"https:\/\/www.royalroad.com\/fiction\/87976\/empty-shell","tags":["Psychological","Slice of Life","Drama"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":33,"chapters_count":1,"last_update":1717733914,"description":"Born into a chaotic family, a young boy's life takes a dark turn as he is constantly faced with the cruelty of life. Spiraling into theft and isolation, his faith in family and society crumbles. Bullied at school and constantly criticized, he becomes isolated from society, finding solace only in his revenge plots. Despite momentary attempts at self-improvement, he is haunted by his past, his heart hardened due to mistrust and resentment.Witness the tragic journey of a youngster transformed into an empty shell by constant trauma as he navigates the perilous path between grief and retribution.","description_hash":6914392163251958203},{"title":"Root for the Runt","fiction_id":"87975","link":"https:\/\/www.royalroad.com\/fiction\/87975\/root-for-the-runt","tags":["LitRPG","Urban Fantasy","Anti-Hero Lead","Grimdark","Multiple Lead Characters","Adventure","Fantasy","Contemporary","Supernatural","Male Lead","Non-Human Lead","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":105,"view_count":286,"chapters_count":7,"last_update":1717897630,"description":"PG13 fantasy story. \nLite LitRPG, Lite reading of character stats, slow progression, no easy flashy magic items and crushing abilities. \nA weakened werewolf turns normal. Seeing the corruption and destruction of Gaia in modern times, when this werewolf cub learns of what the spirits have planned for him, he will do what is needed to fight for Gaia. The other werewolves see his duty as a blasphemy, he knows better.","description_hash":8855983138887332221},{"title":"Requiem of the Lost Exiled","fiction_id":"87974","link":"https:\/\/www.royalroad.com\/fiction\/87974\/requiem-of-the-lost-exiled","tags":["War and Military","Martial Arts","Male Lead","Tragedy","Action","Historical","Romance","Magic","Low Fantasy","High Fantasy","First Contact"],"lable":"Original","following_count":3,"rating":0.0,"page_count":103,"view_count":1189,"chapters_count":23,"last_update":1718379813,"description":"In the unforgiving world of the Exiled Lands, where the desperate and the damned roam, one man seeks redemption through the crucible of darkness. Su, haunted by the ghosts of his past and driven by a thirst for vengeance, finds himself under the tutelage of  a mysterious figure with powers beyond comprehension. As Su embarks on a harrowing journey of self-discovery and survival, he must confront the darkest depths of his own soul and unearth the strength within to face the demons that lurk in the shadows. Will he emerge from the abyss unscathed, or will he be consumed by the darkness that threatens to consume him? \"Requiem of the Lost Exiled\" is a gripping tale of redemption, betrayal, and the enduring power of the human spirit in the face of adversity.","description_hash":-6900156666361807705},{"title":"Old School: A Goblins & Grandmas OSR LitRPG","fiction_id":"87973","link":"https:\/\/www.royalroad.com\/fiction\/87973\/old-school-a-goblins-grandmas-osr-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Multiple Lead Characters","Strong Lead","Adventure","Fantasy","Short Story","Satire","Female Lead","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":20,"rating":5.0,"page_count":72,"view_count":1010,"chapters_count":9,"last_update":1718590164,"description":"A short time ago, in a game store not so far away, four gamer grandmas gathered. What's that, you ask? Were the grandmas themselves gamers, or are they grandmothers of gamers? Both, of course, though as responsible grandmothers, their reasons for showing up to the anniversary event for the world's self-proclaimed most majestic role-playing game is as chauffeurs, glorified babysitters, snack-bearers, and, well, whatever it was that their grandchildren's parents were too busy to do this weekend.\nThen the announcer chanted the incantation “Ngathf Xygag, ngathf Nosenra, ph’nglui mgwl’nfah Roomkcalb Nosenra-Xygag wgah’nagl ngathf!” out of an original copy of the now-infamous cult classic anti-gaming pamphlet  Demonic Duress & Deadly Devil Danger. Stuff happened.Now, the gamer grannies must reunite and band together to, well, go take care of the kids. Which, one must admit, is a little more difficult when the problem at hand involves goblins rather than making sure home-baked cookies are compatible with everyone's nut allergies.","description_hash":-5013347762209683009},{"title":"The call of shadowns : David's Dilemma","fiction_id":"87972","link":"https:\/\/www.royalroad.com\/fiction\/87972\/the-call-of-shadowns-davids-dilemma","tags":["Martial Arts","Male Lead","Contemporary","Slice of Life","Adventure","Romance","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":69,"view_count":269,"chapters_count":7,"last_update":1718326690,"description":"In a seemingly peaceful small city, David's father, an ordinary citizen, became the \"scapegoat\" for anti-government crimes in a well-planned frame-up and was arrested.After David learned the truth, he was determined to avenge his father and all the citizens who had been treated unfairly.After going through a series of events, David reflected on everything he had experienced. He maintained hope and believed that everyone's actions can bring positive changes to society. He firmly believes that this small city has been changed because of their efforts, leaving traces of hope.","description_hash":4930222999236515003},{"title":"Gilda and The Game: The Party Starts After Doomsday","fiction_id":"87971","link":"https:\/\/www.royalroad.com\/fiction\/87971\/gilda-and-the-game-the-party-starts-after-doomsday","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Multiple Lead Characters","Sci-fi","Action","Fantasy","Romance","GameLit"],"lable":"Original","following_count":1,"rating":5.0,"page_count":31,"view_count":292,"chapters_count":6,"last_update":1718391576,"description":"Gilda has no idea she’s only in the tutorial of The Game. She’s using her rogue skills to level up her cooking and run her inn. But when the tutorial ends and her son vanishes, swapping places with a former king, Gilda knows she can’t let him out of her sight until she finds her boy. Adventuring together, they’ll portal to the more technologically advanced Earth, team up with other players, pry into the secrets of the aliens running The Game, and possibly save a few worlds in the process.","description_hash":2596399927311170922},{"title":"Unwanted Scar","fiction_id":"87970","link":"https:\/\/www.royalroad.com\/fiction\/87970\/unwanted-scar","tags":["Drama","Action","Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":14,"view_count":204,"chapters_count":3,"last_update":1718580984,"description":"A young goblin who has had his life destroyed by the wrath of an out-of-touch king, after being saved by a mysterious figure, lives with the humans in the Grishwolds. Treated as a traitor by his own kind and a creature unwanted by humans. He seeks to give meaning to his life, to find the reason and meaning for which he was saved, and to do something good for this sinful world.","description_hash":8419117674569562623},{"title":"Tork and the Wolves","fiction_id":"87969","link":"https:\/\/www.royalroad.com\/fiction\/87969\/tork-and-the-wolves","tags":["Anti-Hero Lead","Comedy","Non-Human Lead","Adventure","Fantasy","Short Story","Male Lead","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":7,"view_count":42,"chapters_count":1,"last_update":1717716137,"description":"Far in the hills away from the hustle and bustle of the main roads of the war torn nation of Crimson Rock, there resided a clan of orcs. They lived an idyllic life. Crushing trees, crushing stones, and crushing the bones of any hunters who wandered too close to the village. It was a time of peace.Which is exactly why Tork hated it.","description_hash":911575255185861336},{"title":"PROJECT CELESTO∞: Idia's Path (English ver.)","fiction_id":"87968","link":"https:\/\/www.royalroad.com\/fiction\/87968\/project-celesto-idias-path-english-ver","tags":["Time Travel","Super Heroes","Female Lead","Sci-fi","Action","Adventure","Fantasy","Supernatural","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":2,"rating":4.0,"page_count":3,"view_count":49,"chapters_count":1,"last_update":1717716115,"description":"×•|×•×|•×•×•|×•×|•×•×•|×•×|•×•×•|×•×|•×•×•|×•×|•×•×•|×•×|•×•×•|×•×|•×• In a corner of the cosmos, born from the void emerges the CELESTO∞ A universe with a colossal and infinite chronology. ×•|×•×|•×•×•|×•×|•×•×•|×•×|•×•×•|×•×|•×•×•|×•×|•×•×•|×•×|•×•×•|×•×|•×•The story is in its initial development stage; I began working on it on [25\/5\/2024 12:55].","description_hash":4888038729127365720},{"title":"Maggots with anger ","fiction_id":"87967","link":"https:\/\/www.royalroad.com\/fiction\/87967\/maggots-with-anger","tags":["Psychological","Tragedy","Horror","Mystery"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":37,"chapters_count":1,"last_update":1717715861,"description":"The man would always bother him, and coax him with words. But this time, it was different. The words he spouted out weren't as friendly.","description_hash":4187504028119818978},{"title":"A New Destiny (Star Wars SI)","fiction_id":"87966","link":"https:\/\/www.royalroad.com\/fiction\/87966\/a-new-destiny-star-wars-si","tags":["Portal Fantasy \/ Isekai","Non-Human Lead","Strong Lead","Adventure","Fantasy","Reincarnation","Female Lead"],"lable":"Fan Fiction","following_count":23,"rating":4.83,"page_count":59,"view_count":1784,"chapters_count":10,"last_update":1718632836,"description":"She was reborn with memories of a story that has yet to unfold. The Force has clearly found a place for her, but where will this new story lead? Follow Anika as she tackles the galaxy to the best of her ability, while also trying to change whatever destinies she can along the way.\n\nA\/N: This is my first time trying to write anything in years, and my first time trying both fanfic and SI. Hopefully, I'll be able to keep it going if there is an interest in reading my story. :)","description_hash":369879605779031659},{"title":"Isrelm","fiction_id":"87965","link":"https:\/\/www.royalroad.com\/fiction\/87965\/isrelm","tags":["Progression","War and Military","Male Lead","Adventure","Fantasy","Romance","Strategy","Ruling Class"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":30,"chapters_count":1,"last_update":1717715849,"description":"While lords vie for supremacy, a boy becomes a king.","description_hash":-5489677779910896412},{"title":"Guardians of Greenvale","fiction_id":"87964","link":"https:\/\/www.royalroad.com\/fiction\/87964\/guardians-of-greenvale","tags":["Female Lead","Sci-fi","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":97,"chapters_count":2,"last_update":1718602773,"description":"A group of Grandmas living on an isolated farm discover an infestation of Goblins on their property.  Wanting to stay in their new home, the creatures make themselves useful to the women and some peace is found.When hunters come seeking the Goblin tribe, the old women must band together to protect their farm and their new friends.","description_hash":-1441344599507834560},{"title":"Shadow of sentience","fiction_id":"87963","link":"https:\/\/www.royalroad.com\/fiction\/87963\/shadow-of-sentience","tags":["Reincarnation","Psychological","Male Lead","Action","Fantasy","Mystery","Magic","Mythos"],"lable":"Original","following_count":2,"rating":0.0,"page_count":18,"view_count":465,"chapters_count":8,"last_update":1718055325,"description":"Imagine waking up one day to find yourself in the middle of a post-apocalyptic world full of horror, mysticism and corruption. Was this the other world life you were wishing for?","description_hash":-6550968500181466362},{"title":"A Return to the Golden Age: Magistoid Rex Regulus","fiction_id":"87962","link":"https:\/\/www.royalroad.com\/fiction\/87962\/a-return-to-the-golden-age-magistoid-rex-regulus","tags":["Time Travel","Urban Fantasy","Progression","Post Apocalyptic","War and Military","Action","Adventure","Fantasy","Sci-fi","Cyberpunk","Supernatural","Male Lead","Strong Lead","Non-Human Lead","Magic","High Fantasy","Steampunk","Ruling Class","Technologically Engineered","Soft Sci-fi"],"lable":"Original","following_count":2,"rating":0.0,"page_count":97,"view_count":416,"chapters_count":15,"last_update":1718068729,"description":"Earth has been invaded by the mystical powered living machines known as the Magistoids, ravaging almost all of the whole planet within 5 years. Makino J. Mizukawa was with the last human resistance along with rebel Magistoids helping them in their crusade against the Magistoid armadas. But a last ditch effort to destroy them led Makino to be hurled back in time to the planet of the Magistoids in their Golden Ages, as a Magistoid himself.\nAlso available in Tapas and Webnovel. Here are the links:\nhttps:\/\/m.tapas.io\/series\/A-Return-to-the-Golden-Age-Magistoid-Rex-Regulus\/info\nhttps:\/\/m.webnovel.com\/book\/a-return-to-the-golden-age-magistoid-rex-regulus_28890246700325205\nMy email address: [email protected]","description_hash":-7718218308191030234},{"title":"the United fleets","fiction_id":"87961","link":"https:\/\/www.royalroad.com\/fiction\/87961\/the-united-fleets","tags":["Strategy","Male Lead","Sci-fi","Action","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":24,"chapters_count":1,"last_update":1717715478,"description":"Casen Yang a 15 year old boy joins a new army thats not tied to any country only their first mission goes wrong and they end lost in space. can they find their way back to Earth and can they survive in the hostile environment called space?","description_hash":485727956151148640},{"title":"X-season 1","fiction_id":"87960","link":"https:\/\/www.royalroad.com\/fiction\/87960\/x-season-1","tags":["Progression","Multiple Lead Characters","Action","Adventure","Fantasy","Mystery","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":19,"chapters_count":1,"last_update":1717715462,"description":"In a world where demons roamed the planet, a young kid(X) was discovered in a forest in the middle of nowhere. Read along his adventures, as he makes new bonds of friendship, and uncovers X's past and his identity.","description_hash":-5464618973196123800},{"title":"The Healer Storyteller","fiction_id":"87959","link":"https:\/\/www.royalroad.com\/fiction\/87959\/the-healer-storyteller","tags":["Comedy","Male Lead","Slice of Life","Adventure","Fantasy","Short Story","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":61,"chapters_count":2,"last_update":1717878043,"description":"Lu is a brother and healer, but also a storyteller.\nHere lies a collection of short stories that transcend time and space told by him to help himself out of hard situations in his relatively calm adventure.\n\nEach chapter features a short story I write when my mind is exhausted but still want to distract myself.","description_hash":250129849763792969},{"title":"A Pretty Odd Tale of an Oddly Pretty World","fiction_id":"87958","link":"https:\/\/www.royalroad.com\/fiction\/87958\/a-pretty-odd-tale-of-an-oddly-pretty-world","tags":["Urban Fantasy","Psychological","Female Lead","Slice of Life","Adventure","Fantasy","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":21,"view_count":76,"chapters_count":2,"last_update":1718076823,"description":"Wandering the world, from apparition to apparition, Eri's journey takes her through the stories and lives of those who've willingly, or unwittingly became involved with the supernatural. The story of people, human or inhuman are the center of her travels.  \nNever are their tales woven by her. The decisions are always made by the ones she watches over. She never denies their choices or their way of life, but merely observes and keep things in order. And though at times she might find it fit to provide discussion, she simply allows the world to be the way it is. For it is the world's imperfections that make it perfect. This odd world is nevertheless pretty to see.\n\n-------","description_hash":-1409081216783372526},{"title":"Mercenary Recruitment","fiction_id":"87956","link":"https:\/\/www.royalroad.com\/fiction\/87956\/mercenary-recruitment","tags":["Action","Adventure","Fantasy"],"lable":"Original","following_count":10,"rating":3.75,"page_count":153,"view_count":4057,"chapters_count":39,"last_update":1718586004,"description":"Travis is a young construction worker who recently lost his last remaining family member. With all of his friends off to college and the lack of companionship, the young man has been lonely for a while. The ability that the gods gave him during the start of the multiversal rifts. The ability to recruit \"Mercenaries.\" Will be his crutch, an ability that answers both of his problems, survival and companionship.This webnovel is available both here in Royal Road and on Webnovel! If you like it please consider dropping a comment or two!","description_hash":4980448380608824073},{"title":"The Cipher","fiction_id":"87955","link":"https:\/\/www.royalroad.com\/fiction\/87955\/the-cipher","tags":["Strategy","Male Lead","Strong Lead","Drama","Action","Adventure","Fantasy","Supernatural"],"lable":"Original","following_count":1,"rating":4.0,"page_count":60,"view_count":509,"chapters_count":13,"last_update":1718633439,"description":"In the sleepy City of Atherium, a mysterious phenomenon began to unfold. Whispers of an extraordinary power—the ability to manipulate locks and keys—swept through the halls of City. As curiosity turned to obsession, a cruel hierarchy emerged, Chaos and fear reigned as the City’s fragile balance was shattered and the power spread.\nThe main character, Lockey, finds himself at the centre of this mysterious phenomenon. As he grapples with his newfound power, he must navigate the treacherous social landscape of his school and confront the darkness that lurks within the hearts of those around him.\nWelcome to the world of \"The cipher\"—a story of resilience, self-discovery, and the strength that lies within us all. I invite you to join our protagonist on a journey through the shadowy halls of Atherium, where the extraordinary and the mundane collide.In this early arc, you'll witness the awakening of a power that reshapes Lockey's reality and sets him on a path of triumph and tragedy. As you follow his story, I hope you'll be drawn into a world that explores the complexities of the human spirit and the consequences of the choices we make.Thank you for embarking on this adventure with Lockey and me. I am excited to share his tale with you and look forward to hearing your thoughts on this riveting journey.","description_hash":-1026354342791983767},{"title":"Grey Horizon: The Inquisitor Chronicles - (Book 1) Back Alley Bloodshed","fiction_id":"87953","link":"https:\/\/www.royalroad.com\/fiction\/87953\/grey-horizon-the-inquisitor-chronicles-book-1","tags":["GameLit","Urban Fantasy","Progression","Anti-Hero Lead","Space Opera","Adventure","Fantasy","Sci-fi","Mystery","Supernatural","Male Lead","Strong Lead","Magic","Grimdark","High Fantasy","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":20,"view_count":24,"chapters_count":1,"last_update":1717682389,"description":"Life in East End ain't exactly what you would call a walk in the park. I should know, I've lived here for longer than most people would believe. But when a routine Quest to hunt down a monster stalking the alleys of the district turns out to be far more than it was billed my life quickly goes from \"not easy\" to \"downright complicated.\" Between drunken Vagrants, angry Dockers, greedy Slum lords, a pissed off Protectorate officer and a gorgeous Artificer, I've got my hands full just trying to keep it all from burying me alive. And to top it all off the Gods damned rent is due and the witch that owns my building ain't known for her patience. \nI ain't getting paid enough for this. \n\n\nHello and welcome to my journey. Grey Horizon is a Hybrid work that includes elements of High Fantasy, Space Travel, Mana-Tech, Noir, Action\/Adventure and GameLit. The book is  a work in progress and at the moment I don't have a dedicated release schedule to share with you. As soon as i can get things settled ill be adding new chapters as quickly as i write them. While the story is plotted through the end if the first book and part of the second, I've deliberately kept that plot fairly loose since my character tend to go off the rails pretty often and the story will just have to follow along to see where their tangents go. I hope you enjoy my book and please feel free to comment with any suggestions or observations.","description_hash":-8439790936882677319},{"title":"Codex of the Future","fiction_id":"87952","link":"https:\/\/www.royalroad.com\/fiction\/87952\/codex-of-the-future","tags":["Portal Fantasy \/ Isekai","Space Opera","Male Lead","Sci-fi","Secret Identity","Action","Adventure","Fantasy","Cyberpunk","Reincarnation","Strong Lead","Magic","High Fantasy","Technologically Engineered","First Contact","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":1,"rating":0.0,"page_count":49,"view_count":537,"chapters_count":7,"last_update":1717765591,"description":"Professor Kai Idris, a Quantum physicist at a prestigious university, spends his nights hidden in his cluttered lab, chasing a forbidden dream. He's building the impossible – a trans-dimensional gateway, a device that can pierce the veil and connect to another universe. Obsessed, he ignores warnings and funding cuts, fueled by the tantalizing whispers of the unknown. Then, one stormy night, the device hums to life, bathing the lab in an otherworldly glow. Kai steps through, leaving behind his world and plunging headfirst into a realm of magic and wonder – a place that only existed on historical and fictional texts. Will he be the greatest threat or the greatest hope?","description_hash":-5211537780562794366},{"title":"THE LAST WORLD","fiction_id":"87951","link":"https:\/\/www.royalroad.com\/fiction\/87951\/the-last-world","tags":["Time Loop","Anti-Hero Lead","Psychological","Secret Identity","Action","Horror","Supernatural","Magic","Low Fantasy","Time Travel"],"lable":"Original","following_count":2,"rating":0.0,"page_count":8,"view_count":208,"chapters_count":5,"last_update":1718241990,"description":"How many times have I traveled across worlds?How many times have I gathered power?I've asked myself how many times now?How many questions have there been?\nThese are the numerous questions our main character has after traveling through different worlds to gather power, all in order to defeat someone named Naval, a person who can travel through time and reality but kills innocent lives. But what can our main character do? Nothing at all? No one has the power to fight him, except by performing the ritual to become the DEVOURER and gathering enough power to defeat him. The main character has tainted himself, accepting to be stained by his own ideals to defeat Naval. And now it's time for him to return to where it all began, a world that started everything, but without Naval and without the agony and guilt in his conscience. However, he has sunk deep into sin. Will he be able to escape this guilt, or will he become something else entirely?","description_hash":6423139156972730884},{"title":"Random Reincarnation[A Litrpg Fantasy Novel]","fiction_id":"87950","link":"https:\/\/www.royalroad.com\/fiction\/87950\/random-reincarnationa-litrpg-fantasy-novel","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Ruling Class","Male Lead","Action","Adventure","Fantasy","Reincarnation","Strong Lead","Magic","High Fantasy","Progression"],"lable":"Original","following_count":71,"rating":4.25,"page_count":124,"view_count":5795,"chapters_count":17,"last_update":1718527846,"description":"When a 21-year-old avid reader of LitRPG and fantasy novels suddenly finds himself reincarnated as a baby in the medieval world of Panora, he faces the daunting task of adapting to his new reality. Despite his infant form, his mind retains the wisdom and knowledge of his previous life, creating a unique struggle to reconcile his mature consciousness with his helpless body.\nAs Ethan grows, he becomes acutely aware of the world’s magical system, which shapes the lives of its inhabitants. This system grants individuals distinct traits and abilities, determined by a combination of innate potential and personal growth. Ethan quickly discovers his own remarkable traits, which provide him with extraordinary advantages over his peers. These include a natural affinity for manipulating mana and an intuitive understanding of complex magical skills.\nDriven by an insatiable curiosity and a desire to explore the full extent of his powers, Ethan embarks on a rigorous quest for self-improvement. His journey is characterized by an obsession with honing his skills and a relentless pursuit of knowledge.\n\nChapters will be between 1,500 and 3,000 words, with at least one chapter published every day.\nComments and corrections are welcome and appreciated.","description_hash":-3688777857485136501},{"title":"Bearing through cultivation [A Xianxia evolution litRPG]","fiction_id":"87949","link":"https:\/\/www.royalroad.com\/fiction\/87949\/bearing-through-cultivation-a-xianxia-evolution","tags":["LitRPG","Portal Fantasy \/ Isekai","Xianxia","Non-Human Lead","Action","Adventure","Fantasy","Reincarnation","Male Lead","High Fantasy"],"lable":"Original","following_count":80,"rating":4.71,"page_count":100,"view_count":10498,"chapters_count":27,"last_update":1718560771,"description":"Max was your typical white collar worker, well maybe not really typical, but normal enough. But one day, after a close encounter with a bear, he died. When he woke up he had four little paws and two cute ears. \"I am happy to be alive but: why am I a bear?!\"\n\nWitness the journey of our not so little friend in order to become the best bear he can be in a world of flying swords, cultivation and crazy pill alchemists. All with the help of a system hub to record his progress.","description_hash":8357421000221398711},{"title":"Bumble Boys - The Boys Go Treasure Hunting","fiction_id":"87948","link":"https:\/\/www.royalroad.com\/fiction\/87948\/bumble-boys-the-boys-go-treasure-hunting","tags":["Comedy","Multiple Lead Characters","Slice of Life","Fantasy","Non-Human Lead"],"lable":"Original","following_count":4,"rating":0.0,"page_count":7,"view_count":65,"chapters_count":1,"last_update":1717679343,"description":"The world has changed, and fantastical creatures of all kinds have chosen to lay down their arms and work together. Despite this newfound harmony, some creatures just can't help but stick to their mischievous ways. Enter the goblins—Chumbles, Dinty, and Frink—three friends who aren’t quite ready to let go of the old days of treachery and scheming.The boys find themselves entangled in various harebrained schemes, exploiting loopholes, misunderstanding other race's customs, or just trying to get by in a world that’s moved on from chaos. Their actions lead to humorous,and sometimes hilarious consequences ,and despite their often questionable methods, their hearts are always in the right place—or at least they think so.[Participant in the Royal Road Community Magazine Contest - June 2024]What to expect:\nA light hearted romp in a fantasy setting where creatures that used to be known as monsters live alongside the more \"civilized\" fantasy races.Release Schedule:\nThis one is for fun and I started it for the community magazine contest.  Updates will be sporadic, but the full first \"episode\" will be complete prior to June 30th, 2024.  If I get positive feedback I may continue working on it - writing it so far has been super fun!","description_hash":-2438401110283510000},{"title":"Singularity 2101: A Neo hunter Chronicle","fiction_id":"87947","link":"https:\/\/www.royalroad.com\/fiction\/87947\/singularity-2101-a-neo-hunter-chronicle","tags":["Male Lead","Sci-fi","Action","Mystery","Short Story","Cyberpunk","Genetically Engineered "],"lable":"Original","following_count":1,"rating":0.0,"page_count":52,"view_count":213,"chapters_count":6,"last_update":1718132875,"description":"Wyet Thorn, your quintessential hound dog of a Neo Hunter, patrolled the neon lit streets of Los Angeles. Long days bled into nights, fueled by two pots of coffee and a pack of cigarettes. The job had a way of grinding down even the toughest souls, but Wyet wore his exhaustion like a badge of honor.\nThen came that fateful day—the one that shattered his world. The only person he’d ever been close to suffered something unspeakable. Wyet’s gut twisted, and he knew he couldn’t let it slide. Not this time. The rabbit hole was wide and deep, swallowing him whole. Lies, deceit, and questionable decisions, each step deeper into the abyss threatened to consume him.\nBut Wyet’s character wouldn’t allow it. Beneath the grizzled exterior, a stubborn streak burned. He needed answers, justice, closure. The truth behind her case became an obsession, gnawing at him from the inside. As he unraveled the mystery, he discovered more than he bargained for, a web of corruption, secrets, and hidden agendas. His journey would be one of self-discovery and selflessness, a tightrope walk between darkness and redemption.\nWould Wyet prevail, unmasking the culprits and find justice for his very good friend? Or would he succumb to the engulfing darkness, forever haunted by the personal demons lurking in the city of towering lights.\nOnly time, and the relentless pursuit of truth, would tell.","description_hash":-41684158976239556},{"title":"The Art of Reasonable Measures","fiction_id":"87946","link":"https:\/\/www.royalroad.com\/fiction\/87946\/the-art-of-reasonable-measures","tags":["Comedy","Female Lead","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":107,"chapters_count":2,"last_update":1717991944,"description":"Locked in a bitter rivalry, Marjorie Dawn must take drastic steps or she may loose her customers for good. Drastic measures that may include telling the king himself.","description_hash":3496283183263102780},{"title":"Cursed or Blessed ?","fiction_id":"87945","link":"https:\/\/www.royalroad.com\/fiction\/87945\/cursed-or-blessed","tags":["Portal Fantasy \/ Isekai","Comedy","Non-Human Lead","Contemporary","Fantasy","Supernatural","Male Lead","Female Lead","Magic","Low Fantasy","Mythos","First Contact"],"lable":"Original","following_count":1,"rating":0.0,"page_count":15,"view_count":168,"chapters_count":3,"last_update":1718000890,"description":"Did you know?\nBecoming a granny comes with its own perks –  like you don't have to buy anti-ageing cream ever again!\nWhat about turning into a goblin? – Well, It's a lifetime subscription for winning the Halloween.","description_hash":-2622809991983497729},{"title":"The Night Hag","fiction_id":"87944","link":"https:\/\/www.royalroad.com\/fiction\/87944\/the-night-hag","tags":["GameLit","Progression","Female Lead","Strong Lead","Drama","Action","Fantasy","Magic"],"lable":"Original","following_count":8,"rating":5.0,"page_count":65,"view_count":1068,"chapters_count":10,"last_update":1718415892,"description":"Serin Hendall was a retiring adventure. Not by choice though. She had lived a full life without many regrets, but there was still so much she wanted to see and do. However, before she could officially retire she died. Serin doesn't remember how it happened, but she is finding out that death suits her. Away from her aging body and empowered as an undead. All the aspirations she put aside can be pursued again. That is until the memories before her death start to surface and it takes her on a path of vengeance. She is weak and alone, but her enemies in their arrogance have left an opportunity for her. One she will fully take advantage of to recover what was stolen and bring destruction upon those that believe they are untouchable.","description_hash":-2061369342650257057},{"title":"Call Dimension Travelers 800","fiction_id":"87943","link":"https:\/\/www.royalroad.com\/fiction\/87943\/call-dimension-travelers-800","tags":["Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","Psychological","Female Lead","Adventure","Fantasy","Contemporary","Slice of Life","Secret Identity","Magic","Low Fantasy","Attractive Lead"],"lable":"Original","following_count":3,"rating":5.0,"page_count":11,"view_count":162,"chapters_count":3,"last_update":1717991705,"description":"[Royal Road Magazine June 2024 Entry]\nDaisy clocks in at 9 AM and leaves by 6. \nWorking in a office responsible for dimension travel and fantasy pest control wasn't easy. You had goblin howrds attacking grannies, vengeful princesses going back in time and random guys being teleported by magical trucks. But for the human ginger, it was just another Tuesday.","description_hash":1987557704235809903},{"title":"Goblins Took Her Cat","fiction_id":"87942","link":"https:\/\/www.royalroad.com\/fiction\/87942\/goblins-took-her-cat","tags":["Dungeon","Grimdark","Multiple Lead Characters","Strong Lead","Drama","Action","Adventure","Fantasy","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":57,"view_count":335,"chapters_count":5,"last_update":1718374565,"description":"Ednarite Moonstorm enjoys the peaceful town of Danvers, near the southern shores, where she and Warfrost have long lived in hiding. All she wants are lazy days with her cat, her garden, and the occasional visit from her children and grandchildren. When the old house cat gets thrown into a bag and carried away by a goblin, Edna vows to get him back, even if it means coming out of retirement and being found by The Betrayers.\nHalf-Dwarf Hildebrin is angry. Her sickly sister Magdelina finally met the maker. A scrawny goblin frightened her into a heart attack at the very end. What a sad fate for a once noble guard of Koh'Lodur, long ago banished to human realms. Goblins will die. She will smash the whole grotto beneath her hammer until her sister is avenged.\nCurgelek thought the orange cat looked tasty. He was proud of himself. All the other goblins wanted it, but he would take the ripe old kitty home and share it with his family. Cats were delicacies to be enjoyed. How was he supposed to know the old woman loved her cat so much she would wipe them from existence to get the darn thing back?\n\nIt's just a cat, lady!!!\n\n\nThis was planned to be a slow-burning dungeon crawler with multiple character point of views, action adventure monster slaughtering, and epic world-building. I think it's actually going to be a prequel story to something much larger, with only 15 chapters plus an epilogue.\nI wrote the first three chapters in three days, and only then realized I'd put far too much detail into them for one web series. I can't possibly do this entire thing justice with just one storyline here in one book. That is why this will only be 15 chapters with a very clear beginning, middle, and end.\n\n\nThis was written for the Goblins and Grandma's Community Magazine Contest June 2024. This is my first story on RR, and no previous reading\/lore is required. In fact, this is the beginning of a much larger story. It's a 3rd person point of view from all the different characters who get caught up in world changing events.\nI'll post more information here at the end of June 2024, but basically I am creating 1st person narratives for the 3 different storylines here. People can read this one as a prequel, and then choose which character they most want to follow. I should also mention that I don't intend to make this one required reading. Each individual future narrative will be stand-alone.","description_hash":2409423936289988100},{"title":"Thrones of the Savannah","fiction_id":"87941","link":"https:\/\/www.royalroad.com\/fiction\/87941\/thrones-of-the-savannah","tags":["Progression","Multiple Lead Characters","Tragedy","Drama","Adventure","Short Story","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":29,"chapters_count":1,"last_update":1717679222,"description":"In the heart of the African Savannah, where golden grasses dance with ancient winds and the sun kisses the horizon, the Kingdom of Nzuri flourishes under the reign of King Abasi, a lion-hearted warrior known for his wisdom and strength. However, shadows of ambition and betrayal loom as the rival Kingdom of Shujaa, led by the cunning Queen Adanna, covets Nzuri's fertile lands and resources. Her strategic maneuvers and whispered alliances sow discord within Nzuri's court.\nKing Abasi's three children, Prince Kofi, Princess Amara, and Prince Jengo, each face personal trials amidst the growing tensions. Prince Kofi, a noble warrior, Princess Amara, a beloved diplomat, and Prince Jengo, an adventurous spirit, all find their loyalty tested. Watching the unfolding drama is the enigmatic Order of the Baobab, a group of seers and shamans led by the blind shaman Asha, who foretell a prophecy of fire, blood, and a new order.\nThe brewing storm culminates when Queen Adanna invites King Abasi to a parley at the neutral Great Baobab Grove. Despite sensing treachery, Abasi, bound by honor, attends with Prince Kofi and loyal guards. Ambushed by hidden assassins, Abasi is mortally wounded, his last command to Kofi: \"Protect Nzuri... at all costs.\" With a heavy heart, Kofi retreats, carrying his father's body back to their kingdom.\nThe news of the king's death sparks grief and rage in Nzuri. Princess Amara uses her diplomatic prowess to rally the people and nobles, while Prince Jengo's daring raids inspire courage. The Order of the Baobab reveals their prophecy to the royal siblings, speaking of the Heart of the Savannah, a legendary artifact that could tip the scales in their favor.\nEmbarking on a perilous quest, the siblings traverse treacherous landscapes, battle fierce creatures, and overcome ancient traps, forging unbreakable bonds and uncovering truths about their heritage. They finally grasp the radiant gem, the Heart of the Savannah, pulsing with primal energy.\nArmed with the artifact, the siblings return to Nzuri, their resolve unshaken. The final battle against Shujaa is fierce, with the Heart of the Savannah turning the tide. In a climactic duel under the burning sun, Prince Kofi defeats Queen Adanna, avenging his father and securing Nzuri's future.\nWith the war over, Nzuri enters a new era of peace and prosperity. The siblings rule with wisdom and compassion, honoring their father's legacy. The Order of the Baobab, their prophecy fulfilled, fades into the shadows, content to watch over the kingdom from afar. The timeless savannah, witness to the rise and fall of empires, whispers tales of bravery, betrayal, and the enduring spirit of those who dared to dream of a better world.","description_hash":4661238180408814970},{"title":"The Vampires Forbidden Love","fiction_id":"87940","link":"https:\/\/www.royalroad.com\/fiction\/87940\/the-vampires-forbidden-love","tags":["Non-Human Lead","Romance","Supernatural","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":80,"chapters_count":2,"last_update":1717721423,"description":"a vampire teen boy and a werewolf teen boy from high-ranking families fall in love, but will their families alow it?","description_hash":1918033289219270282},{"title":"The Dead Spell ","fiction_id":"87939","link":"https:\/\/www.royalroad.com\/fiction\/87939\/the-dead-spell","tags":["Reincarnation","Urban Fantasy","Anti-Hero Lead","Super Heroes","War and Military","Action","Adventure","Fantasy","Sci-fi","Supernatural","Male Lead","Female Lead","Strong Lead","Multiple Lead Characters","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":43,"chapters_count":1,"last_update":1717679214,"description":"Prologue\n\n“How do you kill a wizard? Well, you can’t, really. They’re already dead. At least, here they are. You see, each wizard obtains their respective mastery from the means of which they died. Their essence is captured in a pendant that enables their weapons and abilities. This process is called ‘The Dead Spell’. It’s simple, and so far it’s been quite effective.\n\nIt all starts with Zahir, the Master of Miracle. He’s your typical leader, tall, kind, brave. We trust him. We love him, all of us will. We appreciate how he doesn’t play favourites. Or, at least hides who his favourites are very well. Even if he does have favourites, we trust him. The only thing I find weird about that man is we don’t know how he died. It’s like trying to hide where you went to school - we don’t need to know but it’s weird that he’s never mentioned it. Perhaps he never did. But we trust him. \n\nOne-by-one Zahir has been reviving our sorry butts when we die in what he calls ‘the death of a fool.’ Which I always found funny, since if we’re so foolish then why bother reviving us? Nevertheless. We’ve grown into a bit of a family. A family who’s really tough on newcomers. Which leads into our next person, Wren. Master of Gust. But that’s not all she’ll be known for.\n\nThe goal, the hope, is to assemble a team that can and will protect people from dying in unnatural ways. Car crashes, workplace incidents - extremeness varies, but you get the idea. These aren’t ‘natural’ ways to go. They’re caused by some variable that people either don’t anticipate, or just choose to ignore. Nonetheless, it’s no ‘natural causes’. This team is known as “The Risen”. We know we can’t protect everyone. I know some of us here don't even try. But I know I do. Maybe that’s the problem…”","description_hash":302932317761009609},{"title":"A World in Peril: An Apocalyptic System LitRPG","fiction_id":"87938","link":"https:\/\/www.royalroad.com\/fiction\/87938\/a-world-in-peril-an-apocalyptic-system-litrpg","tags":["LitRPG","Progression","Post Apocalyptic","Sci-fi","Action","Adventure"],"lable":"Original","following_count":17,"rating":4.5,"page_count":21,"view_count":434,"chapters_count":3,"last_update":1718492987,"description":"Citizens of Earth,\n\nThis is a broadcast from the Dominion Expanse. We have intervened to prevent nuclear destruction on your planet after detecting multiple missile launches.\n\nAll remaining weapons have been deactivated. Your civilisation cannot be trusted with such power, as shown by the unrestrained escalation.\n\nEarth is now under Dominion control ahead of schedule due to this recklessness. This transition was originally planned once you reached certain technological benchmarks.\n\nOver the next year, your potential will be evaluated. Earth will not be released - it is now a permanent Dominion world.\n\nHowever, humanity's actions in this time will determine the future:\n\nIf you continue displaying divisiveness and violence, Earth will be repurposed for other Dominion needs.\n\nIf humanity proves it can unify and self-govern under our system, Earth may remain inhabited and maintain some autonomy under Dominion oversight.\n\nThe path forward is yours to walk. Your civilisation’s destiny is in your hands. Tread wisely.\n\nYou have one Earth year before the Dominion Council convenes to decide your fate.","description_hash":-5194113315293037954},{"title":"Sins of the Past: Slumbering Echoes","fiction_id":"87936","link":"https:\/\/www.royalroad.com\/fiction\/87936\/sins-of-the-past-slumbering-echoes","tags":["Reincarnation","Male Lead","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":37,"chapters_count":1,"last_update":1717670856,"description":"What happens after we die? Heaven and Hell? Nothingness?\nIn Dean's case, he got reincarnated into the brand new world, full of magic and wonders, but in the constant state of war between Demon and other races. \nNow known as Aldric, he'll have to master magic and sword in order to defend his newfound home, uncover the world's secrets, and attempt to get back the life he lost on Earth and deal with regrets that haunt him.\n\nAs to what to expect:\n\n- Moral dilemmas \n-Gifted MC, but he will have to reach the OP status \n-Simple but relatively deep magic system (will not go in depth with science based, but if someone can wield gravity and dark magic they will be able to use power similar to black hole as in removing light and so on)\n-A grammatical error here and there as a non native speaker\n-Complex characters\n-Some romance","description_hash":3361381260814219212},{"title":"The Bitter End (Goblins and Grandma's prompt)","fiction_id":"87935","link":"https:\/\/www.royalroad.com\/fiction\/87935\/the-bitter-end-goblins-and-grandmas-prompt","tags":["Urban Fantasy","Anti-Hero Lead","Comedy","Multiple Lead Characters","Action","Fantasy","Satire","Male Lead","Female Lead","Non-Human Lead","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":66,"chapters_count":1,"last_update":1717667277,"description":"For the care workers of \"St Augustine's End of Life and care home centre\" seeing their long, upstanding resident Margaret brandishing an MP40 machine gun and decimating the cabbages was quite the site. One that warranted, at the very least, a review of their gift and possessions policy.\nFor Garrock the Goblin who had long wondered why the plump withered old sods that were given free grub and care wouldn't let him in. It was an average Tuesday as he lead a new squad of loyal nitwits on his eternal quest of living where the grumpy sods lived free of strife.\nAfter all, same big saggy ears, long droopy noses... their just Goblins, these \"Grandma's\".... right?","description_hash":-3948441520520402230},{"title":"A Lonesome Roadside","fiction_id":"87934","link":"https:\/\/www.royalroad.com\/fiction\/87934\/a-lonesome-roadside","tags":["Post Apocalyptic","Comedy","Psychological","Multiple Lead Characters","Sci-fi","Horror","Supernatural","Hard Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":22,"view_count":63,"chapters_count":2,"last_update":1717692947,"description":"The year is 2034 and humanity is shit out of luck thanks to a mix of reality bending cataclysms and incompetence from the powers that be. Follow this dawdling tale about people who have nothing better to do than cause trouble in a world of bloody evolution.  Buckle up and prepare for a mess of Religion, Horror, Gallows Humor, and Plain Old Debauchery thanks to an unlikely team of miscreants.","description_hash":-4123600659927135960},{"title":"New Beginnings - A Pokemon Slice of Life. [OC\/Isekai\/Move Tutor\/Breeder]","fiction_id":"87933","link":"https:\/\/www.royalroad.com\/fiction\/87933\/new-beginnings-a-pokemon-slice-of-life-ocisekaimove","tags":["GameLit","Portal Fantasy \/ Isekai","Progression","Male Lead","Slice of Life","Fantasy"],"lable":"Fan Fiction","following_count":1364,"rating":4.83,"page_count":178,"view_count":61720,"chapters_count":21,"last_update":1718557031,"description":"Ethan Reed, once an ordinary young man from Earth, finds himself mysteriously transported to the vibrant and wondrous world of Pokemon. Stranded and bewildered, Ethan spends over a year lost in an untamed forest, managing to bide his time and survive while he make sense of his new reality, waiting for rescue. During this time, he creates a little plot of land, all for himself and the surrounding Pokemon---A farm of berry trees, a secluded meadow, and a rough shelter. \nOne fateful day, Ethan is finally rescued by an experienced Pokémon Ranger named Elise, who helps him arrive at the bustling Eterna City. There, Ethan is introduced to the community of Pokémon trainers, Nurses, and League Officials who welcome him after his harrowing experience. Despite the gentle reception, Ethan feels out of place and uncertain about his future in this unfamiliar world.\nEthan’s lack of confidence in battling Pokémon leads him to pursue a different path. Inspired by his connection with the Pokemon from his clearing and his desire to help both Pokémon and their trainers, he decides to become a move tutor and breeder. As he learns more about the new but familiar world he finds himself in, Ethan begins to discover his true potential. He learns the esoteric art of teaching Pokémon new moves and the interesting science of breeding to bring out the best traits in each Pokémon.\n\nThis is a little passion project of mine. What is thrown up on here are rough drafts, and me spewing words onto a page. Updates will be wild and sporatic, as this is not my main story. I'm just writing this for fun. There is no planning, it's all off the dome. \nHeavily inspired by Pokemon Trainer Vicky, Hard Enough, and The New Normal. Also, a host of other great fanfictions. \nCrossposted on ScribbleHub, AO3, and SpaceBattles. (For now)","description_hash":1890668998999578128},{"title":"Vampire System: Mage Of Blood And Shadows","fiction_id":"87932","link":"https:\/\/www.royalroad.com\/fiction\/87932\/vampire-system-mage-of-blood-and-shadows","tags":["Urban Fantasy","Anti-Hero Lead","Male Lead","Strong Lead","Action","Fantasy","Supernatural","Magic"],"lable":"Original","following_count":2,"rating":0.0,"page_count":31,"view_count":192,"chapters_count":4,"last_update":1717782540,"description":"A young boy whose life takes a turn for the worse under his father after his mother's death. Eventually, he ends up murdering said father after his attempt to murder him drives him into a corner.\nUnfortunately, he ends up dying on the same spot murdered by his own father.\nIn his death, he smiles as he has succeeded in taking the life of the one person he hated the most oblivious to the fact that this wasn't his end.\nJust as he drew his last breath and closed his eyes, his consciousness is called back by a sudden ding except that he wasn't called back to the world he remembered.\nHe found himself floating in a dark astral plane and a system message in front of him.\n[ System awakening: 15% ]\n[ Transferring consciousness to new life ]\n[ Process initiated ]\nBefore his mind could start processing what was going on, he found himself in the body of a newborn with two faces staring down at him.\nA mother who bore quite the striking resemblance to his old mother and a father whom he already hated on first sight.\nHe was given another chance at a new life but he had one burning question in his heart.\nWas this fate giving him a chance to see the good in people or was it another attempt to screw him over?","description_hash":-4290154919141482348},{"title":"Blood Evolution: Devourer's Path to Power Levelling","fiction_id":"87931","link":"https:\/\/www.royalroad.com\/fiction\/87931\/blood-evolution-devourers-path-to-power-levelling","tags":["LitRPG","Dungeon","Anti-Hero Lead","Male Lead","Strong Lead","Action","Adventure","Fantasy","Tragedy","Reader Interactive","Magic","GameLit","Progression"],"lable":"Original","following_count":12,"rating":4.54,"page_count":45,"view_count":1471,"chapters_count":10,"last_update":1718311443,"description":"(This is the first time I'm submitting a novel, so any feedback would be appreciated. I'll upload at least 1 chapter every Thursday. If I accidentally write too much then I'll be uploading multiple weekly.)\nIn the aftermath of the cataclysmic event that saw the world besieged by towering monoliths known as the Towers, humanity grapples with the harsh realities of its new existence. Among the survivors is Sebastian Azalith, a young man burdened by tragedy and forged in the crucible of despair.\nRaised amidst the chaos and destruction wrought by the Towers, Sebastian finds himself adrift in a world devoid of hope and purpose. With the loss of his mother, crushed beneath the weight of the Towers' arrival, and the absence of his father, who vanished without a trace, Sebastian is left to fend for himself in a world turned upside down.\nForced into joining Varun Academy, a grim institution on the outskirts of civilization, Sebastian struggles to find his footing in a world that has left him behind. With no one to turn to and nowhere else to go, he reluctantly embarks on a journey of self-discovery and redemption, seeking solace in the only place he has left to call home.\nAs Sebastian grapples with the despair of his shattered world, he discovers a dark and forbidden power within himself—the ability to devour the life force of any living creature. With each life he consumes, Sebastian gains strength and power, his soul tarnished by the darkness that consumes him.\nLeaving behind the safety of the academy, Sebastian ventures into the Towers, his heart heavy with the weight of his past and the uncertainty of his future. With each floor he conquers, he faces despair and agony, his soul torn asunder by the darkness that surrounds him.\nBut as Sebastian delves deeper into the depths of the Towers, he begins to unravel the mysteries of his past and unlock the true potential that lies dormant within him. With each victory he achieves, he grows stronger, more ruthless, and more determined to defy the odds and carve out his own destiny in a world consumed by darkness.\nBut as Sebastian's power grows, so too does the darkness that threatens to consume him. Haunted by visions of a future shrouded in despair, he must confront the ultimate truth—that the path to power comes with a price, and the line between saviour and destroyer grows ever thinner.","description_hash":8497551552826335996},{"title":"God Of Man","fiction_id":"87930","link":"https:\/\/www.royalroad.com\/fiction\/87930\/god-of-man","tags":["Psychological","Fantasy","Short Story","Supernatural","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":55,"chapters_count":1,"last_update":1717666593,"description":"A fallen paladin, a humble farmer, and a boy touched by destiny struggle in a world shaped by gods and fate.","description_hash":2661208120446707739},{"title":"Gertrude's Goblins","fiction_id":"87929","link":"https:\/\/www.royalroad.com\/fiction\/87929\/gertrudes-goblins","tags":["Portal Fantasy \/ Isekai","Comedy","Female Lead","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":10,"view_count":119,"chapters_count":2,"last_update":1718214589,"description":"Gertrude had been retired for years when she decided to move out of her home and into a retirement home of her choosing. What she hadn’t expected was that she would never make it there. Did she die? No. She was rescued against her will by a powerful being calling himself the Spirit of Isekai. Isekai, for short. Gertrude finds him a rude, immature brat, but it is already too late to turn back. \nAnd so Gertrude starts her new life in the same aged body as always, with a lot less pain, and a bit more energy. With no goals or ambitions, she settles once again into the life of a grandmother of some children who appear to be beings of the forest. But all is not as it seems, for Gertrude can only see pleasant things. \n\nThis is an entry for the Goblins and Grandmas contest, and is intended to be on the shorter side.","description_hash":-8463031444600919687},{"title":"Old Granny Gob - (A Goblins and Grandmas prompt entry)","fiction_id":"87928","link":"https:\/\/www.royalroad.com\/fiction\/87928\/old-granny-gob-a-goblins-and-grandmas-prompt-entry","tags":["LitRPG","Reincarnation","Comedy","Female Lead","Strong Lead","Adventure","Fantasy","Short Story","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":4,"rating":0.0,"page_count":12,"view_count":90,"chapters_count":1,"last_update":1717666145,"description":"Betty thought her life's last chapter would be taking care of her son and grandchildren. Inexplicably, fate had something else in mind for her. She is transferred to a world with a system.  While this gives her a brand new lease on life, it does so by making her one of the lowest of the low: a goblin.","description_hash":-7658271360081615683},{"title":"OkiOki-OkiOki","fiction_id":"87927","link":"https:\/\/www.royalroad.com\/fiction\/87927\/okioki-okioki","tags":["Psychological","Male Lead","Slice of Life","Action","Mystery","School Life","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":29,"chapters_count":1,"last_update":1717665900,"description":"Oki Oshi, a fourth year student at Gowith high school, has his life flipped completely upside down upon meeting a being he’s seen in his dreams known only as the “Facestealer”. This being, whose gender nor name is known, task Oki with one simple job, “understand who it is that I am, and your world shall not come to ruin.”","description_hash":-7187603519358177974},{"title":"The Fireman's Companion ","fiction_id":"87926","link":"https:\/\/www.royalroad.com\/fiction\/87926\/the-firemans-companion","tags":["Anti-Hero Lead","Multiple Lead Characters","Tragedy","Short Story","Satire","Male Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":29,"chapters_count":1,"last_update":1717665881,"description":"This short story follows Guy, a hiker who’s been separated from his friends. While searching in the woods for an adequate place to build a shelter for the night, Guy stumbles upon an old, abandoned log cabin. As Guy begins to fall asleep in his new resting place, he strangely hears heavy footsteps from down the hall. Fearing it’s an intruder of some kind, he hastily grabs a pocket knife from his backpack and heads into the hall to investigate. Guy is startled to find a bigger, older gentleman grumpily making a drink in the kitchen. His face and neck covered in scar tissue. Upon spotting Guy from the corner, the older man introduces himself as Harvey, a retired fireman. After an open-hearted discussion about themselves, Harvey reveals something from his past that alters Guy’s view of his new roommate. It is told through the eyes of Guy as all these events happen in real time. Guy’s journey takes him on a path of self-discovery as there are also events of regret in his past. In learning about Harvey and his journey, Guy realizes what he must do in order to be happy again, as he was feeling lost literally and emotionally.\nEnjoy!","description_hash":-2082562069333384345},{"title":"Tihan Omnach | Qilarians' Legacy: Explorer Era","fiction_id":"87925","link":"https:\/\/www.royalroad.com\/fiction\/87925\/tihan-omnach-qilarians-legacy-explorer-era","tags":["Virtual Reality","Dungeon","Anti-Hero Lead","Space Opera","Martial Arts","Action","Adventure","Fantasy","Sci-fi","Cyberpunk","Supernatural","Male Lead","Low Fantasy","Genetically Engineered ","First Contact","Progression"],"lable":"Original","following_count":0,"rating":0.0,"page_count":28,"view_count":187,"chapters_count":4,"last_update":1718055529,"description":"Prologue\nIn the vastness of space, nestled in the Andromeda galaxy, lies the colossal planet Gigaterra Prime, known as Giga or G-1. This monstrous world, 185,000 times the size of Imperial Earth, has always been shrouded in mystery and potential. Shielded by a mysterious energy barrier and natural atmospheric quirks, Giga stayed a well-kept secret until recent breakthroughs by human explorers.\nYears ago, a gang of space pirates stumbled upon Giga. Their attempts to breach its formidable energy barrier failed, but they discovered a temporary gap that allowed exploratory drones, called \"Pathfinders,\" to break through. These Pathfinders sent back data revealing Giga's breathable atmosphere, stable climate, and abundance of unique minerals, flora, and wildlife. Massive trees with glowing leaves lit up the night, and rivers rich in unknown minerals flowed through lush valleys. Exotic creatures roamed freely.\nThe sale of this information triggered a wild era of exploration, like a cosmic gold rush. Settlers, mercenaries, and corporations scrambled to stake their claim on the untamed new world. Amid this turmoil, ancient Qilarian ruins surfaced, revealing relics of immense power and wisdom. \nIn the uncharted expanses of Gigaterra, humanity entered a new era of colonization, driven by extraordinary advancements in bioengineering and cybernetics. The Federation and Mars spearheaded these innovations, creating hybrids like the nimble nekomimi and robust reptilians, while seamlessly integrating cybernetic implants to enhance physical and cognitive abilities. These breakthroughs paved the way for humanity to explore and settle new frontiers, transforming the fabric of human existence.\nThe Corporate Sector, with its affluence and technological prowess, dominated the landscape. Sky-High edifices and cutting-edge facilities showcased their influence, while the Settler Sector, with its improvised habitats and struggling populace, lagged far behind. This disparity created a  distinct devide between the high-tech environments of the elite and the dirty, graffiti-covered lower levels where settlers fought for survival.\nIn this era, bioengineered hybrids and cybernetically augmented individuals became commonplace among those who could afford them. On planets like Haven, where the lines between humanity and technology blurred, extreme modifications became a mark of status and power. At the heart of this transformative period stood the Explorer Committee, led by the formidable Zhen Wu Long. Operating independently but under the oversight of the governing Council, the Committee spearheaded the exploration and colonization of Gigaterra Prime. Their mission attracted support from the Federation, Mars, and major corporations, uniting them in a relentless pursuit of discovery and expansion.\nThis MOD Era allowed humans to become anything they desired, combining biological and cybernetic enhancements. \nZhen Wu Long, a seasoned mercenary with a knack for leadership, saw the need for order. Under his guidance, the newly formed Explorer Committee stepped in to regulate the chaos, ensuring fair access to Giga's resources. The Committee aimed to harness the planet's potential while maintaining peace between organizations, guiding humanity's expansion into this new frontier.\nTihan Omnach, a thirty-year-old citizen of Haven from the first settlers wave and low-level corporate worker who had resigned to start a new life as a VR player. One day, while idly scrolling through news feeds, he stumbled upon an announcement about the Explorer Committee’s establishment and recruitment.\nThis New Explorer Era on Gigaterra marks a defining chapter inhuman history.\nHis heart raced as he read the details. Here was a real chance for change, a tangible escape from the digital confines of his four walls and money problems. Drawn by the promise of adventure and the chance to uncover the mysteries of Giga, Tihan seized the opportunity without hesitation.","description_hash":6923499907024060001},{"title":"Spear Carriers","fiction_id":"87924","link":"https:\/\/www.royalroad.com\/fiction\/87924\/spear-carriers","tags":["Multiple Lead Characters","Sci-fi","Contemporary","Slice of Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":49,"chapters_count":1,"last_update":1717665062,"description":"In a contemporary world, a Main Character starts his vast new plans and bold actions for the betterment of the populace.  But what of the spear carriers, the normal people, who also live in that world?  This is their tale, or their many tales, as most short chapters will deal with a new character.","description_hash":-1169548889379034109},{"title":"Fun until Your Day","fiction_id":"87923","link":"https:\/\/www.royalroad.com\/fiction\/87923\/fun-until-your-day","tags":["Comedy","Female Lead","Drama","Historical","Romance","School Life","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":159,"chapters_count":3,"last_update":1717693978,"description":"Lea Ayanda is a nice and funny girl, defined by her secret royal status, isolation, and deep relationship with her maid she calls Mei. Her life is marked by a longing for genuine connections both romantically and general frienship. Despite her royal duties, she desires simple joys. She just wants human connections, but is denied that very thing until Mei tells her something that changed everything...","description_hash":6744794546500283737},{"title":"Video Game Developer in a Cultivation World","fiction_id":"87922","link":"https:\/\/www.royalroad.com\/fiction\/87922\/video-game-developer-in-a-cultivation-world","tags":["Reincarnation","Progression","Xianxia","Comedy","Male Lead","Action","Adventure","Historical","Martial Arts","Supernatural","Secret Identity","Wuxia"],"lable":"Original","following_count":256,"rating":4.62,"page_count":145,"view_count":6261,"chapters_count":10,"last_update":1718622004,"description":"James was a hustler who'd succeeded in retiring early, only for the pandemic to ruin all of his plans. He spent two years locked up inside playing video games and watching movies, only to be spiritually abducted just as the situation started improving. Now his name is Jin and he's a part of the Illusion Room Sect. A cultivation sect that creates scenarios for combat-focused cultivators to hone their skills. In other words, fully immersive video games. Will the gaming knowledge of his past life help him succeed in such a cut-throat world? Will he manage to break his two-year pandemic induced dry-spell? And most importantly, will he ever manage to surpass the rank of cannon fodder?","description_hash":4577353820218814574},{"title":"Becoming Her Knight","fiction_id":"87921","link":"https:\/\/www.royalroad.com\/fiction\/87921\/becoming-her-knight","tags":["Non-Human Lead","Adventure","Fantasy","Romance","Supernatural","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":24,"view_count":49,"chapters_count":2,"last_update":1718035203,"description":"Finnea has been in the army of Queen Titania since she was old enough to hold a sword. Even if it was never a life she would have chosen for herself, she was used to it and even excelled at it. But when she's promoted to the position of knight and given her first solo mission, she is forced into a situation she could never have anticipated. Now she has to travel with the beautiful daughter of the man she was tasked with killing and has to decide between loyalty to her queen and family or to her heart.","description_hash":7946768248663025552},{"title":"Rogue","fiction_id":"87920","link":"https:\/\/www.royalroad.com\/fiction\/87920\/rogue","tags":["Male Lead","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":41,"view_count":388,"chapters_count":6,"last_update":1718371537,"description":"James has finally found the opportunity to join a sect and leave his old life behind, and maybe just maybe this time he will have a better life, something that gives meaning to being alive.","description_hash":838897858445706809},{"title":"Hunter Nick. (goblin and his grandmother)","fiction_id":"87919","link":"https:\/\/www.royalroad.com\/fiction\/87919\/hunter-nick-goblin-and-his-grandmother","tags":["Psychological","Male Lead","Secret Identity","Action","Adventure","Fantasy","Reader Interactive","School Life","Magic"],"lable":"Original","following_count":0,"rating":3.0,"page_count":38,"view_count":461,"chapters_count":8,"last_update":1718532109,"description":"The dignity of any hero lies in how he can get out of a difficult situation. Young hunter Nick finds himself in a trap. He has to solve a difficult task: to save himself and eliminate a strong and resourceful enemy.","description_hash":783174610576425892},{"title":"ShadowPlay ","fiction_id":"87918","link":"https:\/\/www.royalroad.com\/fiction\/87918\/shadowplay","tags":["Virtual Reality","Urban Fantasy","Progression","Strategy","Grimdark","Action","Adventure","Fantasy","LitRPG","Female Lead","Strong Lead","GameLit","High Fantasy","Steampunk","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":58,"view_count":59,"chapters_count":1,"last_update":1717662299,"description":"ShadowPlay: A LitRPG Adventure\nAlyssa Arkwright's privileged life in Neo-Victoria crumbles after her father's murder. Seeking escape, she dives into \"ShadowPlay,\" an online game set in the gothic-industrial world of The Gloom. As Nyx, she navigates quests, battles, and alliances to topple the tyrant Lady Marwen. This LitRPG blends strategy, combat, and character progression. Join Nyx in a tale of stealth, intrigue, and survival, where reality and the virtual blur.","description_hash":-3385614124064407917},{"title":"Machina Heart (GER)","fiction_id":"87917","link":"https:\/\/www.royalroad.com\/fiction\/87917\/machina-heart-ger","tags":["Progression","Post Apocalyptic","Female Lead","Sci-fi","Action","Adventure","Horror","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":3.5,"page_count":10,"view_count":64,"chapters_count":2,"last_update":1718215205,"description":"Die Welt ist dem Untergang geweiht. Dessen sind sich die Menschen bewusst. Was einst ein Planet der Kultur und Wissenschaft war, ist jetzt eine einzige Ruine. Riesige Wesen aus Metall jagen die Menschen und lassen keine Überlebenden. Soda, die gerade dabei zusehen musste, wie ihre einstige Heimat von einem solchen Wesen zerstört wurde, entscheidet sich, dem ganzen ein Ende zu setzen…","description_hash":-7992340431408422288},{"title":"Heroes Trial","fiction_id":"87916","link":"https:\/\/www.royalroad.com\/fiction\/87916\/heroes-trial","tags":["Comedy","Multiple Lead Characters","Fantasy","Short Story","Supernatural","Female Lead","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":35,"view_count":307,"chapters_count":7,"last_update":1718359203,"description":"The great god Khirotsan’ahn the almighty held trials for the heroes of all worlds.\nWhen it was finally Earth’s turn, his goblin arbiters randomly selected three… grandmas? Really?\nDo three grandmas stand any chance in vicious trials filtering out the strongest of heroes?\nCan they stay indifferent between life and death?\nWill they clear all three trials and have their wishes fulfilled by the great god Khirotsan’ahn?\n\nMy submisson for the community magazine contest.","description_hash":8849889579092868388},{"title":"Chronicles of Mercenaries","fiction_id":"87894","link":"https:\/\/www.royalroad.com\/fiction\/87894\/chronicles-of-mercenaries","tags":["LitRPG","War and Military","Multiple Lead Characters","Tragedy","Action","Adventure","Historical","Mythos","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":36,"view_count":172,"chapters_count":4,"last_update":1717687272,"description":"Mercenaries, magic, famous generals, dragons, gods... Is it history that creates heroes, or heroes that create history?\nStarting from the 200th year of the Red Moon Calendar (that is, the first year of the Magic Calendar), on this fantasy continent of magic and knights, Amy Harber started as a small mercenary and wrote an magnificent and magnificent legendary epic!\nMercenaries, magic, famous generals, dragons, gods... The Creator God was killed, and the stars in the Silver Hand emerged as the times required. A group of ordinary young mercenaries were involved in the torrent of history. To hope for a hundredfold gain, one must pay a thousandfold.","description_hash":4260330552101229760},{"title":"The 13th Chime","fiction_id":"87893","link":"https:\/\/www.royalroad.com\/fiction\/87893\/the-13th-chime","tags":["Action","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":27,"view_count":347,"chapters_count":7,"last_update":1718434865,"description":"In a mystic twilight hour, the 13th chime tolls, heralding fading light and whispered truths. Amidst hallowed halls, a saint awaits as melodies intertwine with murmurs. Veiled in shadows, hidden lies forge false realities, yet the saint stands resolute. Oaths break as legions align, and destiny's threads conceal a visionary's dreams. Battles rage, but blades remain sheathed, biding time for a foretold bell's chime to awaken an untold origin and shatter the oath, unveiling a forgotten tale.","description_hash":8661612709652124309},{"title":"The Creature Collecting World of Cillimorphs","fiction_id":"87892","link":"https:\/\/www.royalroad.com\/fiction\/87892\/the-creature-collecting-world-of-cillimorphs","tags":["GameLit","Strategy","Comedy","Sci-fi","Action","Adventure","Sports","Reader Interactive","Soft Sci-fi"],"lable":"Original","following_count":3,"rating":5.0,"page_count":19,"view_count":434,"chapters_count":12,"last_update":1718551046,"description":"Cillimorphs is an interactive creature collector universe like Pokemon, but worse!  Here you can learn all about them, and eventually build your own character and team to star in sprite-illustrated short stories.  You can see everything about the morphs faster over on my blog.\nIn the far future mankind has abandoned Earth and found a system of new planets as their home.  Cryo-freezing all the animals was impractical for the long voyage, but touching them with the spaceborne element cillium turned them into silly, pliable, resilient cillimorphs who could survive the journey.\nOn arrival they were released to the new planets, where they made themselves at home just like us.  Now they're integrated into culture, love to hang and chill, oh and also meet a nice coach like yourself to guide them in competitive rasslin' matches!","description_hash":3888572602484345207},{"title":"“Rebirth, Not Downfall: My Story Isn't What You Think”","fiction_id":"87891","link":"https:\/\/www.royalroad.com\/fiction\/87891\/rebirth-not-downfall-my-story-isnt-what-you-think","tags":["LitRPG","Reincarnation","Urban Fantasy","Male Lead","Contemporary","Fantasy","Harem","School Life"],"lable":"Original","following_count":7,"rating":0.5,"page_count":208,"view_count":4322,"chapters_count":67,"last_update":1718599562,"description":"Lin Yu finds himself in an inexplicable situation, uncertain why he has been transported to this unfamiliar world.In tales he knew, those who traversed through time landed in realms of mystical cultivation, where a single sword could determine the fate of thousands;Some found themselves in historical eras, altering the course of history, wielding power that influenced entire dynasties;Others journeyed back a few decades, leveraging information gaps to amass wealth and lead lives of unparalleled luxury.Yet, why would anyone traverse to a place like this?","description_hash":331341488580311688},{"title":"Milton’s Workshop of Magical Enchantments ","fiction_id":"87890","link":"https:\/\/www.royalroad.com\/fiction\/87890\/miltons-workshop-of-magical-enchantments","tags":["Male Lead","Slice of Life","Drama","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":5,"rating":5.0,"page_count":41,"view_count":446,"chapters_count":5,"last_update":1718407080,"description":"Welcome to Milton’s Workshop of Magical Enchantments where we bring out your equipment’s full potential! Bring your own to be enchanted by our master wizard while you wait or purchase our pre enchanted gear! Our prices are reasonable, and your satisfaction is guaranteed!\nThis fiction tells the story of the day to day life of an apprentice in a master enchanter’s workshop and the myriad of customers from all walks of life that come through its doors as they come looking for the services of the best enchanter in the business!","description_hash":6363009683906255925},{"title":"Dawn of the End","fiction_id":"87889","link":"https:\/\/www.royalroad.com\/fiction\/87889\/dawn-of-the-end","tags":["Progression","War and Military","Multiple Lead Characters","Drama","Action","Historical","Male Lead","Female Lead","Strategy","Soft Sci-fi","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":36,"chapters_count":1,"last_update":1717600457,"description":"In the aftermath of the devastating Great War, the world strives to rebuild and reconcile. However, in 1922, the emergence of Aralia, a nation boasting unmatched technology, shatters the fragile peace. As Aralia rises to power, a former soldier defects, haunted by unknown reasons and the trauma of his past. Now fighting alongside his new comrades against his former allies, he struggles for redemption and a brighter future. But as tensions escalate, the question looms: will they triumph, or is their fate sealed by the specter of war?","description_hash":8863919830199203010},{"title":"Griidlords: A Throne for a Blood Prince","fiction_id":"87888","link":"https:\/\/www.royalroad.com\/fiction\/87888\/griidlords-a-throne-for-a-blood-prince","tags":["LitRPG","Progression","Post Apocalyptic","Super Heroes","War and Military","Action","Adventure","Fantasy","Sci-fi","Male Lead","Soft Sci-fi","Dystopia"],"lable":"Original","following_count":6,"rating":5.0,"page_count":68,"view_count":539,"chapters_count":12,"last_update":1718567471,"description":"This Story is a Prequel to \"A Time of Change and Broken Chains\", but can be read concurrently, before or after.   This book should definitely be read before the book that will follow \"A Time of Change and Broken Chains\".  My posting of \"A Time of Change and Broken Chains\" has caught up with the Patreon, and I can't go ahead of my Patrons here on Royal Road, so I've decided I'm ready to start dropping chapters of this story while \"A Time of Change and Broken Chains\" concludes.\nSet in the Griidlord's universe of Order and Entropy, more than two centuries before the events of \"A Time of Change and Broken Chains\", Tiberius has been pushed to compete for the Sword of Boston by his father.  His father has amassed a great fortune as a merchant, he could buy and sell the castles and lands of the lords of the city, but there is one thing his money can't buy: nobility.  \nTiberius has been trained and honed to compete for the Griidsuit and the founding of a new noble house that would be granted by attaining it.  Competing against the sons and daughters of nobles houses, youths that have been trained by the finest tutors, youths that come from lines of Griidlords themselves, youths that see the suit as their birthright, Tiberius must navigate his own doubts, his own inadequacy, and see if he can grow enough in the precious days of the Choosing to become worthy of becoming The Sword of Boston.\nI have categorized this story as a LitRPG, but it might be more accurately called lite-LITRPG.  I'm new to the genre, but I'm having fun playing with it, so please, be forgiving and don't expect the hardcore stat sheets I've seen in some other stories.","description_hash":-7347246551180960161},{"title":"A game that took over the world","fiction_id":"87887","link":"https:\/\/www.royalroad.com\/fiction\/87887\/a-game-that-took-over-the-world","tags":["Virtual Reality","Progression","Strategy","Comedy","Multiple Lead Characters","Action","Adventure","Sci-fi","GameLit"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":83,"chapters_count":2,"last_update":1717600640,"description":"in a parallel Earth, a Game suddenly appeared. no one knew who made the game or how it was made, but, the game was revolutionary. it replicated the five senses to perfection and put the games before it to shame. the game felt too real, too magical and too good to be true.\n As time went on the game started becoming more and more influential on the real world and people flocked to the it and its information to not be behind times. jobs started emerging in the games world and many people took them. jobs like streamers and gamers started becoming more respected and reputable in society.\nThis is a story of how a Game become a second world. Bustling with people and cultures, legends and myths, wars and kingdoms and rulers and history. so join this world and explore it to the fullest !\n -------------------------------------------------------------------------------------------------------- 1- 2 chapters a week and 1500 words minimum per chapter - ( PS . my second novel so i will try my best ;) there will be no main character in this novel. This is a creative choice so just pick your favorite character and root for them i will try to make each character important and involved in the plot","description_hash":5910936030156700502},{"title":"Backwoods Dungeon","fiction_id":"87886","link":"https:\/\/www.royalroad.com\/fiction\/87886\/backwoods-dungeon","tags":["LitRPG","Urban Fantasy","Dungeon","Multiple Lead Characters","Slice of Life","Action","Adventure","Fantasy","Romance","Supernatural","Male Lead","Female Lead","Magic","Mythos","Progression"],"lable":"Original","following_count":563,"rating":4.54,"page_count":115,"view_count":20420,"chapters_count":17,"last_update":1718636420,"description":"“The seals are broken. The Hells awaken. Take up arms, humanity. The ancient enemy comes once more.”\nThose words sat at the top of a class selection screen covering Theo Tande's vision shortly after surviving a sudden goblin attack in his backyard.\nStill, those goblins dropped money when they died. And he'd just been fired. He'd made stupider choices... Probably.\nHis wife, Rio, strongly disagreed. \n\nWhat to expect: - First Person POVs- A Husband and Wife Dungeon Diver Story- Item and Skill-Focused LitRPG System- Blood, Gore, Excessive Swearing - Guns That Actually Work - Male and Female Protagonists- No Harem or Cultivation\n\nChapters Release Every Two Days","description_hash":-5986998146206782145},{"title":"An Angel's Torment","fiction_id":"87885","link":"https:\/\/www.royalroad.com\/fiction\/87885\/an-angels-torment","tags":["Progression","Grimdark","Psychological","Male Lead","Tragedy","Horror","Mystery","Supernatural","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":81,"chapters_count":2,"last_update":1717842574,"description":"Markus is forced to endure the torment of a self-proclaimed \"Angel\" that goes by the name \"Gabriel\". Markus is forced to by Gabriel to enter \"Doors\" that leads to other worlds\/scenario, with one sole objective, to die a painless death.(May contain bad grammar, sorry if you see them, constantly trying to improve my english. Also, may take a long time to update since I have school)","description_hash":2234108943985109092},{"title":"Peerless Dragon","fiction_id":"87884","link":"https:\/\/www.royalroad.com\/fiction\/87884\/peerless-dragon","tags":["Urban Fantasy","Strong Lead","Action","Adventure","Romance","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":49,"view_count":843,"chapters_count":11,"last_update":1718571662,"description":"Qi Dantian, a man of leisure, ruled a prison, imprisoning thousands of powerful figures. Until his fiancée, already a two-star general, casually tore up their marriage contract, he realized... that the world would dance to his tune when he stepped out of this corner.","description_hash":-6943535069821241631},{"title":"Threads of Fate ","fiction_id":"87883","link":"https:\/\/www.royalroad.com\/fiction\/87883\/threads-of-fate","tags":["Comedy","Action","Adventure","Fantasy","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":13,"view_count":83,"chapters_count":2,"last_update":1718474228,"description":"\"A fated encounter bound by a rare potion; two beings, strangely connected, caught in a mess they hadn't even imagined in their wildest nightmares.\"","description_hash":8017334488264997709},{"title":"Granny Anna","fiction_id":"87882","link":"https:\/\/www.royalroad.com\/fiction\/87882\/granny-anna","tags":["Urban Fantasy","Anti-Hero Lead","Comedy","Multiple Lead Characters","Slice of Life","Action","Adventure","Fantasy","School Life","Supernatural","Female Lead","Strong Lead","Non-Human Lead","Secret Identity","Magic","Low Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":3,"view_count":65,"chapters_count":1,"last_update":1717589532,"description":"One of the most powerful magical practitioners of all time, Morgana Lefay, ends up with a goblin child on her doorstep. Shenanigans and family fluff ensue.","description_hash":1025227756782706050},{"title":"Socks","fiction_id":"87881","link":"https:\/\/www.royalroad.com\/fiction\/87881\/socks","tags":["Slice of Life","Adventure","Short Story","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":54,"chapters_count":1,"last_update":1717589517,"description":"A sock gets lost in the laundry and goes on a journey to get back to its mate","description_hash":-4584278181120765025},{"title":"The Weeping Swordsman","fiction_id":"87880","link":"https:\/\/www.royalroad.com\/fiction\/87880\/the-weeping-swordsman","tags":["Comedy","Action","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":35,"view_count":191,"chapters_count":4,"last_update":1718446322,"description":"A talented swordsman finds himself in a pickle as he is tasked with accompanying a pair of siblings who wish to become adventurers. He must show them the pros and cons of such a life and protect them with his own. Join this band of adventurers as they journey through the nine realms, searching for thrilling adventures and maybe some food along the way.\nNote: This book is just a small piece of my larger novel. Updated every Wednesday and Saturday","description_hash":6971076282183901029},{"title":"Kurosawa Chronicles: Season 1","fiction_id":"87879","link":"https:\/\/www.royalroad.com\/fiction\/87879\/kurosawa-chronicles-season-1","tags":["Progression","Action","Adventure","Fantasy","Mystery","Magic"],"lable":"Original","following_count":2,"rating":5.0,"page_count":58,"view_count":147,"chapters_count":4,"last_update":1718121732,"description":"Kurosawa Chronicles, is a fantasy adventure story in an anime type world setting.\n\nIn a horrific tragedy, faced with the hardest decisions, Hiroto Kurosawa is terrifyingly forced to grow up quickly and stay on his feet to survive.\n\nHiroto's journey will be a heart pounding action packed hunt for survival, while also over flowing with magic and mystery around every corner.\n\n Hiroto will face monsters, demons, and beyond, all while making friends, and finding his inner strength in his attempt to end the terror of the demon lord, and uncovering the truths that lay beneath the shrouded past.\n**************************\nAuthor note:\nThis novel is inspired by years of watching anime like, \"rise of the shield hero\", \"konosuba,\" or even \"demon slayer.\"\nI plan on publishing multiple seasons for this series!\nYou're in for a very big treat with this novel! I Hope to hear from you soon. Enjoy!\n^_^\nAuthor: Daniel J Albers","description_hash":4511970668269285522},{"title":"Void's Aura","fiction_id":"87878","link":"https:\/\/www.royalroad.com\/fiction\/87878\/voids-aura","tags":["LitRPG","Anti-Hero Lead","Female Lead","Strong Lead","Action","Adventure","Fantasy","Horror","Supernatural","Magic","GameLit","Low Fantasy"],"lable":"Original","following_count":4,"rating":5.0,"page_count":12,"view_count":159,"chapters_count":2,"last_update":1717707662,"description":"An update has appeared on everyones phone causing them to take the roles of video game characters. Elidia who has quite the unfortunate skill tends to get concerned looks\n???\"do not look at me like that I've done nothing wrong...\" she says while holding the disfigured corps of another player\nOf course the players beloved savior Aurora will always vouch for Elidia clearing any doubts from their mind \nAurora: \"she is just performing a sacred ritual!\"\nPlayer:\"oh okay!\"\nElidia:\"...\"","description_hash":-4246303338094153473},{"title":"Frost bitten","fiction_id":"87877","link":"https:\/\/www.royalroad.com\/fiction\/87877\/frost-bitten","tags":["Tragedy","Horror","Mystery","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":26,"view_count":173,"chapters_count":6,"last_update":1717621153,"description":"A vampire? Down at the old church are stories of horror, and mystery. Now, there’s a child claiming to be a monster.","description_hash":-5093131100762389095},{"title":"Universal Game Theory","fiction_id":"87876","link":"https:\/\/www.royalroad.com\/fiction\/87876\/universal-game-theory","tags":["Virtual Reality","Progression","Super Heroes","Male Lead","Sci-fi","Adventure","Drama","Fantasy","LitRPG","Supernatural","Magic","GameLit","High Fantasy","Genetically Engineered ","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":1,"rating":4.5,"page_count":32,"view_count":228,"chapters_count":6,"last_update":1718485263,"description":"For Johnny Max Riker it is time to move past his career as a professional gamer to the next step in his life. Fortunately there was a convenient alien invasion recently, bringing with them \"The Game\". What better next step is there for a Video Gamer than to move beyond the screen? But, like everything, things don't come easy and winning only means that the next big challenge is even harder. Eventually a guy just has to ask the question: What is the point of playing The Game, and what does it mean to 'win'?\nUpdates: Tuesday, Thursday, and Saturday. Also other times if I feel like it.","description_hash":6247538905566496128},{"title":"Goblin Secrets","fiction_id":"87875","link":"https:\/\/www.royalroad.com\/fiction\/87875\/goblin-secrets","tags":["Female Lead","Sci-fi","Adventure","Fantasy","Short Story"],"lable":"Original","following_count":2,"rating":5.0,"page_count":30,"view_count":129,"chapters_count":2,"last_update":1718210652,"description":"When Lisa plays a practical joke on the Elders of her settlement, they retaliate against her family. Determined to fix what went wrong, Lisa turns to the forest, where for centuries the goblins have lived in hiding, hoarding forbidden knowledge which has the power to change the world as she knows it...","description_hash":5295489806868988861},{"title":"Mana Veins Saga - Empire Reborn ","fiction_id":"87874","link":"https:\/\/www.royalroad.com\/fiction\/87874\/mana-veins-saga-empire-reborn","tags":["LitRPG","Progression","Post Apocalyptic","War and Military","Wuxia","Action","Adventure","Fantasy","Romance","Martial Arts","Male Lead","Female Lead","Multiple Lead Characters","Magic","Strategy","Mythos","Ruling Class","Genetically Engineered ","Dystopia"],"lable":"Original","following_count":2,"rating":0.0,"page_count":55,"view_count":414,"chapters_count":6,"last_update":1718408600,"description":"The world was destroyed. Now we must build something new.\nLitRpg\nProgression\nEmpire building\nVanilla romance\nSome Violence","description_hash":-7464241048259337356},{"title":"Star of Ruin","fiction_id":"87873","link":"https:\/\/www.royalroad.com\/fiction\/87873\/star-of-ruin","tags":["Progression","Anti-Hero Lead","Space Opera","Ruling Class","Female Lead","Action","Adventure","Fantasy","Romance","Male Lead","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":12,"view_count":97,"chapters_count":3,"last_update":1717696653,"description":"No one knew. The world didn't know. The disaster that fell was unprecedented and terrifying. The disease dubbed the Awn changed the world forever, those who kindled it earned powers beyond mankind and those who didn't fall prey to the Withering. After decades humanity adapted and tracked the source of the Awn, Outer space. Diligent and heroic individuals set out to banish the source except they never came back apart from one. These heroic individuals gained status power and fame but could not reach that one hero. \"Radiants!\" mankind called them.","description_hash":-2073631711732345941},{"title":"FOUR NIGHTS AT THE RETIREMENT HOME OF TORMENT","fiction_id":"87872","link":"https:\/\/www.royalroad.com\/fiction\/87872\/four-nights-at-the-retirement-home-of-torment","tags":["Urban Fantasy","Anti-Hero Lead","Grimdark","Male Lead","Contemporary","Horror","Satire"],"lable":"Original","following_count":1,"rating":0.0,"page_count":19,"view_count":71,"chapters_count":2,"last_update":1717880085,"description":"(A Novella for the Community Magazine Contest)\nRoberto screwed up in his life, big time. He seems left only with the option of wasting all of the days he has left to live.\nHe has become a cynic, unhealthy, crappy individual. Metaphorically, a goblin.\nOne late night a mysterious lunatic approaches and offers him a job. Being a literal social health operator goblin in the retirement home he owns.\nHaving nothing left to lose, and curious to see what truth lies in the words of the weird stranger, Roberto accepts.","description_hash":3320217007748433813},{"title":"For Want of Civilisation (Fallout)","fiction_id":"87871","link":"https:\/\/www.royalroad.com\/fiction\/87871\/for-want-of-civilisation-fallout","tags":["Progression","Post Apocalyptic","Ruling Class","Sci-fi","Tragedy","Action","Adventure","Hard Sci-fi"],"lable":"Fan Fiction","following_count":4,"rating":4.5,"page_count":25,"view_count":135,"chapters_count":2,"last_update":1718195193,"description":"Nuclear hellfire has collapsed pre-war civilisation. Now, two hundred years after the bombs fell, a child dreams of wonders. Wonders only seen in terminals, dusty books and forgotten vaults. Join Leon Frederik as he grapples with his dreams as he tries to turn it into a reality, all with a goal of rebuilding civilisation. Born into a wealthy and influential family from the New California Republic, surely he'll succeed?\nThe NCR, a bastion of democracy, prosperity and civilisation amonst the Wasteland, with Leon's help perhaps a return to normalcy, to a pre-war state can be achieved? Surely, nothing can go wrong?\nUpdates every Wednesday.","description_hash":-8338021117683478387},{"title":"Spawn of the Outworlder","fiction_id":"87870","link":"https:\/\/www.royalroad.com\/fiction\/87870\/spawn-of-the-outworlder","tags":["Portal Fantasy \/ Isekai","Progression","Psychological","Multiple Lead Characters","Harem","Adventure","Fantasy","Romance","Reincarnation","Male Lead","High Fantasy","Mythos"],"lable":"Original","following_count":1,"rating":0.0,"page_count":85,"view_count":221,"chapters_count":7,"last_update":1717801910,"description":"Graham Blackwell is a simple woodcutter from the village Brightshade that has recently been plagued with nightmares. When an agent of the Emperor, Luna Rucervus, arrives to the town, Graham begins to learn that these nightmares may be more than simple fantasy.","description_hash":-6375483016394396779},{"title":"Demon Girl Hellscape","fiction_id":"87869","link":"https:\/\/www.royalroad.com\/fiction\/87869\/demon-girl-hellscape","tags":["Anti-Hero Lead","Psychological","Non-Human Lead","Strong Lead","Action","Adventure","Fantasy","Female Lead","Attractive Lead"],"lable":"Original","following_count":17,"rating":0.0,"page_count":46,"view_count":861,"chapters_count":9,"last_update":1718494220,"description":"In \"Demon Girl Hellscape,\" Lilith, a demoness with a rebellious spirit, grows weary of the endless torment and subjugation in Hell. Determined to forge her own path to freedom, she embarks on a perilous journey into the Abyss, the darkest and most dangerous region of Hell. Battling formidable demonic creatures and overcoming countless obstacles, Lilith's resolve remains unshakable.\nAt the heart of the Abyss, she encounters Drakon, a powerful guardian determined to crush her rebellion. In a fierce and brutal battle, Lilith draws on her inner strength and skill to defeat Drakon, shattering his weapon and ultimately his life. With Drakon defeated, Lilith opens the Gate of Shadows, the final barrier to her escape.\nStepping into the world above, Lilith finds herself in a land of unprecedented beauty and peace. However, her journey is far from over, as she soon senses a sinister presence lurking nearby. Determined to face whatever challenges lie ahead, Lilith sets off into this new world, her steps confident and resolute, ready to confront the unknown future.","description_hash":-2027626824879052920},{"title":"Who is Nobody?","fiction_id":"87868","link":"https:\/\/www.royalroad.com\/fiction\/87868\/who-is-nobody","tags":["Portal Fantasy \/ Isekai","Progression","Psychological","Female Lead","Tragedy","Drama","Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":19,"view_count":40,"chapters_count":1,"last_update":1717579990,"description":"Struggling with a complete loss of memory, Nobody finds herself in a peculiar house filled with strange rooms, fantastical creatures, and a journey of self-discovery. With the help of her cheerful and adventurous friend, Cecily, Nobody embarks on a quest to invite all the unusual inhabitants of the house to a grand banquet. This banquet is said to celebrate her being a new member of the house, but perhaps it entails much more than that.","description_hash":-5600984604382294434},{"title":"You Can't Use the G-Word Anymore, Mawmaw","fiction_id":"87867","link":"https:\/\/www.royalroad.com\/fiction\/87867\/you-cant-use-the-g-word-anymore-mawmaw","tags":["Ruling Class","Comedy","Male Lead","Fantasy","Romance","Short Story","School Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":26,"view_count":167,"chapters_count":4,"last_update":1718500099,"description":"[Participant in the June 2024 Magazine Contest. The theme - 'Goblins and Grandmas']\nRazan is back home for a family reunion following his first year at Mage's College. But things get awkward when the conversation of his new college sweetheart comes up. For you see, she's a little green. Will grandmother and grandpa be able successfully adapt to the relationship dynamics of a more civilized age? And will they ever be able to get over the fact that their grandson and his new paramour are already cohabitating? How many half-goblin babies will the happy couple have in the epilogue? Let's find out!","description_hash":-4844618101663481538},{"title":"Hydra of Discord [PBP Homebrew Timeloop]","fiction_id":"87866","link":"https:\/\/www.royalroad.com\/fiction\/87866\/hydra-of-discord-pbp-homebrew-timeloop","tags":["Portal Fantasy \/ Isekai","Time Loop","Progression","Non-Human Lead","Strong Lead","Action","Adventure","Fantasy","Reincarnation","Reader Interactive","Supernatural","Magic","Mythos","Time Travel","First Contact"],"lable":"Original","following_count":16,"rating":5.0,"page_count":23,"view_count":822,"chapters_count":9,"last_update":1718132178,"description":"Discord grows weary of the steady march of Order and so decides to inject a small drop of mayhem into the mortal plane. \n\nThis is a write-up of a game played on my Discord server","description_hash":260994896626675221},{"title":"Embers of Eliordira","fiction_id":"87865","link":"https:\/\/www.royalroad.com\/fiction\/87865\/embers-of-eliordira","tags":["Urban Fantasy","Progression","Non-Human Lead","Action","Adventure","Fantasy","Male Lead","Magic","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":41,"chapters_count":1,"last_update":1717579699,"description":"Rhresh is a goblin and considers himself to be a fairly average one at best, however after a surprisingly successful mission Rhresh is given a quest by the mysterious and powerful 'Grandma' a quest that he doesn't think he is quite ready to handle.\nFollow Rhresh as he teams up with an eclectic group of different species, occupation, and ideals. trying their best to end the world of Eliordria's magic shortage crisis and prevent a war between species. \nEliordria is a modern world that developed in both magic and technology.\n---\nWhat to expect\nProgression: our characters will develop and grow stronger overtime although not to insane levels\nNot LitRPG: No stats or systems although there is interactions between technology and magic (spellbook app has a list of spells for example)\nPOVs: Focus on Rhresh's point of view there will be brief focuses on other characters in some of the chapters but a specific interlude chapter focusing on the POV of a certain character will be rare if it happens at all\nI'm A New Writer: I will mess up! This is my first time writing fiction of any length! please give me constructive feedback and point out any grammatical errors! Ty!\nUpdates: I'm going to try and keep this story updated at a regular schedule I'll start out at 2 chapters a week and maybe ramp it up from there (Tuesday and Saturday currently)\nThis is part of the Goblins and Grandmas contest.","description_hash":1888616218629189328}]