[{"title":"Ode to the Vines","fiction_id":"87864","link":"https:\/\/www.royalroad.com\/fiction\/87864\/ode-to-the-vines","tags":["Strategy","Grimdark","Steampunk","Multiple Lead Characters","Secret Identity","Drama","Historical","Romance","Mystery","Female Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":132,"view_count":417,"chapters_count":16,"last_update":1718595408,"description":"In the grimy, fog-laden streets of Victorian London, a young girl down on her luck receives an unexpected offer from Adam Clarke after she miraculously saves his wife, Monica. Grateful and intrigued by her skills, Adam offers her a life-changing opportunity to become a forensic scientist under his tutelage. Eager to escape her dire circumstances, she accepts.\nUnder Adam’s mentorship, she quickly adapts to her new role, unraveling complex cases and earning a reputation for her keen intellect and intuition. However, as she delves deeper into her work, she begins to notice unsettling patterns. The cases she investigates seem inexplicably connected, all pointing back to Adam and her newfound allies.\nHaunted by suspicion, she embarks on a covert investigation of those around her, determined to uncover the truth. Balancing her secret quest with her professional duties, she navigates a web of intrigue and deception, all while maintaining the façade of a dedicated forensic scientist. As she digs deeper, she realizes that uncovering the truth may come at a perilous cost, both to her career and her life.","description_hash":-3843477279697962768},{"title":"Circus Freak Murder Spree","fiction_id":"87863","link":"https:\/\/www.royalroad.com\/fiction\/87863\/circus-freak-murder-spree","tags":["Portal Fantasy \/ Isekai","Anti-Hero Lead","Male Lead","Action","Adventure","Fantasy","Mystery","Reincarnation","High Fantasy"],"lable":"Original","following_count":4,"rating":0.0,"page_count":22,"view_count":311,"chapters_count":5,"last_update":1718321419,"description":"The bustling streets of Tokyo were alive with the sounds of the morning rush hour. Akira, a shy, introverted high school boy, shuffled along, lost in thought. Suddenly, a sharp crack pierced the air, and Akira was struck by a searing pain. He collapsed, his life snuffed out in an instant.\nAkira's eyes fluttered open to a strange, fantastical world. He was adorned in a clown-like costume and found himself in a dimly lit chamber. A masked figure approached, revealing that Akira had been reborn in this world for a purposeful journey.\nDazed and confused, Akira struggled to make sense of his new reality. He had been shot and killed, yet here he was, alive and well, albeit in a bizarre and unfamiliar form. Fear and uncertainty washed over him, but a spark of curiosity and hope emerged.\nAkira decided to embrace the challenges of his new life and discover the purpose of his reincarnation. He took a deep breath and stepped forward, ready to confront the unknown and forge a new path in this fantastical world.","description_hash":5300858344990955042},{"title":"Jujutsu Kaisen: Absolute","fiction_id":"87862","link":"https:\/\/www.royalroad.com\/fiction\/87862\/jujutsu-kaisen-absolute","tags":["Urban Fantasy","Anti-Hero Lead","Martial Arts","Comedy","Multiple Lead Characters","Action","Horror","Tragedy","Slice of Life","School Life","Supernatural","Male Lead","Female Lead","Strong Lead","Grimdark","Low Fantasy"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":6,"view_count":85,"chapters_count":2,"last_update":1717626768,"description":"A Jujutsu Kaisen Fanfiction Story. Based in the Real World (Like JJK) but with a whole new story, characters, and techniques. It's my spin on the JJK story, I'd say it's darker but I don't think that's possible given what JJK IS in canon, but I'm trying. I suggest reading through the ACTUAL Jujutsu Kaisen series before starting this one, so you've got a working knowledge of the systems and rules of the world.\nTokyo, Japan, 2024. The Tokyo Jujutsu High seeing the exit of its 3rd-year alumni by the end of the next year, Nakaoka Shōwa, Kawasaki Fujino, and Ishigami Jigen. The trio have been exorcising curses since their first year and no longer face the issues that their Juniors do when committing an exorcism. However, when Powerful Cursed Spirits and Sorcerers start showing up more and more, the trio and their Juniors must face down the threat and save Tokyo from being overrun... or die trying, as is the duty of all Sorcerers.","description_hash":-3302835250937748548},{"title":"Warped","fiction_id":"87861","link":"https:\/\/www.royalroad.com\/fiction\/87861\/warped","tags":["Reincarnation","Non-Human Lead","Sci-fi","Strong Lead","Action","Adventure","Technologically Engineered","Soft Sci-fi","Dystopia"],"lable":"Fan Fiction","following_count":9,"rating":5.0,"page_count":54,"view_count":1122,"chapters_count":13,"last_update":1718572884,"description":"A reincarnation of a man into the 41st millennium.","description_hash":2115951245364380258},{"title":"Steel and Leather: A Fallout Story","fiction_id":"87860","link":"https:\/\/www.royalroad.com\/fiction\/87860\/steel-and-leather-a-fallout-story","tags":["Post Apocalyptic","Female Lead","Action","Adventure","Romance"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":10,"view_count":34,"chapters_count":1,"last_update":1717579658,"description":"As a merchant of the Happy Trails Caravan company was heading east towards New Mexico, she runs into an ambush, and is saved by a Brotherhood of Steel member, who takes her into the bunker to patch her up. The two end up finding out more than they could ever expect, about the wasteland and each other as they begin a journey towards the city of Albuq to meet up with the merchant's caravan and to investigate the ambushes.","description_hash":-3401328460919227233},{"title":"Grandpa left me a soulbound sword","fiction_id":"87859","link":"https:\/\/www.royalroad.com\/fiction\/87859\/grandpa-left-me-a-soulbound-sword","tags":["LitRPG","Urban Fantasy","Dungeon","Martial Arts","Comedy","Action","Adventure","Fantasy","Magic","Low Fantasy","Progression"],"lable":"Original","following_count":12,"rating":0.0,"page_count":6,"view_count":135,"chapters_count":1,"last_update":1717579654,"description":"It's all about the sword.\nImagine you were given a magical sword... what would you do with it?\n[ROYAL ROAD COMMUNITY MAGAZINE ENTRY JUNE 2024]","description_hash":8227360648295624115},{"title":"The Genetic Heroes - Part 3: Eric","fiction_id":"87858","link":"https:\/\/www.royalroad.com\/fiction\/87858\/the-genetic-heroes-part-3-eric","tags":["Anti-Hero Lead","Super Heroes","Male Lead","Sci-fi","Action","Adventure","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.5,"page_count":58,"view_count":323,"chapters_count":16,"last_update":1718222402,"description":"To many, Eric Yun seems like a stereotypical high school nerd, one who becomes overshadowed by their best friend. Eric isn't that nerd. He's actually very smart, with an IQ of 195, and is able to build technologies that the best geniuses in the world would only dream of. Not only that, he's been living alone with holograms of his parents. His parents were killed by a man named Dr. Varnie. It's only now that Varnie and Eric meet again, and this time, Eric is out for revenge.","description_hash":5881004426985541575},{"title":"Song of the Sea","fiction_id":"87857","link":"https:\/\/www.royalroad.com\/fiction\/87857\/song-of-the-sea","tags":["Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","War and Military","Male Lead","Action","Adventure","Fantasy","Romance","Reincarnation","Harem","Magic","Strategy","Low Fantasy","Ruling Class"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":23,"view_count":81,"chapters_count":2,"last_update":1717685479,"description":"aSoIaF Male Self Insert:\nIt is 160AC, a full thirty-one years after the last great Westerosi civil war began. In Dorne, Daeron the Young Dragon is finding that holding Dorne is a lot more difficult than conquering it. In King's Landing, a willful young lady is forced to marry her devout pious brother. A young prince basks in the perks of his title and its complete lack of responsibilities, not caring for the resentment he creates. A Dragonknight seethes, confusing duty and love.\nAnd a young man named Aurion Velaryon has been another man for the last six years. An adult from another world.","description_hash":-847043066609037128},{"title":"The Fallen Nine","fiction_id":"87856","link":"https:\/\/www.royalroad.com\/fiction\/87856\/the-fallen-nine","tags":["Strategy","Multiple Lead Characters","Secret Identity","Strong Lead","Drama","Action","Historical","Mystery","Male Lead","Mythos","Attractive Lead"],"lable":"Original","following_count":7,"rating":5.0,"page_count":6,"view_count":98,"chapters_count":1,"last_update":1717562441,"description":"In the bustling heart of modern India, a chilling murder throws the city into disarray. Detective Vishal, a hardened investigator with a jaded past, is called in to decipher the cryptic clues left behind. Meanwhile, Sathwik, a tech-savvy young man fueled by grief, embarks on a relentless pursuit of his brother's killer. \nTheir paths converge as they delve deeper into a world shrouded in ancient secrets. Vishal, with his keen eye for detail and street smarts, navigates the murky underworld of criminal activity. Sathwik, wielding his technological prowess, uncovers a trail of digital breadcrumbs leading to the truth.\nLurking in the shadows is another player - a mysterious figure searching for an object of impossible power. As these disparate threads begin to intertwine, the stakes rise dramatically. Vishal grapples with the demons of his past while confronting a killer with a cunning beyond compare. Sathwik teeters on the edge of despair as he seeks solace in revenge.  \n**The Fallen Nine** is a heart-pounding noir-style thriller that explores themes of revenge, self-discovery, and the burden of the past. Can Vishal overcome his personal demons to bring a killer to justice, or will the darkness within consume him? Will Sathwik find closure through vengeance, or will he be forced to unearth the truth and confront his grief? As their stories collide, they expose a hidden world where ancient secrets hold the key to unraveling a modern-day mystery. \n\nThe Fallen Nine - written by Jason","description_hash":5910723680293870918},{"title":"Goblin Salt","fiction_id":"87855","link":"https:\/\/www.royalroad.com\/fiction\/87855\/goblin-salt","tags":["Grimdark","Drama","Action","Fantasy","Short Story","Supernatural","Low Fantasy","Mythos","First Contact"],"lable":"Original","following_count":4,"rating":5.0,"page_count":19,"view_count":112,"chapters_count":2,"last_update":1718312709,"description":"Told from the perspective of a survival journal, the story follows an unnamed narrator and their relationship with their grandma, who happens to ward off goblins and other varmints from their isolated home in the Canadian woods. With them and the rest of their family not believing, the narrator decides to finally follow their grandma on one of her \"hunts\", only to accidentally make matters worse and let the varmints loose. With each chapter, we read a new letter from the narrator, recounting what has taken place over the last two weeks since the first incident. What was happened to them? What has happened to their family? What are they writing these letters for? Find out in the short, journaled words of Goblin Salt.","description_hash":7986604404408889823},{"title":"WHISPER OF ARCANE","fiction_id":"87854","link":"https:\/\/www.royalroad.com\/fiction\/87854\/whisper-of-arcane","tags":["Portal Fantasy \/ Isekai","Progression","Comedy","Male Lead","Adventure","Fantasy","Horror","School Life","Supernatural","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":29,"view_count":407,"chapters_count":8,"last_update":1718556115,"description":"Aiden Falcavin, a high school student leading a content life, finds his world turned upside down when he is suddenly transported to Lumidia, a realm where magic is real. Captured by an evil sorcerer, he becomes the subject of a dark ritual and is afflicted with a deadly curse. Will he find a way back home? Can he transform his misfortune into fortune? Join Aiden on his adventure.","description_hash":-74340852358285353},{"title":"Beyond the Surface","fiction_id":"87853","link":"https:\/\/www.royalroad.com\/fiction\/87853\/beyond-the-surface","tags":["Portal Fantasy \/ Isekai","Non-Human Lead","Adventure","Fantasy","Reincarnation","Female Lead","Magic","High Fantasy","Mythos","First Contact"],"lable":"Original","following_count":4,"rating":0.0,"page_count":6,"view_count":54,"chapters_count":1,"last_update":1717555691,"description":"When Ester's heart is shattered by her boyfriend, she seeks solace at a familiar childhood lake. But a freak storm changes everything when a falling tree strikes her down. As she drifts into the mythical world of the lake's inhabitants, Ester's journey takes a supernatural turn she never expected.","description_hash":-5424740858325359870},{"title":"The Cold Flames","fiction_id":"87852","link":"https:\/\/www.royalroad.com\/fiction\/87852\/the-cold-flames","tags":["Portal Fantasy \/ Isekai","Multiple Lead Characters","Adventure","Fantasy","Supernatural","Magic","Mythos"],"lable":"Original","following_count":1,"rating":0.0,"page_count":127,"view_count":407,"chapters_count":10,"last_update":1718595009,"description":"College student Roland Steward, teenager Delaney Jefferson, and bankrupt farmer Ron Berch find themselves separately drawn into a wilderness world where they are immediately pursued by hideous, murderous thugs. In their desperate attempts to escape, they discover they have arrived in a world with 5 separate realms of reality, each with its own peculiar laws of nature.\nThe First is an oppressively gray and gloomy realm in which the inhabitants display a dullness of mind that mirrors their surroundings. The Second corresponds to the reality that the three came from. The Third is an intensified world of exceptional powers. The Fourth is a realm of great empires, wizards, and extraordinary beasts. The Fifth is a realm far beyond human understanding, inhabited by immortal spirits with unspeakable powers. Realm borders are tricky places to be because no one can retain powers greater than those that exist in the realm they currently occupy.\nAided by two mysterious wanderers, Roland, Delaney, and Ron race through the Second Realm into the mountains of the Third where the manhunt for them intensifies. Each harrowing escape provides clues as to who is pursuing them and why. Finally they deduce that someone is attempting the unthinkable act of shattering the realm boundaries and considers these interrealm travelers to be the chief obstacle standing in their way.","description_hash":2609732721820162153},{"title":"Fight For Freedom Or Die Trying...","fiction_id":"87851","link":"https:\/\/www.royalroad.com\/fiction\/87851\/fight-for-freedom-or-die-trying","tags":["Grimdark","Drama","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":37,"view_count":126,"chapters_count":2,"last_update":1717696015,"description":"In a world where certain races are segregated, exiled and free to be killed, four young goblins rise to fight for racial justice and reclaim their rights to live with the help of four retired and old war heroes.\nSpecial submission for June 2024 RRCM","description_hash":8812481786178149398},{"title":"Westeros : Echoes of Warframe","fiction_id":"87850","link":"https:\/\/www.royalroad.com\/fiction\/87850\/westeros-echoes-of-warframe","tags":["Portal Fantasy \/ Isekai","War and Military","Fantasy"],"lable":"Fan Fiction","following_count":6,"rating":4.75,"page_count":29,"view_count":485,"chapters_count":6,"last_update":1718079293,"description":"In \"Echoes of Warframe,\" Maximus Mormont awakens in the turbulent world of Westeros, discovering he wields the powers of Warframes, digital warriors from his past life. Amidst the intrigue of the Game of Thrones, Maximus must unlock and master his Warframe abilities while navigating the perilous political landscape.\nStruggling with the loss of his former existence and the weight of newfound responsibilities, Maximus grapples with inner doubts and external threats. With allies and adversaries lurking in every shadow, he must harness his Warframe powers to survive.\nAs Maximus delves deeper into Westeros' secrets, he unravels hidden agendas and confronts unexpected challenges. With the fate of the realm hanging in the balance, Maximus must confront his own desires and the true nature of his new world, forging a path that will shape the future of Westeros and beyond.\n-----------------------------\nYour feedback is invaluable as I embark on this writing journey. Please note that all elements mentioned are copyrighted by Warframe, and characters from Game of Thrones belong to George R.R. Martin; I am merely integrating them into my narrative. Any constructive criticism and suggestions for improvement are welcomed as we craft an engaging tale together.","description_hash":-6722442636024112446},{"title":"Dragon of malgan","fiction_id":"87849","link":"https:\/\/www.royalroad.com\/fiction\/87849\/dragon-of-malgan","tags":["LitRPG","Reincarnation","Time Loop","Dungeon","Post Apocalyptic","Action","Adventure","Drama","Fantasy","Cyberpunk","Sports","Supernatural","Male Lead","Strong Lead","Multiple Lead Characters","Non-Human Lead","Magic","Anti-Hero Lead","Strategy","Grimdark","Low Fantasy","High Fantasy","Space Opera","Mythos","War and Military","Villainous Lead","Ruling Class","Time Travel","Genetically Engineered ","Soft Sci-fi","Progression","Artificial Intelligence"],"lable":"Original","following_count":4,"rating":0.0,"page_count":6,"view_count":98,"chapters_count":1,"last_update":1717901095,"description":"\"chaos dragon\" follows our protagonist who woke up in an unfamiliar realm needed by a strange enigmatic goddess who reveals to him many secrets about his new journey.\nNow in a new world in a new form how will he navigate the strange world that is in a constant state of war and chaos or will he survive at all or will he die just like all his other kin.\n\nYou're going to have to read the story to find out man I don't know what else to tell you.","description_hash":-7043215667512845982},{"title":"Beyond the Portal: A Sorcerer's Journey","fiction_id":"87848","link":"https:\/\/www.royalroad.com\/fiction\/87848\/beyond-the-portal-a-sorcerers-journey","tags":["Portal Fantasy \/ Isekai","Urban Fantasy","Comedy","Multiple Lead Characters","Adventure","Fantasy","Romance","Male Lead","Magic","Mythos","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":11,"view_count":60,"chapters_count":1,"last_update":1717550291,"description":"In the heart of a forgotten realm, Aric, a young sorcerer, stumbles upon an ancient portal emanating a mesmerizing and otherworldly energy. Driven by an insatiable curiosity and a sense of destiny, he steps through the portal and is transported to Earth, a world devoid of magic yet brimming with technological marvels.\nConfused and overwhelmed by the bustling modern city he finds himself in, Aric attracts curious stares due to his archaic attire and magical staff. Amidst the chaos, a mysterious voice in his mind guides him to seek out Elara, a sharp-tongued and skeptical young woman. Despite her initial disbelief and sarcasm, Aric proves his magical prowess, convincing Elara to help him navigate this strange new world.\nAs Elara introduces Aric to the wonders of Earth's technology, from automobiles to smartphones, the two form an unlikely partnership. Elara's street-smart resourcefulness complements Aric's mystical abilities, making them a formidable duo. Together, they explore the city's marvels while Aric seeks to understand the portal that brought him here and the destiny it foretells.\nHaunted by the ethereal voice and driven by a deep sense of purpose, Aric immerses himself in the study of Earth's advancements while also delving into ancient texts in search of clues about the portal. Along the way, he uncovers hints of a great destiny intertwined with the very fabric of reality, one that requires him to confront extraordinary challenges and make profound discoveries.\nAs they embark on their journey, Aric and Elara face numerous obstacles and forge deep connections. The journey not only transforms Aric, who learns to blend his magical heritage with the new world’s technological wonders, but also Elara, who discovers a world beyond her skepticism.\n\"Beyond the Portal: A Sorcerer's Journey\" is a tale of adventure, discovery, and transformation. It explores the intersection of magic and technology, the strength of human (and sorcerous) spirit, and the enduring power of purpose and destiny. As Aric and Elara unravel the mysteries that bind their worlds together, they embark on the greatest adventure of their lives, one that will change them forever.","description_hash":6431890510075341711},{"title":"The Quick Goblin","fiction_id":"87846","link":"https:\/\/www.royalroad.com\/fiction\/87846\/the-quick-goblin","tags":["Progression","Comedy","Non-Human Lead","Adventure","Fantasy","Romance","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":4,"rating":0.0,"page_count":28,"view_count":256,"chapters_count":5,"last_update":1718278972,"description":"Quick was raised believing she was a goblin.  She went to school with goblins, where she learned to speak, read, and write goblin, and studied goblin poetry.  Her mothers are goblins and so are her grandmothers.  The only problem is that she's not a goblin.  Not at all.\nTo make things worse, she is asked to undertake a quest, a mission of great importance, one that will affect not only the future of the Goblin realms but of the entire known world.  Can Quick hack it?  She doesn't think so, but everyone else seems to.","description_hash":-3586016983297536046},{"title":"Erasure","fiction_id":"87845","link":"https:\/\/www.royalroad.com\/fiction\/87845\/erasure","tags":["Male Lead","Sci-fi","Romance","Mystery","Soft Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":40,"view_count":291,"chapters_count":4,"last_update":1718431576,"description":"Sci-fi mystery with MM romance. Phoenix's brother, Logan, has undergone Erasure, a brain alteration surgery that has wiped some of his memories and emotional connections as sentencing for committing a horrible crime. Erasure has become more common as an alternative crime punishment, supported by human rights group The Awakening. Phoenix struggles to decide whether to keep his brother in his life with this new identity, when he receives an anonymous tip that things concerning his brother aren't what they seem, prompting him to investigate the secrets Logan was keeping, and the real circumstances surrounding his Erasure.","description_hash":2995322954796195362},{"title":"Crown Sword and Sorcery","fiction_id":"87844","link":"https:\/\/www.royalroad.com\/fiction\/87844\/crown-sword-and-sorcery","tags":["Ruling Class","Multiple Lead Characters","Drama","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":19,"view_count":63,"chapters_count":2,"last_update":1718192469,"description":"A dark cloud hangs over Luc Derune, child to parents dead in the last war and now the adopted son of a secretive Baron. After being sent away he must fight a strange enemy to the north and grapple with his own conflicting lineage.\nGwendolyn Rune lives a charmed life as daughter to one of the most powerful lords of the kingdom, but in her heart she longs for something more. When a chance to travel to the royal capital presents itself she grabs it with both hands and refuses to let go.\nAelfric Rune is an oddity in his family, a boy more obsessed with books and stories than swords and tourneys. When he witnesses a supernatural sight his life is forever changed- for the worse most believe but Aelfric can feel something change from within him... Something powerful. \nUpdates every Wednesday.","description_hash":7147719013454330219},{"title":"Godless Strings","fiction_id":"87843","link":"https:\/\/www.royalroad.com\/fiction\/87843\/godless-strings","tags":["Multiple Lead Characters","Secret Identity","Strong Lead","Action","Adventure","Fantasy","School Life","Female Lead","High Fantasy"],"lable":"Original","following_count":3,"rating":4.5,"page_count":43,"view_count":398,"chapters_count":6,"last_update":1718564961,"description":"“You’re not my hero.”\n\nFor our newborn protagonist, everything in her life had been building towards a single purpose. To meet her long-awaited Hero. \n\nSo, with the ‘script’ in her hands, she set out to do just that. She set out to reshape the whole world. She cast down the other Gods from their thrones, re-aligned the stars and twisted the strings of fate until they could be twisted no more.\n\nAnd now, she has everything in place for the first scene in the script. A brief, fleeting moment in an obscure alleyway. There, she sees the moment when her Hero finally begins his journey to save the world. But then…\n\n“Your purpose was to give him the first push, not trigger some last-stage demonic awakening.”\n\nThings start to go awry. The people around her begin acting out-of-line. The ‘puppets’ around her are playing politics, the Demons and Angels are preparing for war and resentful Gods are still lurking in the shadows beyond her gaze. \n\nThe world is slowly being set on fire as dozens of actors, from the lowliest of mortals to the highest of gods, begin forging their own destiny astray from her designs.\n\nOne by one, these godless strings are beginning to snap.\n\n____________\n\n-Mild gore warning. Nothing too visceral","description_hash":-4803040246872377932},{"title":"Ancient Rebirth In New Earth ","fiction_id":"87842","link":"https:\/\/www.royalroad.com\/fiction\/87842\/ancient-rebirth-in-new-earth","tags":["LitRPG","Male Lead","Drama","Adventure"],"lable":"Original","following_count":2,"rating":0.0,"page_count":1,"view_count":48,"chapters_count":1,"last_update":1717550233,"description":"Warrior Samuel Declan Harbinger died in 1605. Or so everyone thought. Buried for hundreds of years, the man, his name, and legend were forgotten. Then how is he completely healed and in a new world that looks so much like the one he left behind and yet completely new? Where is he? And what are these symbols and numbers floating above his head?","description_hash":-4907701717579807924},{"title":"The Story of Edward Growler, or, About That Time I Turned My Grandmother Into a Goblin","fiction_id":"87841","link":"https:\/\/www.royalroad.com\/fiction\/87841\/the-story-of-edward-growler-or-about-that-time","tags":["Progression","Steampunk","Sci-fi","Tragedy","Drama","Historical","Technologically Engineered","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":40,"chapters_count":1,"last_update":1717550217,"description":"Hello, my dear reader.\nI hope this piece of writing finds you well. In it, you shall find the newly discovered writings and journal entries of Edward Growler, an English Physician who practiced during the Vicorian Era in London; his final words are a grim and disturbing warning, which we all ought to heed and learn from. I post this in hopes that it may both help someone, and that it may keep his memory alive.","description_hash":-4781435404595960099},{"title":"The Lord of Veins | A Shadow Slave Adaptation","fiction_id":"87840","link":"https:\/\/www.royalroad.com\/fiction\/87840\/the-lord-of-veins-a-shadow-slave-adaptation","tags":["Progression","Tragedy","Action","Adventure","Fantasy","Magic"],"lable":"Fan Fiction","following_count":5,"rating":0.0,"page_count":47,"view_count":722,"chapters_count":7,"last_update":1718519253,"description":"Zerin, a young boy, spent his developing years in an orphanage. Life there was tolerable at best; at least he had companionship, a bed, regular meals, and the security of a sheltered roof. However, he soon realized that these things are fleeting.\n\nThis is my first piece of writing.\nI'm planning to craft a completely original story with unique characters. While I might drop hints to characters from the book or even include them as cameos, it's important to note that my story will diverge significantly from the original book, and this extends much farther than just the characters themselves.","description_hash":-3175048121514154278},{"title":"Re-Vamp","fiction_id":"87838","link":"https:\/\/www.royalroad.com\/fiction\/87838\/re-vamp","tags":["Time Travel","Urban Fantasy","Progression","Anti-Hero Lead","Multiple Lead Characters","Adventure","Drama","Historical","Contemporary","Slice of Life","Supernatural","Male Lead","Strong Lead","Non-Human Lead","Low Fantasy","Soft Sci-fi","Attractive Lead"],"lable":"Original","following_count":5,"rating":5.0,"page_count":154,"view_count":2269,"chapters_count":30,"last_update":1718487413,"description":"After a \"nap\" of over 500 years, Arnaud de la Roche, a vampire from 15th-century Gascony, awakens in a third world country in modern-day. Trapped in a dark hole in an unfamiliar forest, Arnaud faces his worst nightmare: being exposed to daylight without access to his refuge or food supply. As he struggles to adapt to this new environment, Arnaud encounters Arturo, an orphaned boy who becomes his only link to this new reality.","description_hash":8287221846841045887},{"title":"Drifting Through the Hell of Earth","fiction_id":"87837","link":"https:\/\/www.royalroad.com\/fiction\/87837\/drifting-through-the-hell-of-earth","tags":["Virtual Reality","Time Travel","Post Apocalyptic","Wuxia","Action","Adventure","Horror","Mystery","Martial Arts","Magic","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":51,"view_count":466,"chapters_count":12,"last_update":1718598108,"description":"A young man, who has a tough life, embarks on a new journey after receiving news about his missing father. The best part of his journey is discovering that his father is more than an ordinary scholar and that the world is never without hope. However, the hardest part of his journey is realizing that the world he knows is not real. He gets entangled in a series of strange events, deadly hunting games, and travels to parallel spaces. He grew into a magical Kung Fu warrior, a smart mechanic, and a deep thinker. But his enemies are kings, monsters, and beings from other worlds. He doesn’t seem to stand a chance!\nHis path is like a lonely ship wrecked and adrift in a harsh world. Giving up would be the easy way out, but he chooses the difficult path - to survive and unravel the mysteries surrounding him.","description_hash":7116956805892645256},{"title":"Justice Lords Limitless Act 2: EndWar","fiction_id":"87836","link":"https:\/\/www.royalroad.com\/fiction\/87836\/justice-lords-limitless-act-2-endwar","tags":["Super Heroes","Multiple Lead Characters","Secret Identity","Action","Adventure","Horror","Male Lead","Female Lead"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":31,"view_count":92,"chapters_count":2,"last_update":1718286800,"description":"Batman returns! With Batgirl at his side, he renews his crusade against crime. However, Gotham suffers as old heroes bring about old foes. Has Batman come this far just to be defeated? Set in the DCAU Justice Lords Universe.","description_hash":-5835829142798796858},{"title":"Bounders: A Ravens Guide","fiction_id":"87835","link":"https:\/\/www.royalroad.com\/fiction\/87835\/bounders-a-ravens-guide","tags":["Progression","Female Lead","Sci-fi","Secret Identity","Action","Adventure","Satire","Genetically Engineered ","Technologically Engineered","Hard Sci-fi","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":34,"chapters_count":1,"last_update":1717543139,"description":"People forget that the apocalypse doesn't last forever, for every end there is a new beginning. Civilizations rebuild, and while the scars of the past may remain. The things we have learned from them help to forge a new future for those that hold on.\nWren takes on the legacy of the Bounders, a group of individuals whose mission is to traverse across the recovering wasteland. The wasteland is dangerous, more so now that it is coming back to life. The roads between settlements have never been more perilous.\nBut, this is what Bounders live for: the thrill, the glory, the pride of being the ones to connect those who have survived The Fall. Within this new world, technology works in symphony with nature, and the consequences of nuclear fallout are a warning to all how dangerous knowledge unchecked can be.\nWren's journey will be fraught with danger. Will she find what she's looking for? Let's find out.\n\n\n2-3 Chapters a week Mon-Wed-Fri (Chapters Start June 24th)\nWhat to expect:\n- Creative original crafted Sci-Fi world influenced by earth technology\n- Exploration of wasteland, action and adventure. Friendships and rivalries. Technology that mimics magic, and integration of tech into daily lives.\n- MC who is cautious but excited to explore the world beyond. Smart MC will be sneakier in the beginning, as she learns to navigate the wasteland on her own.\n- Animal sidekick, who plays an important role.\n- Secrets, discoveries, twists and more.","description_hash":-2691291475576589699},{"title":"The Luna's Sacrifice","fiction_id":"87834","link":"https:\/\/www.royalroad.com\/fiction\/87834\/the-lunas-sacrifice","tags":["Portal Fantasy \/ Isekai","Time Loop","Dungeon","Anti-Hero Lead","Ruling Class","Drama","Fantasy","Romance","Reincarnation","Slice of Life","Supernatural","Female Lead","Strong Lead","Multiple Lead Characters","Non-Human Lead","Magic","Low Fantasy","High Fantasy","Mythos","Time Travel","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":43,"view_count":278,"chapters_count":6,"last_update":1718578208,"description":"Zana, the only daughter among six siblings, is the crown jewel of the Alpha, a leader in training with unparalleled beauty, strength, and wisdom.\nFrom a young age, Zana proved to be an exceptional warrior, earning the respect of the pack's warriors. However, in a world where peace is fleeting, Zana will have to face harsh challenges that will test not only her leadership abilities but also her will to survive.\nDiscover a story about a love greater than death, bravery, and betrayal in 'The Luna's Sacrifice,' where a once treasured peace was only an ephemeral memory before an unending storm.","description_hash":-9102605906071423743},{"title":"Post-Apocalyptic Survivor in Another World: New Beginning","fiction_id":"87833","link":"https:\/\/www.royalroad.com\/fiction\/87833\/post-apocalyptic-survivor-in-another-world-new","tags":["Portal Fantasy \/ Isekai","Post Apocalyptic","Male Lead","Sci-fi","Strong Lead","Action","Adventure","Fantasy"],"lable":"Original","following_count":75,"rating":4.0,"page_count":111,"view_count":4524,"chapters_count":11,"last_update":1718564725,"description":"Joseph ‘The Wrath’ Haythorn was old, worn out, ready to let The End claim him, as it had claimed Earth. Yet, instead of perishing in the apocalypse, he had seemingly been taken to… someplace else. Restored to youth and craving answers, he sets out only to discover that beings out of fantasy exist here. Monsters, bandits, and other dangerous creatures stalked these lands… yet, that wasn’t anything new to Joseph.","description_hash":-7278341645730297335},{"title":"CHEROPHOBIA","fiction_id":"88125","link":"https:\/\/www.royalroad.com\/fiction\/88125\/cherophobia","tags":["Progression","Anti-Hero Lead","Comedy","Psychological","Non-Human Lead","Romance","Contemporary","Slice of Life","School Life","Male Lead","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":75,"chapters_count":1,"last_update":1717920665,"description":"How did my life come to this?Here I lay on my twin size mattress with the dirt stains on top, trying to find out the exact pin point of my downfall. No, I shouldn’t call it that. Downfall would mean that I was at the top at one point. I was doomed from the start. Almost as if it were fate for my life to come to this. Well, what do you do now? What do you do when you aren't seen? Everyone above is human, to be a real human is to be seen. So what happens if you don’t become a real human?\nAll my life, I watched from afar, wondering how it felt to have the world around you shines all its brightness towards you. Wondering how it felt to be on the “good” part of existence. After all, those at the top get to choose what is considered good or bad. Yet their double standards leak through their cracks, for when they find something they cannot understand, they shut it down. It might be hard to see that from above, but down here in the darkness, I see everything true. Yes, after years of existing at the bottom, I now know, humans really are nasty creatures.","description_hash":8920824256017867993},{"title":"RE:Quest Goblins and Grandmas","fiction_id":"88123","link":"https:\/\/www.royalroad.com\/fiction\/88123\/request-goblins-and-grandmas","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","Strategy","Action","Adventure","Comedy","Fantasy","Harem","Slice of Life","Male Lead","Female Lead","Multiple Lead Characters","Secret Identity","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":12,"view_count":71,"chapters_count":2,"last_update":1718370197,"description":"I got sucked into a hardcore video game called RE:Quest with my grandma.\nThere is only one difficulty in settings called honor mode and the only condition to leave is to slay the final boss and beat the game.\nNo Saves, No Reloading, One Life Only.\nCan I survive this dangerous world while protecting my grandma who is carefree?","description_hash":454406947272762874},{"title":"Parched Scribe","fiction_id":"88122","link":"https:\/\/www.royalroad.com\/fiction\/88122\/parched-scribe","tags":["Urban Fantasy","Anti-Hero Lead","War and Military","Martial Arts","Male Lead","Adventure","Fantasy","Mystery","Strong Lead","Magic","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":110,"chapters_count":2,"last_update":1717977456,"description":"Arvid lives in a dangerous world, where deeds define who you are, a world where words, passages, and writings mean power and fear and where monsters and humans are bathed in ink, drawing a canvas of battle for survival. He hopes only to be able to get the means to get by, but what happens when a fateful encounter allows him to see the world from a very interesting perspective..","description_hash":-1074311180071954732},{"title":"El futuro frente a nosotros [Español]","fiction_id":"88121","link":"https:\/\/www.royalroad.com\/fiction\/88121\/el-futuro-frente-a-nosotros-espanol","tags":["Ruling Class","Female Lead","Secret Identity","Drama","Fantasy","Romance","Short Story","Low Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":28,"chapters_count":1,"last_update":1717920008,"description":"Princesa heredera, y chico de las cuadras. Parece una historia improbable, pero Mina y Emer han sido compañeros de juegos desde niños a pesar de las diferencias en su posición, y cuando los años van pasando el amor termina por surgir entre ellos. Sin embargo, no lo tendrán fácil. ¿Conseguirán estar juntos, y ser felices con su destino?","description_hash":6181889399084919588},{"title":"ARIA","fiction_id":"88120","link":"https:\/\/www.royalroad.com\/fiction\/88120\/aria","tags":["Female Lead","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":28,"chapters_count":1,"last_update":1717919999,"description":"In a world governed by magic, Aria is an anomaly-born without any magical abilities. Cast aside and underestimated, she is determined to uncover the truth behind her powerlessness. ARIA is an epic fantasy adventure about an outcast's quest for power, the discovery of inner strength, and the enduring light within us all.","description_hash":-8761645855440370852},{"title":"Klik the Goblin","fiction_id":"88119","link":"https:\/\/www.royalroad.com\/fiction\/88119\/klik-the-goblin","tags":["Psychological","Non-Human Lead","Secret Identity","Action","Fantasy","Short Story","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":24,"view_count":88,"chapters_count":2,"last_update":1718509349,"description":"[Participant in the June 2024 Royal Road Community Magazine Contest]\nKlik is a goblin, and he hates it\nKlik spends more time with Elder Zelena than he does with his own tribe. Unlike them, she cares for him, talks to him as an equal, treats him with kindness. In her little home, he feels safe, not in constant fear of his siblings pouncing on him at any moment. There’s only one problem though: She doesn’t know he’s a goblin.\nEvery time he visits Zelena, he wears a wooden mask and a cloak that covers up his head and body. If she knew he was a goblin, everything would be over. Without his mask and cloak, the town would see him for what he truly is: a monster. Klik wants to be normal. And normal means ‘human’, doesn’t it?\nTo Jelnar Lariel, none of that matters though, because he’s set on an indiscriminate goblin hunt. Prophecies foretell of a powerful magic relic, hidden in the depths of the Velhana jungle, possessed by a tribe of goblins. What Jelnar wants is not normalcy, but supremacy. And the Eye of Zokurath is his path to power, even if he has to massacre goblins in his wake.\nAs Klik watches humans kill the goblins of his tribe, he wonder what it means to be a monster. Is a monster born, or created?","description_hash":-6575806976966070346},{"title":"Dragon Tail","fiction_id":"88118","link":"https:\/\/www.royalroad.com\/fiction\/88118\/dragon-tail","tags":["Portal Fantasy \/ Isekai","Progression","Post Apocalyptic","War and Military","Grimdark","Adventure","Fantasy","Horror","Psychological","Male Lead","Magic","Strategy","Dystopia"],"lable":"Original","following_count":1,"rating":0.0,"page_count":21,"view_count":61,"chapters_count":1,"last_update":1717913714,"description":"Guy gets reincarnated as a dragon.","description_hash":-25278321887714461},{"title":"Tales of Two Realms","fiction_id":"88117","link":"https:\/\/www.royalroad.com\/fiction\/88117\/tales-of-two-realms","tags":["Portal Fantasy \/ Isekai","Post Apocalyptic","Multiple Lead Characters","Action","Fantasy","First Contact"],"lable":"Original","following_count":1,"rating":5.0,"page_count":41,"view_count":129,"chapters_count":3,"last_update":1718288161,"description":"In the fading twilight of the Aurelia Empire's golden era, Claudia, a humble farmer burdened by the weight of societal expectations and overshadowed by her brother's achievements, yearns for a life of purpose and freedom. As the specter of war looms ever closer, Claudia's resolve is tested when her father falls gravely ill amidst the encroaching shadows of famine and banditry.\nDriven by a desire to alleviate her family's suffering and carve out her own destiny, Claudia takes a bold step into the unknown, joining the ranks of the legion. But her journey takes an unexpected turn when she finds herself thrust into a realm shrouded in mystery and peril alongside the XI Legion.\nAs Claudia and her comrades navigate this strange new world, they encounter towering titans and eerie remnants of a forgotten age, bearing witness to a landscape scarred by ancient conflicts and primordial chaos. Amidst the chaos, questions linger: How will the women of the XI Legion shape the destiny of this realm? Will cooperation triumph over conflict, or will the clash of civilizations spell doom for both worlds?\nWith the fate of two realms hanging in the balance, Claudia must confront her own doubts and fears as she grapples with the uncertainty of what lies ahead. Only time will tell whether their arrival heralds salvation or destruction, but one thing remains certain—Claudia's journey marks a turning point in the tapestry of fate, where the destinies of worlds collide and the gods themselves hold sway over the outcome.","description_hash":-7397948188410297086},{"title":"Razavan in the City of Cats","fiction_id":"88116","link":"https:\/\/www.royalroad.com\/fiction\/88116\/razavan-in-the-city-of-cats","tags":["LitRPG","Progression","Strategy","Non-Human Lead","Slice of Life","Action","Drama","Fantasy","Romance","Male Lead","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":45,"view_count":83,"chapters_count":2,"last_update":1718252475,"description":"At sixteen Razavan wasn't sure what he wanted to do in life, but selling himself into service to keep from dying was definitely nowhere on the list.\nOh well. So much for that plan.\nNow, years later, he is dedicated to Lord Vennir, Patron Power of Wit, as a Dusk Knight, champion of all who call on his lord for aid, which mostly involves dealing with counterfeiting, contract disputes, embezzling, goods retrieval, death threats, and the occasional high risk repossession. Vennir is also the Patron of merchants, playwrights, comedians, and really clever thieves, after all.\nTo make matters worse, he didn't even manage to steer his class into something awesome like mage or warrior. No, far from it. Who's going to be afraid of a dancer?\nAnd now they've assigned him a Frigidi as a partner, a woman from the race of demons famous the world over for how uptight they are. He can’t even figure out what name to call her.\nAt least the bard might make things fun.\n\nWhat to expect: \nThis story is a shot from the hip into a fantasy-flavored LitRPG world that I’ve been working on for two or three years now. This isn’t the first thing I’ve written in this world, but it’s the first thing I’m releasing, and it’s coming in live. I have a decent idea where it’s going, but I’m not sure how I’m getting there, which matches pretty well with Razavan and his approach to life. Update schedule is whenever I can, as this story is fighting with paying bills, children, and sanity for my attention.\nTakara, the City of Cats, is a vast trade city populated with cat folk and a whole ton of other races. It exists as a fairly stable early-industrial economy with a mix of tech and magitech powering things. The world of Agona where Takara is located is fundamentally governed by science with the System overlaid on top of it. Magic enhances or alters reality in predictable ways, but does not supplant it. There ARE numbers and pretty complex character sheets, but they will not be popping up often.\nThe writing style is character focused, primarily focused on Razavan, who is a character. The plot isn’t going to be as important as the people, though sometimes important events will take hold. The main goal is fun, with the primary means for achieving that being to throw Razavan into situations he’d rather not be in.\nThere will be romance. Razavan doesn’t get a vote in this. There are harems as an element in some cultures, treated realistically. Razavan has no interest in them, and doesn’t get one. Razavan’s primary focus in life will be on surviving his job, however, so don’t worry. There will be plenty of bloody excitement. \nRazavan is not OP. He WILL get stronger, but Agona is a @(#&$ world where leveling is hard. Expect him to solve problems like a Paladin of the God of Wit should: by out-thinking, out-dodging, and out-talking them.\nOkay. Time for warnings.\nMay contain: Any of the horrible things that are conceivably possible in life. I aim for PG-13 on the visualization level, generally with fade to black on sexual things (NO graphic sex), and possibly R-rated gore if a scene needs to get serious. Takara is not a nice place, and it’s fairly polite as far as all of Agona goes. I write dark things because I like to put them next to extremely light things. Heroic things. Think nobledark. \nThat said, I’m pretty sure the MC I’ve picked is going to keep things fairly lighthearted.  \nSoli Deo gloria.","description_hash":8978489201541639550},{"title":"Aged to Perfection [Cyberpunk Heist]","fiction_id":"88114","link":"https:\/\/www.royalroad.com\/fiction\/88114\/aged-to-perfection-cyberpunk-heist","tags":["Urban Fantasy","Anti-Hero Lead","Multiple Lead Characters","Sci-fi","Action","Fantasy","Short Story","Cyberpunk","Female Lead","Low Fantasy","Soft Sci-fi"],"lable":"Original","following_count":4,"rating":5.0,"page_count":11,"view_count":72,"chapters_count":1,"last_update":1717886196,"description":"Once a legendary mercenary, now a relic, Maria is drawn back into the underworld she thought she’d left behind.  [Participant in the Royal Road Community Magazine Contest - June 2024]","description_hash":-5475143678396504576},{"title":"Total War: Shogun in another world ","fiction_id":"88113","link":"https:\/\/www.royalroad.com\/fiction\/88113\/total-war-shogun-in-another-world","tags":["War and Military","Grimdark","Psychological","Multiple Lead Characters","Harem","Action","Drama","Fantasy","Male Lead","Strategy","High Fantasy","Ruling Class","Artificial Intelligence"],"lable":"Fan Fiction","following_count":4,"rating":0.0,"page_count":38,"view_count":315,"chapters_count":4,"last_update":1718607750,"description":"This story is about a guy who gets kill on earth. Lucky bastard, but unfortunately his luck runs out and he reincarnates into a world that is exactly like his old one or maybe even worst. However he is not left naked and afraid in an unfamiliar world, because thanks to some space shenanigans he gains the Total War : Shogun System. Maybe with this he will survive. Maybe...\n....\nAs you can see am trash at describing my own book, mostly because I am not sure what going to happen in it. Yes I am that type of writer. But worry not as i am decent. I think. I hope.\nAnd is you want to support my works please check out my p.a.t.r.e.o.n patreon.com\/_Starsign_","description_hash":-5493070196722678240},{"title":"Bloody Gwendol","fiction_id":"88112","link":"https:\/\/www.royalroad.com\/fiction\/88112\/bloody-gwendol","tags":["Anti-Hero Lead","Grimdark","Non-Human Lead","Tragedy","Action","Fantasy","Horror","Magic","Villainous Lead"],"lable":"Original","following_count":5,"rating":5.0,"page_count":19,"view_count":161,"chapters_count":2,"last_update":1718326993,"description":"Former soldier in the Goblin King's army, Gwendol, just wanted to spend a happy, peaceful vacation with her grandbabies.\nSadly, it's not to be.\nWhen her peace is destroyed, what lengths will she go to, to have her revenge?","description_hash":6407095571690248244},{"title":"Sputnik Saga","fiction_id":"88111","link":"https:\/\/www.royalroad.com\/fiction\/88111\/sputnik-saga","tags":["Urban Fantasy","Comedy","Steampunk","Male Lead","Strong Lead","Action","Adventure","Fantasy","Supernatural","Grimdark","Low Fantasy","Soft Sci-fi","Dystopia"],"lable":"Original","following_count":1,"rating":0.0,"page_count":57,"view_count":270,"chapters_count":7,"last_update":1718618402,"description":"In the vast land of La Serva, there were a total of four regions: North, South, East, and West. In this world where vampires rule through strength, the only ones capable of combating them are the Cursed.\nAt the center of this land lies the Tower, a place that can grant any wish to those who reach it. From losing all the blood in your body, to being bitten by trees, or even facing budget cuts in the adventure, those who dare to reach it are willing to do anything.\nFrom royalty, clergy, trenches and trash cans, heroes can emerge from anywhere, but they all share one common goal: to reach the Tower and fulfill their desires. There are no companions during the journey, but perhaps there are similar souls awaiting them at the end! From companions to miraculous vaccines — Sputnik Saga!","description_hash":3127277793435083956},{"title":"Sanctuary [Demon \/ Mage Romance]","fiction_id":"88110","link":"https:\/\/www.royalroad.com\/fiction\/88110\/sanctuary-demon-mage-romance","tags":["Anti-Hero Lead","Comedy","Multiple Lead Characters","Action","Fantasy","Romance","Supernatural","Female Lead","Non-Human Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":98,"view_count":501,"chapters_count":10,"last_update":1718468580,"description":"A demon and a witch walk into a bar...\nWhatever it was that Julian did to deserve her life turning into some kind of cliché superhero story with her as the reluctant lead, she regretted it dearly.\nBut with children disappearing and a potential threat to the world afoot, she has to put aside her aversion to being 'the hero', step up to the plate, and hunt down the sick mastermind behind it all.\nAll while dodging the intense gaze of her new partner, Dimitrius Valentine. Those gold eyes promised things neither of them could afford to deliver on, but her resistance fails the longer they spend together. Kind, courageous and stubborn to a fault; he was everything she'd always wanted in a lover. And everything she couldn't have.\nWith a past that won't stay behind her, new enemies around every corner, and only a handful of spells to battle with, the odds had never been in her favor...but losing wasn't an option.","description_hash":1424878642401039161},{"title":"The Dream Eater - [Progression Fantasy Isekai]","fiction_id":"88109","link":"https:\/\/www.royalroad.com\/fiction\/88109\/the-dream-eater-progression-fantasy-isekai","tags":["GameLit","Portal Fantasy \/ Isekai","Progression","Psychological","Male Lead","Adventure","Fantasy","Horror","Reincarnation","Strong Lead","High Fantasy"],"lable":"Original","following_count":20,"rating":0.0,"page_count":93,"view_count":1020,"chapters_count":12,"last_update":1718589964,"description":"They dare not speak his name. I'm his replacement.\nWhen Ferrowill's latest assassination job ends with him tumbling from a balcony, he's reincarnated into The Realm of Dreams where fear is the greatest strength of all. He learns this firsthand when The Dream Eater forces him into a contract that grants him the most powerful ability in The Realm - all of them. And while this sounds like fun, Ferrowill is convinced that life after death doesn't mean you're actually dead.\nNavigate the incomprehensible world of Dreams and Nightmares, defeat the nine unkillable manifestations of pure fear, become The Dream Eater, and get back home. It's that simple for our common, everyday, noble-killing thief.\nWhat to expect:\n- A casual first-person narrator who gets stuff done- Clear goals to train and struggle towards- Fights focused on realism and ability usage- Unrestrained world-building- Authentic character moments- MC goes from weak to break reality strong\nUploads 1 chapter every other day.","description_hash":-7040227219652723994},{"title":"Monster Lord Melvin","fiction_id":"88108","link":"https:\/\/www.royalroad.com\/fiction\/88108\/monster-lord-melvin","tags":["Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","War and Military","Male Lead","Action","Adventure","Fantasy","Satire","Reincarnation","Slice of Life","Supernatural","Strong Lead","Secret Identity","Magic","Strategy","High Fantasy","Mythos","Villainous Lead","Ruling Class"],"lable":"Original","following_count":6,"rating":5.0,"page_count":6,"view_count":143,"chapters_count":2,"last_update":1718064005,"description":"Melvin died. That sucked. He had just gotten a new suit, he was on the way to his favorite bar, and the high from his recent promotion still had a smile on his face. But his sudden and painful heart attack didn't care about any of that. At least he woke up afterward, if somewhere unexpected.\nBecause now, Melvin is the Monster Lord. He lives in the Abyssal Palace in the heart of the Dark Forest, ruling over the hundreds of thousands of Devils, Drakes, Demons, Dire Wolves, Dragons, and Doppelgangers, that call him their Lord. They are all convinced that Melvin is the strongest out of all of them, and only takes the form of a human to mock their enemies. Strangely, they might be right about that first part.\nAt least said enemies are people he won't feel bad killing. If you took all the greed in corporate America, every billionaire in the world, and every merchant to have ever lived and combined it, it would not equal the avarice of a single Heroic Adventurer.\nMelvin must juggle the war with humans, the fragile layer of deception keeping him from being outed as a human, the strange new powers that come with being a Monster Lord, and the fact that all of the Monsters and unholy abominations he rules over are... the closest friends he's ever had?","description_hash":4532008900284991188},{"title":"Immortal cultivation!!? This is Immortal fight [Xian Dòuzhēng]","fiction_id":"88107","link":"https:\/\/www.royalroad.com\/fiction\/88107\/immortal-cultivation-this-is-immortal-fight-xian","tags":["Xianxia","Male Lead","Harem","Action","Adventure","Fantasy","Mystery","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":89,"chapters_count":2,"last_update":1717871034,"description":"Warning: bloody scenes are ahead so read carefully.\nThousands of years ago in the golden age of cultivation where many great talents rose up and fell down the path, but with order come chaos as this prosperity came to an end  when, because of a mysterious entity the age of cultivation was almost driven to extinction and that caused the world of cultivation to be in a period of time where cultivation was at its lowest ,this period of time was called \"despair era\".\nTwo thousand years before the current timeline, the heavens started to mend and heal itself as with chaos come order ,this embarked a period which was known as \" blooming era\"\nAfter two thousand years in the current timeline there is a new era which even  rivals the golden era of cultivation, Zhiyou YIGE a young boy who's fate took an interesting turn on the day he awakened his own technique which changed his fate and led him down an interesting  path , fate's season changed and intertwined as Zhiyou rose through perial of challenges, but he did not know that something mysterious was present , it was always present.\n___________________________________\n~Past~\nAuthor: I didn't make Zhiyou too strong right?\n~Future ~\nAuthor:FUDGE he's too strong !how can I continue my story?\nThis is newly written so please be patient readers and I hope you like the story.","description_hash":-4132445868201520114},{"title":"From Scrap Land and Beyond","fiction_id":"88106","link":"https:\/\/www.royalroad.com\/fiction\/88106\/from-scrap-land-and-beyond","tags":["Reincarnation","Space Opera","Male Lead","Sci-fi","Strong Lead","Action","Adventure","Genetically Engineered ","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":2,"rating":0.0,"page_count":7,"view_count":155,"chapters_count":2,"last_update":1717920128,"description":"Thorn wasn't your typical ten-year-old. At least, not on the inside. His past life as Dain \"The Fixer\" Hopper, a legendary tech troubleshooter, had abruptly ended at the ripe old age of 54 thanks to a rogue microwave incident. Now, he found himself crammed into the scrawny body of a ten-year-old orphan named Thorn on the aptly named planet, \"Scrap Land.\" Scrap Land was a desolate rock, perpetually shrouded in smog, where its citizens spent their days knee-deep in discarded tech, trying to salvage anything of value.\nThorn, however, wasn't fazed by the stench of burnt circuits and flickering neon signs. In fact, his eyes gleamed with a mischievous glint behind his oversized glasses. Here, in this electronic graveyard, Thorn saw a playground. Two thousand years of technological advancement might be lost on most ten-year-olds, but for Dain \"The Fixer\" Hopper reincarnated, it was a treasure trove waiting to be unearthed.","description_hash":-119178469207270184},{"title":"The Golden Merchant","fiction_id":"88105","link":"https:\/\/www.royalroad.com\/fiction\/88105\/the-golden-merchant","tags":["LitRPG","Urban Fantasy","Anti-Hero Lead","Male Lead","Slice of Life","Adventure","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":11,"view_count":97,"chapters_count":2,"last_update":1717917663,"description":"A young man named Gold dies during a hurricane and is reborn in the world of Tarius. Gifted with a system, how will Gold fare in an unfamiliar fantasy world? Read and find out! \nINFO\/DISCLAIMERS\nThe system plays a major part in the story. \nSlice-Of-Life, don’t expect tons of actions. There will be moments but action is not often.\nProfanity will be used in the story.\nNo planned romance for now.\nWill be posting on Webnovel under the same name. Anywhere else is without my (the owner and author) permission.","description_hash":-7975071871046993377},{"title":"Cake & Calamity","fiction_id":"88104","link":"https:\/\/www.royalroad.com\/fiction\/88104\/cake-calamity","tags":["Comedy","Female Lead","Strong Lead","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":107,"chapters_count":2,"last_update":1717870708,"description":"Written for the Community Magazine Contest of June 2024.\nWriting tag –  Goblins and Grandmas\nA Grandson’s written account of his Grandma’s misadventure to collect the missing ingredients for a birthday cake. The story is written from the perspective of the Grandson, who himself is now a rambling old dwarf.\nExpect a whimsical world, outlandish characters and a fun adventure.\nHow far would you go to make a birthday wish come true?","description_hash":-6466533267323029862},{"title":"Hellish Oblivion","fiction_id":"87832","link":"https:\/\/www.royalroad.com\/fiction\/87832\/hellish-oblivion","tags":["Comedy","Drama","Fantasy","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":23,"chapters_count":1,"last_update":1717539342,"description":"Carl woke up in hell. And he want to go back because he forgot to turn his stove off. The rest are the consequences of his action and catastropes.\n(My first short story)","description_hash":4826603138742742993},{"title":"The Goblyn Games (A LitRPG Adventure)","fiction_id":"87831","link":"https:\/\/www.royalroad.com\/fiction\/87831\/the-goblyn-games-a-litrpg-adventure","tags":["Virtual Reality","Comedy","Multiple Lead Characters","Strong Lead","Adventure","Fantasy","Mystery","LitRPG","Magic","GameLit","High Fantasy","Artificial Intelligence"],"lable":"Original","following_count":2,"rating":5.0,"page_count":12,"view_count":94,"chapters_count":1,"last_update":1717539338,"description":"[Participant in the June 2024 Royal Road Community Magazine Contest]\nWhen a new, fully immersive Virtual Reality system is released, James and his Grandma sign up for the opening day. Based on rave ratings from Beta Testers, his Grandma chooses The Goblyn Games, a grim world where Goblins are the ruling species and humans are the minority. \nIt sounded like a fun time and a good game. James was looking forward to showing his aging grandmother the ropes to video games and letting her experience full, youthful mobility.\nBut everything goes downhill when error after error starts popping up. Soon, players throughout the VR world lose access to their Menu.\nAnd their logout button.\nTrapped in the grim world of The Goblyn Games, James and his grandma must use everything at their disposal to stay alive and beat the game. Together, they will have to challenge five games of various genres set up by the Goblin King to free themselves and everyone else.","description_hash":5075948265123345023},{"title":"Psyche Line","fiction_id":"87830","link":"https:\/\/www.royalroad.com\/fiction\/87830\/psyche-line","tags":["Reincarnation","Time Loop","Progression","Anti-Hero Lead","Strategy","Action","Horror","Psychological","Mystery","Martial Arts","Reader Interactive","School Life","Supernatural","Male Lead","Strong Lead","Multiple Lead Characters"],"lable":"Original","following_count":4,"rating":4.67,"page_count":24,"view_count":106,"chapters_count":2,"last_update":1717568346,"description":"The story begins with the main character, running desperately through a dark alley, facing both physical and mental challenges. The narrative states his struggles,  loss, a surreal encounter with death, and questions about life choices.\nSuddenly, the focus shifts to modern-day Japan. He is reborn as a child with vague memories of his past life (next to none). Discovering a twin sister and realizing their rebirth marks the start. Fast forward 14 years to Hiroshi's first day of high school, where he witnesses a classmate's murder, setting the story in motion.","description_hash":-7815080925435895739},{"title":"Nana and Snarl","fiction_id":"87829","link":"https:\/\/www.royalroad.com\/fiction\/87829\/nana-and-snarl","tags":["Non-Human Lead","Slice of Life","Fantasy","Short Story"],"lable":"Original","following_count":3,"rating":5.0,"page_count":17,"view_count":339,"chapters_count":7,"last_update":1718365543,"description":"A goblin barely survives the horrific attack of an owl, saved by an elderly woman, and taken to a warm and cozy home.","description_hash":8608730590961239607},{"title":"The Omnivore's Grimoire: A Tale of Survival and Transformation","fiction_id":"87828","link":"https:\/\/www.royalroad.com\/fiction\/87828\/the-omnivores-grimoire-a-tale-of-survival-and","tags":["GameLit","Portal Fantasy \/ Isekai","Male Lead","Strong Lead","Adventure","Fantasy","Reincarnation","Magic"],"lable":"Original","following_count":2,"rating":0.0,"page_count":9,"view_count":413,"chapters_count":6,"last_update":1717803086,"description":"This story is exclusively posted on Royal Road. Any reproduction or distribution of this work on other platforms is strictly prohibited unless explicitly authorized by the author.\n\nFreddie, a hardened orphan from the streets, is reborn in a magical realm filled with mythical beings and monstrous threats. With only his street smarts and insatiable hunger, he must navigate this new world. A chance encounter with a peculiar fruit unlocks an extraordinary ability: the power to absorb the knowledge and abilities of anything he consumes.\nWith each bite, Freddie's understanding of this magical realm deepens, and his strength grows. He faces mythical beasts and uncovers ancient secrets, forging unexpected alliances along the way. As Freddie's influence grows, he creates a sanctuary for outcasts, blurring the lines between races. However, his power attracts the attention of powerful enemies who threaten his newfound community.\n\"The Omnivore's Grimoire: A Tale of Survival and Transformation\" is a gripping saga of self-discovery, unlikely friendships, and the struggle for acceptance in a divided world. Follow Freddie's journey from lost soul to a beacon of hope, rewriting his destiny one bite at a time.","description_hash":-6320087058140987087},{"title":"Magic in Cyberpunk?!","fiction_id":"87827","link":"https:\/\/www.royalroad.com\/fiction\/87827\/magic-in-cyberpunk","tags":["Progression","Male Lead","Sci-fi","Action","Adventure","Short Story","Cyberpunk","Supernatural","Magic","Low Fantasy","Technologically Engineered"],"lable":"Fan Fiction","following_count":6,"rating":0.0,"page_count":14,"view_count":96,"chapters_count":1,"last_update":1717896426,"description":"(COVER IS AI GENERATED)\nMagic is such an interesting thing. No matter how you view it, it's always amazing to see what others visualize magic to be. I am one of them and I got to use magic in this dystopian cyberpunk world.","description_hash":7032593230589131483},{"title":"Grandma's goblin","fiction_id":"87826","link":"https:\/\/www.royalroad.com\/fiction\/87826\/grandmas-goblin","tags":["LitRPG","Progression","Female Lead","Strong Lead","Action","Adventure","Fantasy","Magic","GameLit","High Fantasy","Attractive Lead"],"lable":"Original","following_count":9,"rating":5.0,"page_count":15,"view_count":256,"chapters_count":3,"last_update":1718487242,"description":"[Royal Road Magazine June 2024 Entry]\nAn elderly woman's compassion leads her to an unthinkable act - sheltering one of the magical creatures her society reviles as monsters.\nMaría risks everything to defy hatred and shelter the enemy infant. But this act of empathy forges an unprecedented bond across the human-goblin divide. As María and the precocious goblin form an unlikely friendship, they begin to unlock new wellsprings of power unlike anything in the humanity's sheltered history.\nTheir budding abilities may just provide the key to venturing beyond Greenview's crumbling boundaries and expanding the reaches of humanity and goblin-kind alike. But first, they'll have to overcome prejudices far more deeply rooted than even the city's decaying walls.\nThis rich tale of unlikely companionship across ancient divides asks what walls can be dismantled when compassion trumps fear of the unknown.","description_hash":-8631768323895729230},{"title":"𝐃𝐞𝐯𝐢𝐥'𝐬 𝐀𝐝𝐯𝐨𝐜𝐚𝐭𝐞.","fiction_id":"fiction","link":"https:\/\/www.royalroad.com\/fiction\/87825","tags":["Progression","Non-Human Lead","Secret Identity","Drama","Fantasy","Romance","Short Story","Female Lead","Magic","First Contact"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":33,"chapters_count":1,"last_update":1717535997,"description":"\"Perhaps if I committed Seppuku, I wouldn't have felt such pain.\"\n\nA former samurai, a ronin that goes by the name Akarazu Akira ventures across the land of Japan until he stumbled upon a skeptical woman in her dark crimson Kimono.\n\n\"One ponders... Does one think that even the world's most monstrous being can change? To be put in an edge, shot like a Devil's Advocate. This amulet... Shall be the last link of thy clan. And yet, I can't help but feel a sense of comfort in thy presence, Akira.\"","description_hash":-4298639513557788967},{"title":"Killer King","fiction_id":"87824","link":"https:\/\/www.royalroad.com\/fiction\/87824\/killer-king","tags":["Urban Fantasy","Anti-Hero Lead","Martial Arts","Comedy","Secret Identity","Action","Fantasy","Romance","Low Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"This is a story about a top-notch assassin being reborn. The rhythm is humorous and it's of the cool-article type. The book contains a large number of face-slapping scenes. Evil-minded people, please come in. The protagonist is a person with a great sense of mischief. The overall style is very relaxed and funny, and it's an urban novel with a romantic style.\nExpectation: A very interesting cool-article. You will see how a reborn assassin gradually becomes the world's top assassin, while also harvesting love, friendship and family affection, and gradually transforms from a numb and cold-blooded assassin into a person with joys, angers, sorrows and pleasures.\nNot expecting: This book will not contain any overly pornographic content. Because it is an urban novel, the protagonist will not become extremely powerful, but still remains the world's top assassin.","description_hash":6662629071125166830},{"title":"The Demon's Apprentice: A Journey in Red and Blue","fiction_id":"87823","link":"https:\/\/www.royalroad.com\/fiction\/87823\/the-demons-apprentice-a-journey-in-red-and-blue","tags":["Psychological","Female Lead","Drama","Fantasy","Romance","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":133,"view_count":268,"chapters_count":7,"last_update":1718398311,"description":"Upload schedule: Friday or Saturday(Will depend on how the ideas flow).What if I told you that magic is real? I know, I know, crazy, right?\nNoma, 18 years old. Solitary orphan, desperate, and lost in the vast world without a guiding light. In search of the answer to the question \"What is true freedom?\" the girl who has nothing is saved and taken under the wings of a non-human who claims to be a mage.When the entity invites her into their home and makes an offer they can't refuse, the girl's frozen time begins to slowly move.She doesn't know yet, but her life is about to begin anew, filled with magic, fairies, and other beings of magical nature.Romance and magic mix themselves with mystery and light horror in this story, as one can never escape their past forever. Expect something along the lines of 'low fantasy with low stakes'; in truth, a comfy read with a teaspoon of misadventures and revelations.","description_hash":4991488625330592497},{"title":"Anti-Goblin Rangers","fiction_id":"87822","link":"https:\/\/www.royalroad.com\/fiction\/87822\/anti-goblin-rangers","tags":["Portal Fantasy \/ Isekai","Urban Fantasy","Anti-Hero Lead","War and Military","Female Lead","Action","Adventure","Fantasy","Sci-fi","Cyberpunk","Supernatural","Strategy","Low Fantasy","First Contact","Soft Sci-fi"],"lable":"Original","following_count":3,"rating":0.0,"page_count":26,"view_count":257,"chapters_count":3,"last_update":1718157613,"description":"The year is 2034 and humanity has been pushed to the brink. The vile goblins of the fae world open more portals by the day, sending spells and hexes through to curse or kill innocent people by the hundreds. \nGovernments have fallen. Cities lay in ruins. A because of the mysterious force known as magic. \nThe source of their evil powers? Grandmas. The constant sacrifices, of earth's precious Grandmas. \nIn these trying times, only our heroes can defend the Grandmothers of earth from the putrid invaders. \nThey are humanity's finest. They, are the AGR. The Anti-Goblin Rangers.","description_hash":-5114936778064694903},{"title":"Kiss of death ","fiction_id":"87821","link":"https:\/\/www.royalroad.com\/fiction\/87821\/kiss-of-death","tags":["Psychological","Drama","Action"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":42,"chapters_count":1,"last_update":1717535852,"description":"Amy and Elias fell in love with each other. Elias was head over heels, but Amy had her doubts. The ultimate betrayal might lead to the ultimate disaster.","description_hash":3376227622313449008},{"title":"SACRIFICIAL CULTIVATION SYSTEM","fiction_id":"87820","link":"https:\/\/www.royalroad.com\/fiction\/87820\/sacrificial-cultivation-system","tags":["Portal Fantasy \/ Isekai","Progression","Space Opera","Xianxia","Male Lead","Action","Adventure","Fantasy","Mystery","Reincarnation","Martial Arts","Supernatural","Strong Lead","Magic","Low Fantasy","High Fantasy","Attractive Lead"],"lable":"Original","following_count":7,"rating":2.75,"page_count":107,"view_count":1205,"chapters_count":15,"last_update":1718256671,"description":"Ceceada Apex has always struggled in the Sun Sect’s Outer Court. Labeled with a Low Mortal Physique and stuck at Level 1 of the Body Refinement realm, Ceceada is the subject of ridicule and disappointment.His fortunes change dramatically when a mysterious holographic panel appears before him, presenting him with a choice: fuse with a \"system.\" Skeptical yet desperate for improvement, Ceceada accepts the offer. The system, a powerful and enigmatic entity, integrates with his body, immediately bestowing upon him a series of cultivation breakthroughs.","description_hash":6793824378240783064},{"title":"Flash's adventures with Sky & Nova","fiction_id":"87819","link":"https:\/\/www.royalroad.com\/fiction\/87819\/flashs-adventures-with-sky-nova","tags":["Multiple Lead Characters","Action","Adventure","Fantasy","Romance","Supernatural","Non-Human Lead","Magic","High Fantasy","Mythos"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":8,"view_count":21,"chapters_count":1,"last_update":1717535296,"description":"This story is about three wolf girls that go on several adventures together.","description_hash":-5855991369855419107},{"title":"Rocko McGoblino, Goblin Extraordinaire","fiction_id":"87818","link":"https:\/\/www.royalroad.com\/fiction\/87818\/rocko-mcgoblino-goblin-extraordinaire","tags":["LitRPG","Comedy","Non-Human Lead","Slice of Life","Adventure","Fantasy","Horror","Magic","Grimdark","High Fantasy"],"lable":"Original","following_count":4,"rating":5.0,"page_count":13,"view_count":191,"chapters_count":3,"last_update":1718233162,"description":"Rocko was born an ordinary goblin, much like any other goblin. Someone left a dirty, filthy hole in the ground completely unattended, and one day, out popped Rocko. However, one day, young and naive as he was, Rocko decided to sneak into the human village to steal some food and prank some kids.\nUnfortunately for him, Grandma Smotrich just lost her only grandson in the annual poison mushroom eating contest that morning, and was quickly searching for a rebound grandchild not already claimed by one of the other village grandmas. Rocko could not be any less prepared, for soon, Gram Gram is coming.\n[Participant in the Royal Road Magazine Contest][LitRPG]","description_hash":6695895037780252096},{"title":"Kamina gets Kureiji-ed! (Draft)","fiction_id":"87817","link":"https:\/\/www.royalroad.com\/fiction\/87817\/kamina-gets-kureiji-ed-draft","tags":["Time Travel","Non-Human Lead","Sci-fi","Action","Fantasy","Romance","Female Lead"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":1,"view_count":46,"chapters_count":1,"last_update":1717534732,"description":"In the original timeline, Kamina died, and Team Dai-Gurren was wiped out. Kureiji Ollie is not accepting that! She calls in a favour from Kronii, and…\n(draft)","description_hash":-555915618922642355},{"title":"\"I want a system too\"( leveling without gods)","fiction_id":"87816","link":"https:\/\/www.royalroad.com\/fiction\/87816\/i-want-a-system-too-leveling-without-gods","tags":["LitRPG","Reincarnation","Dungeon","Ruling Class","Martial Arts","Action","Adventure","Fantasy","Satire","Male Lead","Strong Lead","Secret Identity","Strategy","GameLit","High Fantasy","Mythos","Genetically Engineered ","First Contact","Dystopia","Progression","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":28,"view_count":211,"chapters_count":6,"last_update":1718397321,"description":"hey guys this has an old version where I called it \"Destined Beyond Dimensions.\" Some told that old version was good somehow so check it out first 2 chapter is similar\nStark 007 gets mysteriously reincarnated through some disturbing events after discovering a temple on an unknown planet with his team\nwait what are these strings ...do I have to choose one statue of god will this give me power will this change my fate \n{ god of shadows }\n{god of karma} \nHere you can expect: \nnew concepts with a familiarity we all love\ndeep world-building \nGods and demons other species \nnewbie mistakes >","description_hash":-7422892349429153641},{"title":"infectents ","fiction_id":"87815","link":"https:\/\/www.royalroad.com\/fiction\/87815\/infectents","tags":["Progression","Post Apocalyptic","Strategy","Psychological","Male Lead","Action","Sci-fi","Tragedy","Reader Interactive","Strong Lead","Secret Identity","First Contact","Hard Sci-fi","Dystopia"],"lable":"Original","following_count":1,"rating":0.0,"page_count":157,"view_count":570,"chapters_count":17,"last_update":1718397166,"description":"I upload 1 chapter every other day and use Grammarly and QuillBot for grammar editing Thank me by reading and commenting \nWarning: The following work is not for weak minds; it has gore and really shitty things and villain here sometimes feels convincing and has nothing to do with real-world or intend to create or support conspiracies or groups of any kind, so don't get offended If you still do, please read the warning again\nHere is what you can expect:fast passed\n1. MC is average but uses his brain as much as possible and does have the possibility of dying, and I am being serious here. MC pretends to have a split personality for...\n2. story is good It revolves around 17-year-old Mc and his friends Hruday and Haru, who seem to have had scary dreams before the apocalypse. Is this what made him different? But some seem to real to be fake. Is he suffering from memory loss or a secretly only memory regreeser!!?  \nhe doesn't know how to follow his journey in the apocalypse and how he manages his base while still being at his late teens, full of adults  . it also follows of the villain, or you can call him antihero too  \n3. Well, think of MC as a veteran of zombie content; he thinks about almost everything, but he will die if your choices are bad. Well, until i put out the choices, he won't. and this isn't your typical fantasy zombie, rather a sci-fi one \nAlso, if you don't know what audio theater is, i have a hidden gem called \"We Are Alive.\" It is available in spotify for free\n\/\/\/\/\/\/why are you still here? go try one or 2 chapters; i am sure you will like it \n 4. This was the ultimate entertainment when we had free periods (ahh, I miss those times ). i made it such that each choices had different impact. i will do that here too, on request\n5. i don't make stories which aren't unique or I crave that kind of book to be created 5. this has some cool concepts; some might even create conspiracies so be aware Also, the first chapter is little long as it has dialogue and foreshadowing  \n6. i am doing this because i want others to watch my stories so i will try to make audio theater if requested and also search for a good editor who could correct my grammar mistakes.\nthe credit for art goes to ArtStation remove this cover contact: [email protected]  also to encourage or support","description_hash":9164718996171483371},{"title":"Wild Mage's Awakening","fiction_id":"87814","link":"https:\/\/www.royalroad.com\/fiction\/87814\/wild-mages-awakening","tags":["LitRPG","Urban Fantasy","Dungeon","Martial Arts","Male Lead","Action","Adventure","Fantasy","Supernatural","Magic","Low Fantasy","Progression"],"lable":"Original","following_count":26,"rating":2.5,"page_count":126,"view_count":2856,"chapters_count":18,"last_update":1718622004,"description":"After finally graduating, Miles can finally go through his awakening and receive his class. In this world most wish for utility classes to aid in daily life and earn a living but Miles awakens a combat class and must fight to earn money to help support his family.But wait... This class seems pretty vague? And why do the effects of my spells keep changing?!","description_hash":-5032448489430865267},{"title":"The Leftovers","fiction_id":"87813","link":"https:\/\/www.royalroad.com\/fiction\/87813\/the-leftovers","tags":["Male Lead","Slice of Life","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":9,"view_count":26,"chapters_count":1,"last_update":1717534454,"description":"Inspired by true events, this horror short story delves into the chilling discoveries made by two teenage boys on a December day in 1994. Set on the property of a mysterious figure, the boys stumble upon unsettling secrets hidden amidst the debris of a forgotten heap of trash.","description_hash":-1717935497092455456},{"title":"Nocturnal Bureaucracy","fiction_id":"87812","link":"https:\/\/www.royalroad.com\/fiction\/87812\/nocturnal-bureaucracy","tags":["Male Lead","Action","Adventure","Fantasy","Magic","Low Fantasy"],"lable":"Original","following_count":4,"rating":5.0,"page_count":22,"view_count":143,"chapters_count":2,"last_update":1718424095,"description":"Alex, a young man in his twenties, never expected his life to take such a bizarre turn. A surprise visit to his family's home leaves him standing at an empty doorstep. Seeking solace, he heads to his eccentric grandma's house, only to be pulled into an odd request: deliver a mysterious package to a government building late at night.\nWhat begins as a simple errand quickly unravels into a whirlwind adventure. Alex finds himself thrust into a hidden world where goblins run the government office after dark. Amidst the chaos of taking a number and filling out forms, he is attacked, and the precious package is stolen.\nChasing the thieves leads Alex to an underground goblin city, where he is arrested and charged with negligence for losing an ancient and powerful relic. Now, he must navigate the labyrinthine bureaucracy of goblin authorities, recover the relic, and clear his name—or risk losing his freedom forever.\nDive into a fantastical tale of mystery, magic, and the most peculiar form of government you'll ever encounter in Nocturnal Bureaucracy.","description_hash":-8367151130038532258},{"title":"Goblin X Granny","fiction_id":"87811","link":"https:\/\/www.royalroad.com\/fiction\/87811\/goblin-x-granny","tags":["LitRPG","Portal Fantasy \/ Isekai","Urban Fantasy","Post Apocalyptic","Comedy","Action","Fantasy","Mystery","Supernatural","Female Lead","Strong Lead","Non-Human Lead","Magic","Grimdark","GameLit","Genetically Engineered "],"lable":"Original","following_count":3,"rating":5.0,"page_count":10,"view_count":69,"chapters_count":1,"last_update":1717534395,"description":"When you close your eyes, what do you see? \nIt’s been fifty years since the emergence of the first plane. Every few years, another opened. Despite being spread across the globe like small pockets of new worlds, they all lead to the same place. The same plane. A mirror-world where new physics reigned supreme, massive energies spiraled and voices came in ambient whispers as time spun anew. This mirror world had a simple name. The Plane of Mana. With the emergence of a new world blipping into existence within earth, creatures were born from viruses that thrived within. Beings who were able to enter Mana came out with powers and abilities out of your wildest dreams…. Or worst nightmares. Wars broke out. The government banned all use of all things born in Mana while secretly uncovering its secrets for themselves. What’s new? But that’s old news. In time, a semblance of balance was restored to a world made different. But only that. Only a semblance. \nAgatha took pride in the blood, sweat and tears she donated to gaining that balance. Or at least she used to. That was a long time ago. Younger days, brighter spirit. Back when she was a soldier. When she got her first dose of enhancements and was one of the first to dawn the title of super-soldier. Decades ago the term was used in movies to explain why the boyscout in blue tights could punch through steel. Now the term was written in legislation. Or at least it used to be. Her division was disbanded and reabsorbed into a new front against the invasion of Mana. SpellHunters. She was well past her prime, but she was the best on the force. Or— again, at least she used to be. Hopefully, her and a very unlikely partner were enough for a new style of criminal on the rise in the streets of Chicago…","description_hash":8085808643431391414},{"title":"That Time I got Reincarnated as a Lizard","fiction_id":"87810","link":"https:\/\/www.royalroad.com\/fiction\/87810\/that-time-i-got-reincarnated-as-a-lizard","tags":["Reincarnation","Progression","Female Lead","Action","Fantasy","Magic","High Fantasy"],"lable":"Fan Fiction","following_count":20,"rating":5.0,"page_count":23,"view_count":926,"chapters_count":6,"last_update":1718594047,"description":"[That time I got reincarnated as a slime fanfic] \nSlime, lizard, dragon, human. \nThey all start somewhere... right? Some are given easier beginnings, while others? not so much. \nA lizard, even worse off then a slime. What do they get? What's so special about a lizard? Slimes regenerate, ogres have great strength- even goblins are stronger than a little lizard right? \nBut with a difficult upbringing, starting from the bottom, through sheer effort, it is indeed possible to overcome such an obstacle. A friendly slime did it after all..... right?","description_hash":-3222613593816165683},{"title":"BlackBox","fiction_id":"87809","link":"https:\/\/www.royalroad.com\/fiction\/87809\/blackbox","tags":["LitRPG","Progression","Male Lead","Sci-fi","Secret Identity","Action","Adventure","Drama","Cyberpunk","Supernatural","Technologically Engineered","Soft Sci-fi","Dystopia","Artificial Intelligence"],"lable":"Original","following_count":3,"rating":0.0,"page_count":7,"view_count":159,"chapters_count":2,"last_update":1717825684,"description":"Ichiro's life was meticulously planned—resources, connections, and a promising corporate future all laid out for him. But everything changed when he was abducted by his father's corporate rivals. Now, I inhabit Ichiro's body, my soul merging with his form as seamlessly as spirits possess AIs.\nAwakening in an unfamiliar Cyberpunk world, I'm initially met with support from my 'family' before they abandon me. As I descend from the gleaming heights of a luxurious apartment to the shadowy depths below the streets, my life transforms from the comfort of corporate privilege to the harsh reality of the violent underground.\n\n\n\nSet in an original Cyberpunk setting.\nCheck the Author's Notes for additional tags, setting details, and specific content warnings.","description_hash":-5600099974366210539},{"title":"Time Hotel","fiction_id":"87808","link":"https:\/\/www.royalroad.com\/fiction\/87808\/time-hotel","tags":["Urban Fantasy","Male Lead","Slice of Life","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":191,"view_count":753,"chapters_count":15,"last_update":1718317965,"description":"The story of Ethan, a Chinese food enthusiast who runs a small inn and spends time with various visitors from time and space.","description_hash":1933680227326390424},{"title":"The Signal","fiction_id":"87807","link":"https:\/\/www.royalroad.com\/fiction\/87807\/the-signal","tags":["Male Lead","Sci-fi","Contemporary","Mystery","Short Story","First Contact","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":15,"view_count":336,"chapters_count":4,"last_update":1718391604,"description":"An unexpected phone call at dawn catapults Harlow Bennet and his team of MIT mathematicians into a classified project to decrypt a mysterious message from outer space.\nIt quickly becomes clear the signal is not just a cosmic puzzle, it is an exploration of humanity’s place in the cosmos and how it might change.\nA captivating story of human curiosity, the quest for knowledge, and their consequences.","description_hash":-8938726642706081943},{"title":"My Dojo System","fiction_id":"87806","link":"https:\/\/www.royalroad.com\/fiction\/87806\/my-dojo-system","tags":["Xianxia","Comedy","Action","Adventure","Fantasy","Supernatural","Wuxia","Attractive Lead"],"lable":"Original","following_count":3,"rating":5.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"In 2024, Felix Warren's life is abruptly cut short by a tragic accident. Expecting the void of death, he instead awakens in a rundown dojo in Thaloria, a mystical world filled with untapped potential and magical energies. Thrust into extraordinary circumstances, Felix finds himself navigating this unfamiliar and perilous new world full of supernatural phenomenon all while having to develop his new dojo and its disciples.","description_hash":-1663879685393409188},{"title":"Swords Don't Kill Monsters","fiction_id":"87805","link":"https:\/\/www.royalroad.com\/fiction\/87805\/swords-dont-kill-monsters","tags":["Progression","War and Military","Action","Adventure","Fantasy","High Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":47,"view_count":619,"chapters_count":10,"last_update":1718310240,"description":"A young man learns to navigate a world where many things exist by the whims of the powerful. \n\nThis is my first work, and I hope to release a couple chapters a week over the summer.\nEveryone in this world has access to magic that I will be calling \"ambient.\" It should mostly scale off of training and how well the individual user understands the concept that they are trying to conjure. For example, most people would know that heat causes fire, so starting a fire with ambient would be extremely easy. Most people (in a medieval\/fantasy setting) do not know how electricity works, so lightning magic would be nearly impossible. \n\nAlso, the MC is very young in the prologue, and will be in his mid teens for the first arc, but will be a full fledged adult before too deep into the story. I just couldn't see character and world building going super well with a character already at an age where they should have things mostly figured out.","description_hash":-8152712545577783685},{"title":"[Can't Opt Out] : A Can't We Get Rid of the Raids LitRPG","fiction_id":"87804","link":"https:\/\/www.royalroad.com\/fiction\/87804\/cant-opt-out-a-cant-we-get-rid-of-the-raids-litrpg","tags":["Virtual Reality","Urban Fantasy","Progression","War and Military","Female Lead","Adventure","Drama","Fantasy","Sci-fi","LitRPG","School Life","Strong Lead","Secret Identity","Magic","Genetically Engineered ","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":4,"rating":0.0,"page_count":227,"view_count":1388,"chapters_count":24,"last_update":1718575503,"description":"The government sponsored raids are spiraling out of control. Almost a decade on, even their supposed purpose—to keep Baalphorian citizens prepared for another war—is becoming harder for even the raid’s most ardent supporters to justify.\nAfter her friend is dosed with an illegal and highly dangerous drug, however, the raids that Emilia has hated since this inception are the least of her worries.\n\nFor almost a decade, Emilia has been running. Running from her past, from the person she once was, from the war and destruction that ripped her country, her soul, her very core apart.\nShe has a good life. She has friends and school and the normalcy that she always craved. She doesn’t miss her old life—not often, anyways. She’s locked her ability to miss away, along with so many of the skills that made her a so-called war hero.\nEmilia always knew the normal, relaxing life she carved out for herself wouldn’t last. So, when a series of events bring old friends and scars back into her life, when the government sponsored raids start to get even more out of control than they already were, when secrets about the real reason behind the war start to echo out into the world, Emilia knows its just a matter of time before she has to stop running.\nOh, and she’s pretty sure her boyfriend is going to break up with her.\n\nWhat to Expect:\n- Length~\n- Posting 2000+ word chapters Sun-Thur (+ 10 chapters over the 4th and 5th, then double releases until the 17th)\n- All the diversity\n- Bad governments & good friends\n- Background romances\n- Go with the flow MC who has all the brain cells but constantly only uses two\n- An author who cries when they kill their characters but will kill them anyways\n- People dealing badly with trauma through (legal) drugs, sex, and (both legal and illegal) body modifications\n- No harem, but the MC is in a (quickly crumbling) open relationship and they both hook up with other people semi-regularly\n- Occasional, totally optional smut for the MC and side characters (I’m also not ruling out a healthy thruple or quad endgame, but that’s a long ways off)\n- Several Systems, including a normal world version, a the government and corporations are messing with the world’s magic and forcing raids upon it version, and the occasional VR System (which are still largely based on the real world system because reasons and have consequences for the MC’s real body)","description_hash":-2176565875674669850},{"title":"Under the Line","fiction_id":"87803","link":"https:\/\/www.royalroad.com\/fiction\/87803\/under-the-line","tags":["LitRPG","Portal Fantasy \/ Isekai","Anti-Hero Lead","Male Lead","Drama","Action","Adventure","Fantasy","Reincarnation","GameLit"],"lable":"Original","following_count":5,"rating":0.0,"page_count":47,"view_count":585,"chapters_count":6,"last_update":1718208480,"description":"Lone is a man of little or no word if he can help it. Reborn in a village on the border of the frontline where a super dungeon broke and wreaks havoc on the surrounding countries. He finds himself orphaned and alone (pun intended) As he finds himself on a world of magic, levels, fantasy, horror, and more, he fights to survive find peace and punch the elf woman who started it all.","description_hash":4124472770073421790},{"title":"Return of the Wind Mage ","fiction_id":"87802","link":"https:\/\/www.royalroad.com\/fiction\/87802\/return-of-the-wind-mage","tags":["LitRPG","Reincarnation","Time Travel","Progression","Post Apocalyptic","Action","Adventure","Fantasy","Sci-fi","Male Lead","GameLit"],"lable":"Original","following_count":28,"rating":4.43,"page_count":132,"view_count":3614,"chapters_count":22,"last_update":1718571609,"description":"After eight long years, peace is at hand. One final stronghold of foes is all that remains before the united forces of North America have pacified the continent after the arrival of the System. Santiago Silva, a powerful wind mage, leads the attack upon their enemies. Stumbling upon a powerful last ditch ritual to prevent them from losing, he is catapulted back in time. \n\nWaking up two days before the arrival of the System, Santi is determined that he will make the most of his knowledge. Friends and family who had fallen before will live. The enemy will not be able to gather the strength they did the last time. And maybe, just maybe, they can figure out the goals of the System. \n\nHe’s not the only one who was thrust back in time though. Six of the Apostates, the leaders of the foe, have come back with him. Now in a race of time to stop their plots from hatching, Santi will have to take risks he never would have before. \n\nWhat to Expect: Weak to Strong main character. Slow paced growth with interesting characters. 1.5k-2k word chapters. \n\nJune Release schedule: 7x a week. \nThis is a work of fiction and any and all resemblance to real people, places, or things is completely incidental.","description_hash":2978194695209266823},{"title":"Siren's Reach - Fallen Lands Book 3","fiction_id":"87801","link":"https:\/\/www.royalroad.com\/fiction\/87801\/sirens-reach-fallen-lands-book-3","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Comedy","Non-Human Lead","Action","Adventure","Fantasy","Reincarnation","Supernatural","Female Lead","Strong Lead","Secret Identity","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":6,"rating":5.0,"page_count":55,"view_count":131,"chapters_count":3,"last_update":1718411220,"description":"(This is Book 3 of the Fallen Lands series. Please be aware that reading this Synopsis or any portion of this book will be full of spoilers for books one and two, so stop now if you want to avoid them!  Books one, Vigilance, and two, West Peak, are currently free to read on Kindle Unlimited, but due to Amazon rules, I can only post a sample of them here on Royal Road at the same time. This book, Siren's Reach, will be written to completion here on Royal Road before being edited for novelization.)\n(All Evelyn chapters have been removed for re-writes and will be back soon.)\n\nWith the last known bastion of The Fallen in ruins and the remaining Greater Devils isolated from civilization by thousands of miles and a monster-filled ocean, Evelyn and her crew set their course for Vigilance, hoping for rest and a chance to build a new life. But this victory has not come without a price. The memories of those she was forced to kill and the devastation she left behind weigh heavily on Evelyn's heart, casting a shadow over her every step. As she settles into her new role in society, navigating the complexities of studying, politics, and intrigue, the world begins to tip into chaos. Nations race against each other to reclaim the Fallen Lands, monsters surge back into the continent, and political tensions soar, forcing everyone to adapt to the new norms.\nEvelyn isn't the only one caught up in these changes. The shockwaves of Aethabe's rage ripple across the continent, and as storms churn out of the shallow sea, the floodwaters filling Kingsgrove have an unexpected effect on a forgotten soul left behind.","description_hash":-7324533507815203280},{"title":"Until the Blue Hour","fiction_id":"87800","link":"https:\/\/www.royalroad.com\/fiction\/87800\/until-the-blue-hour","tags":["Multiple Lead Characters","Contemporary","Drama","Romance","Female Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":68,"view_count":125,"chapters_count":4,"last_update":1718463487,"description":"Remy only acknowledges necessity; want is a luxury that she cannot afford. Allison only knows desire; necessity simply either is or is not met. Coming together by chance in a small seaside town on the edge of the world, Remy's want and Allison's need will meet and carry each other forward. Both are tall orders, but neither is too much to ask.\nUpdates on Tuesday and Saturday.","description_hash":4208407670453156786},{"title":"Survivors: twenty years of biohazard","fiction_id":"87799","link":"https:\/\/www.royalroad.com\/fiction\/87799\/survivors-twenty-years-of-biohazard","tags":["Post Apocalyptic","Sci-fi","Drama","Horror","Hard Sci-fi","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":8,"view_count":46,"chapters_count":1,"last_update":1717503236,"description":"Jason wakes up to the sound of a biological bomb exploding and finds himself in a dark basement. He discovers that the Earth world has been destroyed outside and its atmosphere has become toxic and deadly. So how did he end up in the basement? How will he get out of there? What awaits him outside?","description_hash":-8175701947369365651},{"title":"The kingdom between realms","fiction_id":"87798","link":"https:\/\/www.royalroad.com\/fiction\/87798\/the-kingdom-between-realms","tags":["Comedy","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":72,"view_count":396,"chapters_count":14,"last_update":1718607620,"description":"Will the kingdom of peace and harmony experience it's first taste of chaos and strive or will it remain a place of peaceful harmonous days? Come inside to see what happens inside the Underneath Kingdom!\n\nThis story is actually my boyfriends, but he asked me to upload it for him on my account and cover art is by the artist of the upcoming comic version of this story. The comic version shall be uploaded to Webtoon under the artist's account so feel free to check out her other works. The artist on Webtoon is Krystal_H78","description_hash":2941913927957512226},{"title":"The misadventure of Patricia Bonfire","fiction_id":"87797","link":"https:\/\/www.royalroad.com\/fiction\/87797\/the-misadventure-of-patricia-bonfire","tags":["Portal Fantasy \/ Isekai","Ruling Class","Comedy","Multiple Lead Characters","Slice of Life","Fantasy","Short Story","Female Lead","Strong Lead","Magic","High Fantasy","First Contact"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":28,"chapters_count":1,"last_update":1717503223,"description":"Patricia Bonfire was visiting her great grandson, the Archmage of Oldspine, when a spell gone awry sent her across the world and into the lives of a humble goblin village. what  will happen next? only time will tell.\n\nMay change tags, not sure exactly what is happening, picked the ones that loosely fit my plan.","description_hash":3077723195875827084},{"title":"One Last Bite","fiction_id":"87796","link":"https:\/\/www.royalroad.com\/fiction\/87796\/one-last-bite","tags":["Post Apocalyptic","Psychological","Female Lead","Contemporary","Tragedy","Short Story","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":18,"view_count":72,"chapters_count":1,"last_update":1717503221,"description":"Survivors of a zombie apocalypse, a hopeless mother must perform a supply run for her family of three.","description_hash":-5952573805676727310},{"title":"Dungeon Oasis","fiction_id":"87795","link":"https:\/\/www.royalroad.com\/fiction\/87795\/dungeon-oasis","tags":["Portal Fantasy \/ Isekai","Dungeon","Non-Human Lead","Fantasy","Reincarnation","Magic","High Fantasy"],"lable":"Original","following_count":16,"rating":5.0,"page_count":7,"view_count":301,"chapters_count":2,"last_update":1718035202,"description":"I have a problem. After being accidentally killed I was given a chance at reincarnation. I chose to be reborn as a dungeon because it had the longest life expectancy of all the options. The problem is that my dungeon is in the middle of a vast desert. How am I supposed to attract delvers when few people can even reach me, and fewer still are in any shape to go delving when they do. \nGuess I'll have to become my own oasis. That doesn't mean that I'm not going to do the whole dungeon thing though.\n(Note, the majority of this story will be clean. The profanity tag is just to give me more dialog options. Don't expect explicit language in every conversation.)","description_hash":7659813642844387528},{"title":"Knit Wit","fiction_id":"87794","link":"https:\/\/www.royalroad.com\/fiction\/87794\/knit-wit","tags":["Strategy","Comedy","Female Lead","Contemporary","Fantasy","Short Story","First Contact"],"lable":"Original","following_count":1,"rating":0.0,"page_count":11,"view_count":73,"chapters_count":1,"last_update":1717503196,"description":"Goblins and Grandmas... two unlikely groups brought together by chance. An uneasy alliance is formed when each group discovers they need the other.","description_hash":-6748028957324924902},{"title":"Manifest","fiction_id":"87793","link":"https:\/\/www.royalroad.com\/fiction\/87793\/manifest","tags":["Multiple Lead Characters","Action","Adventure","Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":29,"chapters_count":1,"last_update":1717503191,"description":"In a world where souls can be manifested into powerful abilities, two young individuals, Jade Everhart and Omaru Grayheart, embark journeys that will intertwine their fates forever. Jade, from the prestigious Everhart Manor, sets out to become a Soul Knight, carrying the weight of his family's legacy on his shoulders. Meanwhile, Omaru, orphaned and ostracized from his village, seeks redemption and purpose in the ancient forests. Omaru's journey to become a Soul Knight is driven by his desire to protect others and overcome the shadows of his past. As Jade and Omaru's paths converge, they form a strong bond fueled by their shared ambition and determination. However, their burgeoning friendship is tested as they face formidable challenges and a rivalry emerges between them. As they strive to become Soul Knights, they must also beware of the evils lurking in the shadows, threatening to derail their quests and plunge the world into darkness.","description_hash":-5306958463464157755},{"title":"Murder town","fiction_id":"87770","link":"https:\/\/www.royalroad.com\/fiction\/87770\/murder-town","tags":["Male Lead","Drama","Fantasy","Mystery","Short Story","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":29,"chapters_count":1,"last_update":1717501974,"description":"A mystery about lovers kashan and Irim in a town, where they face a murder.","description_hash":-2213748820710677799},{"title":"Blox Fruits: Celestial Pirates!","fiction_id":"87769","link":"https:\/\/www.royalroad.com\/fiction\/87769\/blox-fruits-celestial-pirates","tags":["GameLit","Urban Fantasy","Progression","Super Heroes","War and Military","Action","Adventure","Comedy","Drama","Supernatural","Male Lead","Multiple Lead Characters","Strategy","Grimdark","High Fantasy"],"lable":"Fan Fiction","following_count":1,"rating":0.0,"page_count":5,"view_count":86,"chapters_count":2,"last_update":1717728091,"description":"Feast your eyes before the bizarre adventures of Celestial Pirates as they sail across the seas in search of the true meaning behind Freedom!\n\n★This story is inspired by the wonderful adventures of The Celestial Pirates based on a Roblox One Piece game, Blox Fruits. A game that was also inspired by one of the best selling manga, One Piece, written by Eiichiro Oda.★\n\n-Love, Author Sharuru","description_hash":-5548167866616486549},{"title":"Magas Resurgence","fiction_id":"87768","link":"https:\/\/www.royalroad.com\/fiction\/87768\/magas-resurgence","tags":["Anti-Hero Lead","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":11,"view_count":102,"chapters_count":3,"last_update":1717932721,"description":"Magas Resurgence is an epic fantasy series set in a world where individuals wield powers that mirror their deepest principles. The narrative revolves around Satoshi, a young man on a quest for vengeance and truth after inheriting a legendary blade once owned by Maga, a powerful Nephilim warrior. As Satoshi uncovers dark secrets and faces formidable foes, he must navigate a landscape of betrayal, power struggles, and ancient legends reborn.","description_hash":-6214916936706024235},{"title":"The Shadow of Arrows","fiction_id":"87767","link":"https:\/\/www.royalroad.com\/fiction\/87767\/the-shadow-of-arrows","tags":["War and Military","Tragedy","Drama","Fantasy","Romance","Strategy","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"After the ruthless conquest of the continent of Efforos by the House of Arrow came to an end, a new generation emerged, marked by the harrowing memories of their fathers and families falling at the hands of Alexander the Second, the ambitious ruler who held the titles of Lord of House Arrow, Duke of Jueba City, and Emperor of Efforos. In the year 331 A.A. (After Arrival), a simmering desire for vengeance began to take root across the continent, particularly manifesting in three individuals. Nahira, the daughter of the last king of House Griffin, carried the weight of her family's demise on her shoulders. Cy, the Duke of House Voreioi, whose ancient lineage had often been victimized by the Arrow's thirst for power, also felt the stirring of retribution in his heart. Lastly, Adila, once a queen but now a lonely and desolate duchess, sought solace for her shattered soul amidst the turmoil. Meanwhile, in the grandeur of Jueba City, Prince Niles, the youngest son of Alexander, and a trusted first councilor, found himself holding a pivotal letter that would determine the fate of the entire empire.","description_hash":7478800956297708660},{"title":"Old Wolves Never Die [A Grandmas-vs-Goblins Heist Story] ","fiction_id":"87766","link":"https:\/\/www.royalroad.com\/fiction\/87766\/old-wolves-never-die-a-grandmas-vs-goblins-heist","tags":["Anti-Hero Lead","Strategy","Psychological","Female Lead","Strong Lead","Action","Drama","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":5,"rating":5.0,"page_count":48,"view_count":342,"chapters_count":7,"last_update":1718524569,"description":"[Participant in the June 2024 Royal Road Community Magazine Contest]\n\n\nWOLF thought she was done with her One Last Job—had botched it so thoroughly that she could live out her days in peace and solitude, free from anyone or anything she cared enough to fight for.\nBut the past has a way of catching up with you, especially if you're a retired Assassin with mysterious powers and even stranger friends. And when an old packmate comes a-knocking with a brand new proposal to take down an all-too-familiar mark, Wolf is thrown back into a deadly battle against a Goblin army led by the sinister Urlking—and a reckoning with the darkness within her own heart—all to set right what went terribly wrong thirty years ago.\nOne Last Job, this time for keeps...\n\n\n\nA note about the release schedule: At least for now, this is a side project, intended to complete within the time frame of the community magazine contest. As such, I won't have a set release schedule, and will simply upload new chapters whenever they're ready.","description_hash":2511073479925563685},{"title":"The Dominator of Realities","fiction_id":"87765","link":"https:\/\/www.royalroad.com\/fiction\/87765\/the-dominator-of-realities","tags":["Portal Fantasy \/ Isekai","Urban Fantasy","Progression","Post Apocalyptic","Super Heroes","Adventure","Fantasy","Sci-fi","Mystery","Supernatural","Male Lead","Magic","Xianxia","High Fantasy","Space Opera","Ruling Class","Soft Sci-fi"],"lable":"Original","following_count":3,"rating":0.0,"page_count":26,"view_count":322,"chapters_count":5,"last_update":1717763642,"description":"Living in a world of super hero's Nick is excited for his eighteenth birthday to awaken his powers. When testing his powers for the first time with no experience or control. Nick appears in another universe with no idea where he is and no way home. Will Nick become another who dies and gets forgotten in the sands of time or will he grab hold of his fate and find a way home?","description_hash":-6458439877983212977},{"title":"Outer Heaven - A Life of Many Deaths","fiction_id":"87764","link":"https:\/\/www.royalroad.com\/fiction\/87764\/outer-heaven-a-life-of-many-deaths","tags":["Portal Fantasy \/ Isekai","Urban Fantasy","Comedy","Multiple Lead Characters","Tragedy","Action","Fantasy","Reincarnation","Supernatural","Male Lead","Low Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":20,"view_count":45,"chapters_count":1,"last_update":1717469702,"description":"Barachiel \"Rocky\" Bergamo is a simple man of simple tastes, working for the common good. All his good deeds however are met with misfortune, as everyone takes advantage of him. Just as he is about to end things, he meets Celine Cho, whom he later discovers to be more than she seemed.","description_hash":5273166426373220815},{"title":"Interviews Of Valen Donk","fiction_id":"87763","link":"https:\/\/www.royalroad.com\/fiction\/87763\/interviews-of-valen-donk","tags":["Comedy","Male Lead","Strong Lead","Adventure","Fantasy","Satire","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":16,"view_count":37,"chapters_count":1,"last_update":1717466311,"description":"Valen Donk a reporter for the Therac Times scours the magical and fanatical world looking for news to share. His ability to stumble and fall into the most powerful people across the world has lead him to be one of the most popular reporters not just in Therac but across the world. These writings are his first hand accounts of his adventures across this land of interesting people and bizarre adventures. The fantasy world is heavily inspired by the series by Terry Pratchett called the Discworld also the individual stories might draw inspiration form other pieces of writing.","description_hash":7208927558750867853},{"title":"Reborn of The Cthulhu King ","fiction_id":"87762","link":"https:\/\/www.royalroad.com\/fiction\/87762\/reborn-of-the-cthulhu-king","tags":["Reincarnation","Anti-Hero Lead","Grimdark","Multiple Lead Characters","Harem","Action","Fantasy","Romance","Mystery","Supernatural","Male Lead","Strong Lead","Non-Human Lead","Magic","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":37,"view_count":478,"chapters_count":16,"last_update":1718467478,"description":"After the catastrophic battle in which he was defeated by the Demon Dragon Zudomu, Zalmiuth found himself reborn as a small demon, back to where he had once started. Now, Zalmiuth's objective is clear: to retry everything and conquer the Demon Realm.","description_hash":4172900110053156746},{"title":"Crowned in Mud: A Monster Evolution story","fiction_id":"87761","link":"https:\/\/www.royalroad.com\/fiction\/87761\/crowned-in-mud-a-monster-evolution-story","tags":["LitRPG","Reincarnation","Anti-Hero Lead","War and Military","Comedy","Adventure","Fantasy","Non-Human Lead","Ruling Class"],"lable":"Original","following_count":9,"rating":4.5,"page_count":18,"view_count":558,"chapters_count":4,"last_update":1717961293,"description":"A rich aristocratic noble obsessed with money was going about his regular day when he died. The next day he wakes up as a lizard, in the middle of a mud land surrounded by predators and monsters who want to kill and eat him. But just because he's a lizard now doesn't mean his noble superiority complex went away.","description_hash":-3680880714975312444},{"title":"Firstborn of the Frontier","fiction_id":"87760","link":"https:\/\/www.royalroad.com\/fiction\/87760\/firstborn-of-the-frontier","tags":["Urban Fantasy","Male Lead","Slice of Life","Action","Adventure","Fantasy","Supernatural","Magic","Technologically Engineered"],"lable":"Original","following_count":594,"rating":4.65,"page_count":807,"view_count":21717,"chapters_count":28,"last_update":1718569860,"description":"The Frontier. A new world full of freedom, adventure, and opportunity, where anyone can carve their name into history and earn a fortune doing so.\n \nA promise made to the first wave of settlers, but for Howie Zhu, the Frontier is all he’s ever known. Born and raised in this unexplored land filled with vast riches and natural splendour, he sets out to make his mark as the Firstborn of the Frontier, the eldest scion of a new generation on a new world. With his daddy’s pistol on his hip, his mama’s Spellbook in his pocket, and a heart full of determination, he ventures out in search of fame, fortune, identity, and purpose. A trailblazer by necessity and lone wolf by nature, join Howie as he explores a world bereft of all the modern conveniences of the old, where the law is a distant echo of a polite suggestion and monstrous Aberrations run rampant. Survival is only the beginning as he navigates through lands teeming with danger and opportunity both, for the true struggle lies in straddling the line between hero and villain. Morals are the currency of trust after all, and there is little of either to be found out on the wild, untamed Frontier.\n \nAn Urban Fantasy Magi-Tech tale of Spellslinging, gunfighting, adventuring, and exploring, with orcs, bugs, and zombies aplenty. Inspired by DnD, Path of Exile, Rimworld, and a few other things.\n \nChapters released every Tues\/Thurs\/Sun\nJoin us for a chat on Discord\nCheck out the Magical Compendium for general rules, methods, spells, and moreMap of the Frontier (WIP and subject to change)","description_hash":-5966804974379061492},{"title":"Living Motor","fiction_id":"87759","link":"https:\/\/www.royalroad.com\/fiction\/87759\/living-motor","tags":["Urban Fantasy","Male Lead","Action","Adventure","Fantasy","Low Fantasy","Mythos"],"lable":"Original","following_count":1,"rating":0.0,"page_count":12,"view_count":92,"chapters_count":2,"last_update":1718591558,"description":"Living Motor is the story of Jing as he discovers a hidden world behind his current one, where different supernatural beings and groups clash to control what happens in the current world. The one strange thing is, everyone has decided that they can only compete by racing?!\nFollow Jing as he meets fantastical characters, both humans and not, while discovering why he's able to even enter this other world in the first place!","description_hash":7051771880483800669},{"title":"From the Ashes","fiction_id":"87758","link":"https:\/\/www.royalroad.com\/fiction\/87758\/from-the-ashes","tags":["Progression","War and Military","Grimdark","Psychological","Steampunk","Action","Adventure","Fantasy","Supernatural","Male Lead","Magic","Low Fantasy","Mythos"],"lable":"Original","following_count":6,"rating":5.0,"page_count":100,"view_count":385,"chapters_count":7,"last_update":1718561037,"description":"Mankind had fought for its survival for centuries. A people who never could wield magic were thrust into a magical world, forcing them to adapt in new and unique ways. \nWyatt Rosallyn is one of them. Born in the countryside amid a scientific and industrial revolution, his gifted mind landed him into one of the most prestigious universities in the Human Realms. However, not all was well for Wyatt. Memories still surface from his early childhood, blurry and disjointed, but traumatic all the same. The questions about his past and family interest him as much as the natural world and its laws. He will find that his family history runs much deeper than he had thought.\nIn the quest to find answers, he will travel far from home to an untamed and hostile land.\nAnd he'll find he has been gifted in more ways than one.\nAnd... Whispers are coming from the farthest reaches of the continent. Something way bigger than Wyatt is brewing.\n\nAuthor's Note - This story will be a slow burn for the most part, so if you like worldbuilding in stories I think you'll gonna like this one :). Another thing to mention is that English is not my native language, hence any grammar mistakes or bad sentence structure are to blame for that. Not that's an excuse though! I will edit whenever I can so that I make it an enjoyable reading experience for you lads and lassies! Thank you!\nChapters will be long (3,000 to 6,000 words) with occasionally shorter chapters (less than 3,000 words). One chapter will go live every 3 days. If any change occurs I will inform you.\nIf you want to read chapters in advance, consider subscribing to my Patreon!\nPatreon - https:\/\/www.patreon.com\/chronos1848","description_hash":6410858740425700165},{"title":"Stolen Divinity: Sun God Cultivation","fiction_id":"87757","link":"https:\/\/www.royalroad.com\/fiction\/87757\/stolen-divinity-sun-god-cultivation","tags":["Progression","Anti-Hero Lead","Female Lead","Strong Lead","Drama","Action","Adventure","Fantasy","Magic","High Fantasy","Mythos","Attractive Lead"],"lable":"Original","following_count":238,"rating":4.22,"page_count":206,"view_count":12850,"chapters_count":29,"last_update":1718561162,"description":"In the battle for power and godhood, it’s winner takes all, and Adriana has no intention of losing. \nThe Gods are at war, the world overrun with unnatural monsters bent on the destruction of all humanity. Men and women compete to claim the most Divinity in a never ending, brutal competition for Godhood. Determined to Ascend themselves, young, hotheaded warrior Adriana and her flighty only friend, Davos, join a pair of mercenaries in their hunt for Divinity of their own. \nWhen a tip gone wrong leads them into a battle between the sun god Hessius and the evil titan, the Maw of Chaos, Adriana inherits the fallen sun god’s power. Now on the path to godhood, she'll have to decide whether to stand for humanity against the Mother of Monsters, or to fight only for herself. \nBut everyone is after her newly-won Divinity: former allies turned stalkers, greedy power brokers, and hundreds of disciples of Hessius all converge to claim it for themselves. But Adriana will take on the world, do anything and everything it takes, to claim the destiny she’s chosen. Anything to be a God. \nExpect: tons of fighting, cool powers, and a world inspired by Greek Myths. Updates daily for the first month!","description_hash":-3022280661695886176},{"title":"When Heroes Die","fiction_id":"87756","link":"https:\/\/www.royalroad.com\/fiction\/87756\/when-heroes-die","tags":["Portal Fantasy \/ Isekai","Grimdark","Multiple Lead Characters","Fantasy","Female Lead","Magic","High Fantasy"],"lable":"Fan Fiction","following_count":3,"rating":0.0,"page_count":281,"view_count":865,"chapters_count":17,"last_update":1718395205,"description":"The hero defeats the monster, finds their lover and locks away the ancient evil, then the world goes on living. At least, that is what usually happens. This, however, is not that story.\n\nThis is a story about what happens when heroes die.\n\n\n\nWhen Heroes Die is a Worm Post Gold Morning\/A Practical Guide to Evil Fanfiction featuring Taylor Hebert's journey in Calernia. Please support the respective authors. These are their worlds, I am just playing around with them.\n\nIt starts in the Guide year 1314, nine to ten years before the Guide canonically starts Catherine's story in Chapter 1: Knife. All events that occur prior to that year are following the canonical Guide timeline, as per the WordPress version of the Guide. The Conquest has already happened. Expect events that occur after that date to gradually drift from canon. I am aware that events in the Yonder version of the Guide are different, I am not following it.\n\nWhen Heroes Die will update every Monday, Wednesday and Friday at 10 PM UTC +2. Chapters will be between 3-5k in length.","description_hash":-9096687951203935377},{"title":"The Grey Files: A Vampyre Lord LitRPG","fiction_id":"87755","link":"https:\/\/www.royalroad.com\/fiction\/87755\/the-grey-files-a-vampyre-lord-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Sci-fi","Secret Identity","Adventure","Drama","Fantasy","Supernatural","Strong Lead","Magic","GameLit"],"lable":"Original","following_count":117,"rating":4.37,"page_count":179,"view_count":6383,"chapters_count":23,"last_update":1718534662,"description":"Waking up in a strange dungeon with no memory of his past life, Jackson Grey is tasked by a dark god to find the artifact at the end of the dungeon if he wants to be free. It turns out Jackson has awoken in the realms of Eden, he has strange powers he isn’t sure how to use, and if that wasn’t enough, he may be a blood sucking vampyre. Dealing with an insatiable hunger, Jackson must solve deadly puzzles, fight even deadlier monsters, and do his very best to not become a monster himself along the way. In his journey through the dungeon, Jackson will have to learn a harsh lesson. In Eden, the only thing that really matters is strength.","description_hash":-7556124566197770622},{"title":"The Hero is Not Coming","fiction_id":"87754","link":"https:\/\/www.royalroad.com\/fiction\/87754\/the-hero-is-not-coming","tags":["Reincarnation","War and Military","Slice of Life","Drama","Action","Adventure","Fantasy","Magic","Strategy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":33,"view_count":240,"chapters_count":8,"last_update":1718480714,"description":"Because he did not feel the need to pass on any knowledge, the hero was unable to avert the final catastrophe. He and his friends couldn't defeat evil alone; they chose to stay and protect the borders, leaving him alone to defeat the demon lord. At the end, he only had the ability to drive him out of this world and hide with the remnants of humanity; his decisions plagued his mind until his death.\n\nA long time passed, and now Edmund has a chance to use the memories of the hero along with his guilt to defeat the demon lord, but since he lacks magic and is completely ignored by everyone, he must create a path that anyone can follow because this time the hero is not coming.","description_hash":-1164819070055965115},{"title":"So When Am I a Hero? [Apocalypse LitRPG]","fiction_id":"87753","link":"https:\/\/www.royalroad.com\/fiction\/87753\/so-when-am-i-a-hero-apocalypse-litrpg","tags":["LitRPG","Post Apocalyptic","Comedy","Female Lead","Action","Adventure","Fantasy","GameLit","Low Fantasy"],"lable":"Original","following_count":678,"rating":4.74,"page_count":152,"view_count":23786,"chapters_count":19,"last_update":1718379962,"description":"Helen used to have it all together, with a dreamy fiancé and an upcoming law degree. Then, her world shattered to bits. At only 26 years old, she already hit rock bottom as a bathrobe-wearing, nonsense-muttering crazy lady. Couldn’t get much worse, right?\nThat’s, of course, when Earth also decides to pull a Helen: it fractures, literally, into pieces. Five million, to be exact - each fully converted into a hovering battlefield. Now, on a flying hunk of what used to be Chicago, she has less than 24 hours to find an elusive portal and get out before the city crumbles. And this is only the first stage. \nFor Helen, it isn’t actually all that bad. She’s fighting cryptid nightmares, stumbling through quests, tasting history, and scoring loot. Finally, the world makes just about as much sense as her life. \nBut when she becomes the reluctant leader of a hapless team, she finds she may either be just what they need to survive or exactly what tears them apart. One thing’s for sure though: this is the weirdest Tuesday of her life. \nWhat to Expect:\n- System apocalypse\n- Slow burn\n- \"At least she survives\" to \"sure, we'll call that strong\" MC\n- Dark, self-deprecating humor mixed with brutal action\nI’ll be publishing chapters roughly 2000 words each: every day for the first month, then probably dropping back to just two days a week (Monday, Thursday @ Noon EST). Cheers!","description_hash":8233399543505765089},{"title":"A second chance","fiction_id":"87752","link":"https:\/\/www.royalroad.com\/fiction\/87752\/a-second-chance","tags":["Time Travel","Male Lead","Slice of Life","Drama","Fantasy","Romance","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":24,"view_count":108,"chapters_count":3,"last_update":1717786665,"description":"A young man finds himself deeply depressed over what he perceives was wasted life and opportunities. Struggling to accept his life and dealing with regrets, the unfortunate accident gives him a second chance.\nWill he make it this time? Or is it simply not meant to be?","description_hash":-2384156258392214354},{"title":"Riftwalker","fiction_id":"87751","link":"https:\/\/www.royalroad.com\/fiction\/87751\/riftwalker","tags":["Urban Fantasy","Progression","Post Apocalyptic","Anti-Hero Lead","War and Military","Action","Drama","Fantasy","Psychological","Slice of Life","Male Lead","Magic","Grimdark","Low Fantasy","Dystopia"],"lable":"Original","following_count":2227,"rating":4.65,"page_count":151,"view_count":73054,"chapters_count":14,"last_update":1718375748,"description":"The Rapture hit on June 14th, 2024, flooding Earth with monsters from another world. Three years later, Kei Nakamura was in the middle of it, fighting monsters in post-apocalyptic Seattle. As a drafted soldier, his life was bleak, and his time was running short. Yet, after a series of wild events gave him ever-increasing powers, he bided his time, improved his magic, and took his life into his own hands.\nRead chapter 1 >\n-\nWhat to expect:\n \n[+] Unique Magic System\n[+] Weak to Strong\n[+] Portal Monsters\n[+] Action\n[+] Slow Burn\n[+] Slice of Life\n[+] Real Struggles\n[+] Hi-tech Feudal Society\n——————\n- Quality-first writing. 3k word chapters. MWF.","description_hash":2892176576424268242},{"title":"Zakula: Beloved Companion","fiction_id":"87750","link":"https:\/\/www.royalroad.com\/fiction\/87750\/zakula-beloved-companion","tags":["Reincarnation","Male Lead","Strong Lead","Drama","Adventure","Fantasy","Mystery","Magic","High Fantasy","Mythos","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":178,"view_count":673,"chapters_count":20,"last_update":1717417898,"description":"Karelias did not choose his dog. Armas chose his human. For many years, they have been brothers with two hands and six feet. But Armas was always destined to die first. Knowing how lost his human would be without him, he clings onto life. But death always wins.\nOr does it?\nWhen Karelias' long lost father returns, he claims it doesn't have to be this way. Supposedly the blood of the great goddess Zakula can grant eternal life and bring anyone back from the other side. But is it really a good idea to drink the blood of a goddess?","description_hash":7792676483085724866},{"title":"Mabel's Marvelous Misadventure","fiction_id":"87749","link":"https:\/\/www.royalroad.com\/fiction\/87749\/mabels-marvelous-misadventure","tags":["Portal Fantasy \/ Isekai","Comedy","Adventure","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":40,"chapters_count":1,"last_update":1717414868,"description":"In the whimsical village of Elderberry Hollow, Mabel Thistledown is known for her nurturing nature and her cozy cottage filled with the scent of baked goods and blooming roses. One night, her family heirloom locket glows and transports her to the magical forest of Shimmerwood, where she encounters a camp of goblins.\nMistaking the goblins for children, Mabel takes on the role of their granny, caring for them with a firm but loving hand. She organizes their camp, feeds them, and even puts them to bed with lullabies. The goblins, initially resistant to her ways, soon find themselves charmed by her kindness and begin to see her as their matriarch.","description_hash":7826037301614029644},{"title":"The Blessing of Orion","fiction_id":"87748","link":"https:\/\/www.royalroad.com\/fiction\/87748\/the-blessing-of-orion","tags":["Male Lead","Action","Adventure","Fantasy","Mystery","Supernatural","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":10,"view_count":28,"chapters_count":1,"last_update":1717414861,"description":"Humanity is on the brink of extinction. Years ago a rift tore open in our world, and creatures of nightmare emerged, plunging humanity in an era of death and destruction. On the verge of being wiped out entirely, humanity's last hope appeared, a star that fell from the sky, imbuing them with the gift of magic. \nFrom it was born the six Ancient Arts, magical practices designed to empower mankind and resist the impending Apocalypse. The Founding Countries were born, the last, greatest safehouses that the monsters have tried and failed to penetrate for centuries. Humanity was safe, for the most part. \nRodric Charleston was born and raised in one of these countries, safe from the horrors that lurk beyond the magical borders. He had never considered going beyond them, until four months ago, when disastrous news had reached them. The party his father had been traveling with, transporting important provisions, had been attacked. It is unsure whether any survivors remained, but no one had ever cared to confirm. Rodric cares, however, and he has finally come of age. \nAgainst the wishes of everyone he cares about, he ventures out into this dark and deadly world, to find the answers no one else will.","description_hash":-6668416669174700493},{"title":"DISHONEST","fiction_id":"87747","link":"https:\/\/www.royalroad.com\/fiction\/87747\/dishonest","tags":["Anti-Hero Lead","Martial Arts","Grimdark","Harem","Tragedy","Action","Horror","Romance","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":26,"view_count":138,"chapters_count":3,"last_update":1718365088,"description":"This is my story. I grew up in a village of slaves in the kingdom of Erlösung. My mother, a prostitute in a brothel, was my only family, and I loved her dearly. My only friend was the chief's granddaughter. Despite not having much, I treasured our time together and the memories we made. Everything changed when a soldier discovered my mother's true identity as an elvaan and a witch. In order to protect me, she sacrificed herself, and I found myself in a precarious situation between life and death in the Cave of Between. After being attacked by the guardian, an ancient dragon of chaos, my soul was spirited away to the underworld. My journey has been to escape the seven hells and to grow stronger for my quest of seeking revenge for my loved ones. My name is Alonne Snowseek, and this is my story.","description_hash":6009014579620264051},{"title":"Dot & Gob - Slice of Life Fantasy - ['Goblins & Grandmas' Entry]","fiction_id":"87746","link":"https:\/\/www.royalroad.com\/fiction\/87746\/dot-gob-slice-of-life-fantasy-goblins-grandmas","tags":["Comedy","Psychological","Female Lead","Slice of Life","Drama","Fantasy","High Fantasy"],"lable":"Original","following_count":10,"rating":4.75,"page_count":74,"view_count":1052,"chapters_count":15,"last_update":1718627880,"description":"Dorothy has lived far longer than she expected. Especially when her husband passed to leave her alone in their home in the goblin-infested Midderlands. But she might regret not listening to her son and moving somewhere safer when she hears goblins screeching outside her house in the middle of the night.\nSaving a scrawny goblin, Gob, is only the start of her problems when her intervention attracts the attention of Great Chief Taruk, a powerful goblin leader who has begun a war against the 'manlings' to lay ancestral claim to the forest where Dorothy lives. \nEntry for Goblins & Grandma's writing contest. Will aim for one chapter a day, but don't have any backlog so I could fall behind.","description_hash":6515433557273940035},{"title":"How to Train Your Endbringer","fiction_id":"87745","link":"https:\/\/www.royalroad.com\/fiction\/87745\/how-to-train-your-endbringer","tags":["Progression","Super Heroes","Ruling Class","Comedy","Psychological","Action","Adventure","Slice of Life","Female Lead","Non-Human Lead","Secret Identity","Soft Sci-fi"],"lable":"Fan Fiction","following_count":356,"rating":4.78,"page_count":152,"view_count":10043,"chapters_count":13,"last_update":1718481947,"description":"In which Taylor loses her mind, Queen Administrator decides that bugs aren't very impressive, and everyone discovers that It's hard to escalate more than 'ride an Endbringer into battle.'\n\nA Worm fanfiction... written in 2018. It's kind of bad, but it's got a few cute and funny moments!","description_hash":3989031349300027750},{"title":"SHADOWS OF THE CHOSEN","fiction_id":"87744","link":"https:\/\/www.royalroad.com\/fiction\/87744\/shadows-of-the-chosen","tags":["Urban Fantasy","Post Apocalyptic","Super Heroes","Secret Identity","Action","Adventure","Mystery","Supernatural","Magic"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":21,"chapters_count":1,"last_update":1717414751,"description":"\"Shadows of the Chosen\" follows Rex, an 18-year-old crippled boy who transforms into the Divine General to fight against ancient malevolent demons. With newfound divine powers, he battles to lift the curse on Earth and restore hope to humanity.","description_hash":692413672620967008},{"title":"Absence of Illumination","fiction_id":"87743","link":"https:\/\/www.royalroad.com\/fiction\/87743\/absence-of-illumination","tags":["Male Lead","Action","Adventure","Fantasy","Mystery","Supernatural"],"lable":"Original","following_count":4,"rating":5.0,"page_count":25,"view_count":288,"chapters_count":5,"last_update":1717910975,"description":"Silas thought he was attending a regular gathering, but he soon realizes he's stumbled into a dangerous cult. Caught in their web, he's compelled to complete missions, each more daunting than the last. Little does he know, these tasks will unleash consequences far beyond his imagination. As he slowly completes the missions, he delves deeper into the world he calls home.","description_hash":2034185564998011453},{"title":"Dretar:Story of the God Killer","fiction_id":"87742","link":"https:\/\/www.royalroad.com\/fiction\/87742\/dretarstory-of-the-god-killer","tags":["Anti-Hero Lead","Male Lead","Tragedy","Action","Mystery","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":17,"chapters_count":1,"last_update":1717414723,"description":"When a young boy name dretar finds gets neglected he starts a adventure for us readers","description_hash":-7503781017257739643},{"title":"Lord Executioner","fiction_id":"87741","link":"https:\/\/www.royalroad.com\/fiction\/87741\/lord-executioner","tags":["Ruling Class","Martial Arts","Male Lead","Slice of Life","Drama","Action","Fantasy","Short Story","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":5,"view_count":60,"chapters_count":1,"last_update":1717414699,"description":"A liege lord must dispense justice in the name of his shōgun.","description_hash":40806340764721955},{"title":"King’s Court","fiction_id":"87740","link":"https:\/\/www.royalroad.com\/fiction\/87740\/kings-court","tags":["Fantasy","Short Story","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":4.5,"page_count":3,"view_count":85,"chapters_count":1,"last_update":1717414299,"description":"A short story of a King’s conversation with a Philosopher that is visiting his court.\nDisclaimer: This is more of a test of my proficiency in writing which means that I will likely not continue on with anything of a similar nature.","description_hash":-5162839874939443658},{"title":"PIG SYSTEM: A GOBLINS & GRANDMAS DICE SYSTEM ADVENTURE ","fiction_id":"87738","link":"https:\/\/www.royalroad.com\/fiction\/87738\/pig-system-a-goblins-grandmas-dice-system-adventure","tags":["GameLit","Female Lead","Slice of Life","Adventure","Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":18,"view_count":80,"chapters_count":2,"last_update":1718580053,"description":"Adventure is not something the ladies of Summer Eve Residence are expecting as they enjoy their peace and quiet from the other old folks. But with a late breakfast, bloody horn holes, and a goblin thief bound by tribe honor to serve. The ladies of Summer Eve find that adventure can be had even in their golden years.","description_hash":-8349680461225338197},{"title":"Sinbound","fiction_id":"87737","link":"https:\/\/www.royalroad.com\/fiction\/87737\/sinbound","tags":["Anti-Hero Lead","Male Lead","Strong Lead","Action","Adventure","Soft Sci-fi"],"lable":"Original","following_count":2,"rating":0.0,"page_count":52,"view_count":319,"chapters_count":8,"last_update":1717557358,"description":"The Eclipse Agency: Anomaly Unleashed\nIn a world where extraordinary powers turn ordinary people into dangerous anomalies, The Eclipse Agency captures and studies these powerful beings. Among them is Kaze Jūryoku, an S-Rank anomaly with the ability to manipulate gravity. As the agency's most prized asset, Kaze becomes the focal point of the ambitious Project K experiment, led by the ruthless Chairman Kurosawa Misuki.\nRin Asakura, a young girl with newly discovered abilities, undergoes intense experiments to boost her powers, supervised by the conflicted scientist Dr. Keito Shinsei. As Keito grapples with the ethics of his work, he decides to leave the agency to protect his family, setting off a chain of events that shake the agency to its core.\nAlliances form and tensions rise as Enforcers joins forces  to stop Kurosawa's dangerous plan. Secrets unravel, betrayals emerge, and a final showdown looms that will test their limits and redefine the boundaries of power.\n**Sinbound** is a gripping tale of power, betrayal, and redemption, where Kaze's struggle for freedom and the true cost of power are revealed in a battle that will determine the fate of humanity.","description_hash":2634296621362959070},{"title":"Fire & Soul","fiction_id":"87736","link":"https:\/\/www.royalroad.com\/fiction\/87736\/fire-soul","tags":["Action","Fantasy","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":19,"view_count":53,"chapters_count":2,"last_update":1718196658,"description":"Daimen's world lies in ruins—his clan decimated; his parents brutally slain by the tyrannical Emperor Aelon. Consumed by grief and driven by a burning desire for vengeance, Daimen journeys to Ceiala. There, after a mission spirals into chaos, he inherits the formidable power of the Phoenix. Determined to avenge his loved ones, Daimen throws himself into relentless training, pushing his newfound abilities to their limits. But as his strength grows, a sinister and unknown threat begins to loom, casting a shadow over his quest for revenge and threatening the very fabric of the Realm. Every step forward in his journey reveals darker secrets and deeper dangers, twisting his path into a perilous fight for not just vengeance, but the survival of everything he holds dear.","description_hash":8760435497957411536},{"title":"Yearning Spirit: The Foolish Youth With a Secret Skill","fiction_id":"87735","link":"https:\/\/www.royalroad.com\/fiction\/87735\/yearning-spirit-the-foolish-youth-with-a-secret","tags":["LitRPG","Progression","Drama","Adventure","Fantasy","Magic","GameLit","High Fantasy","Mythos"],"lable":"Original","following_count":3,"rating":5.0,"page_count":48,"view_count":414,"chapters_count":5,"last_update":1718575233,"description":"There are many paths to walk in life, all leading in different directions - some toward peace, some toward glory... some toward doom. There are some paths, however, that humans were never meant to walk... and Aedan Omarsson has found himself on one of them. Worse yet, he doesn't even know how or why.","description_hash":4344604252351379803},{"title":"Stalida, The Goblin Queen","fiction_id":"87734","link":"https:\/\/www.royalroad.com\/fiction\/87734\/stalida-the-goblin-queen","tags":["Portal Fantasy \/ Isekai","Multiple Lead Characters","Slice of Life","Fantasy","Mystery","Reincarnation","Female Lead","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":39,"view_count":468,"chapters_count":7,"last_update":1718276402,"description":"Lu’s world is full of secrets, secrets she craves to uncover. Stalida, is a crazy old lady that no one believes when she tells them her stories. However, when Lu starts talking to her great grandma Stalida, Lu starts to realize that the stories that Stalida tells Lu, is one hundred percent real. Giving Lu a whole new perspective of what is possible in the world. A world she wishes to explore to its fullest capabilities, even if it is against her parents wishes. Follow Lu, as she uncovers a deep family hidden secret that unveils something that Lu thought was impossible.\nSchedule - Every Tuesday\/Thursday 6:00am CST, through the month of June only! \nThis is a community magazine contest entry - the prompt Goblins and Grandmas. \nEnjoy!","description_hash":845150738221093926},{"title":"Building Circles","fiction_id":"87733","link":"https:\/\/www.royalroad.com\/fiction\/87733\/building-circles","tags":["Adventure","Historical","Satire","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":176,"view_count":283,"chapters_count":7,"last_update":1718023730,"description":"A man, we call him Cain, but that's not his name, must travel through late Neolithic Britain to build circles. Around and around he must go searching for love and home. But nowhere is safe, and nothing is sure.","description_hash":2925700292419591215},{"title":"Prototype's Gate","fiction_id":"87732","link":"https:\/\/www.royalroad.com\/fiction\/87732\/prototypes-gate","tags":["Portal Fantasy \/ Isekai","Anti-Hero Lead","Non-Human Lead","Strong Lead","Action","Adventure","Fantasy","Reincarnation","Male Lead","Magic","Genetically Engineered "],"lable":"Fan Fiction","following_count":20,"rating":4.5,"page_count":136,"view_count":1600,"chapters_count":14,"last_update":1718635201,"description":"After surviving a nuclear explosion, Alex Mercer, the protagonist of Prototype, finds himself mysteriously transported to the mystical world of Baldur's Gate, a land teeming with magic, mythical creatures, and ancient mysteries.","description_hash":4988509069529725678},{"title":"when i met you","fiction_id":"87731","link":"https:\/\/www.royalroad.com\/fiction\/87731\/when-i-met-you","tags":["Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":22,"chapters_count":1,"last_update":1717413704,"description":"this story is about a 17 year boy and girl the girl moves to california but then she meets \"james ford\" and her life turns upside down","description_hash":-5473432383222349886},{"title":"Timebound odyssey ","fiction_id":"87730","link":"https:\/\/www.royalroad.com\/fiction\/87730\/timebound-odyssey","tags":["Anti-Hero Lead","Comedy","Sci-fi","Action","Adventure","Hard Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":13,"view_count":152,"chapters_count":3,"last_update":1717440861,"description":"In the land of Drakenspire, ruled by Duke Orion Valtaris, there is a group of seven individuals charged with protecting the land from danger. Among them is a pretty girl who has a look akin to a princess of a royal family; everyone calls her Selene. Another is a quiet and aloof girl with mysterious  features, known as Lyra. The third girl is Talia, who has a wild demeanor and dresses in the traditional way of her tribe.\nThere are also four men in the group. Callien is a muscular, good-looking man with immense strength. Ellios is a mastermind when it comes to working with technology and gadgets. Aldin is an expert in weapons.\nThe seventh member is the strangest. He doesn't engage with anyone else and doesn't appreciate others even when they seek his help. He does whatever he wants without regard for anyone else, but nobody opposes him because he is one of the strongest in the group. He is a mage who likes to study everything about magic, but only in one specific direction.\n\n*strongly suggest to read first full chapter (1,1.2,1.3) before come to any conclusions","description_hash":4358794591185879427},{"title":"The vampire problem","fiction_id":"87729","link":"https:\/\/www.royalroad.com\/fiction\/87729\/the-vampire-problem","tags":["Urban Fantasy","Strategy","Psychological","Non-Human Lead","Action","Adventure","Fantasy","Supernatural","Male Lead","Low Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":43,"view_count":205,"chapters_count":4,"last_update":1717703576,"description":"You can’t be in direct sunlight, you can’t be near any people with strong religions, your shape and first ability is decided by the one that made you, you have to drink blood three times a day, and can starve like any human, except your body also has a mind of its own, and if you don’t feed it, it will rampage. You get one random ability per every century you live through, you get one official familiar for every century you survive in, and you're three times as fast and strong, as the peak of human athleticism. You will die with a steak to the heart, and are immensely flammable. Welcome to the vampire problem. Good luck surviving.","description_hash":1723381755281803997},{"title":"Alan Buys the Universe [LitRPG]","fiction_id":"87728","link":"https:\/\/www.royalroad.com\/fiction\/87728\/alan-buys-the-universe-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Strategy","Comedy","Action","Adventure","Fantasy","Reincarnation","Male Lead","Strong Lead","Magic","GameLit","Mythos","Progression"],"lable":"Original","following_count":165,"rating":4.89,"page_count":218,"view_count":4535,"chapters_count":18,"last_update":1718625713,"description":"Whispers tell of a merchant who strikes deals with gods.\nSomewhere faraway, the universe is in peril. But on Earth, Alan is minding his own business after a double-shift at the pawn shop… until he’s assaulted by a screaming archer. Turns out he was a good shot.\nAlan awakes in Strangey Town – a zany nightmarish jungle of ideas run by a horrid deity – where a clairvoyant frog confirms he has an affinity for magic, and that his powers are far from ordinary. To convene with gods, bargain for souls, and tap into every known magic the universe has to offer is unheard of. But with great promise comes grave danger. Realms hellbent on seizing control of the universe seek to seize Alan’s potential, and will declare war to gain it.\nThrough magic, blade’s edge or a deal, the God Merchant will prevail.","description_hash":-8000289175707814212},{"title":"Forgotten","fiction_id":"87727","link":"https:\/\/www.royalroad.com\/fiction\/87727\/forgotten","tags":["Reincarnation","Psychological","Harem","Action","Adventure","Fantasy","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":23,"chapters_count":1,"last_update":1717413668,"description":"If Man stood before the god’s and had many questions… But was given the chance to only ask one. \n\nWhat would you ask? \n\nAlec was a nice and kind man born in 1935 to kind and caring parents who could barely afford to feed another child let a lot themselves… Out of spite they tried their best to feed and clothe the small young boy with whatever they could. Sadly before they knew it they had grown weak and weary while the boy grew older and stronger. By the time they knew it the boy had come of age and was off to find work but the only work… War. while he never stood out; he had ambition. A burning fire to take care of his parents who took care of him when they had nothing.. To come back and survive.","description_hash":-8338001804060400347},{"title":"Marvel: I Have A Super USB Drive ","fiction_id":"87726","link":"https:\/\/www.royalroad.com\/fiction\/87726\/marvel-i-have-a-super-usb-drive","tags":["Reincarnation","Progression","Psychological","Sci-fi","Strong Lead","Action","Adventure","High Fantasy","Genetically Engineered ","Technologically Engineered","Hard Sci-fi","Dystopia","Artificial Intelligence","Attractive Lead"],"lable":"Fan Fiction","following_count":19,"rating":3.75,"page_count":93,"view_count":1414,"chapters_count":11,"last_update":1718553835,"description":"Life's unpredictable, and so was Joe Petersen's death. Divine Destiny as cruel as it is, gave Joe another second chance. The rotation of a golden roulette thrust him further from the world of normality, and into the multiverse of madness. In Marvel, gods, demons, ancient witches, and cosmic aberrations mingled amongst men; survival and safety were a privilege for the strong. How will Joe navigate through this chaotic universe with only a mysterious USB Drive as his lifeline? Join as he evolves, thrives, and spearheads humanity beyond their preconceived boundaries! \n\nAs Joe finds his own meaning in that absurd world, will ultimate power corrupt his human soul or will he be the one corrupting POWER itself? \n\n...\n\nPS: I have crossposted this on RoyalRoad, Fanfiction.net, Scribblehub, and WebNovel.","description_hash":-1191874678445315269},{"title":"Dancing In The Void","fiction_id":"87725","link":"https:\/\/www.royalroad.com\/fiction\/87725\/dancing-in-the-void","tags":["Urban Fantasy","Post Apocalyptic","Multiple Lead Characters","Tragedy","Fantasy","Horror","Romance","Supernatural","Non-Human Lead","Magic","Low Fantasy","Mythos","Soft Sci-fi"],"lable":"Original","following_count":6,"rating":5.0,"page_count":333,"view_count":665,"chapters_count":15,"last_update":1718560017,"description":"Beware those with white locks… touched by death, they bestow her onto others…\nIt should have been a day like any other. The sameish routine of ordinary life. The monotony of a calm evening. But that fateful day would be anything but typical. That day, Constantine Sancthos found a stranger. A being unlike anything he'd ever seen before crashed through the window of his room. His heart cried out in an echo of agony, forcing him to act, to save her. What cruel soul could abandon a wounded angel to the whims of fate? He could have never imagined that the merest act of kindness would drag him and all his dearest friends into the true unseen reality of their world. A world of the supernatural, filled with horrific demons, eldritch beings that defy conception, and darker forces beyond their wildest imaginations. Will they sink into an abyss of despair, or will they persevere and cling on to the frail hopes of their humanity?\n\nDancing In The Void is a story that I have been writing for a very, very long time. Currently it is 87 chapters long, broken up into 2 completed \"books\" and 1 being written at the present time. At its core, it is a story about love, wrapped in a shell of tragedy and despair, full of treacherous demons, world-shattering battles and crucial choices that will shape the fate of reality itself. I have decided to at long last make it public. I will be posting the first 15 chapters every day within the next two weeks with future chapters coming out on a bi-weekly basis.","description_hash":-3321878140174782265},{"title":"Luckomancer","fiction_id":"87724","link":"https:\/\/www.royalroad.com\/fiction\/87724\/luckomancer","tags":["LitRPG","Progression","Comedy","Male Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":4,"rating":2.75,"page_count":53,"view_count":503,"chapters_count":6,"last_update":1718240305,"description":"Ignatius 'Nate' Arkwright awoke in a room made of storm cloud in Terra, a world very unlike his own. He arrives in a ruined town with myriad secrets and dangers. He unlocks abilities sought by many and he must gather allies, abilities, and powers to survive and thrive in his new world, and maybe discover the reason behind his arrival.","description_hash":-7477481551132350371},{"title":"Narrie's birthday circus surprise","fiction_id":"87723","link":"https:\/\/www.royalroad.com\/fiction\/87723\/narries-birthday-circus-surprise","tags":["Contemporary","Slice of Life","Short Story","School Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":67,"view_count":514,"chapters_count":19,"last_update":1718544644,"description":"I am Narrie Trish Middlecreak and this is my short story based in my forever home town of Noel, and guess what? It's about when my moms brought the whole town together to give me a not very secret late birthday circus surprise!\n\nUpdates ~1ch a day until fully edited\/posted.","description_hash":5528373857343532198},{"title":"Bad Meat","fiction_id":"87722","link":"https:\/\/www.royalroad.com\/fiction\/87722\/bad-meat","tags":["Male Lead","Horror","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":3,"view_count":76,"chapters_count":1,"last_update":1717413592,"description":"Guy eats too much bad meat, and it doesn't go well.","description_hash":-557148451903054920},{"title":"Myris: Legend of the Broken Realm","fiction_id":"87721","link":"https:\/\/www.royalroad.com\/fiction\/87721\/myris-legend-of-the-broken-realm","tags":["Strong Lead","Action","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":38,"view_count":103,"chapters_count":3,"last_update":1717850113,"description":"The world is at stake. Overlords threaten the world of Myris. The six heroes chosen by the gods shall save it... Wait, six?","description_hash":31541010968553777},{"title":"Ready Player Worm","fiction_id":"87720","link":"https:\/\/www.royalroad.com\/fiction\/87720\/ready-player-worm","tags":["GameLit","Urban Fantasy","Progression","Anti-Hero Lead","Super Heroes","Action","Adventure","Comedy","Drama","Male Lead","Female Lead","Strong Lead","Villainous Lead","Attractive Lead"],"lable":"Fan Fiction","following_count":25,"rating":4.89,"page_count":117,"view_count":904,"chapters_count":6,"last_update":1718402434,"description":"Some people just want to watch the world burn. After all, when actions have zero consequences, why not indulge in the basest desires and most selfish whims? It's all fun and games in the end. \nToo bad Earth Bet didn't quite get that memo.","description_hash":2486516343459605532},{"title":"The Time Bandits ","fiction_id":"87719","link":"https:\/\/www.royalroad.com\/fiction\/87719\/the-time-bandits","tags":["Time Travel","Male Lead","Sci-fi","Action","Adventure","Soft Sci-fi"],"lable":"Original","following_count":1,"rating":0.0,"page_count":11,"view_count":63,"chapters_count":2,"last_update":1718430096,"description":"In this sequel to \"THE PORTAL\" we return to the cave where David Jones is still getting used to being a new time traveler. While working to close a paradox for his father, David bumps into something he didn't expect to see: another time traveler. There are suddenly a lot more of them, causing more problems in time for David and his family to fix...","description_hash":8473566821523704947},{"title":"Dragon Soul","fiction_id":"87718","link":"https:\/\/www.royalroad.com\/fiction\/87718\/dragon-soul","tags":["Urban Fantasy","Male Lead","Strong Lead","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":2,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Kenterra itself is magic. The core of the world is a crystal that burns with endless aetheric energy, which thus imbues the planet and everything on it with its power. From this power was born the dragons. Each dragon was given – by the primordial dragon, first dragon and guardian of magic – dominion over an element. fire, water, earth, air, metal, plant, light, dark, and beyond. Together, the dragons created the world. \nOnce the world was made, the mortals took their home upon it. Unlike the dragons, mortals were not born with any connection to an element, but to the core itself. This allowed mortals the ability to cast, and what’s more, create magic. However, the great evil – jealous of the core – sent agents to destroy the world. Mortals fought back, valiantly. But on their own, they were no match for agents of the great evil. So the dragons gifted a chosen few humans the power to use even more powerful elemental magic, to control the element, devour it, grow in strength and fight using their bodies.\nThis was long ago. The Dragon Souls have long since passed on. The world has advanced far beyond its earlier capabilities. But the great evil has been watching, waiting, growing in power… the time has come for new Dragon Souls…","description_hash":2797569280475260983},{"title":"Legacy Of Altherion ","fiction_id":"87717","link":"https:\/\/www.royalroad.com\/fiction\/87717\/legacy-of-altherion","tags":["Portal Fantasy \/ Isekai","Multiple Lead Characters","Action","Fantasy","Romance"],"lable":"Original","following_count":0,"rating":0.0,"page_count":51,"view_count":248,"chapters_count":7,"last_update":1718379534,"description":"Two young men born of different worlds, move to the town of Bracken, unaware of the dangers that await them. \nNathan originates from Altherion, a world of supernatural beings and magic. He chooses to spend most of his time on Earth, where he is able to study, travel and enjoy Earth culture without imposed obligations. \nLogan originates from Kingsford, a city on Earth. Due to circumstances beyond his control, he is forced to relocate to Bracken, where he awakens mysterious supernatural powers not present in his documented lineage. \nIt is discovered that Altherians visiting Bracken are being brutally attacked by unknown assailants, without cause or motive. \nThe young men and those around them soon find themselves entangled in a deadly crusade that threatens the existence of both of their worlds. \nWar is imminent, and extinction looms ever closer.","description_hash":-4352807896062753521},{"title":"The Glorious Revolution - [Isekai Kingdom Building]","fiction_id":"87716","link":"https:\/\/www.royalroad.com\/fiction\/87716\/the-glorious-revolution-isekai-kingdom-building","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","War and Military","Male Lead","Action","Adventure","Fantasy","Strong Lead","Magic","Strategy","GameLit","High Fantasy","Ruling Class"],"lable":"Original","following_count":845,"rating":4.36,"page_count":173,"view_count":46422,"chapters_count":23,"last_update":1718564405,"description":"What happens after a Summoned Hero has done his job and beaten back the Big Bad? \nGoing back home isn't a possibility for Leonard Weiss, and he is perfectly content to live in exile in the furthest little town the Royal Court could send him to. \nBut when they overreach in their fear of his power, Leonard decides he's done playing their game. \nHe's suffered the foul presence of slavery and tyranny for too long. It's time to change things, whether the people in charge want it or not.\nThe Glorious Revolution is an Isekai gone wonky. Leonard isn't like your typical hero, who is all too glad to build a harem of slaves. He accepted the status quo because there was an apocalyptic Incursion waiting to spread across the world, but now that the existential danger has passed, he won't allow injustice to reign.\nTGR has elements of Litrpg (the system is mostly hidden from sight, but very much present) and Progression Fantasy (a military campaign to win and an army to build up)\n\nPosting every day for the first month!","description_hash":3603621711604278607},{"title":"VMMORPG FANTASY ONLINE ","fiction_id":"87715","link":"https:\/\/www.royalroad.com\/fiction\/87715\/vmmorpg-fantasy-online","tags":["LitRPG","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":53,"view_count":439,"chapters_count":10,"last_update":1718544550,"description":"A mysterious pandemic called \"Kleine-Levin Syndrome\" has infected nearly half of the human population, causing terror around the world.\nAs the pandemic worsened, a famous gaming company created a game called \"FOS\" (Fantasy Online System), which successfully lowered the level of fear and depression among everyone around the world.\nOne day, a high school student named Ethan received a mysterious message while playing FOS from someone named Athena.  The message referred to the location of the cure formula to end the pandemic, which was inside of the game. But, it turned out there was a wicked side that was after the formula. Would Ethan manage to find it and end this pandemic?","description_hash":-9146946724660454379},{"title":"Not to be a goblin","fiction_id":"87714","link":"https:\/\/www.royalroad.com\/fiction\/87714\/not-to-be-a-goblin","tags":["Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","Grimdark","Psychological","Action","Fantasy","Horror","Male Lead","Non-Human Lead","Magic","First Contact","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":54,"chapters_count":1,"last_update":1717392196,"description":"Participant in the Royal Road Magazine June 2024 writing contest: Goblins and grandmas.","description_hash":-4430831356584503697},{"title":"A Dormant threat ","fiction_id":"87713","link":"https:\/\/www.royalroad.com\/fiction\/87713\/a-dormant-threat","tags":["Male Lead","Action","Adventure","Fantasy","Short Story","Magic","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":21,"view_count":272,"chapters_count":6,"last_update":1717853968,"description":"“According to legend the world was created by three ancient dragons, each representing a different element of reality. The earth dragon Seb carved the surface with his claws, the Sea dragon Tiamat flooded the craters her brother had created. The air dragon Aether created the winds. Life sprouted in the land crafted by the dragons and soon the world was teeming with creatures of every shape and size. However, Tiamat became furious with her younger brothers for not listening to her warnings. She hatched a plot against all who lived, excluding her brothers, to flood the world with salt water so that she could live in peace with her brothers. Her brothers heard of her plan and cast a spell that rendered them all dormant, so that beings who resided on the lands they had made could thrive. The world and life upon it continued unabated, and soon mankind began to take root.” This is the tale of how our world began. \n Prophecy states that there will come a time when Tiamat would wake from her slumber and attempt to flood the world once more. At that time, a champion of immense power will fight Tiamat and defeat her for all time","description_hash":-2707736303178041796},{"title":"The Last King","fiction_id":"87712","link":"https:\/\/www.royalroad.com\/fiction\/87712\/the-last-king","tags":["Reincarnation","Time Travel","Dungeon","Post Apocalyptic","Male Lead","Action","Adventure","Fantasy","Sci-fi","Low Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":57,"view_count":558,"chapters_count":17,"last_update":1718634633,"description":"When Gates began appearing on Earth, humanity couldn't stop the Creatures coming from the gates, this lead too thousands of millions of deaths and by the year 2029 all big citys and governments have fallen leaving just tiny outposts left to survive, by the year 2054 the first Awakened start to appear they are feared but people also see their potential at stoping the gates but these awakened individuals were also seen as different and shunned from society because common people feared their power, all the while Orion Rivers is trying to survive in the wasteland that was once earth but he lives a double life since he can return to his original life, but he has to choose between them since he doesn't have two souls.","description_hash":1011052167169294303},{"title":"Lunacy's Tale","fiction_id":"87711","link":"https:\/\/www.royalroad.com\/fiction\/87711\/lunacys-tale","tags":["Anti-Hero Lead","Strong Lead","Tragedy","Action","Adventure"],"lable":"Original","following_count":0,"rating":0.0,"page_count":71,"view_count":586,"chapters_count":11,"last_update":1718595778,"description":"In a society bound by laws and order, everything appears ordinary on the surface, but beneath lies a world of madness.\nIn such an environment, one has no choice but to go crazy.\nThis is the story of Noel, a man who not only succumbs to the madness but chooses to embrace his lunacy.\n---------\nOne chapter daily from mon to fri.\nNote: This is the second story of my seven story series. The first one is [Wrath's Ascent].","description_hash":-8820440231162970022},{"title":"Out in Touch","fiction_id":"87709","link":"https:\/\/www.royalroad.com\/fiction\/87709\/out-in-touch","tags":["Progression","Comedy","Multiple Lead Characters","Contemporary","Slice of Life","Drama","School Life","Supernatural","Male Lead","Female Lead"],"lable":"Original","following_count":1,"rating":3.5,"page_count":23,"view_count":90,"chapters_count":3,"last_update":1718549764,"description":"Yoichi has been a social butterfly all his life despite one abnormal adversity: a mutated disease that pushes people away like a forcefield. Imposing a huge risk on everyone around him, he’s forced to rely on the barely-fulfilling world of online socializing.\nThat’s until they discover Verónica’s case. Opposite Yoichi’s, her mutated disease pulls people toward her like a magnet—a nightmare for her safety and introversion. However, this curse might become her only escape from the hellish confines of her adoptive household.\n\n- Sundays at 15:00 UTC.- Calendar available on vidalhernandez.com- Also posted on Scribble Hub, Neovel, Webnovel, and Honeyfeed.- Cover art made with dream.ai and Leonardo.Ai","description_hash":-8529507317079910247},{"title":"My Brother Is Too Strong","fiction_id":"87708","link":"https:\/\/www.royalroad.com\/fiction\/87708\/my-brother-is-too-strong","tags":["Virtual Reality","Comedy","Male Lead","Action","Adventure","Fantasy","LitRPG"],"lable":"Original","following_count":0,"rating":0.0,"page_count":12,"view_count":143,"chapters_count":3,"last_update":1717660867,"description":"It is a story about a young man named Laden, who is now living peacefully, retired from all the things that bothered him from the past, along with his nine years old little sister, Yuna.\nA story that happened a long time ago, unfolding in the present time, unveiling and triggering certain events. A memory of distant past and present converges. A lifetime of peace, so near yet so far away, now arrives after a long time. It is a journey well ended.","description_hash":4938123753105153768},{"title":"Game of Thrones, gaming merchant!","fiction_id":"87707","link":"https:\/\/www.royalroad.com\/fiction\/87707\/game-of-thrones-gaming-merchant","tags":["LitRPG","Harem","Action","Adventure","Fantasy","Romance"],"lable":"Fan Fiction","following_count":2,"rating":0.0,"page_count":10,"view_count":136,"chapters_count":2,"last_update":1717669512,"description":"dude gets yeeted and reborn into the world of Westeros with a boon from the random god like being that sent him to this world in the form of a shop system similar to an anime he watched in the past life.","description_hash":-3613905193670532017},{"title":"THE WISH OF MALICE ","fiction_id":"87706","link":"https:\/\/www.royalroad.com\/fiction\/87706\/the-wish-of-malice","tags":["Psychological","Action","Fantasy","Mystery"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":49,"view_count":227,"chapters_count":6,"last_update":1718360652,"description":"A PART OF SELFISH DESIRE \nMeet Robert, a charismatic individual with a sinister secret. Behind his charming exterior lies a cauldron of malevolent emotions, driven by a singular focus: to protect his family and best friend at any cost. He will stop at nothing to ensure their safety, even if it means destroying the universe.\nAs Robert navigates the world, his cold logic and calculating gaze size up potential threats, hiding a seething hatred beneath his thin-lipped smile. Those who know him whisper about the darkness beneath, but dare not speak out against him, fearing his merciless wrath.\nOnly his best friend, Jarvis, seems immune to Robert's toxic influence, but even he is unaware of the true depths of Robert's depravity. As Robert's malevolent energy grows in power, it's only a matter of time before he unleashes his full fury upon the world, leaving destruction in his wake.\nThe gods themselves will soon tremble at the mention of Robert's name, for he is a force of nature, unstoppable and merciless. In the end, only one thing is certain: Robert will emerge victorious, his loved ones safe, and the universe in ruins.\nGenre: Dark Fantasy, Villainous Protagonist","description_hash":-5641108201134808992},{"title":"Of Tails, Curses and Kings","fiction_id":"87705","link":"https:\/\/www.royalroad.com\/fiction\/87705\/of-tails-curses-and-kings","tags":["Villainous Lead","Comedy","Multiple Lead Characters","Adventure","Fantasy","Romance","Gender Bender","Supernatural","Male Lead","Non-Human Lead","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":10,"rating":5.0,"page_count":65,"view_count":580,"chapters_count":4,"last_update":1718383502,"description":"Emony's been a proud and powerful werewolf all his life, the vicious and paranoid caretaker of his favorite companion, Tiphaine, a lamia forced to carry a legendary curse that turns to stone all that gaze into her eyes.\nWhich is why he was not amused when his other supposed friend, the witch Lenah, turned him into a mermaid. One with a golden tail, a magically squeaky voice and all the wrong kinds of feminine features.\nWhen a teleportation mishap then lands Emony and Tiphaine into the medieval village of Coldbarrow, desperate to free themselves of their afflictions, the two are forced to form uneasy alliances, playing both sides in a conflict between besieged, frightened villagers and an undead monarch hell-bent on raising an army to reunite with the queen he lost so many years ago.\nTheir quest to locate the king's lost love leads them across the kingdom steeped in mystery and danger, but as truths emerge, revelations from the past start to unveil a heart-brekaing choice that could break the two's curses or seal their doom forever.\n\nAuthor's note: I'll be putting up a chapter or two here every week. To everyone blessed with the gift of impatience, you can find the full story here:\nhttps:\/\/www.amazon.com\/Tails-Curses-Kings-Justin-Poli%C4%8Dar\/dp\/961071899X","description_hash":3812980906341219616},{"title":"I Fell In Love With A Beach Lion","fiction_id":"87704","link":"https:\/\/www.royalroad.com\/fiction\/87704\/i-fell-in-love-with-a-beach-lion","tags":["Comedy","Multiple Lead Characters","Slice of Life","Secret Identity","Drama","Fantasy","Romance","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":24,"view_count":340,"chapters_count":10,"last_update":1718499579,"description":"A side story for one of my main series; A pride of Werelions seeks comfort as an intense heatwave rocks their area.","description_hash":-8064817733823774827},{"title":"Today I Die [Oneshot]","fiction_id":"87703","link":"https:\/\/www.royalroad.com\/fiction\/87703\/today-i-die-oneshot","tags":["Psychological","Male Lead","Contemporary","Slice of Life","Drama","Short Story","School Life"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":56,"chapters_count":1,"last_update":1717383641,"description":"Theo, a simple teenager like all others, has the special power to see the day he dies. When that day finally comes, he wants to do one last thing: confess his love, in the hopes that he will be rejected.","description_hash":2035423985127789164},{"title":"Death Rules","fiction_id":"87702","link":"https:\/\/www.royalroad.com\/fiction\/87702\/death-rules","tags":["GameLit","Portal Fantasy \/ Isekai","Urban Fantasy","Grimdark","Multiple Lead Characters","Horror","Mystery","Tragedy","Short Story","Supernatural","Secret Identity","Mythos","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":84,"view_count":232,"chapters_count":7,"last_update":1718400647,"description":"Weird Rules.Mundane, until they soaked in crimson, dictating survival in a game where the stakes are life and death.I used to think of them as mere suggestions, easily bent.That naivety cost me.The rules took a dark turn, becoming harbingers of destruction, their violations answered not with warnings, but with screams and the rending of flesh.Each storyline unfolds like a butcher’s diagram, meticulous and brutal, the consequences of transgression laid bare in visceral detail.Entrails become ornaments, and blood paints the backdrop of my existence—a macabre realm ruled by these sanguine laws.","description_hash":7166832357400206513},{"title":"Vices of the Pages","fiction_id":"87701","link":"https:\/\/www.royalroad.com\/fiction\/87701\/vices-of-the-pages","tags":["Portal Fantasy \/ Isekai","Female Lead","Strong Lead","Fantasy","Historical","Reincarnation"],"lable":"Original","following_count":3,"rating":0.0,"page_count":9,"view_count":154,"chapters_count":3,"last_update":1718258646,"description":"When an avid reader of historical fantasy webtoons, specifically the villainess subgenre, meets their untimely, statistically probable death, they find themself \"isekaid\" into one of the comics they read! Facing the consequences of piracy and incurring divine wrath, they were reincarnated into the most recent one they read, which they had dropped before the second chapter. To thrive in this fast-paced work environment, they must rely on their pattern recognition and critical thinking.","description_hash":4903190015720666472},{"title":"One Star Review","fiction_id":"87699","link":"https:\/\/www.royalroad.com\/fiction\/87699\/one-star-review","tags":["LitRPG","Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","War and Military","Action","Fantasy","Psychological","Mystery","Martial Arts","School Life","Supernatural","Male Lead","Secret Identity","Magic","Strategy","Grimdark","High Fantasy","Villainous Lead","Ruling Class","Dystopia"],"lable":"Original","following_count":2,"rating":0.0,"page_count":50,"view_count":331,"chapters_count":7,"last_update":1718067606,"description":"In a twist of fate, a man finds himself transported to a medieval fantasy world after leaving a one-star review for a popular isekai fantasy novel. However, it takes an unexpected turn when he awakens in the body of one of the story's minor antagonists, a character who meets an untimely death early in the plot.","description_hash":-5703852881488530081},{"title":"Veiled in Arcana","fiction_id":"87698","link":"https:\/\/www.royalroad.com\/fiction\/87698\/veiled-in-arcana","tags":["Adventure","Fantasy","Historical","Mystery","Supernatural","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":17,"chapters_count":1,"last_update":1717383555,"description":"During an age of calm, Percy, a young man who only wants to feel “something” again, winds up being involved in a scheme that brings him into a world of mysteries.As a “Flamechaser”, how will he traverse such mysteries and even enter the gaze of the Gods?","description_hash":156057831794955136},{"title":"Trinity Soul","fiction_id":"87697","link":"https:\/\/www.royalroad.com\/fiction\/87697\/trinity-soul","tags":["Urban Fantasy","Multiple Lead Characters","Slice of Life","Action","Fantasy","School Life","Supernatural","Male Lead","Low Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":54,"view_count":369,"chapters_count":9,"last_update":1717811792,"description":"They will never forget that night. Starting from mere curiosity and mischief, it ironically changed the course of their lives. Dean, Diki, and Joseph, these three friends planned a bravery test at an abandoned mansion to fulfill their desires. However, little did they know, an Entity sent them to a parallel world forcefully. A world where 'Talent' is a real thing. Tasked with the heavy responsibility of saving the Universe, can these trio accomplish it?","description_hash":-4224233089615491800},{"title":"My Evolution System and Fall from Space","fiction_id":"87696","link":"https:\/\/www.royalroad.com\/fiction\/87696\/my-evolution-system-and-fall-from-space","tags":["LitRPG","Progression","Male Lead","Sci-fi","Genetically Engineered ","Technologically Engineered","Hard Sci-fi","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":5,"rating":0.0,"page_count":105,"view_count":1290,"chapters_count":20,"last_update":1717467386,"description":"In the brink of ecological collapse, Grayson Reese awakens on his 18th birthday with a mission that could alter Earth's destiny. Armed with advanced biotech and an evolutionary system bestowed by his genius parents, Grayson is thrust into a world teetering on the edge of ruin. From the biodiverse landscapes of the Galapagos to the vastness of space, his quest spans the creation of new life forms, the cultivation of alliances with the mycelial hive Conn, and the daring confrontations against the ominous Triad. As Grayson navigates the complexities of bioengineering, orbital habitats, and interspecies diplomacy, he uncovers the power of innovation and the weight of responsibility. 'My Evolution System and Fall from Space' unfolds as a tale of survival, unity, and the relentless pursuit of a future where humanity and the planet can once again thrive. Join Grayson in a saga where science and hope collide, leading to a world teeming with possibilities and dangers alike.","description_hash":-7836560655566737904},{"title":"Adamant Blood","fiction_id":"87695","link":"https:\/\/www.royalroad.com\/fiction\/87695\/adamant-blood","tags":["Progression","Post Apocalyptic","Super Heroes","Male Lead","Contemporary","Action","Adventure","Slice of Life","Strong Lead","Magic"],"lable":"Original","following_count":997,"rating":4.67,"page_count":232,"view_count":37010,"chapters_count":22,"last_update":1718631048,"description":"Mark Careed dreamed of being a hero ever since he was 8, or maybe younger. Of fighting monsters outside of the city walls, of going anywhere he wanted instead of just where it was safe, of either killing kaijus himself, or being up there in the thick of it, with the real heroes. He’s almost 18 now, close to taking the real Tutorial and Awakening his Power.\nHis hopes and plans fell through when the False Tutorial estimated his future Power as a brawny. A simply stronger human. This should have come as no surprise. 90% of humans on Earth Awaken as brawnies.\nMark doesn’t want to be a basic brawny. He wants to be something more.\nHe needs to do something big to change his fate.\nSomething drastic.\nSomething like seeking help from an archmage, a true Hero of Humanity. \n\n\nIf you like Ar’Kendrithyst, Super Supportive, or Changeling, you might like Adamant Blood.\n\n\nAdamant Blood is a story of exploration, slice of life, kaijus, magic, other worlds, trauma, superheroes, and growth.","description_hash":-7865841576137810179},{"title":"Crimson Pact","fiction_id":"87693","link":"https:\/\/www.royalroad.com\/fiction\/87693\/crimson-pact","tags":["GameLit","Anti-Hero Lead","Grimdark","Female Lead","Strong Lead","Action","Adventure","Fantasy","Romance","Supernatural","Magic","High Fantasy","Hard Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":17,"view_count":44,"chapters_count":1,"last_update":1717373625,"description":"In the village of Ashenfort, young Elara's tranquil life is shattered when dark magic wielders, the Crimson Circle, massacre her family. Driven by vengeance, Elara spends a decade honing her skills and mastering dark arts, eventually summoning a fallen angel, Azrael, to aid her quest. Together, they uncover the Crimson Circle's operations, dismantling their power while deepening their own bond. Their journey leads them to the Blood Keep, where they thwart a sinister ritual and gain crucial knowledge about the Circle's ultimate plan. As they prepare for the looming threat, their pact strengthens, setting the stage for an epic battle against the forces of darkness.","description_hash":2898808094752502392},{"title":"Dark Genesis","fiction_id":"87692","link":"https:\/\/www.royalroad.com\/fiction\/87692\/dark-genesis","tags":["LitRPG","Reincarnation","Progression","Male Lead","Action","Adventure","Fantasy","Magic","GameLit","High Fantasy","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":29,"view_count":45,"chapters_count":1,"last_update":1717373620,"description":"Summary: In a world where NPC characters are aware of their roles within an RPG, a lowly NPC discovers they are actually the reincarnation of a fallen god. They ally with a dark, enigmatic character who promises power but demands loyalty in the form of forbidden magic that will cause permanent change in the world they currently live in.","description_hash":-2348341342738486768},{"title":"Obscura Online","fiction_id":"87691","link":"https:\/\/www.royalroad.com\/fiction\/87691\/obscura-online","tags":["Virtual Reality","Strategy","Psychological","Female Lead","Strong Lead","Horror","Mystery","LitRPG","Supernatural","GameLit","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":14,"view_count":42,"chapters_count":1,"last_update":1717373615,"description":"Summary:\nDetective Samantha \"Sam\" Kincaid, a renowned but unconventional detective known for her fearless approach and sharp intellect, is called to investigate a series of disappearances linked to a dark web VR game called \"Obscura Online.\" Her investigation leads her into the game itself, where she meets a charismatic game developer, Alex Mercer, who offers his help. However, Sam soon realizes that Alex has his own agenda, and the game is far more sinister than she ever imagined.","description_hash":-8066142007302177223},{"title":"ShadowPlay","fiction_id":"87690","link":"https:\/\/www.royalroad.com\/fiction\/87690\/shadowplay","tags":["Virtual Reality","Urban Fantasy","Anti-Hero Lead","Ruling Class","Grimdark","Action","Adventure","Fantasy","Romance","LitRPG","Female Lead","Strong Lead","Strategy","GameLit","High Fantasy","Steampunk","Technologically Engineered","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":10,"view_count":39,"chapters_count":1,"last_update":1717373585,"description":"Alyssa, a software engineer betrayed in college, dives into \"Shadowplay,\" an underground MMORPG where shadows rule and moral ambiguity thrives. As Nyx, she navigates \"The Gloom,\" a gothic city teeming with secrets, building her reputation through cunning and strategic manipulation. Forming alliances and undermining rivals like Lady Marwen, she catches the attention of The Shadow King, leading to a volatile partnership marked by power and attraction. Their alliance strengthens during a mission for a powerful artifact, but Alyssa's strategic genius is truly tested when The Harbinger resurfaces, threatening their control. After a climactic battle and The Harbinger's defeat, Alyssa and The Shadow King brace for new threats, united and ready to command the shadows and face future challenges in this complex, dark world.","description_hash":426860285587057306},{"title":"The Abyssal Lover","fiction_id":"87689","link":"https:\/\/www.royalroad.com\/fiction\/87689\/the-abyssal-lover","tags":["Virtual Reality","Portal Fantasy \/ Isekai","Anti-Hero Lead","Super Heroes","Grimdark","Action","Adventure","Fantasy","LitRPG","Male Lead","Strong Lead","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":11,"view_count":23,"chapters_count":1,"last_update":1717373578,"description":"Alex, a skilled gamer seeking new challenges, ventures into the Abyss, a perilous area in their game, and makes a pact with a mysterious woman, trading their soul for immense power. Navigating the dark, twisted realm of the Abyss, Alex battles powerful entities and other players, becoming known as \"The Void-Walker.\" They form alliances, including one with a powerful abyssal entity, and confront the game's enforcers to maintain balance. As Alex’s legend grows, they explore \"The Underworld,\" a new, equally dangerous game, while striving to keep their newfound power in check and ensure the Abyss does not threaten the game's stability. Through trials and tribulations, Alex emerges as a revered and feared figure, balancing their dark powers with a commitment to maintaining the game’s integrity.","description_hash":2446466120711044610},{"title":"The Cursed Hero","fiction_id":"87688","link":"https:\/\/www.royalroad.com\/fiction\/87688\/the-cursed-hero","tags":["Virtual Reality","Male Lead","Strong Lead","Action","Adventure","Fantasy","LitRPG","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":10,"view_count":26,"chapters_count":1,"last_update":1717373573,"description":"### Summary of the Plot\n#### Protagonist's Introduction to \"The Cursed Hero\"The protagonist, immersed in a mundane life, hears about a new dark fantasy MMORPG called \"The Cursed Hero\" that syncs with players' emotions to create an unparalleled immersive experience. Intrigued, they enter the game using a VR headset, creating a half-elf rogue named Eryndor Thorne.\n#### Entering the Game WorldUpon entering the game, the protagonist, now Eryndor, finds themselves on a bridge between dimensions, leading to a sprawling, eerie city blending ancient and modern architecture. Eryndor navigates the city, feeling the game's intense realism as they encounter remnants of a once-thriving civilization.\n#### Forming AlliancesEryndor joins a group of diverse players, forming bonds as they journey through the dangerous game world. They face numerous challenges, battling beasts and navigating traps, strengthening their friendships and growing as a team.\n#### Encountering SeraphinaWhile exploring, Eryndor meets Seraphina, a mysterious figure who offers to guide them through the game’s complexities. She reveals the game's ability to manipulate emotions and promises to teach Eryndor how to control these forces.\n#### The Grimoire of ShadowsSeraphina leads Eryndor to an ancient ruin containing the Grimoire of Shadows, an ancient tome filled with powerful knowledge. Eryndor studies the book, gaining the ability to manipulate the game's energies, significantly enhancing their powers.\n#### Facing the GuardianIn the deepest chamber of the ruins, Eryndor and Seraphina encounter a Guardian who challenges Eryndor to confront their deepest fears to prove their worth. Eryndor overcomes terrifying visions and earns the right to command the Heart of the World, a powerful artifact capable of reshaping reality.\n#### The Cost of PowerEryndor defeats the Guardian, but the Guardian warns that wielding the Heart’s power requires a significant sacrifice. As the ruins collapse, Eryndor and their companions narrowly escape, burdened by the Guardian's ominous message.\n#### Preparing for the UnknownOutside the ruins, Eryndor and Seraphina realize they must uncover the nature of the required sacrifice and prepare for future challenges. Determined to master the power of the Heart and navigate the dangerous world of \"The Cursed Hero,\" they set off, ready to face whatever lies ahead.\n### Thought-Provoking Questions1. How do you think Eryndor's newfound powers will affect their relationships with their companions?2. What could the required sacrifice entail, and how might it impact Eryndor's journey?3. How does the manipulation of emotions in the game reflect the protagonist's real-life struggles and desires?4. What ethical dilemmas might arise from wielding such immense power in a game that feels so real?","description_hash":2934982158504795966},{"title":"Post-Apocalypse with My Cats","fiction_id":"87687","link":"https:\/\/www.royalroad.com\/fiction\/87687\/post-apocalypse-with-my-cats","tags":["Urban Fantasy","Post Apocalyptic","Female Lead","Adventure"],"lable":"Original","following_count":1,"rating":4.5,"page_count":22,"view_count":289,"chapters_count":4,"last_update":1717403718,"description":"One day, the world broke, and humanity lost its precious modern civilization. On top of that, zombies and other monsters start to roam the planet and eat the remaining survivors. Nerdy girl Tamita has to survive in this new world, but luckily, she is accompanied by her two overpowered cats! This is a light-hearted story of their journey through a world wrecked with ruins, anomalies, and monsters.","description_hash":7389851840039930321},{"title":"Seastone","fiction_id":"87686","link":"https:\/\/www.royalroad.com\/fiction\/87686\/seastone","tags":["Urban Fantasy","Female Lead","Slice of Life","Secret Identity","Action","Adventure","Fantasy","Romance","Gender Bender","Supernatural","Magic","Low Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":12,"view_count":252,"chapters_count":2,"last_update":1717385641,"description":"Sammy lives a life of intrigue, danger, and excitement as a grocery store cashier. His life is suddenly flipped upside down when he steals from his best friends store, landing in a world he had no idea existed. Now dealing with new powers, new people, and a new body, can Sammy adapt to his life's changes while also juggling romance?","description_hash":8641760495005128692},{"title":"Blue Moon Sky Crystal","fiction_id":"87684","link":"https:\/\/www.royalroad.com\/fiction\/87684\/blue-moon-sky-crystal","tags":["Time Loop","Urban Fantasy","Female Lead","Sci-fi","Adventure","Fantasy","Mystery","Magic","Mythos","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":17,"chapters_count":1,"last_update":1717373237,"description":"Zombie virus outbreak, all human settlements were destroyed, leaving only Yadi, the alien life of three hundred years, unexpectedly found herself free from zombie attacks, in an accident, gradually discovered his secret and the cause of the zombie rampage","description_hash":-1643482332650602654},{"title":"The last Feather","fiction_id":"87683","link":"https:\/\/www.royalroad.com\/fiction\/87683\/the-last-feather","tags":["Urban Fantasy","Female Lead","Fantasy","Short Story","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":5,"view_count":20,"chapters_count":1,"last_update":1717373233,"description":"A short Story about a fire, a girl, an angel and her last feather …","description_hash":-3628598231262027592},{"title":"Truces of Magick","fiction_id":"87682","link":"https:\/\/www.royalroad.com\/fiction\/87682\/truces-of-magick","tags":["Male Lead","Action","Adventure","Fantasy","Romance","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":33,"view_count":44,"chapters_count":1,"last_update":1717373230,"description":"In a world where magick is a godlike art, our protagonist has been self taught in his small home in the borderlands of the strongest empire in the world, Endelgrad. It is not long before these magical prodigies are found by the empire and soon assimilated into their ranks. How much is Zocar willing to sacrifice and what is he willing to do to ensure his families safety and also his own personal well-being? Follow the story of a legend in the making and a caster in training through his heroic tale.","description_hash":-2562201984571332122},{"title":"Nindō: Dominion","fiction_id":"87681","link":"https:\/\/www.royalroad.com\/fiction\/87681\/nindo-dominion","tags":["Time Travel","Progression","Ruling Class","Male Lead","Slice of Life","Action","Fantasy","Romance","Harem","Supernatural","Strong Lead"],"lable":"Fan Fiction","following_count":4,"rating":0.0,"page_count":101,"view_count":1181,"chapters_count":16,"last_update":1718562604,"description":"When talking in infinites, unlikely is just certainty waiting its turn. In a paradoxical dimension where space and time are non-existent, infinite possibilities are right around the corner.... including going back in time to fix everything.","description_hash":-6863875554512287576},{"title":"The Scarlet Lord","fiction_id":"87680","link":"https:\/\/www.royalroad.com\/fiction\/87680\/the-scarlet-lord","tags":["Portal Fantasy \/ Isekai","Grimdark","Psychological","Female Lead","Contemporary","Fantasy","Horror","Supernatural","Magic","Mythos"],"lable":"Original","following_count":0,"rating":0.0,"page_count":4,"view_count":32,"chapters_count":1,"last_update":1717373199,"description":"Amanda had never expected to amount to much. She always had struggled with ADHD, and worse yet, she was an opioid addict. She truly believed things couldn’t get worse for her, until her worst nightmares came true. She finds herself entered and trapped in a strange nightmare realm, where the world was topsy-turvy, the sky an emerald green, and the local denizens and beings deadly. She has to race against the clock to find her way out and escape the deadly trials in her path. All the while, she must maintain her dependancy in a world working against her, or fall prey to opioid withdrawal, and then likely die. Can she truly survive against all odds? Statistics say, “It is unlikely.”","description_hash":-921199301066644704},{"title":"Dead or Alive: A Bounty Hunter Tale (LitRPG)","fiction_id":"87679","link":"https:\/\/www.royalroad.com\/fiction\/87679\/dead-or-alive-a-bounty-hunter-tale-litrpg","tags":["LitRPG","Portal Fantasy \/ Isekai","Male Lead","Action","Adventure","Fantasy","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":6,"rating":4.5,"page_count":50,"view_count":755,"chapters_count":10,"last_update":1717372765,"description":"Bounty Hunters were born with the fall of House Beser and the anarchy that followed in the lands of Beseria. Respected and feared by all who encounter them, a Bounty Hunter is a mercenary with a hint of an assassin thrown in for good measure when the job calls for it. Bounty Hunters deal in people, but not just any people. As their name suggests, they are only interested in those who have a bounty on their head. People need them, but also fear them. The cold-blooded nature of their profession can inspire fear because they have no moral code and only serve the bounty. A bounty hunter is rarely a welcome guest, and contact with members of this profession is almost always limited to business. There is no standard of training required, and their only oath is to deliver the bounty. But in the lands of Beseria, they are also the only source of justice some people can get against their more dangerous enemies. They are also the only organization in the lands that maintains a neutral stance and is afforded some protection from foreign armies, mercenaries, and the remnants of the Beserian army. This is because Bounty Hunters will work for anyone, and to destroy a bureau of theirs is to risk the wrath of a motley assortment of murderous hobos and professional assassins.Taken from his world for reasons unknown, bounty hunter Jaeger is left adrift in a world almost entirely different from his own. With the introduction of mystical people, magical abilities and monsters, he feels out of his depth. But one thing doesn't change: people still need his services, because no matter where you are or what magical means you have at your disposal, a bounty hunter is always needed.Releases every two weeks on Friday.","description_hash":493611369248489554},{"title":"Noblesse Oblige","fiction_id":"87678","link":"https:\/\/www.royalroad.com\/fiction\/87678\/noblesse-oblige","tags":["LitRPG","Progression","Strategy","Action","Adventure","Fantasy","Magic","GameLit","High Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":10,"view_count":77,"chapters_count":1,"last_update":1717370431,"description":"This story follows the child of a noble family in a fantasy world with LitRPG\/GameLit elements. He attempts to right the wrongs that he feels the world has wrought, and re-assert justice. This is NOT a fairytale, good guy wins novel. It is a novel about a young man in a fantasy world that happens to be infused with LitRPG. Not a disney movie.  \nExpect - Real characters, decisions, morals, emotions, pacing, fights, scenarios, plot developments, motivations, etc. This book (while clearly not real because LitRPG isn't real) will stick to reality as much as possible.- Updates that will be as regular as possible considering the author does have a day occupation, and not a lot of time available. - A plot that is enrapturing, characters that make sense, and emotions that the character feel that are tangible to the reader.","description_hash":-769762810836355569},{"title":"A Benevolent Evil Dragon","fiction_id":"87677","link":"https:\/\/www.royalroad.com\/fiction\/87677\/a-benevolent-evil-dragon","tags":["Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","Non-Human Lead","Strong Lead","Action","Adventure","Fantasy","Reincarnation","Male Lead","Magic","High Fantasy"],"lable":"Original","following_count":43,"rating":4.93,"page_count":81,"view_count":1716,"chapters_count":8,"last_update":1718588191,"description":"A young software engineer whose life was plagued by misfortune, mental and physical health problems as well as a whole cocktail of other issues very much outside of his control, finds himself contemplating life while going through his gruesome death, which, strangely enough, he did not even cause! Imagine contemplating it for so long only to end being run over by a drunk driver. Funny how life works. Regardless, that untimely death results in the usually forgetful man remembering everything! And what's more, retaining that perfect memory of his 28 years of life! Of course that would be all so useless if not for the fact that he manages to wake up, now finding himself as a newborn dragon of all things! From a powerless speck of dust in an uncaring society, in a cruel world, he now finds himself as an absurdly knowledgeable and powerful being, finally able to have a life he wants to live!Yet all is not good... for he is but a whelp in a confusing world with confusing rules and powers, a world no better than his old one, that no amount of fantasy books could truly prepare him for. And there's always the question: Is he a human reborn as a dragon? Or a dragon who remembers once being human. A new body, a new blend of instincts and thought, nature and nurture, a chaos that gets to decide who and what he will end up being. \n\nSo in more simple terms this is going to be a progression fantasy of a human turned dragon using the absurd amount of knowledge (a lot of it being trivia) that he acquired coupled with the physical and magical talents natural to his draconic body in order to make a good life for himself and eventually others, while struggling with his identity and his continuously changing mentality.This story will start slow and focus quite a bit on that mental aspect and how a new body can threaten to alter his morals. There will be introspection, a lot of inner monologues, experimentation, world building and most importantly: growth of all kinds! Oh, also, no MC ain't getting human transformation any time soon or maybe at all. This is a dragon story and by God it will have dragons in it!","description_hash":-5078435816891197496},{"title":"Tonight, a hurricane.","fiction_id":"87676","link":"https:\/\/www.royalroad.com\/fiction\/87676\/tonight-a-hurricane","tags":["Anti-Hero Lead","Steampunk","Female Lead","Sci-fi","Action","Mystery","Short Story","Cyberpunk","Soft Sci-fi","Dystopia"],"lable":"Original","following_count":4,"rating":5.0,"page_count":4,"view_count":36,"chapters_count":1,"last_update":1717364155,"description":"Rachel, a former police officer now making a living as a private detective in the remnants of what was once the world's most important city, the old New York, started her night like any other. However, while chasing a small-time extortionist, she discovered a secret that could turn the city upside down. Tonight's rain could turn into a hurricane.\nA black novel in cyberpunk style an setting, no mistery is small enough for Rachel, but this one, might be even personal.","description_hash":-5032069228017564000},{"title":"Armed","fiction_id":"87675","link":"https:\/\/www.royalroad.com\/fiction\/87675\/armed","tags":["Adventure","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":22,"view_count":179,"chapters_count":3,"last_update":1717481283,"description":"In a world of twelve shades of light and darkness, the hierarchical system is strict, and the upper limit of each person's life has long been predetermined. The higher the rank, the longer they can live. Only by killing the undead tribe and elevating their rank to obtain the life scale can they truly achieve immortality. Having a resilient personality and outstanding talent, but born at the bottom of the world and unable to even touch martial arts skills, he suddenly received a relic and will from a deceased person.","description_hash":-2057508851347578176},{"title":"Fae & Fire ~ A Ghosts of Grimwood tale","fiction_id":"87674","link":"https:\/\/www.royalroad.com\/fiction\/87674\/fae-fire-a-ghosts-of-grimwood-tale","tags":["Male Lead","Action","Fantasy","Horror","Short Story","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":33,"chapters_count":1,"last_update":1717364135,"description":"As a boy of seven, Prince Ethan dreams of heroes and fiends. However, when he is woken by war bells in the dead of night, he comes face to face with terrors beyond the darkest tales.\nIn his efforts to keep his family safe from the haunting thrall of rising ghosts, he is faced with impossible choices that threaten to doom those he loves most.\n\nThe Ghosts of Grimwood series is a collection of stand-alone dark fantasy novelettes expanding upon the spectral mysteries and ethereal threats of the Edenwood Cosmos. These tales are perfect for those who crave a hint of horror, chilling lore, and worlds of beautiful magics.\n\nThis tale and others are available as both eBook and paperback for those who prefer those formats.\n\nMore tales in the Edenwood Cosmos available on my website: brightwitch.com","description_hash":-4477532865906865988},{"title":"Ghost Lights ~ A Ghosts of Grimwood tale","fiction_id":"87673","link":"https:\/\/www.royalroad.com\/fiction\/87673\/ghost-lights-a-ghosts-of-grimwood-tale","tags":["Female Lead","Drama","Fantasy","Horror","Short Story","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":38,"view_count":227,"chapters_count":7,"last_update":1717812001,"description":"Claudia’s sister, Francine, is the rising star of Alchemy, determined to achieve the impossible.\nAs Claudia prepares to choose her own path as a Grimwood acolyte, she is terrified her destiny will never measure up.\nA choice made in haste will haunt her beyond death.\nAs Claudia journeys through realms of myth, struggling to hold onto the most precious fragments of herself, her sacrifices may be the key to a miracle of magic.\n\nThe Ghosts of Grimwood series is a collection of stand-alone dark fantasy novelettes expanding upon the spectral mysteries and ethereal threats of the Edenwood Cosmos. These tales are perfect for those who crave a hint of horror, chilling lore, and worlds of beautiful magics.\n\nThis tale and others are available as both eBook and paperback for those who prefer those formats.\n\nMore tales in the Edenwood Cosmos available on my website: brightwitch.com","description_hash":-7392280123777183413},{"title":"The Wars","fiction_id":"87672","link":"https:\/\/www.royalroad.com\/fiction\/87672\/the-wars","tags":["Post Apocalyptic","Psychological","Sci-fi","Drama","Satire","Technologically Engineered","First Contact","Artificial Intelligence"],"lable":"Original","following_count":2,"rating":5.0,"page_count":68,"view_count":221,"chapters_count":4,"last_update":1717533122,"description":"When the world ended, it came in the form of an Ecophage--colossal clouds of self-replicating nanomachines, created by some ancient alien race, long extinct. The Ecophage first targeted all biomass, disintegrating people in the streets, consuming forests and animals in order to convert their raw materials into more nanite swarms.\nJeremy Braxton and a handful of survivors find sanctuary in a billionaire's retreat: limestone caves that go deep underground, and are fully stocked. But with society destroyed, all human history and knowledge is lost...except for Jeremy's DVD player, and a copy of the Star Wars trilogy. This novella will take readers through a hypothetical world-ending scenario of SRPs (self-replicating probes), diving into the minds of characters who realize everything we took for granted is absolutely gone, and explore what happens when something that was once \"just a good fantasy story\" becomes the sole campfire story being told to the human remnants...and what happens if a primitive people start to believe the stories of Luke, Leia, Darth Vader, and the Death Star are real.\nThis story is inspired by the Toba Event, a real volcanic event that took place about 74,000 years ago, during the Late Pleistocene, and nearly wiped out all of humanity, leaving only 2,000-3,000 humans alive on Earth. My question was, \"What if that happened today?\" This story is a possible answer.","description_hash":-3958336827021520066},{"title":"Who am i","fiction_id":"87671","link":"https:\/\/www.royalroad.com\/fiction\/87671\/who-am-i","tags":["Multiple Lead Characters","Sci-fi","Fantasy","Short Story","Hard Sci-fi"],"lable":"Original","following_count":0,"rating":5.0,"page_count":1,"view_count":25,"chapters_count":1,"last_update":1717363571,"description":"Amodora is a normal girl who lives on a moon that encircles the planet zexade. It seems like a normal day, but this one day spirals her into other worlds, and the life of a princess that she never wanted.","description_hash":-4345575828843270769},{"title":"Echoes of the kitsune First Arc: The Academy ","fiction_id":"87670","link":"https:\/\/www.royalroad.com\/fiction\/87670\/echoes-of-the-kitsune-first-arc-the-academy","tags":["GameLit","Reincarnation","Urban Fantasy","Progression","War and Military","Action","Adventure","Fantasy","Romance","Martial Arts","Reader Interactive","School Life","Female Lead","Magic","High Fantasy","Mythos","Ruling Class","Attractive Lead"],"lable":"Original","following_count":4,"rating":5.0,"page_count":33,"view_count":584,"chapters_count":8,"last_update":1717887628,"description":"\"you are dead\" says the god of original story's Bragi. \"and for your sins you will be reincarnated into your own plagiarized novel, try to entertain us.\"\nthis is my first novel, feedback is appreciated and so is comments, i will try to reply to every one, regardless of it is constructive or not\n\nIm also on scribble hub and webnovel.","description_hash":7149339444050848422},{"title":"Shadows Unveiled: Echoes of Memes Past","fiction_id":"87669","link":"https:\/\/www.royalroad.com\/fiction\/87669\/shadows-unveiled-echoes-of-memes-past","tags":["Progression","Strategy","Grimdark","Psychological","Multiple Lead Characters","Drama","Tragedy","Harem","School Life","Female Lead","Secret Identity","First Contact","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":28,"view_count":94,"chapters_count":4,"last_update":1718102619,"description":"Meme, a seasoned child therapist, has dedicated her career to nurturing and healing children facing adversities in various aspects of their lives. Her steadfast resolve has never wavered, until she accepts a position at Maple-Pine Middle School-a fateful decision that unlocks a Pandora's box of long-buried memories from her tumultuous past.\nAs Meme grapples with the ghosts of her own childhood, she is thrust into the turbulent life of Unique, a seventh-grader ensnared in a nightmarish existence of abuse and unrelenting bullying. In a race against time, Meme must confront her personal demons while striving to rescue Unique from a dire living situation and the relentless torment of her peers.\nIn a poignant narrative of resilience and redemption, \"Shadows Unveiled: Echoes of Meme's Past\" unravels Meme's tumultuous journey as she confronts her inner demons while striving to save Unique from the horrors of her reality. Can Meme break free from the echoes of her past and empower Unique to overcome her struggles, or will the weight of history threaten to consume them both? Join Meme on a transformative odyssey where the bonds of empathy and healing transcend the barriers of time and trauma.","description_hash":6802304721700487985},{"title":"Aria-Cherishment","fiction_id":"87668","link":"https:\/\/www.royalroad.com\/fiction\/87668\/aria-cherishment","tags":["Progression","Multiple Lead Characters","Sci-fi","Action","Fantasy","Mystery","Female Lead","Magic","Low Fantasy","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":76,"view_count":68,"chapters_count":2,"last_update":1717400140,"description":"Lacia Amana: cute, smart, and loves her best friend more than anyone. She attends school just like most other normal 19-20 year old girls, but after stumbling into a mysterious boy, she soon learns that not everything is as it seems.However, she also harbors a secret that will upend everything she thought she once knew. Thrust into the chaos and disarray that has become her world, Lacia must discover what it is she believes in and what it is she knows is right. Even if it costs her everything.As her world steadily devolves into chaos, she's forced to leave behind the life she once had. For better or for worse, Lacia becomes the catalyst for something only ever heard of in ancient myths.Where this new road takes her is anyone's guess but hers.","description_hash":7952702084537058817},{"title":"The Fall of Astraea","fiction_id":"87667","link":"https:\/\/www.royalroad.com\/fiction\/87667\/the-fall-of-astraea","tags":["Ruling Class","Multiple Lead Characters","Action","Adventure","Fantasy","Romance","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":17,"view_count":190,"chapters_count":5,"last_update":1717527555,"description":"Love. War. Death. Royals.\n\nThis story has it all and then some as Jack, newborn werewolf, integrates himself into the Monsters' Army. Meanwhile, \"Prince Viktor\" plots to overthrow the king and turn Astraea into a female supremacy.\n\nPic by Payton Tuttle on Unsplash: https:\/\/unsplash.com\/photos\/a-skull-with-a-crown-on-top-of-it-hVpFBq-PSgQ\n\nAlso on ScribbleHub, proof of ownership here: https:\/\/www.scribblehub.com\/profile\/164383\/cheekycryptid\/","description_hash":-9179271333191154892},{"title":"An entirely fictitious work of events","fiction_id":"87666","link":"https:\/\/www.royalroad.com\/fiction\/87666\/an-entirely-fictitious-work-of-events","tags":["Time Travel","Progression","Anti-Hero Lead","War and Military","Martial Arts","Adventure","Drama","Fantasy","Mystery","Male Lead","Strong Lead","Multiple Lead Characters","Secret Identity","Magic","High Fantasy","Mythos","Dystopia","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":7,"view_count":23,"chapters_count":1,"last_update":1717363457,"description":"Our protagonist has opted out. He'd decided he's had enough, and yet, a small bright light shining, a type of music, a lullaby of words, a tease into something new, a salivating temptation that might belonged to the angels or the damned and with that singular event our man jumps in a different form of fashion, into a world unknown to all but the muse that tells this tale.","description_hash":-2515380107645749810},{"title":"An Inheritance of Fire","fiction_id":"87665","link":"https:\/\/www.royalroad.com\/fiction\/87665\/an-inheritance-of-fire","tags":["Progression","Grimdark","Multiple Lead Characters","Action","Adventure","Fantasy","Romance","Magic","High Fantasy"],"lable":"Original","following_count":10,"rating":4.75,"page_count":110,"view_count":663,"chapters_count":16,"last_update":1718566836,"description":"Echoes of war still sound across the shadowy realm of Idria. Their lingering fervor causes an uneasy peace; while the elves grow their forest, the humans develop their technology. The dwarves, for their part, hide themselves in their mountain forges, eyes for naught but their craft. Regardless of their many differences, they all share in one thing: the constant struggle against the dark tides that push at their borders. \nOnly the hollows, a magicless race, live scattered against the shadows that shroud much of the land. They restlessly stalk the monsters that roam the essence-rich region and emerge only to sell the spoils of their endless hunt. \nDespite the perils of such a life, Selerim is content to follow in his father’s footsteps. But when, following a coming-of-age ceremony, his sister’s illness forces him from the secluded village that he calls home, he finds himself entangled in events that promise to shape the course of history.\nWhat to expect: \n*Grimdark: while there will be moments of warmth and tenderness, the setting and tone will remain in line with what one should expect from a grimdark story. This is not an isekai or a LitRPG.\n*Slow progression: characters growing stronger is both a plot point and a focus, but it will take time for them to grow comfortable with their individual powersets. Different characters will follow differernt routes to power. \n*Character-driven story: while there are occasional sporadic events, for the most part, the plot is advanced by the characters and their actions. Each will have their own motivations that (I hope) make sense. This includes the overarching antagonist(s). \n*Different POVs: there will be different “POVs.” In quotations because the story is written in third person. Many will return, but some will be once-offs. \nLastly, please heed the violence and content warnings. There won’t be any outright murderhobos or murderhobo-ing (that’s a word, right?), but there will be violence, and some of it will be both gruesome and graphic. In the same vein, darker topics will be present, but never the focus. \nI hope you enjoy. Updates daily.","description_hash":-697762162427297929},{"title":" ISSTH Fanfic - A Chance Encounter! (award winning short story)","fiction_id":"87664","link":"https:\/\/www.royalroad.com\/fiction\/87664\/issth-fanfic-a-chance-encounter-award-winning","tags":["Xianxia","Strong Lead","Action","Adventure","Short Story","Wuxia"],"lable":"Fan Fiction","following_count":13,"rating":5.0,"page_count":22,"view_count":541,"chapters_count":8,"last_update":1717341525,"description":"*Please read the author foreword for context about this story*A tale of Meng Hao This fan fic takes place around I Shall Seal the Heavens - Book 2 - Chapter 96, when Meng Hao was beginning his journey to the Southern Domain. Come along for a story of how Meng Hao's offhand actions could deeply affect the lives of people he came in contact with. Meng Hao will visit a village on a whim but gets more than he bargained for! Join Meng Hao as he takes a light step into the mortal world again out of nostalgia! Disclaimer: This is an ISSTH Fan Fiction Story. I do not own ISSTH or any related products.","description_hash":5273682968384686646},{"title":"Souls Online: Summoner's Saga LitRPG","fiction_id":"87663","link":"https:\/\/www.royalroad.com\/fiction\/87663\/souls-online-summoners-saga-litrpg","tags":["LitRPG","Slice of Life","Action","Adventure","Fantasy","Magic"],"lable":"Original","following_count":7,"rating":4.25,"page_count":88,"view_count":1087,"chapters_count":9,"last_update":1718532003,"description":"In Souls Online, Leon, an autistic man, is unexpectedly transmigrated into a novel he once read. With his sister Rose being the lead of the novel! Join him as he plays the biggest VRMMORPG in the world as Leon discovers his talent for forming bonds with creatures. As he faces challenges and delves into dungeons and hopefully catches up to his sister's cheat-like skills!\n\nWhat to expectThe story focuses on Leon's viewpoint as he struggles with his autism and the unique experiences that come with it.During Leon's gameplay, the story focuses more on action, intrigue and worldbuilding and during his time outside the game I try to go for a more of a slice-of-life approach.There will also be bonding moments for Leon and his familiars along with the ever-growing scaling that comes with a LitRPG, yes there are stats. I'll try not to throw them in too much.\n\nDisclaimersThe novel starts slow due to the worldbuilding of Leon's new reality but after he enters the game it will start to speed up more.Updates three times a week with Tuesdays, Thursdays and Sundays as the upload days. Each chapter is 2.5k - 3k words.Inspired by novels like: Reincarnation of the Strongest Sword God and Rebirth of the Thief Who Roamed The World.This novel was spell-checked with Grammarly as I'm not a native English speaker. The cover was made with AI.","description_hash":5011661751192314065},{"title":"Noble Rebirth: Ends Dawn","fiction_id":"87662","link":"https:\/\/www.royalroad.com\/fiction\/87662\/noble-rebirth-ends-dawn","tags":["Reincarnation","Male Lead","Fantasy","Horror","Magic","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":65,"view_count":548,"chapters_count":11,"last_update":1717505008,"description":"After dying a death I considered pathetic, but still having lived a life without regrets, I didn't know that my existence wouldn't end that way.\nI didn't know that soon I would awaken in the void, only to reincarnate in another world.\nThis is the story of Schadet Oporitorco, who will do anything for power after witnessing it.\n(This novel was inspired by several other novels)","description_hash":-5856905085846910061},{"title":"Timebound Destiny","fiction_id":"87661","link":"https:\/\/www.royalroad.com\/fiction\/87661\/timebound-destiny","tags":["LitRPG","Time Travel","Dungeon","Anti-Hero Lead","Xianxia","Action","Adventure","Fantasy","Romance","Martial Arts","Slice of Life","School Life","Male Lead","High Fantasy","First Contact","Attractive Lead"],"lable":"Original","following_count":7,"rating":4.92,"page_count":74,"view_count":592,"chapters_count":7,"last_update":1718285471,"description":"Under the Heavenly Emperor’s nose, Leo succeeds in performing a ritual from a joke-of-a-book to go back in time.\n\nHowever, the Heavenly Emperor had been watching him all along. He did not believe the ritual would work, and this was a major miscalculation!\n\nNot only did the ritual work with Leo going back in time, but the whole timeline itself was flipped!\n\nThe reversal led to the universe repeating the events again from a set point. The future people who hadn’t been born yet disappeared, but the ones already present regressed along with Leo and the Heavenly Emperor.\n\nWith so many regressors acting as variables, will Leo be able to succeed in achieving his goals? Will the butterfly effect that would take place be too strong or will the variables be kept in check? What would the fate of the world be under such circumstances?\n\nJourney along Leo in a world of steam machinery, magic, cultivation, oriental elements, and added modern touch where potions are a way to breakthrough and unique to each individual!\n\nFrom dungeons to celestial realms, potions to martial arts, victorian era to modern cultivation; the world has it all!\n.....\nA\/N: What to expect?\n— Slice of life. Lots and lots of slice of life.\n— A never-before-seen blend of Victorian\/Steampunk + modern + Xianxia fantasy!\n— Unique cultivation paths for all!\n— System for all!\n— Multiple Regressors!\n— No Harem, No smut!\n— A power couple!\n— Good paced romance!\n— A new take on world hopping (the world hops, not the protag :D. If you don't understand it now, you will in due time!)","description_hash":7269499677897823602},{"title":"A new savage Beginning","fiction_id":"87660","link":"https:\/\/www.royalroad.com\/fiction\/87660\/a-new-savage-beginning","tags":["LitRPG","Portal Fantasy \/ Isekai","Anti-Hero Lead","Grimdark","Drama","Action","Adventure","Fantasy"],"lable":"Original","following_count":9,"rating":2.88,"page_count":244,"view_count":3413,"chapters_count":32,"last_update":1718550285,"description":"warning: the main lead will ruffle feathers he’s a very old school type of guy. At the beginning of the story he will be broken, full of venom, lash out without a filter in a world where saying the wrong think could get you killed. He doesn’t care how much he insults or offends people, if he feels like it he will.\nyou have been warned. You will disagree with him.\nA man after a long life filled with hardships ends up dying due to heart failure. The constant stress, being a dad, failing marriage, and the fact he was (he strongly suspects) suffering from random side effects from a booster Shot. (like how unlucky did this guy get?). He croaks. The powers that be decide this is BS and this man deserves a second chance and is offered the option to be reborn by both the goddess of love and the god of war. But there is a third uninvited god. The god of strife who loved his old life’s misery, and is determined to put this man’s new life to good use.","description_hash":3221874724915180448},{"title":"JJK: Endlessly Leveling with Cursed Energy","fiction_id":"87658","link":"https:\/\/www.royalroad.com\/fiction\/87658\/jjk-endlessly-leveling-with-cursed-energy","tags":["LitRPG","Portal Fantasy \/ Isekai","Dungeon","Male Lead","Sci-fi","Action","Fantasy","Horror","Harem","Soft Sci-fi","Attractive Lead"],"lable":"Fan Fiction","following_count":10,"rating":4.5,"page_count":106,"view_count":1203,"chapters_count":13,"last_update":1718219225,"description":"Meet Jamal, an ordinary teenager who is given the opportunity to become a Jujutsu Sorcerer with the potential for endless evolution in cursed techniques. His initiation into sorcery involves surviving a harrowing ordeal in a literal Dungeon of Curses, an experience orchestrated by Satoru Gojo, who sees it as an opportunity to impart crucial lessons to Jamal about the basics of being a sorcerer.Throughout the trial, Satoru assigns Jamal a singular mission: to master the art of delivering the 'Perfect Punch' - a technique potent enough to exorcise the Boss of the Dungeon. As Jamal navigates the challenges of the dungeon and learns under Satoru's guidance, he begins to understand the weight of being a Jujutsu Sorcerer while facing all curses related to World Hunger.\n\nStarts with JJK Universe","description_hash":1927305073431246021},{"title":"Particles of Paradise ","fiction_id":"87657","link":"https:\/\/www.royalroad.com\/fiction\/87657\/particles-of-paradise","tags":["Comedy","Multiple Lead Characters","Action","Adventure","Fantasy","School Life","Supernatural","High Fantasy","Mythos"],"lable":"Original","following_count":3,"rating":4.5,"page_count":49,"view_count":209,"chapters_count":6,"last_update":1718616601,"description":"Yuki's life takes an unexpected turn when the enigmatic Naomi Sasaki enters his life. Naomi unveils the existence of Avalon, a mystical dimension housing the renowned Avalon Academy of Magic. She reveals that Yuki is somehow connected to this world, though the details remain unclear.\nDespite his initial disbelief, Yuki finds himself drawn into Naomi's world. He soon learns that Naomi's life is not what it seems and that she has her own secrets. As they grow closer, Yuki grapples with his newfound abilities and the mysteries surrounding Avalon.\nParticles of Paradise is a coming-of-age story that blends action, adventure, and fantasy. It follows Yuki's journey as he discovers a hidden world, grapples with his newfound abilities, and uncovers the secrets of his connection to Avalon. The story explores themes of friendship, self-discovery, and destiny, with a touch of mystery and intrigue.","description_hash":-5991824138186585946},{"title":"The last warrior of light","fiction_id":"87656","link":"https:\/\/www.royalroad.com\/fiction\/87656\/the-last-warrior-of-light","tags":["Post Apocalyptic","Male Lead","Action","Adventure","Fantasy","Short Story","Attractive Lead"],"lable":"Fan Fiction","following_count":0,"rating":4.75,"page_count":12,"view_count":235,"chapters_count":4,"last_update":1718478156,"description":"A story describing a hero of an apocalypse. Bunio sets on his journey to the main HOB laboratory to find answers to his neverending questions.","description_hash":3190085715533594180},{"title":"Rusters","fiction_id":"87655","link":"https:\/\/www.royalroad.com\/fiction\/87655\/rusters","tags":["Reincarnation","Dungeon","War and Military","Martial Arts","Grimdark","Action","Adventure","Fantasy","Mystery","School Life","Strong Lead","Magic","Strategy","High Fantasy","Mythos","Ruling Class","First Contact","Dystopia","Progression"],"lable":"Original","following_count":0,"rating":0.0,"page_count":13,"view_count":69,"chapters_count":2,"last_update":1717470951,"description":"Beaten, humiliated, and then subsequently murdered. Jora wakes up in an unfamiliar and deadly labyrinth inside a body that isn't his and is surrounded by people he's never met before. Full of stuffy, stale air and filled to the brim with grotesque abominations teeming with otherworldly powers, Jora must fight for his life every step he takes.\nIn a twist of fate, Jora must fight, scavenge, and clench his teeth to survive in this twisted world. Will he grow stronger, smarter, and make it out of the hell he found himself trapped in? Or will he falter and die, letting his only opportunity wither away before he has the chance to see it prosper?","description_hash":5397816564293940008},{"title":"Source of Magic","fiction_id":"87654","link":"https:\/\/www.royalroad.com\/fiction\/87654\/source-of-magic","tags":["Female Lead","Sci-fi","Fantasy","School Life","Magic"],"lable":"Original","following_count":4,"rating":4.0,"page_count":223,"view_count":813,"chapters_count":20,"last_update":1718553605,"description":"Lia is happy to be accepted to the only magic school in the universe. It was always her dream to become as powerful a mage as the queen or the mages from the stories. But when she takes the entrance exam, she notices that the class structure of the world is even harsh in the world of mages, as they're separated into two different types of mages: Ones that direct the magic, the so called imperi, and ones that provide the mana necessary. In er frustration, she pushes all her mana into one of the instructors, who then gets a vision of the future. Will she accept her role, and can the school avoid the future of a zombie apocalypse on the station?","description_hash":-1562196813126497200},{"title":"Advanced Cultivation Civilization ","fiction_id":"87653","link":"https:\/\/www.royalroad.com\/fiction\/87653\/advanced-cultivation-civilization","tags":["Virtual Reality","Space Opera","Xianxia","Male Lead","Sci-fi","Action","Adventure","Fantasy","Martial Arts","High Fantasy","Technologically Engineered","Artificial Intelligence"],"lable":"Original","following_count":3,"rating":0.0,"page_count":24,"view_count":287,"chapters_count":4,"last_update":1718399643,"description":"This is the story of a civilization's rise to greatness through the eyes and intervention of its people.\n\nThe focus is mostly on Mumaso Reed, a Nascent Soul inventor and his various creations.","description_hash":-326233201721020098},{"title":"Therian Mystery Dungeon","fiction_id":"87652","link":"https:\/\/www.royalroad.com\/fiction\/87652\/therian-mystery-dungeon","tags":["LitRPG","Dungeon","Male Lead","Action","Adventure","Fantasy","Magic","GameLit","High Fantasy","Progression"],"lable":"Original","following_count":3,"rating":4.5,"page_count":16,"view_count":151,"chapters_count":1,"last_update":1717304456,"description":"A year ago, \"mystery dungeons\" began appearing all throughout the land of Theria. To combat them, exploration guilds such as the one in Foxhole Village have been established. a pair of fox siblings joined to explore and research these strange environments, but as they slowly crawl up the ranks, they learn what really lies at the heart of the mystery dungeons.","description_hash":4670931242020197509},{"title":"Bleed","fiction_id":"87651","link":"https:\/\/www.royalroad.com\/fiction\/87651\/bleed","tags":["Urban Fantasy","Anti-Hero Lead","Female Lead","Fantasy","Romance","Mystery","Magic"],"lable":"Original","following_count":1,"rating":0.0,"page_count":6,"view_count":36,"chapters_count":1,"last_update":1717304447,"description":"In the neon-lit labyrinth of Meridian City, where humans and vampires coexist in a fragile truce, Star Sangrave is a half-vampire outcast teetering on the edge of survival. Abandoned as a child and plagued by the mystery of her origins, she navigates the treacherous halls of St. Ifrid's Preparatory Academy by day and the city's dark underbelly by night, fueled by the synthetic blood substitute, Elixir.\nHaunted by the cruel whispers of her classmates and the gnawing hunger that threatens to reveal her true nature, Star's existence is a constant battle against the monster within. Her only solace lies in her fragile friendship with Booker, a beacon of normalcy in her chaotic world. But even his companionship cannot shield her from the escalating dangers.\nAs her 18th birthday approaches, Star's quest for answers intensifies. A clandestine meeting with the sinister dealer Asher thrusts her deeper into a web of deceit and danger, revealing that her past is more entwined with the city's dark secrets than she ever imagined. When a shadowy figure from her nightmares emerges, Star is confronted with a chilling truth that forces her to confront her darkest fears.\n\"Bleed\" is a gripping tale of identity, addiction, and survival. In a city where every shadow hides a threat and every ally has a hidden agenda, Star must unravel the mystery of her lineage and face the monstrous legacy she has inherited. Will she succumb to the darkness or carve out her own destiny in a world that wants her to bleed?","description_hash":-3590874092222243556},{"title":"Avalon","fiction_id":"87650","link":"https:\/\/www.royalroad.com\/fiction\/87650\/avalon","tags":["LitRPG","Progression","War and Military","Grimdark","Multiple Lead Characters","Action","Adventure","Fantasy","Tragedy","Supernatural","Male Lead","Non-Human Lead","Strategy","GameLit","High Fantasy"],"lable":"Original","following_count":2,"rating":0.0,"page_count":49,"view_count":555,"chapters_count":8,"last_update":1718569672,"description":"This is going to be a fiction piece that I am going to try and update weekly. If you have any questions, feel free to ask and make sure to leave a comment so I know what I am doing good and what I can work on.","description_hash":343506356578717631},{"title":"Accidental Necromancer","fiction_id":"87649","link":"https:\/\/www.royalroad.com\/fiction\/87649\/accidental-necromancer","tags":["Urban Fantasy","Anti-Hero Lead","Multiple Lead Characters","Strong Lead","Action","Adventure","Fantasy","Horror","Supernatural","Male Lead","Female Lead","Non-Human Lead","Magic","Low Fantasy"],"lable":"Original","following_count":5,"rating":5.0,"page_count":148,"view_count":359,"chapters_count":5,"last_update":1718397099,"description":"Becoming a Necromancer wasn’t on Kyle Reeves’s to-do list.\nBut when the man finds himself with a book of necromantic rituals bound to his soul, Kyle is forced headfirst into a secret world of monsters, magic, and deadly intrigue. The supernatural world is callous, unforgiving, and dog-eat-dog. Meanwhile, Kyle’s just a beginner in all this. The fledgling Death Magician must fight tooth and nail to survive with only a handful of friends, whatever creatures he can raise from the grave, and his grimoire to aid him. The odds are heavily stacked against the Necromancer and Kyle's lineage has enemies with centuries worth of axes to grind. It’s enough to make someone give up.\nToo bad for his foes, Kyles is no quitter.\nWhat to expect:\n- Both hard and soft magical systems.\n- Mages who are often both physically and mentally strong. \n- Eventual battles (which will be quite brutal, especially starting out)\nNote: This book is being actively written. Expect frequent rewrites and edits. Sensitive content as I write may or may not include torture (physical and psychological), extensive gore, grave robbing, body horror, abuse, and dysfunctional relationships.\nAlso, please leave a comment or review if you can. I'm always open to advice and feedback! :-)","description_hash":-7009510794906623473},{"title":"Luna y Mar [Spanish]","fiction_id":"87648","link":"https:\/\/www.royalroad.com\/fiction\/87648\/luna-y-mar-spanish","tags":["Female Lead","Drama","Fantasy","Romance","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":20,"view_count":115,"chapters_count":3,"last_update":1718489869,"description":"En un mundo donde la política y las alianzas dictan el destino de los corazones, Amelia, una princesa destinada a un matrimonio arreglado, encuentra su vida transformada al conocer a Lucien, el enigmático líder del clan Luna Azul. Con un pasado lleno de traiciones y secretos, Lucien se convierte en el guardián de su corazón y en la esperanza de un amor verdadero. Mientras las intrigas y las antiguas rivalidades amenazan con separarlos, Amelia y Lucien deberán enfrentarse a los desafíos de sus respectivos reinos, confiando en el poder del \"Corazón de Luna\" para iluminar su camino hacia un futuro juntos.\n¿Podrá su amor vencer las sombras del deber y la tradición?\nDescúbrelo en esta apasionante historia de romance, valentía y magia bajo la luz de la luna.","description_hash":-6954613054252495960},{"title":"Djinn Ascendance ","fiction_id":"87646","link":"https:\/\/www.royalroad.com\/fiction\/87646\/djinn-ascendance","tags":["Portal Fantasy \/ Isekai","Progression","Anti-Hero Lead","Xianxia","Grimdark","Action","Adventure","Fantasy","Mystery","Reincarnation","Martial Arts","Male Lead","High Fantasy","Villainous Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":21,"view_count":202,"chapters_count":3,"last_update":1717311000,"description":"Within the heart of the desert, where the whispers of the Djinn echo across the sands, a tale of power and betrayal unfolds. Follow the path of a young man as he rises from obscurity to challenge the gods themselves, wielding the ancient arts of Djinn mastery to reshape the world in his image.","description_hash":2744605109344558615},{"title":"The Way You're Annoying","fiction_id":"87645","link":"https:\/\/www.royalroad.com\/fiction\/87645\/the-way-youre-annoying","tags":["Psychological","Female Lead","Slice of Life","Tragedy","Drama","Romance","Male Lead","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":11,"view_count":175,"chapters_count":3,"last_update":1717398059,"description":"Satoru Kitamura and Misaki Hanada are childhood friends who went to elementary school together. This is their story. Follow them as they go through ups and downs in their lives. The Way You're Annoying.","description_hash":-5973250817056958713},{"title":"The Hacker","fiction_id":"87644","link":"https:\/\/www.royalroad.com\/fiction\/87644\/the-hacker","tags":["Female Lead","Sci-fi","Adventure","Mystery","Short Story","Genetically Engineered ","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":56,"chapters_count":1,"last_update":1717304293,"description":"A hacker discovers a sinister secret about a company when trying to extract information. Now she will have to uncover the truth and risk her life in the process. Part of the biovirtual world and series.","description_hash":-3599615491719896492},{"title":"Adjustable World: Tefter","fiction_id":"87642","link":"https:\/\/www.royalroad.com\/fiction\/87642\/adjustable-world-tefter","tags":["Progression","Martial Arts","Action","Adventure","Fantasy","High Fantasy","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":40,"view_count":120,"chapters_count":3,"last_update":1718473452,"description":"\"Adjustable World: Tefter\" is a fictional novel where every individual is born with some form of inexplicable anomaly, ranging from barely noticeable to wildly disruptive, impacting their own lives and lives of those around them. The organization \"Source\" is tasked with containing these \"wild individuals\" to prevent disasters and with studying them to advance the understanding of the supernatural phenomena.\nHowever, what happens when such an organization suddenly collapses? The Pashtrik Mountain basin is the first area affected by the absence of the Source.\nThe story is told from the perspective of a character named Zafer, a local of the basin, who inadvertently becomes a key figure in establishing a new world order. He interacts and mediates with numerous other characters from the region, whose interests intertwine, unaware that they are simultaneously shaping a significant historical period. Zafer spends most of his time training, fighting for what he loves and considers right at the moment, philosophizing about the many life inconsistencies that befall him, and uncovering the sources of all the ancient mysteries of the world.\nThe story contains almost to no intimate scenes and the only reason it's a mature content is due to a couple of chapters containing slight gore.","description_hash":-2195910086066115463},{"title":"Broken","fiction_id":"87641","link":"https:\/\/www.royalroad.com\/fiction\/87641\/broken","tags":["Psychological","Multiple Lead Characters","Slice of Life","Strong Lead","Tragedy","Romance","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":27,"chapters_count":1,"last_update":1717304194,"description":"I started this short story series to help cope with my heartbreaks. This is not a continuous story. Updates will be very inconsistent.","description_hash":-5661979829557454368},{"title":"Sturmtanz - The way of the Storm - Initial Adventure","fiction_id":"87639","link":"https:\/\/www.royalroad.com\/fiction\/87639\/sturmtanz-the-way-of-the-storm-initial-adventure","tags":["LitRPG","Adventure","Fantasy"],"lable":"Original","following_count":1,"rating":0.0,"page_count":9,"view_count":67,"chapters_count":2,"last_update":1717852852,"description":"Paul left his last life where he just when everything was starting to evolve so good. But he gets his chance to say goodbye and chooses to step into a new chaotic existence. An existence in an unusual universe at the edge of total destruction. There he was not born as usual, he needs to pass an initial adventure as a \"little soul\" in an distorted spiritform. The definition of his abilities, his features and evolution depends on his success solving this first initial adventure. First then a passing to the stormuniverse is possible and the start of an adventure he never thought possible.","description_hash":5207961777827497585},{"title":"In Between","fiction_id":"87638","link":"https:\/\/www.royalroad.com\/fiction\/87638\/in-between","tags":["Super Heroes","Space Opera","Comedy","Sci-fi","Adventure","Satire","Magic","Hard Sci-fi"],"lable":"Original","following_count":2,"rating":0.0,"page_count":32,"view_count":74,"chapters_count":1,"last_update":1717301390,"description":"A Chicago PD detective saved an intergalactical space explorer and got dragged into a whimsical adventure across galaxies.\nTaking the satirical approach of buddy cop and sci fi, the pair of cuckoos must uncover the mysterious evil syndicate that controls the universe from the shadows.\nThey must work together to investigate the vast expanse of space, encountering strange new worlds, battling creatures, and deciphering cryptic clues left behind by the syndicate's operatives.\nWho can stand up against the powerful syndicate and save the universe from impending doom? Two sarcastic idiots, protected by our Lord and Savior, plot armor.","description_hash":9070916009130819440},{"title":"Eidos Tamers: An Apocalyptic LitRPG Adventure","fiction_id":"87637","link":"https:\/\/www.royalroad.com\/fiction\/87637\/eidos-tamers-an-apocalyptic-litrpg-adventure","tags":["LitRPG","Urban Fantasy","Dungeon","Post Apocalyptic","Strategy","Action","Adventure","Sci-fi","Contemporary","Supernatural","Male Lead","Multiple Lead Characters","GameLit","Soft Sci-fi","Progression","Artificial Intelligence"],"lable":"Original","following_count":81,"rating":4.18,"page_count":142,"view_count":5708,"chapters_count":19,"last_update":1718383177,"description":"A science experiment gone wrong. Monsters ravaging the world. Life becomes a constant battle for survival.\n \n Julian couldn’t catch a break. From losing his job to getting expelled from college, his life couldn’t get any worse. Then came the Tri-Bracer System, along with the monsters…\n\nWhen the Artino Research Towers unleashed energy into the atmosphere, wild, elemental beasts started appearing, destroying everything in their path. Thanks to the Tri-Bracer System, however, humanity is given [classes] that can tame these dangerous creatures, making their elemental powers their own. As the world is consumed by the Mon Phenomenon, Julian will have to adapt to this new system, and fast. \n\nAs he attempts to survive, and discover the truth behind this catastrophe, he’ll find that answers won’t come so easily. After all, monsters aren’t the only dangers that lurk in the apocalypse.\n\nThe System was clear:\n[Survive, Bond, and Thrive…Together.]\nWhat to expect:\n- Monsters: Hunting, Surviving, and Taming in urban settings\n- Tutorial Stage to LitRPG System Integration with skills, ranks, and levels after\n- Weak to Strong Protagonist\n- Friendships\n- Animal Companion Bonds\n- High Stakes and Consequences\n-No Harem\n\nPosting chapters Monday-Friday at noon EST.\nStay tuned for a Patreon Update!","description_hash":-421411750377421529},{"title":"7. DUTIFUL [TALES FROM THE CROSSROADS vol. 1]","fiction_id":"87636","link":"https:\/\/www.royalroad.com\/fiction\/87636\/7-dutiful-tales-from-the-crossroads-vol-1","tags":["Psychological","Non-Human Lead","Sci-fi","Horror","Short Story","Supernatural","Female Lead","Magic","Low Fantasy","Mythos","First Contact","Soft Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":2,"view_count":72,"chapters_count":1,"last_update":1717294510,"description":"Tales from the Crossroads is a series of 17 micro-fiction horror stories set in the Primordial Crossroads Universe.\nDUTIFUL is about a woman's struggle to fulfil her duty to her family and people by venturing into deep space.","description_hash":1929941727427131792},{"title":"Beneath Us","fiction_id":"87635","link":"https:\/\/www.royalroad.com\/fiction\/87635\/beneath-us","tags":["Action","Adventure","Fantasy","Supernatural"],"lable":"Original","following_count":1,"rating":0.0,"page_count":16,"view_count":172,"chapters_count":5,"last_update":1717624683,"description":"What is the right thing to do?\nFollow the story of a rogue knight, Kazimir, who ventures far down into forbidden lands, lands where no one ever mustered the courage to set foot in before, where he discovers many truths that have been kept secret right under humanity's noses all along...","description_hash":2176462415852058587},{"title":"Overnight Princess: Path to Nobility","fiction_id":"87634","link":"https:\/\/www.royalroad.com\/fiction\/87634\/overnight-princess-path-to-nobility","tags":["Female Lead","Strong Lead","Adventure","Fantasy","Historical","Romance","Magic","High Fantasy","Attractive Lead"],"lable":"Original","following_count":2,"rating":0.0,"page_count":68,"view_count":951,"chapters_count":15,"last_update":1718283662,"description":"Born and raised by her mother in a secluded village, Layne Miroff finds solace in the tranquility of rural life. Contented with simple joys, Layne believes that she is an ordinary farmer's daughter and life for her can never be more than this. But on the night of her 18th birthday, the unspoken truth shatters her perception of reality because in her veins runs a prestigious legacy of nobility.\n \nHow will she navigate this sudden twist of fate?\n\nRelease Schedule: 2-3 chapters a week, every Thursday, 9:00 pm GMT+8 time.","description_hash":-1836950444382342754},{"title":"The Queen and the Mermaid - A Lesbian Romance (A Frozen\/The Little Mermaid Fanfiction)","fiction_id":"87633","link":"https:\/\/www.royalroad.com\/fiction\/87633\/the-queen-and-the-mermaid-a-lesbian-romance-a","tags":["Multiple Lead Characters","Adventure","Fantasy","Romance","Female Lead"],"lable":"Fan Fiction","following_count":8,"rating":4.5,"page_count":253,"view_count":997,"chapters_count":15,"last_update":1718309041,"description":"Coming home from Corona, Elsa's ship is hit by a massive storm. It sinks and Elsa is left to drown. She wakes up in a small life boat unaware of how she got there. She meets a beautiful redhead out at sea who happens to be a mermaid—and her savior. Her name is Ariel. Elsa and Ariel begin to bond and they form a friendship; and, it's through their friendship that they realize their feelings for each other may run even deeper... [New chapter posted every Friday]","description_hash":5373660208155465327},{"title":"Young Rose","fiction_id":"87632","link":"https:\/\/www.royalroad.com\/fiction\/87632\/young-rose","tags":["Male Lead","Tragedy","Historical","Romance","Short Story","Attractive Lead"],"lable":"Original","following_count":1,"rating":0.0,"page_count":11,"view_count":157,"chapters_count":4,"last_update":1718524014,"description":"Story of the young nobles and their tragic love stories. The main character's Gilbert, Samuel, Henry, and Victor all experience a tragic first love within the noble society full of greed and disgust. Although tragic, their love blooms among the path full of thorns and meet the end; some tragic and some happy but all gets what they wanted.","description_hash":-5016705788733179163},{"title":"Otherworld Realm: Craft System","fiction_id":"87631","link":"https:\/\/www.royalroad.com\/fiction\/87631\/otherworld-realm-craft-system","tags":["LitRPG","Portal Fantasy \/ Isekai","Urban Fantasy","Dungeon","Male Lead","Adventure","Fantasy","Mystery","Contemporary","Slice of Life","Low Fantasy","Progression"],"lable":"Original","following_count":20,"rating":5.0,"page_count":50,"view_count":871,"chapters_count":8,"last_update":1718627890,"description":"The otherworld portals descended onto Earth, bringing in monsters, treasures, and mysterious realms for humans to explore. Rankers, humans with awakened geist, explored the otherworld realms using magic while the regular humans stayed within the safe zone to deal with the usual real world problems like nagging parents and bureaucrats. Geared with a craft system that doesn't provide any physical item, Ian must unravel the mystery surrounding the unexplained deaths within the real world.\nArthur’s note: A pantser to the core with many rl choirs, please do not expect a consistent schedule or a complete story. The goal is just to finish the first book with around 50 chapters.\nChapters will be released randomly, but at least once a week.\nPatreon support is appreciated. \/chocomug\nMy other novel is a modern cultivation slice-of-life medical drama based in China: “System Only Gives Me Useless Gifts” (Completed)","description_hash":-9090024346959380826},{"title":"The Man in the Arena","fiction_id":"87630","link":"https:\/\/www.royalroad.com\/fiction\/87630\/the-man-in-the-arena","tags":["Progression","Martial Arts","Sci-fi","Drama","Action","Sports","First Contact","Hard Sci-fi"],"lable":"Original","following_count":0,"rating":0.0,"page_count":11,"view_count":48,"chapters_count":1,"last_update":1717280883,"description":"Fists will fly, jaws will be broken, and diplomatic will be incidents had in Rory Caldwell's exhilarating debut to interplanetary MMA.","description_hash":-5130357882410879243},{"title":"Aeternum Vale","fiction_id":"87629","link":"https:\/\/www.royalroad.com\/fiction\/87629\/aeternum-vale","tags":["Urban Fantasy","Progression","Anti-Hero Lead","Strategy","Psychological","Adventure","Mystery","Tragedy","Supernatural","Male Lead","Multiple Lead Characters","First Contact"],"lable":"Original","following_count":2,"rating":0.0,"page_count":23,"view_count":182,"chapters_count":3,"last_update":1718497290,"description":"In a world overrun by Aberrō, unusual magical monsters, humans can only find refuge in the city of Aeternum—a domed paradise safe from the dangerous world outside. The people of Aeternum live peacefully and uninterrupted, but something is off. To protect Aeternum, families are split apart, taken away, and valiantly sent outside to defend Aeternum from the Aberrō.\nAeternum protege, fiat aeternus\nCassius relives his past experience as a Fender, and finds himself in a new group. They are tasked with protecting the Permanentia, the land separating Aeternum from the outside world. Blissfully unaware of the danger that lies past the Permanence, they travel deeper and deeper into the outside world veiled in mystery. What are they really protecting, and will they die protecting it? Cassius knows there’s an untold truth somewhere in this cold world, and he will find it.","description_hash":6827035670547743721},{"title":"The Supernatural Prodigal Genius","fiction_id":"87628","link":"https:\/\/www.royalroad.com\/fiction\/87628\/the-supernatural-prodigal-genius","tags":["Male Lead","Contemporary","Action","Fantasy","Supernatural"],"lable":"Original","following_count":1,"rating":5.0,"page_count":42,"view_count":869,"chapters_count":15,"last_update":1717312305,"description":"A prodigal young man, once a useless scion with no meridian energy and a reputation for running away from marriage, nearly loses his life while heroically saving a damsel in distress. This near-death experience unexpectedly awakens his dormant meridians. “Two hundred eighty-four? That’s an insanely high innate ability index! And he possesses two sacred attributes—unbelievable!” But what is this innate ability index? And what are sacred attribute abilities? Jun Haotian’s life becomes vibrant and exciting. Follow Jun Haotian as he advances step by step, navigates the world of romance, masters the business realm, and dominates the world of supernatural abilities.","description_hash":4305086183897293428},{"title":"Serpentis [Monster Evolution Novel]","fiction_id":"87627","link":"https:\/\/www.royalroad.com\/fiction\/87627\/serpentis-monster-evolution-novel","tags":["Portal Fantasy \/ Isekai","Dungeon","Post Apocalyptic","Anti-Hero Lead","Martial Arts","Action","Adventure","Comedy","Mystery","Reincarnation","Reader Interactive","Supernatural","Male Lead","Multiple Lead Characters","Non-Human Lead","Magic","Grimdark","High Fantasy","Mythos","Genetically Engineered ","Dystopia","Progression"],"lable":"Original","following_count":14,"rating":5.0,"page_count":296,"view_count":2458,"chapters_count":22,"last_update":1718492420,"description":"Trigger Warning: Child abuse (non-sexual and never will be), PTSD, self-harm, suicidal thoughts, graphic violence.Born to pain and hardship, Charlie clings to life with every step he has to take and defiantly continues.\nCharlie's first life was filled with nothing but tremendous pain, that of body and soul. Yet, even throughout the darkness that oppressed his very being, Charlie found salvation in others. They were the tools to his recovery and brought him back from the brink on more than one occasion.\nBut...\nWhat if Charlie were to lose it all?\n---- A\/N ----Serpentis is not my first novel, as unfortunately due to many issues that had come up in real life, I had to drop my previous work. I'm happy to say that for the first time in my life, I am in a comfortable place and ready to start a new story. I have read a tremendous number of novels and believe to have improved my writing almost as much. Please share your thoughts and criticisms freely in the comments, I cannot wait to read them all!Some additional notes: Each chapter is between 3-5k words. At such lengths I can only write and edit one chapter a day. If you see any inconsistency, or error, please point it out and I will fix them as soon as possible!\nI post Monday - Saturday.Also, join our discord! https:\/\/discord.gg\/8mBPzSPj4v","description_hash":719557087311593583},{"title":"Who Are You","fiction_id":"87626","link":"https:\/\/www.royalroad.com\/fiction\/87626\/who-are-you","tags":["Female Lead","Fantasy","Romance","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":1,"view_count":30,"chapters_count":1,"last_update":1717279778,"description":"Werewolves and wolves all in this modern age. A normal girl's life, turns out to be not so normal. These demons she has to deal with inside her. Who is she really? Can she find herself? What is reality and what is the nightmare? Is the nightmare, reality? So many questions no one knows the answer to.","description_hash":5655029104789873446},{"title":"Apocalypse Blacksmith ","fiction_id":"87625","link":"https:\/\/www.royalroad.com\/fiction\/87625\/apocalypse-blacksmith","tags":["LitRPG","Post Apocalyptic","Comedy","Action","Adventure","Fantasy"],"lable":"Original","following_count":21,"rating":3.5,"page_count":78,"view_count":1166,"chapters_count":8,"last_update":1718146775,"description":"The end of the world wasn't my best day. It wasn't my worst day either. But let's not talk about who did or didn't accidentally vomit on a baby seal. Or who did or didn't then get into a fight with that seal’s mother. A fight that definitely ended in a draw. \nLet’s talk about what matters. \nThe apocalypse destroyed Earth and all I got was a lousy hammer.","description_hash":-6153087986424613502},{"title":"Rushed After the Rain","fiction_id":"87624","link":"https:\/\/www.royalroad.com\/fiction\/87624\/rushed-after-the-rain","tags":["Xianxia","Non-Human Lead","Action","Fantasy","Historical","Romance","Female Lead","Attractive Lead"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Night descended quietly… Everyone looked like a fleeting painting, visible for a moment before vanishing into the rain and mist. On this rainy night, Yi Yao saw someone she knew from the past — a person she could never forget.","description_hash":-8122815661819793637},{"title":"This is just typical Reverse World Story, right?","fiction_id":"87623","link":"https:\/\/www.royalroad.com\/fiction\/87623\/this-is-just-typical-reverse-world-story-right","tags":["Reincarnation","Dungeon","Male Lead","Slice of Life","Harem","Action","Fantasy","Romance","Magic"],"lable":"Original","following_count":4,"rating":5.0,"page_count":75,"view_count":1640,"chapters_count":13,"last_update":1718404461,"description":"This is the story of an earthling named Lubius who died after drowning because the boat he was on had an accident. He was just a little lucky to wake up in his own alternate body in another world.—------------------------------------------------------------------------------------------------------------------My first story so please be kind and I hope you comment if you see something weird and other stuff.English is not my first language and most of this work is done by DeepL.I try my best to upload every two days with 1500 words per chapter.\nWhat to expect:1. Slow-pace story.2. Harem-oriented story with some Echi, but at the moment I don't think I will write any +18stuff. It's already a lot of smut or +18 in this kind of genre after all.3. Weak to Strong, but it will be a long ride.4. No OP MC.5. No system and stuff.\nThis is my first time writing. Feedback is welcome, I'd love to hear what you readers like and where you think I could have done better.Is there some idea and stuff just say it too. Anything welcome...","description_hash":7849413036053853339},{"title":"Raelsphere: The Paladin","fiction_id":"87622","link":"https:\/\/www.royalroad.com\/fiction\/87622\/raelsphere-the-paladin","tags":["Male Lead","Fantasy","Supernatural","Magic","High Fantasy"],"lable":"Original","following_count":0,"rating":0.0,"page_count":11,"view_count":82,"chapters_count":2,"last_update":1717392447,"description":"Reegar Greywalker, a paladin, is looking for a respite, to find a city for shelter. A stop in a small town changes his plan and now he explores an old ruin infested with monsters with newfound friends in hope to stop a new threat. And all he wants is a bed and a good meal.","description_hash":-5380192618081635363},{"title":"Lighfe","fiction_id":"87621","link":"https:\/\/www.royalroad.com\/fiction\/87621\/lighfe","tags":["Progression","Sci-fi","Adventure","Fantasy","Short Story","Low Fantasy"],"lable":"Original","following_count":3,"rating":5.0,"page_count":45,"view_count":516,"chapters_count":10,"last_update":1717294176,"description":"In the blazing heart of the Sun, a spark of light comes to life with an astonishing quality: self-awareness. As it struggles against loneliness and the loss of energy, it desperately seeks to uncover its purpose and if there is anything beyond its brilliant prison.","description_hash":-4279015568520059869},{"title":"The Divine Intervention for the Plight of Quezhal and the Fate of the 2nd-6th Planes","fiction_id":"87620","link":"https:\/\/www.royalroad.com\/fiction\/87620\/the-divine-intervention-for-the-plight-of-quezhal","tags":["Action","Adventure","Fantasy","Magic","High Fantasy","Mythos"],"lable":"Original","following_count":1,"rating":0.0,"page_count":14,"view_count":113,"chapters_count":3,"last_update":1717547835,"description":"Quezhal has always been weak. The shamans told him his leg would never heal, and he ended up trapped in a war wearied town after being robbed. However, his luck changed. Something was stirring, and the Gods needed allies on the 4th plane...\nThe world is based off of a fusion of middles ages Europe and the Americas, as well as industrial society.\n(Quezhal is pronounced Kuehz - Hal)","description_hash":1003622487794968501},{"title":"Dungeon of Logistics","fiction_id":"87618","link":"https:\/\/www.royalroad.com\/fiction\/87618\/dungeon-of-logistics","tags":["LitRPG","Dungeon","Fantasy","Progression"],"lable":"Original","following_count":8,"rating":0.0,"page_count":9,"view_count":216,"chapters_count":2,"last_update":1717475378,"description":"A soul is formed into a new dungeon in the middle of a cold war between the Dungeons and the World Trees. In this tight spot, our dungeon will ultimately take a unique path by focusing on science, logistics, and production to aim to bring a new form of power to this world. Will the newly minted dungeon be able to survive? Can our dungeon grow strong enough, fast enough to make an impact?\nThis story is a hobby project, aiming to follow a traditional progressive dungeon story but with a heavy focus on logistics and a fast ramp up to massive world shaking battles. Absolutely let me know what i can do better. Ill be using AI images throughout chapters as they are pretty.","description_hash":4700227696117960602},{"title":"Destiny's Gambit (Progression Fantasy - Conditional Magic)","fiction_id":"87617","link":"https:\/\/www.royalroad.com\/fiction\/87617\/destinys-gambit-progression-fantasy-conditional","tags":["Progression","Strategy","Psychological","Male Lead","Slice of Life","Action","Fantasy","Mystery","School Life","Supernatural","Strong Lead","Secret Identity","Magic","High Fantasy","First Contact","Attractive Lead"],"lable":"Original","following_count":13,"rating":4.88,"page_count":211,"view_count":1750,"chapters_count":22,"last_update":1718308468,"description":"Book 1: The Crimson Devil\nUpdating Daily! Around 2.5k each chapter.\nA heavy plot based novel.\n________\nAiden finally gave in to the messages barraging his phone after letting out a grunt of annoyance. With a dazed look, he let his hand fumble around the nightstand, eventually holding his phone after a few tries and opened it to numerous messages on the group from his friends.\n\nEyes still half closed, he went through the messages, “Look at the night, the moon looks so red!” “The moon is beautiful today!” “The night sky is breathtaking, look outside your window!” “There’s no way you want to miss the moon today!” Due to his habit of sleeping in complete darkness, with curtains closed, he didn’t, on instinct, immediately turn around to look outside the window near his bed, which caused his gaze to linger around longer to find a letter on the nightstand.\n\nHuh? I don’t remember placing anything else here?\n\nWhen he held the letter though, a symbol embossed on it immediately caught his attention. It was of a secret society he made along with his friends when they were kids. Friends who had one by one disappeared from his life. He opened it to find only a single piece of paper, and some liquid dripping on his palm.\n\nQuickly transitioning to a sitting posture while he grasped the paper in one hand, he turned on the lamp with the other. His eyes widened, pupils dilating, as he looked at the hand holding the paper, which soon began shaking as dark red liquid kept sliding off the paper to stain his hand. \n\nIs it blood?\n\nContaining his fear, he concentrated his gaze onto the paper which had some messy words written over it with the same liquid.\n\nDon’t look at the moon!\n\n_____________________________\n\nThe Great Smog brought countless incomprehensible disasters. Turns out it wasn’t unity that worked, but fragmentation. The government relocated people from cities to towns across the lands, thinning out the population. It worked, the number of disasters witnessed a drastic decline, making it manageable for the government to deal with.\n\nYears after The Great Smog, Aiden Spencer has come across such incomprehensible disasters, one even in his home.\n\n_____________________________\n\nConditional Magic - It fascinated me when I read about it, so this is the magic in my novel.\n\nMajor themes - Magic and Corruption.\nMinor themes - Fate and Free will.\n\nMajor tags - Magic, Mystery, Damaged civilization, Ghosts, Mythical races, (end game tags) :- Portals, Multiple Worlds.\n\nMinor tags - Horror, Slice of life, Potatoes.\n\nThe name of the book is slightly end game so sorry if it doesn’t match in your head while you read the novel.","description_hash":9163891948990858955},{"title":"Frozen Exteriors, Thawed Interiors","fiction_id":"87616","link":"https:\/\/www.royalroad.com\/fiction\/87616\/frozen-exteriors-thawed-interiors","tags":["Adventure","Romance"],"lable":"Fan Fiction","following_count":0,"rating":0.0,"page_count":33,"view_count":125,"chapters_count":3,"last_update":1718080211,"description":"At Anna's suggestion, Elsa decides to take a vacation at her ice castle. While there she meets Jack Frost. How will this play out?","description_hash":7940561954965664899},{"title":"The Collected Adventures of Fetu","fiction_id":"87615","link":"https:\/\/www.royalroad.com\/fiction\/87615\/the-collected-adventures-of-fetu","tags":["Post Apocalyptic","Adventure","Fantasy","Short Story"],"lable":"Original","following_count":2,"rating":0.0,"page_count":4,"view_count":39,"chapters_count":1,"last_update":1717279563,"description":"Hi folks! This is where I will be dumping the collected adventures of Fetu, a very Conan-type character and my first attempt at sword and sorcery type stories. Fetu is based in the fictional universe of Ruin - a published novel (of which more are coming soon) read by many!\n\nI am sharing these with the public for free, because RR is where I got my start before I was discovered by a publisher. Enjoy these. I will try to do one a week.","description_hash":-5655696022667669094},{"title":"Just how things are","fiction_id":"87614","link":"https:\/\/www.royalroad.com\/fiction\/87614\/just-how-things-are","tags":["Multiple Lead Characters","Sci-fi","Short Story","Technologically Engineered","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":6,"view_count":50,"chapters_count":1,"last_update":1717279545,"description":"A man awakens in a laboratory with no memories and no idea of anything going on, but he seems unable to wonder about it... a very short story in which most descriptions of the plot would be spoilerish.","description_hash":6971351217891516958},{"title":"MC IS REINCARNATED AS SWORD","fiction_id":"87613","link":"https:\/\/www.royalroad.com\/fiction\/87613\/mc-is-reincarnated-as-sword","tags":["Portal Fantasy \/ Isekai","Progression","Comedy","Non-Human Lead","Fantasy","Reincarnation","Female Lead","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":1,"view_count":49,"chapters_count":1,"last_update":1717279540,"description":"I am so, SO sick of searching this website for a decent \"MC is object\" story. I got fed up so I'm writing this. There will be no hand wavy abilities to bs a reason why the MC can move on their own. There will be no harem or romance for obvious reasons. This was born out of pure frustration and needing an itch scratched, so there is not an iota of a plan going in. Feedback is GREATLY appreciated, as I kinda suck at writing. Will probably update name & synopsis when there is a plan.","description_hash":-1454777710424223186},{"title":"The Witches of Isle Royale","fiction_id":"87612","link":"https:\/\/www.royalroad.com\/fiction\/87612\/the-witches-of-isle-royale","tags":["Martial Arts","Sci-fi","Romance","Genetically Engineered "],"lable":"Original","following_count":1,"rating":0.0,"page_count":190,"view_count":813,"chapters_count":19,"last_update":1717285204,"description":"America has collapsed and nothing is like it was.\nNow, in the sprawling metro area of the M in the Northeast Regional Sovereignty where everything is negotiable, unlicensed private investigator Kim Murayama agrees to help one of the mysterious contraband “witches” of Isle Royale. Returning her to her quarantined island in Lake Superior shouldn't be that difficult a job.But whispered rumors of immortality and far-fetched tales of witchcraft aren't even half of the story. He may have opened a Pandora's Box that can't be closed.","description_hash":2408739419437501340},{"title":"Permitted","fiction_id":"87609","link":"https:\/\/www.royalroad.com\/fiction\/87609\/permitted","tags":["Multiple Lead Characters","Slice of Life","Tragedy","Drama","Romance","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":33,"chapters_count":1,"last_update":1717268661,"description":"Do-yun suffers to find the meaning of his life after the loss of his girlfriend. Meanwhile, Ha-eun suffers to find herself worthy of life after being branded as a curse  by her family. Going through life, they struggle to escape from their misery. Permitting themselves the gift of death, they run into each other and comfort themselves. Going forward, will they ever permit themselves to move on from their past life?","description_hash":-3402958689626651115},{"title":"Permitted","fiction_id":"87608","link":"https:\/\/www.royalroad.com\/fiction\/87608\/permitted","tags":["Multiple Lead Characters","Slice of Life","Tragedy","Drama","Romance","Short Story"],"lable":"Original","following_count":0,"rating":0.0,"page_count":0,"view_count":0,"chapters_count":0,"last_update":0,"description":"Do-yun suffers to find the meaning of his life after the loss of his girlfriend. Meanwhile, Ha-eun suffers to find herself worthy of life after being branded as a curse  by her family. Going through life, they struggle to escape from their misery. Permitting themselves the gift of death, they run into each other and comfort themselves. Going forward, will they ever permit themselves to move on from their past life?","description_hash":-3402958689626651115},{"title":"Poppy - The Marvelous Kitten","fiction_id":"87607","link":"https:\/\/www.royalroad.com\/fiction\/87607\/poppy-the-marvelous-kitten","tags":["Portal Fantasy \/ Isekai","Adventure","Fantasy","Magic","High Fantasy"],"lable":"Original","following_count":3,"rating":0.0,"page_count":5,"view_count":165,"chapters_count":2,"last_update":1717266994,"description":"Poppy had lived a perfect life of luxury in her normal home with her normal human owners, who she knew as her parents. Until one fateful day, she stumbles into a magical tunnel, leading her on an adventure to explore and fulfill her curiosity. However, she soon realises, adventure sounds fun, until you're in the middle of it. She quickly finds herself lost in a magical world, neverending with strange creatures and realms. She must make friends and find her way back home. Does curiosity kill the kitten?","description_hash":-6147364916243949560},{"title":"I Can Transform Into Monsters ","fiction_id":"87606","link":"https:\/\/www.royalroad.com\/fiction\/87606\/i-can-transform-into-monsters","tags":["Urban Fantasy","Progression","Martial Arts","Comedy","Non-Human Lead","Action","Fantasy","Mystery","Supernatural","Male Lead","Strong Lead","Secret Identity"],"lable":"Original","following_count":10,"rating":0.0,"page_count":85,"view_count":1470,"chapters_count":23,"last_update":1718570649,"description":"Maxwell Duncan, an ordinary guy in Japan. One day, he meets Akuro, a cat who gives him a cursed bracelet. This bracelet lets Maxwell turn into different monsters. Now, but Maxwell must learn to control his new powers and face powerful challenges in a world of ghosts and creatures.","description_hash":-5332354829988452054},{"title":"Reincarnation of the Robot Captain ","fiction_id":"87605","link":"https:\/\/www.royalroad.com\/fiction\/87605\/reincarnation-of-the-robot-captain","tags":["LitRPG","Reincarnation","Multiple Lead Characters","Sci-fi","Action","Adventure","Fantasy","Cyberpunk","Male Lead","Non-Human Lead","Genetically Engineered ","Artificial Intelligence","Attractive Lead"],"lable":"Original","following_count":8,"rating":4.5,"page_count":57,"view_count":1435,"chapters_count":15,"last_update":1718629067,"description":"After dying in his house when his apartment was burning, Karl Johnson got reincarnated in a new apocalyptic sci-fi world, where he plays the role of a strong robot captain of a huge Organization. Now Karl's mission is simple, survive and protect this world from vicious enemies.","description_hash":3436877751317406741},{"title":"Altered Bonds — Pokemon Mystery Dungeon","fiction_id":"87604","link":"https:\/\/www.royalroad.com\/fiction\/87604\/altered-bonds-pokemon-mystery-dungeon","tags":["GameLit","Portal Fantasy \/ Isekai","Dungeon","Strategy","Psychological","Adventure","Drama","Fantasy","Supernatural","Male Lead","Female Lead","Multiple Lead Characters","Non-Human Lead","Secret Identity","Magic","High Fantasy","Mythos","First Contact","Progression"],"lable":"Fan Fiction","following_count":7,"rating":5.0,"page_count":272,"view_count":768,"chapters_count":9,"last_update":1718611981,"description":"[TWO CASTAWAYS STEP FOOT UPON A LAND WHERE THEY DO NOT BELONG.]\n\nA tragic shipwreck leaves Lucario and an Alolan girl Eira trapped in Haven Archipelago — a Pokemon civilization hostile to humans. Their only saving grace? A magic transformation item to protect the girl and their secrets.\nAgainst friendly-at-first explorers and lurking hunters, however, keeping a low profile might not be enough. And what of the dangers abound, with vile mutants seeking to spread their infection, and natural distortions called Mystery Dungeons that are unraveling into chaos? One slip-up, and they could be goners.\nIn this realm, calamitous conspiracies converge, souls seek solace, and magic manifests. A duo with no home are thrust into it all, facing a reality beyond their imagination. A fairy tale begins—\nAnd the fable of an ill omen grips a crumbling world.\n\n(A Pokemon Mystery Dungeon-style fanfiction heavily built on action, character relations, and drama. Can be read with general Pokemon knowledge.)","description_hash":-4510274150373882119},{"title":"Lord of Hollows","fiction_id":"87603","link":"https:\/\/www.royalroad.com\/fiction\/87603\/lord-of-hollows","tags":["Anti-Hero Lead","Male Lead","Harem","Action","Adventure","Fantasy","Romance","Dystopia"],"lable":"Original","following_count":0,"rating":0.0,"page_count":5,"view_count":51,"chapters_count":1,"last_update":1717256296,"description":"Our main protagonist (Noah finds himself on a journey in attempts to revive his deceased mother, now what awaits him are trails that he must complete","description_hash":-57353492862136287},{"title":"I am a great mage","fiction_id":"87602","link":"https:\/\/www.royalroad.com\/fiction\/87602\/i-am-a-great-mage","tags":["Male Lead","Adventure","Fantasy","Mystery","Attractive Lead"],"lable":"Original","following_count":2,"rating":1.5,"page_count":99,"view_count":455,"chapters_count":10,"last_update":1717736967,"description":"Travel through to a different world, learn magic, and have extraordinary encounters","description_hash":-4189872427956698854},{"title":"Homeworld","fiction_id":"87601","link":"https:\/\/www.royalroad.com\/fiction\/87601\/homeworld","tags":["Female Lead","Sci-fi","Strong Lead","Drama","Action","Adventure","Genetically Engineered ","Technologically Engineered","Soft Sci-fi","Artificial Intelligence"],"lable":"Original","following_count":7,"rating":5.0,"page_count":62,"view_count":938,"chapters_count":10,"last_update":1718576963,"description":"The galaxy teems with intelligent life. Spacefaring civilizations expand across the Milky Way. Humanity is one among thousands. \nWithout a centralized government, strong alliances or reliable diplomacy, no one civilization has control over the Milky Way and its systems. Chaos ensues as advanced species rise and fall. The wilds of the Milky Way are untamable.\nA young soldier, set on her way of life, is recruited for a special mission that will change her, and the galaxy, forever.\n...............................................................................................................\nNew Chapters Thur - Sun after 5 p.m. CST. The Patreon is now up and ten chapters ahead!\nHomeworld is an adventure tale at its heart, full of exploration and the unknown, but with all that comes tough choices. These choices affect the galaxy and the characters within, forever. I get a bit silly with the science in my fiction and I don't shy away from lengthy descriptions about tech, politics, or astrophysics. However, the real story is about people and their struggle to survive amongst one another.","description_hash":-2107655701500601506},{"title":"The Greatest Sin","fiction_id":"87600","link":"https:\/\/www.royalroad.com\/fiction\/87600\/the-greatest-sin","tags":["Anti-Hero Lead","War and Military","Multiple Lead Characters","Strong Lead","Drama","Action","Adventure","Fantasy","Male Lead","Female Lead","Magic","Strategy","Villainous Lead","Ruling Class","Attractive Lead"],"lable":"Original","following_count":10,"rating":0.0,"page_count":214,"view_count":2952,"chapters_count":35,"last_update":1718571786,"description":"And so Arascus, God of Pride, waited. He waited for his defeat as the forces of Heaven & Hell combined descended upon him. He waited as they tried to kill him. He waited as they locked him away. He waited for a thousand years in that dark prison.\n\nNow. He was done waiting.","description_hash":1513632202359782929},{"title":"Shikari's Heart","fiction_id":"87599","link":"https:\/\/www.royalroad.com\/fiction\/87599\/shikaris-heart","tags":["Comedy","Male Lead","Action","Supernatural"],"lable":"Original","following_count":0,"rating":0.0,"page_count":80,"view_count":194,"chapters_count":8,"last_update":1718481906,"description":"In a world where emotions wield supernatural abilities, Surata's lonely, everyday life gets taken from him after having a near-death experience with a murderous lone wolf named Koroki. Without any explanation, they were forced to live together and become \"brothers.\" Surata's one dream is to become a Shikari, a licensed hunter who harnesses their emotions into supernatural abilities. There's just one problem: he can't awaken his powers. Despite being forced to live with him, Koroki slowly accepts Surata as his new family. His dream is to live a peaceful life, free from war. But the world is about to turn against them.Years after their altercation,16-year-old Surata gets kidnapped by a group of ex-Shikaris. After being physically tortured and mentally defeated, he was effortlessly saved by Koroki, who also uses no abilities. After hiding for years, rumors start to form about Koroki's existence, slowly unveiling a tragedy that will soon ruin their world.","description_hash":-8895721106645225327}]